{"url": "https://en.wikipedia.org/wiki/1927_International_Pageant_of_Pulchritude", "title": "1927 International Pageant of Pulchritude", "summary": "The Second International Pageant of Pulchritude and Eighth Annual Bathing Girl Revue was held from May 21 to May 23, 1927, in Galveston, Texas. More contestants from outside the United States entered the pageant compared to the previous year, with women from Cuba, France, Italy, Luxembourg, Portugal, and Spain joining. Canada and Mexico also sent delegates, as they had in 1926. There were also 29 contestants from the United States. An estimated 250,000 people attended the events during that weekend, and over $5000 in prizes were given to the winners. The pageant was becoming known as an opportunity for potential movie and stage actresses to be discovered.Miss United States, Dorothy Britton, who represented New York City, was crowned Miss Universe 1927 at the end of the event. She was considered the first American girl to win an international contest of any importance, as well as the first girl from New York City to win a national prize.", "content": "The Second International Pageant of Pulchritude and Eighth Annual Bathing Girl Revue was held from May 21 to May 23, 1927, in Galveston, Texas. More contestants from outside the United States entered the pageant compared to the previous year, with women from Cuba, France, Italy, Luxembourg, Portugal, and Spain joining. Canada and Mexico also sent delegates, as they had in 1926. There were also 29 contestants from the United States. An estimated 250,000 people attended the events during that weekend, and over $5000 in prizes were given to the winners. The pageant was becoming known as an opportunity for potential movie and stage actresses to be discovered.Miss United States, Dorothy Britton, who represented New York City, was crowned Miss Universe 1927 at the end of the event. She was considered the first American girl to win an international contest of any importance, as well as the first girl from New York City to win a national prize.\n\n\n== Events ==\nBefore the pageant opened, the contestants from Europe toured the Southwest United States for 20 days before arriving at Galveston.The Second International Pageant opened on May 21 with a parade of the contestants in sports costume after a lunch at Gaido's Restaurant. Bands such as El Toreador Band, Miss Spain's official escort Afterwards, contestants were invited to a dance on the pleasure boat Galvez.On May 22, the swimsuit parade was held. Conservative estimates put the number of people in attendance at around 250,000. The entire city was crowded, with hotels filled and heavy street traffic. Bands such as the Santa Fe Shop Band, the official escort for Miss Cleburne, the Missouri Pacific Lines Band, and the Palestine Booster's Club accompanied the parade.The main pageant was held on May 23 at the Galveston City Auditorium. There, Miss United States and the Beauty Queen of the Universe were crowned.Accommodations for the contestants were provided for at the Hotel Galvez and the Hotel Dallas.\n\n\n=== Pageant format ===\nThe 1927 pageant saw a change from the previous year, as the contest introduced the selection of a Miss United States. During the final pageant, each of the girls representing cities and states from across the United States were judged, with the top scorer gaining the title of Miss United States. Miss United States would then compete for the Grand Prize and the title of Beauty Queen of the Universe against the foreign competitors. The remaining prizes, from First through Ninth, would then be a free-for-all among the international contestants and the remaining contestants from the United States.The winner of the Grand Prize would receive $2000 and a silver plaque. In the subsequent free-for-all, First Prize received $1000, Second received $500, and Third to Ninth received $100.\n\n\n== Judges ==\nThe panel of judges were composed of artists, sculptors, and benefactors of the revue. Their identities remained a secret to each other and to the public until the end of the event. The criteria for judging included beauty, form, grace, and personal charm, while costumes and float decorations were not considered.The judges were as follows:\nJ. Knowles Hare, an artist and painter.\nHarry Tuthill, a cartoonist, creator of The Bungle Family.\nAlbert Ricker, an artist.\nCornelius Vanderbilt Jr., a newspaper publisher from New York.\nEnrico Cerracchio, an artist and sculptor.\nPaul Robinson, cartoonist, creator of Etta Kett\nE. H. Reynolds of St. Louis, Missouri Pacific Lines\n\n\n== Results ==\n\"I just know they'll give Miss New York the prize. I love her. She's the most beautiful girl in the world, I think.\"\n\n\n=== Dorothy Britton ===\nDorothy Britton, Miss New York, was awarded both the Miss United States title and the Beauty Queen of the Universe prize.  For winning, Britton received $2000 in gold and a silver plaque engraved \"Beauty Queen of the Universe\". She attributed her win, in part, to a locket with her mother's picture, which she kept with her throughout the competition.After the competition, Britton began a 12-week tour in July, making appearances across the United States, such as at Pleasure Beach, Connecticut, on July 1 and in Lowell, Massachusetts, on August 22.Britton, 19, from Jersey City, was a saleslady at a New York dress house before entering the Miss New York Contest. She was chosen among 900 contestants for the title of Miss New York, the contest held by N. Y. Mirror and Smart Set Magazine. Britton was said to enjoy three cups of black coffee a day, and was described as an out-of-doors type of girl. She engaged in a variety of sports such as swimming, tennis, fencing, and horseback riding.\n\n\n=== Placements ===\n\n\n==== Miss Universe and Free-for-all ====\n\n\n==== Miss United States ====\n\n\n== Delegates ==\n\nThirty-eight women entered the pageant in 1927, one less from the previous year's. However, there were more competitors in the event from outside the United States compared to 1926. Also, restrictions were placed on the contestants in that they should be chosen in an elimination contest in their home city, conducted by a newspaper, theater, commercial or civic body.Contestants had to be unmarried, aged 16 to 25, and not connected with any stage presentation, movie studio, or similar industries. The contest was open to women from any city anywhere in the world except Galveston. For example, Miss Italy was chosen in a nationwide contest by Rome newspaper Tevere, and Miss France was chosen in a contest conducted by Le Journal of Paris.\n\n\n=== Contestants ===\n\n\n=== Controversy ===\nIn April 1927, a French woman who sought to enter the pageant after claiming she was the \"most beautiful woman in France\" was detained at Ellis Island. Official sponsors of Miss France, Roberte Cusey, protested her claim.\n\n\n== Notable guests ==\nMajor General Mason Patrick attended the event, bringing with him a detail of over 60 planes. Also present were Congressman Clay Stone Briggs and newspaper publisher Cornelius Vanderbilt Jr.\n\n\n== Gallery ==\n\n\t\t\n\t\t\n\n\n== References ==", "links": ["1926 International Pageant of Pulchritude", "1928 International Pageant of Pulchritude", "1929 International Pageant of Pulchritude", "1930 International Pageant of Pulchritude", "1931 International Pageant of Pulchritude", "1932 International Pageant of Pulchritude", "1935 International Pageant of Pulchritude", "Ada Williams (actress)", "Alexandria, Louisiana", "Amarillo", "Arkansas", "Austin", "Baton Rouge", "Beaumont, Texas", "Bessemer, Michigan", "Brooklyn", "Canada", "Chicago", "Clay Stone Briggs", "Cleburne, Texas", "Cornelius Vanderbilt IV", "Cuba", "Dallas", "Denver", "Douglas, Arizona", "Ellis Island", "Etta Kett", "Fencing", "Florida", "Fort Worth", "France", "Galveston, Texas", "Green Bay, Wisconsin", "Harry J. Tuthill", "Hattiesburg American", "Horseback riding", "Hotel Galvez", "Houston", "Human swimming", "International Pageant of Pulchritude", "Italy", "Jersey City", "Kerrville", "Le Journal (Paris)", "Louisiana", "Lowell, Massachusetts", "Luxembourg", "Maria Alba", "Mason Patrick", "Mexico", "Milwaukee", "Monroe, Louisiana", "Moorhead Daily News", "New Orleans", "New York (state)", "New York City", "NewspaperArchive.com", "Oak Cliff", "Ogden, Utah", "Omaha", "Ottawa, Illinois", "Paul Robinson (cartoonist)", "Pine Bluff, Arkansas", "Pleasure Beach", "Port Isabel, Texas", "Portugal", "San Antonio", "Shreveport", "Spain", "Tennis", "Texas", "The Bungle Family", "United States", "Vancouver"]}