{
    "url": "https://en.wikipedia.org/wiki/1983_Canarian_regional_election",
    "title": "1983 Canarian regional election",
    "summary": "The 1983 Canarian regional election was held on Sunday, 8 May 1983, to elect the 1st Parliament of the Autonomous Community of the Canary Islands. All 60 seats in the Parliament were up for election. The election was held simultaneously with regional elections in twelve other autonomous communities and local elections all throughout Spain.\nThe Spanish Socialist Workers' Party (PSOE) emerged as the largest party in the archipelago with 27 seats—4 short of an overall majority—following the disintegration and dissolution of the Union of the Democratic Centre (UCD), the former ruling party of Spain in the 1977–1982 period which had achieved virtually unopposed victories in the islands in the 1977 and 1979 general elections. The People's Coalition, an electoral alliance comprising the People's Alliance (AP), the People's Democratic Party (PDP) and the Liberal Union (UL) became the second largest party and the main opposition force in the Parliament with 17 seats, while the also-nationwide Communist Party of Spain (PCE) obtained 1 seat. The centre and centre-right vote became further split between several small parties and splits from the UCD, such as the Democratic and Social Centre (CDS) of former Spanish prime minister Adolfo Suárez, which entered Parliament with 6 seats; the Gomera Group of Independents (AGI), with 2 seats; or the Canarian Nationalist Convergence (CNC) and the Independent Herrenian Group (AHI) with 1 seat each.\nThe election resulted in the most fragmented regional assembly of those elected on 8 May, with nine parties represented in the Parliament. The PSOE candidate Jerónimo Saavedra, who had been elected as provisional president in December 1982, was able to get re-elected with the support of AM, AGI and AHI, though the party did not commit itself to a global agreement with any other political force.",
    "content": "The 1983 Canarian regional election was held on Sunday, 8 May 1983, to elect the 1st Parliament of the Autonomous Community of the Canary Islands. All 60 seats in the Parliament were up for election. The election was held simultaneously with regional elections in twelve other autonomous communities and local elections all throughout Spain.\nThe Spanish Socialist Workers' Party (PSOE) emerged as the largest party in the archipelago with 27 seats—4 short of an overall majority—following the disintegration and dissolution of the Union of the Democratic Centre (UCD), the former ruling party of Spain in the 1977–1982 period which had achieved virtually unopposed victories in the islands in the 1977 and 1979 general elections. The People's Coalition, an electoral alliance comprising the People's Alliance (AP), the People's Democratic Party (PDP) and the Liberal Union (UL) became the second largest party and the main opposition force in the Parliament with 17 seats, while the also-nationwide Communist Party of Spain (PCE) obtained 1 seat. The centre and centre-right vote became further split between several small parties and splits from the UCD, such as the Democratic and Social Centre (CDS) of former Spanish prime minister Adolfo Suárez, which entered Parliament with 6 seats; the Gomera Group of Independents (AGI), with 2 seats; or the Canarian Nationalist Convergence (CNC) and the Independent Herrenian Group (AHI) with 1 seat each.\nThe election resulted in the most fragmented regional assembly of those elected on 8 May, with nine parties represented in the Parliament. The PSOE candidate Jerónimo Saavedra, who had been elected as provisional president in December 1982, was able to get re-elected with the support of AM, AGI and AHI, though the party did not commit itself to a global agreement with any other political force.\n\n\n== Overview ==\n\n\n=== Electoral system ===\nThe Parliament of the Canary Islands was the devolved, unicameral legislature of the autonomous community of the Canary Islands, having legislative power in regional matters as defined by the Spanish Constitution and the Canarian Statute of Autonomy, as well as the ability to vote confidence in or withdraw it from a regional president.Transitory Provision First of the Statute established a specific electoral procedure for the first election to the Parliament of the Canary Islands, to be supplemented by the provisions within Royal Decree-Law 20/1977, of 18 March, and its related regulations. Voting for the Parliament was on the basis of universal suffrage, which comprised all nationals over eighteen, registered in the Canary Islands and in full enjoyment of their political rights. The 60 members of the Parliament of the Canary Islands were elected using the D'Hondt method and a closed list proportional representation, with an electoral threshold of 20 percent of valid votes—which included blank ballots—being applied in each constituency. Alternatively, parties could also enter the seat distribution as long as they reached three percent regionally. Seats were allocated to constituencies, corresponding to the islands of El Hierro, Fuerteventura, Gran Canaria, La Gomera, La Palma, Lanzarote and Tenerife, with each being allocated a fixed number of seats: 3 for El Hierro, 7 for Fuerteventura, 15 for Gran Canaria, 4 for La Gomera, 8 for La Palma, 8 for Lanzarote and 15 for Tenerife.The electoral law allowed for parties and federations registered in the interior ministry, coalitions and groupings of electors to present lists of candidates. Parties and federations intending to form a coalition ahead of an election were required to inform the relevant Electoral Commission within fifteen days of the election call, whereas groupings of electors needed to secure the signature of at least one-thousandth of the electorate in the constituencies for which they sought election—with a compulsory minimum of 500 signatures—disallowing electors from signing for more than one list of candidates.\n\n\n=== Election date ===\nThe Government of Spain, in coordination with the Junta of the Canary Islands, was required to call an election to the Parliament of the Canary Islands within from 1 February to 31 May 1983. In the event of an investiture process failing to elect a regional president within a two-month period from the first ballot, the Parliament was to be automatically dissolved and a snap election called, with elected deputies merely serving out what remained of their four-year terms.\n\n\n== Parliamentary composition ==\nThe first election to the Parliament of the Canary Islands was officially called on 10 March 1983, after the publication of the election Decree in the Official State Gazette, with the mandate of the Provisional Parliament ending on 8 May. The table below shows the composition of the parliamentary groups in the Provisional Parliament at the time of its expiry.\n\n\n== Opinion polls ==\nThe tables below list opinion polling results in reverse chronological order, showing the most recent first and using the dates when the survey fieldwork was done, as opposed to the date of publication. Where the fieldwork dates are unknown, the date of publication is given instead. The highest percentage figure in each polling survey is displayed with its background shaded in the leading party's colour. If a tie ensues, this is applied to the figures with the highest percentages. The \"Lead\" column on the right shows the percentage-point difference between the parties with the highest percentages in a poll.\n\n\n=== Voting intention estimates ===\nThe table below lists weighted voting intention estimates. Refusals are generally excluded from the party vote percentages, while question wording and the treatment of \"don't know\" responses and those not intending to vote may vary between polling organisations. When available, seat projections determined by the polling organisations are displayed below (or in place of) the percentages in a smaller font; 31 seats were required for an absolute majority in the Parliament of the Canary Islands.\n\n\n=== Voting preferences ===\nThe table below lists raw, unweighted voting preferences.\n\n\n== Results ==\n\n\n=== Overall ===\n\n\n=== Distribution by constituency ===\n\n\n== Aftermath ==\n\n\n== Notes ==\n\n\n== References ==\nOpinion poll sources\nOther",
    "links": [
        "1977 Spanish general election",
        "1979 Canarian Island Cabildo elections",
        "1979 Spanish general election",
        "1980 Basque regional election",
        "1980 Catalan regional election",
        "1981 Galician regional election",
        "1982 Andalusian regional election",
        "1983 Aragonese regional election",
        "1983 Asturian regional election",
        "1983 Balearic regional election",
        "1983 Canarian Island Cabildo elections",
        "1983 Cantabrian regional election",
        "1983 Castilian-Leonese regional election",
        "1983 Castilian-Manchegan regional election",
        "1983 Extremaduran regional election",
        "1983 Madrilenian regional election",
        "1983 Murcian regional election",
        "1983 Navarrese regional election",
        "1983 Riojan regional election",
        "1983 Spanish local elections",
        "1983 Spanish regional elections",
        "1983 Valencian regional election",
        "1984 Basque regional election",
        "1984 Catalan regional election",
        "1985 Galician regional election",
        "1986 Andalusian regional election",
        "1986 Basque regional election",
        "1987 Aragonese regional election",
        "1987 Asturian regional election",
        "1987 Balearic regional election",
        "1987 Canarian Island Cabildo elections",
        "1987 Canarian regional election",
        "1987 Cantabrian regional election",
        "1987 Castilian-Leonese regional election",
        "1987 Castilian-Manchegan regional election",
        "1987 Extremaduran regional election",
        "1987 Madrilenian regional election",
        "1987 Murcian regional election",
        "1987 Navarrese regional election",
        "1987 Riojan regional election",
        "1987 Spanish regional elections",
        "1987 Valencian regional election",
        "1988 Catalan regional election",
        "1989 Galician regional election",
        "1991 Canarian Island Cabildo elections",
        "1991 Canarian regional election",
        "1995 Canarian Island Cabildo elections",
        "1995 Canarian regional election",
        "1999 Canarian Island Cabildo elections",
        "1999 Canarian regional election",
        "2003 Canarian Island Cabildo elections",
        "2003 Canarian regional election",
        "2007 Canarian Island Cabildo elections",
        "2007 Canarian regional election",
        "2011 Canarian Island Cabildo elections",
        "2011 Canarian regional election",
        "2015 Canarian Island Cabildo elections",
        "2015 Canarian regional election",
        "2019 Canarian Island Cabildo elections",
        "2019 Canarian regional election",
        "2023 Canarian regional election",
        "Absolute majority",
        "Adolfo Suárez",
        "Autonomous communities of Spain",
        "Boletín Oficial del Estado",
        "Cabildo insular",
        "Canarian Assembly",
        "Canarian Convergence",
        "Canarian Nationalist Convergence",
        "Canarian People's Union",
        "Canary Islands",
        "Closed list",
        "Communist Party of Spain (Marxist–Leninist) (historical)",
        "Communist Party of the Canaries",
        "Cortes Generales",
        "D'Hondt method",
        "Democratic Coalition (Spain)",
        "Democratic and Social Centre (Spain)",
        "Devolution",
        "El Hierro",
        "El Hierro (Parliament of the Canary Islands constituency)",
        "Elections in Spain",
        "Electoral alliance",
        "Electoral threshold",
        "Esteban Bethencourt Gámez",
        "European Parliament",
        "Francisco Marcos Hernández",
        "Fuerteventura",
        "Fuerteventura (Parliament of the Canary Islands constituency)",
        "Gomera Group of Independents",
        "Gonzalo Angulo González",
        "Government of Spain",
        "Gran Canaria",
        "Gran Canaria (Parliament of the Canary Islands constituency)",
        "Grouping of electors (Spain)",
        "ISSN (identifier)",
        "Independent Herrenian Group",
        "Jerónimo Saavedra",
        "La Gomera",
        "La Gomera (Parliament of the Canary Islands constituency)",
        "La Palma",
        "La Palma (Parliament of the Canary Islands constituency)",
        "Lanzarote",
        "Lanzarote (Parliament of the Canary Islands constituency)",
        "Lanzarote Independents Party",
        "Liberal Union (Spain, 1983)",
        "List of municipalities in Canary Islands",
        "Lorenzo Olarte Cullen",
        "Majorera Assembly",
        "Miguel Cabrera Cabrera",
        "Ministry of the Interior (Spain)",
        "N/a",
        "Parliament of the Canary Islands",
        "People's Alliance (Spain)",
        "People's Alliance–People's Democratic Party",
        "People's Coalition (Spain)",
        "People's Coalition (Spain, 1983)",
        "People's Democratic Party (Spain)",
        "Percentage point",
        "Political alliance",
        "Political party",
        "President of the Canary Islands",
        "Proportional representation",
        "Results breakdown of the 1977 Spanish general election (Congress)",
        "Results breakdown of the 1979 Spanish general election (Congress)",
        "Results breakdown of the 1979 Spanish local elections (Canary Islands)",
        "Results breakdown of the 1982 Spanish general election (Congress)",
        "Results breakdown of the 1983 Spanish local elections (Canary Islands)",
        "Results breakdown of the 1986 Spanish general election (Congress)",
        "Results breakdown of the 1987 European Parliament election in Spain",
        "Results breakdown of the 1987 Spanish local elections (Canary Islands)",
        "Results breakdown of the 1989 European Parliament election in Spain",
        "Results breakdown of the 1989 Spanish general election (Congress)",
        "Results breakdown of the 1991 Spanish local elections (Canary Islands)",
        "Results breakdown of the 1993 Spanish general election (Congress)",
        "Results breakdown of the 1994 European Parliament election in Spain",
        "Results breakdown of the 1995 Spanish local elections (Canary Islands)",
        "Results breakdown of the 1996 Spanish general election (Congress)",
        "Results breakdown of the 1999 European Parliament election in Spain",
        "Results breakdown of the 1999 Spanish local elections (Canary Islands)",
        "Results breakdown of the 2000 Spanish general election (Congress)",
        "Results breakdown of the 2003 Spanish local elections (Canary Islands)",
        "Results breakdown of the 2004 European Parliament election in Spain",
        "Results breakdown of the 2004 Spanish general election (Congress)",
        "Results breakdown of the 2007 Spanish local elections (Canary Islands)",
        "Results breakdown of the 2008 Spanish general election (Congress)",
        "Results breakdown of the 2009 European Parliament election in Spain",
        "Results breakdown of the 2011 Spanish general election (Congress)",
        "Results breakdown of the 2011 Spanish local elections (Canary Islands)",
        "Results breakdown of the 2014 European Parliament election in Spain",
        "Results breakdown of the 2015 Spanish general election (Congress)",
        "Results breakdown of the 2015 Spanish local elections (Canary Islands)",
        "Results breakdown of the 2016 Spanish general election (Congress)",
        "Results breakdown of the 2019 European Parliament election in Spain",
        "Results breakdown of the 2019 Spanish local elections (Canary Islands)",
        "Results breakdown of the April 2019 Spanish general election (Congress)",
        "Results breakdown of the November 2019 Spanish general election (Congress)",
        "Revolutionary Communist League (Spain)",
        "Socialist Party of the Canaries",
        "Spain",
        "Spanish Constitution of 1978",
        "Spanish prime minister",
        "Statute of Autonomy",
        "Tenerife",
        "Tenerife (Parliament of the Canary Islands constituency)",
        "Unicameral legislature",
        "Union of the Democratic Centre (Spain)",
        "Universal suffrage",
        "Workers' Socialist Party (Spain)"
    ]
}