{"url": "https://en.wikipedia.org/wiki/2016_San_Francisco_Giants_season", "title": "2016 San Francisco Giants season", "summary": "The 2016 San Francisco Giants season was the Giants' 134th year in Major League Baseball, their 59th year in San Francisco since their move from New York following the 1957 season, and their 17th at AT&T Park. They reached the postseason, where they defeated the New York Mets in the NL Wild Card Game but lost in four games to the eventual World Series champion Chicago Cubs in the Division Series.", "content": "The 2016 San Francisco Giants season was the Giants' 134th year in Major League Baseball, their 59th year in San Francisco since their move from New York following the 1957 season, and their 17th at AT&T Park. They reached the postseason, where they defeated the New York Mets in the NL Wild Card Game but lost in four games to the eventual World Series champion Chicago Cubs in the Division Series.\n\n\n== Events ==\nNovember 5, 2015 − The Giants decline to exercise options on OF Nori Aoki and OF Marlon Byrd, allowing them to become free agents.\nNovember 17, 2015 – The Giants and IF Brandon Crawford agreed to a 6-year contract extension worth $75 million with a full no-trade clause and no option years.\nDecember 3, 2015 – The Giants decline to tender the 2016 contracts on RHP Yusmeiro Petit and C Héctor Sánchez, allowing them to become free agents.\nDecember 9, 2015 – The Giants sign RHP Jeff Samardzija to a five-year, $90 million contract.\nDecember 16, 2015 – The Giants sign RHP Johnny Cueto to a six-year, $130 million contract with a club option for 2022. Cueto can opt out of the contract after two years.\nJanuary 7, 2016 – The Giants sign CF Denard Span to a three-year, $31 million contract.\nJanuary 13, 2016 – The Giants received a player to be named or cash considerations from the Arizona Diamondbacks in exchange for minor-league RHP Cody Hall.\nFebruary 1, 2016 – The Giants and RHP George Kontos agreed to a one-year, $1.15 million contract avoiding salary arbitration.\nFebruary 10, 2016 – The Giants and 1B Brandon Belt agreed to a one-year, $6.2 million contract avoiding salary arbitration.\nApril 9, 2016 – The Giants and 1B Brandon Belt agreed to a 5-year contract extension.\nJuly 5, 2016 – The rosters for the 2016 Major League Baseball All-Star Game are announced, with C Buster Posey being named the National League's starter at catcher and to the all-star game for the fourth time. LHP Madison Bumgarner is named to his fourth all-star roster and RHP Johnny Cueto makes the all-star game for the second time.\nJuly 5, 2016 – Brandon Belt won the Final Vote for the All-Star Game and makes his first appearance in the All-Star Game.\nJuly 28, 2016 – The Giants acquire IF Eduardo Núñez from the Minnesota Twins in exchange for minor league LHP Adalberto Mejia.\nAugust 1, 2016 – The Giants acquire LHP Will Smith from the Milwaukee Brewers in exchange for minor league LHP Phil Bickford and C Andrew Susac.\nAugust 1, 2016 – The Giants acquire LHP Matt Moore from the Tampa Bay Rays in exchange for 3B Matt Duffy, minor league RHP Michael Santos, and minor league IF Lucius Fox.\nSeptember 27, 2016 – The Giants acquire 3B Gordon Beckham from the Atlanta Braves in exchange for minor league SS Rich Rodriguez.\nNovember 11, 2016 – SS Brandon Crawford and C Buster Posey were named Wilson Defensive Players of the Year along with the team that named Defensive Team of the Year.\n\n\n== Season standings ==\n\n\n=== National League West ===\n\n\n=== National League Division Standings ===\n\n\n=== Record vs. opponents ===\n\n\n== Game log and schedule ==\nAll schedule and scores taken from MLB.com.\n\n\n=== Postseason ===\n\n\n== Roster ==\n\n\n== Postseason ==\n\n\n=== Wild Card ===\n\nDespite having claimed the Wild Card spot on the final day of the regular season, the Giants were able to tab ace Madison Bumgarner for the Wild Card game start. Bumgarner had an excellent regular season for the Giants, finishing with a career-low in ERA and a career-high in strikeouts, finishing fourth in the National League in both categories. On the hill for the New York Mets was Noah Syndergaard, who himself finished 3rd in the NL in ERA and 9th in strikeouts. The pitching matchup didn't disappoint, it took until the bottom of the third inning for the game's first hit and baserunner, with Syndergaard striking out four straight batters on two occasions. The closest either side came to scoring was in the top of the 6th when, after Denard Span singled and stole second base with two outs, Brandon Belt hit a long fly ball to center field which was caught on the dead run by Curtis Granderson, smashing into the wall and holding on. Syndergaard exited after 7 innings, having struck out 10. Crucially as it turned out, the Giants had forced Syndergaard out of the game with Bumgarner still going strong. Another golden opportunity was squandered by the Giants in the top of the 8th inning, when Addison Reed struck out Hunter Pence to end the inning with the bases loaded. After Bumgarner left a runner in scoring position in the bottom of the 8th, the game moved to the 9th with the Mets bringing in closer Jeurys Familia. Brandon Crawford led the inning off with a double to left-center, but Ángel Pagán couldn't lay down the sacrifice bunt and then struck out. Joe Panik worked a walk and Conor Gillaspie stepped up to the plate to launch a three-run home run to right field. Gillaspie had only started the game because Eduardo Núñez was still dealing with a hamstring injury and had to be left off the roster. Bumgarner then got the final three outs, completing the shutout just as he had done in the 2014 Wild Card Game. Bumgarner made 119 pitches, allowed just 6 total baserunners, striking out 6 and setting an MLB record of 23 consecutive scoreless innings pitched in postseason elimination games. With the win, the Giants equalled the Major League record for consecutive postseason series wins with 11, also extending their streak of postseason elimination game wins to 9.Wednesday, October 5, 2016 – 8:07 p.m. (EDT) at Citi Field in New York City\n\n\n=== Division Series ===\n\n\n==== Game 1, October 7 ====\nThe Giants started 18-game winner Johnny Cueto in Game 1 of the NLDS, while the Cubs countered with 19-game winner Jon Lester. Just as in the Wild Card game, both starting pitchers lived up to the billing, and dominated the opposing team's lineup. Also as in that game, the Giants had slightly more opportunities to score in the early innings, but were unable to take advantage of them. The Giants had the leadoff man on base in each of the first three innings, but the Cubs, with the help of a caught stealing and a successful pickoff play at first base were able to wipe the runners off base quickly. Lester seemed to improve as the game went on, and the Giants found it difficult to have extended at bats against him. After 8 dominant innings in which he made just 86 pitches, Lester looked set to come out of the game, as his spot in the lineup along with the spot of his catcher David Ross were due up, and it looked as though Cubs manager Joe Maddon would decide to pinch-hit for them both. In the end before the game reached that point, Javier Báez cranked a home run to left-field off Cueto which would ultimately seal the game. Cueto nonetheless pitched superbly, striking out 10 in his 8 innings of work and allowing just three hits in total. Neither starter walked a batter. Though Buster Posey doubled with two outs off Cubs closer Aroldis Chapman to give the Giants a faint hope, Hunter Pence grounded out to end the game and give the Cubs the lead in the series.\n\n\n==== Game 2, October 8 ====\nThe Giants started former Cub, Jeff Samardzija in Game 2. Samardzija had pitched well for the Giants down the stretch, but only lasted four innings in his last appearance at Wrigley Field. Unfortunately for the Giants, Samardzija produced a similar effort this time. Dexter Fowler led off the bottom of the 1st inning with a double and was eventually brought in to score on a two-out base hit by Ben Zobrist. The second inning proved Samardzija's undoing as he loaded the bases with nobody out on the way to giving up three more runs in the frame. A 4-run deficit to the Major League leader in ERA Kyle Hendricks appeared to be a large one already, but the Giants did bring themselves briefly back into the game. Joe Panik produced a leadoff double and that was followed by another from pinch-hitter Gregor Blanco spelling the end of the night for Samardzija. Blanco was brought in to score on a sacrifice fly from Brandon Belt and the Giants had halved the deficit. However, those were to be the only runs they would score. In the 4th inning, Hendricks took a line drive off the bat of Ángel Pagán off his arm and eventually decided to leave the game. This proved not to help the Giants as, not only did the Cubs bullpen shut them down the rest of the way, but also Travis Wood, brought on to relieve Hendricks, launched a solo home-run off George Kontos to pad the Cubs lead in the bottom half of the 4th. This was just the second time a relief pitcher has homered in a postseason game, the last time being in 1924. Aroldis Chapman locked down the save again, and the Giants were faced with elimination in Game 3.\n\n\n==== Game 3, October 10 ====\nFacing a possible sweep, the Giants were able to call on Madison Bumgarner to take the mound and try to extend their streak of elimination game wins. As a mark of the strength of the Cubs rotation, they were able to start an 18-game winner and the reigning Cy Young Award winner Jake Arrieta. Bumgarner wasn't especially sharp and he struggled to put away hitters in the second inning, culminating in a three-run home run with two strikes to Arrieta. The Giants were staring down the barrel with a 3–0 deficit. Buster Posey singled home Denard Span in the third and the Giants narrowed the gap to one in the 5th inning, with Span again the catalyst, tripling and scoring on Brandon Belt's sacrifice fly. Bumgarner left the game after five innings and the bullpen managed to keep the Cubs in check. There looked to be a major turning point in the bottom of the 6th inning, when a play at first was reviewed. After a spectacular sliding save from Javier Báez at one end, it appeared from multiple angles that first baseman Anthony Rizzo may have taken his foot off the base, but much to the consternation of the crowd, the call stood as called, wiping out a lead-off runner as the Giants were running out of time. In the bottom of the 8th inning, Belt singled to lead off the inning off Travis Wood, and Héctor Rondón walked Posey. With two on and nobody out, Joe Maddon called on Aroldis Chapman for a six out save. After Hunter Pence struck out, Wild Card hero Conor Gillaspie lined a two-run triple to the gap in right-center to turn the tables and give the Giants the one-run lead. Brandon Crawford then singled through the drawn-in infield and the Giants had an insurance run to lead 5–3. Crawford then stole second base, and advanced to third on an errant throw but the Giants weren't able to cash him in. Sergio Romo came in to try to close out the game, but Dexter Fowler drew a walk on 8 pitches and Kris Bryant sent a deep fly ball to left field that hit the top of the wall and bounced over for a game-tying two-run home run. The 9th inning had been a huge problem for the Giants all season, and that problem had surfaced again at a crucial time. Romo did manage to pitch through the inning without surrendering the lead, and the game went to extra innings. In the end, it was a battle of two left-handed long relievers to see who would crack first, Ty Blach for the Giants and Mike Montgomery for the Cubs. Crawford led off the bottom of the 13th inning with a double, and that was followed by a walk-off double off the high wall in right field by Joe Panik, and the Giants ensured there would be a Game 4 in the series.\n\n\n==== Game 4, October 11 ====\nThe Giants turned to trade deadline acquisition Matt Moore to keep them in the series. Moore, who had pitched in the Game 162 win to see the Giants into the postseason would be opposed by John Lackey for the Cubs. The early going was good for the Giants as Denard Span doubled to lead off the Giants half of the 1st, and came into score on a sacrifice fly from Buster Posey. Though David Ross would homer to lead off the 3rd inning, the Giants would soon be back on top. With the bases loaded and 1 out in the bottom of the 4th, Moore singled home the go-ahead run, and another would come into score as Lackey couldn't maintain contact with first base as the Cubs attempted to double up Span. A throwing error from Brandon Crawford that allowed Javier Báez to reach third led to a Ross sacrifice fly that immediately cut the Giants lead to 1 in the 5th. The Giants were to hit right back as, after Hunter Pence singled with one out in the bottom half of the inning, Crawford made amends by launching a double that would have been a home run were it not for a short section of railing on the top of the wall of Levi's Landing. Both runners would come into score anyway as Conor Gillaspie came through again with an RBI base hit (one of four hits in the game for him), and Joe Panik hit a sacrifice fly to give the Giants a 5–2 lead. The Cubs bullpen again shut the Giants down the rest of the way, but Moore was gradually becoming the story in the game. After 8 innings, Moore had delivered 120 pitches, surrendering just 2 hits, 2 walks and 2 runs (one unearned) whilst striking out 10. However, in a stunning turn of events, five Giants relief pitchers combined to blow the game and the season in the 9th inning. Derek Law allowed a leadoff hit to Kris Bryant, Javier López walked Anthony Rizzo and Sergio Romo gave up an RBI double to Ben Zobrist setting up the tying runs in scoring position. Will Smith then entered to allow the tying hit to pinch-hitter Willson Contreras. Finally an out was recorded as Jason Heyward's sacrifice bunt ended up in a force play at second, but another Crawford error allowed Heyward to reach second base. Baez then came through for the Cubs again to bring in Heyward for the go-ahead run off Hunter Strickland. The Giants had blown another 9th inning lead, and didn't have a win in the 9th inning when trailing all season. Aroldis Chapman promptly struck out the side to eliminate the Giants. With the loss several streaks ended, the Giants equal MLB record 11 straight postseason series win streak, their MLB record 10 game elimination game win streak, and also their even-year World Series win streak dating back to 2010.\n\n\n== Statistics ==\n\n\n=== Batting ===\nNote: G = Games played; AB = At bats; R = Runs scored; H = Hits; 2B = Doubles; 3B = Triples; HR = Home runs; RBI = Runs batted in; BB = Base on balls; SO = Strikeouts; AVG = Batting average; OPS = On base plus slugging percentage; SB = Stolen bases\n\n\n=== Pitching ===\nNote: W = Wins; L = Losses; ERA = Earned run average; G = Games pitched; GS = Games started; SV = Saves; IP = Innings pitched; H = Hits allowed; R = Runs allowed; ER = Earned runs allowed; HR = Home runs allowed; BB = Walks allowed; K = Strikeouts  \n\n\n== Farm system ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\n2016 San Francisco Giants season Archived December 20, 2014, at the Wayback Machine\n2016 San Francisco Giants season at Baseball Reference", "links": ["1883 Major League Baseball season", "1883 New York Gothams season", "1884 New York Gothams season", "1885 New York Gothams/Giants season", "1886 New York Giants season", "1887 New York Giants season", "1888 New York Giants season", "1888 World Series", "1889 New York Giants season", "1889 World Series", "1890 New York Giants season", "1891 New York Giants season", "1892 New York Giants season", "1893 New York Giants season", "1894 New York Giants season", "1895 New York Giants season", "1896 New York Giants season", "1897 New York Giants season", "1898 New York Giants season", "1899 New York Giants season", "1900 New York Giants season", "1901 New York Giants season", "1902 New York Giants season", "1903 New York Giants season", "1904 New York Giants season", "1905 New York Giants season", "1905 World Series", "1906 New York Giants season", "1907 New York Giants season", "1908 New York Giants season", "1909 New York Giants season", "1910 New York Giants season", "1911 New York Giants season", "1912 New York Giants season", "1913 New York Giants season", "1914 New York Giants season", "1915 New York Giants season", "1916 New York Giants season", "1917 New York Giants season", "1918 New York Giants season", "1919 New York Giants season", "1920 New York Giants season", "1921 New York Giants season", "1921 World Series", "1922 New York Giants season", "1922 World Series", "1923 New York Giants season", "1924 New York Giants season", "1925 New York Giants (MLB) season", "1926 New York Giants (MLB) season", "1927 New York Giants (MLB) season", "1928 New York Giants (MLB) season", "1929 New York Giants (MLB) season", "1930 New York Giants (MLB) season", "1931 New York Giants (MLB) season", "1932 New York Giants (MLB) season", "1933 New York Giants (MLB) season", "1933 World Series", "1934 New York Giants (MLB) season", "1935 New York Giants (MLB) season", "1936 New York Giants (MLB) season", "1937 New York Giants (MLB) season", "1938 New York Giants (MLB) season", "1939 New York Giants (MLB) season", "1940 New York Giants (MLB) season", "1941 New York Giants (MLB) season", "1942 New York Giants (MLB) season", "1943 New York Giants (MLB) season", "1944 New York Giants (MLB) season", "1945 New York Giants (MLB) season", "1946 New York Giants (MLB) season", "1947 New York Giants (MLB) season", "1948 New York Giants (MLB) season", "1949 New York Giants (MLB) season", "1950 New York Giants (MLB) season", "1951 National League tie-breaker series", "1951 New York Giants (MLB) season", "1952 New York Giants (MLB) season", "1953 New York Giants (MLB) season", "1954 New York Giants (MLB) season", "1954 World Series", "1955 New York Giants (MLB) season", "1956 New York Giants (MLB) season", "1957 New York Giants (MLB) season", "1958 Major League Baseball season", "1958 San Francisco Giants season", "1959 San Francisco Giants season", "1960 San Francisco Giants season", "1961 San Francisco Giants season", "1962 National League tie-breaker series", "1962 San Francisco Giants season", "1963 San Francisco Giants season", "1964 San Francisco Giants season", "1965 San Francisco Giants season", "1966 San Francisco Giants season", "1967 San Francisco Giants season", "1968 San Francisco Giants season", "1969 Major League Baseball season", "1969 San Francisco Giants season", "1970 San Francisco Giants season", "1971 San Francisco Giants season", "1972 San Francisco Giants season", "1973 San Francisco Giants season", "1974 San Francisco Giants season", "1975 San Francisco Giants season", "1976 San Francisco Giants season", "1977 San Francisco Giants season", "1978 San Francisco Giants season", "1979 San Francisco Giants season", "1980 San Francisco Giants season", "1981 San Francisco Giants season", "1982 San Francisco Giants season", "1983 San Francisco Giants season", "1984 San Francisco Giants season", "1985 San Francisco Giants season", "1986 San Francisco Giants season", "1987 San Francisco Giants season", "1988 San Francisco Giants season", "1989 Loma Prieta earthquake", "1989 National League Championship Series", "1989 San Francisco Giants season", "1990 San Francisco Giants season", "1991 San Francisco Giants season", "1992 San Francisco Giants season", "1993 San Francisco Giants season", "1994 San Francisco Giants season", "1995 Colorado Rockies season", "1995 San Francisco Giants season", "1996 Los Angeles Dodgers season", "1996 San Francisco Giants season", "1997 Florida Marlins season", "1997 San Francisco Giants season", "1998 Chicago Cubs season", "1998 National League Wild Card tie-breaker game", "1998 San Francisco Giants season", "1999 New York Mets season", "1999 San Francisco Giants season", "2000 Major League Baseball season", "2000 New York Mets season", "2000 San Francisco Giants season", "2001 San Francisco Giants season", "2001 St. Louis Cardinals season", "2002 National League Championship Series", "2002 San Francisco Giants season", "2003 Florida Marlins season", "2003 San Francisco Giants season", "2004 Houston Astros season", "2004 San Francisco Giants season", "2005 Houston Astros season", "2005 San Francisco Giants season", "2006 Los Angeles Dodgers season", "2006 San Francisco Giants season", "2007 Colorado Rockies season", "2007 San Francisco Giants season", "2008 Milwaukee Brewers season", "2008 San Francisco Giants season", "2009 Colorado Rockies season", "2009 San Francisco Giants season", "2010 Atlanta Braves season", "2010 National League Championship Series", "2010 San Francisco Giants season", "2010 World Series", "2011 San Francisco Giants season", "2011 St. Louis Cardinals season", "2012 Atlanta Braves season", "2012 National League Championship Series", "2012 San Francisco Giants season", "2012 St. Louis Cardinals season", "2012 World Series", "2013 Cincinnati Reds season", "2013 Pittsburgh Pirates season", "2013 San Francisco Giants season", "2014 National League Championship Series", "2014 National League Wild Card Game", "2014 Pittsburgh Pirates season", "2014 San Francisco Giants season", "2014 World Series", "2015 Chicago Cubs season", "2015 Pittsburgh Pirates season", "2015 San Francisco Giants season", "2016 American League Championship Series", "2016 American League Division Series", "2016 American League Wild Card Game", "2016 Arizona Diamondbacks season", "2016 Atlanta Braves season", "2016 Baltimore Orioles season", "2016 Boston Red Sox season", "2016 Chicago Cubs season", "2016 Chicago White Sox season", "2016 Cincinnati Reds season", "2016 Cleveland Indians season", "2016 Colorado Rockies season", "2016 Detroit Tigers season", "2016 Houston Astros season", "2016 Kansas City Royals season", "2016 Los Angeles Angels season", "2016 Los Angeles Dodgers season", "2016 Major League Baseball All-Star Game", "2016 Major League Baseball draft", "2016 Major League Baseball postseason", "2016 Major League Baseball season", "2016 Miami Marlins season", "2016 Milwaukee Brewers season", "2016 Minnesota Twins season", "2016 National League Championship Series", "2016 National League Division Series", "2016 National League Wild Card Game", "2016 New York Mets season", "2016 New York Yankees season", "2016 Oakland Athletics season", "2016 Philadelphia Phillies season", "2016 Pittsburgh Pirates season", "2016 San Diego Padres season", "2016 Seattle Mariners season", "2016 St. Louis Cardinals season", "2016 Tampa Bay Rays season", "2016 Texas Rangers season", "2016 Toronto Blue Jays season", "2016 Washington Nationals season", "2016 World Series", "2017 Arizona Diamondbacks season", "2017 Colorado Rockies season", "2017 San Francisco Giants season", "2018 Chicago Cubs season", "2018 Colorado Rockies season", "2018 San Francisco Giants season", "2019 Milwaukee Brewers season", "2019 San Francisco Giants season", "2019 Washington Nationals season", "2020 Cincinnati Reds season", "2020 Milwaukee Brewers season", "2020 San Francisco Giants season", "2021 Los Angeles Dodgers season", "2021 San Francisco Giants season", "2021 St. Louis Cardinals season", "2022 San Francisco Giants season", "A. J. Ramos", "AT&T Park", "Aaron Blair", "Aaron Sanchez (baseball)", "Adam Ottavino", "Adam Wainwright", "Addison Reed", "Al Lang Stadium", "Albert Suárez", "Alex Box Stadium", "Alex Reyes", "Alex Wood (baseball)", "American League", "Andrew Cashner", "Andrew Miller (baseball)", "Andrew Susac", "Anthony DeSclafani", "Anthony Rizzo", "Anthony Swarzak", "Antonio Bastardo", "Archie Bradley (baseball)", "Arizona Complex League Giants", "Arizona Diamondbacks", "Arizona League", "Arizona League Giants", "Aroldis Chapman", "Atlanta Braves", "Augusta GreenJackets", "Baltimore Orioles", "Barry Bonds", "Bartolo Colón", "Bay Bridge Series", "Ben Zobrist", "Bill Hayes (baseball)", "Bill Terry", "Bolton Street Park", "Boston Red Sox", "Brad Brach", "Brad Hand", "Brad Ziegler", "Brandon Belt", "Brandon Crawford", "Brandon Maurer", "Brandon McCarthy", "Brandon Morrow", "Bruce Bochy", "Buster Posey", "Caleb Cotham", "California", "California League", "Candlestick Park", "Carl Edwards Jr.", "Carl Hubbell", "Carlos Estevez", "Carlos Martínez (pitcher, born 1991)", "Chad Bettis", "Chad Chop", "Chad Green (pitcher)", "Chicago, Illinois", "Chicago Cubs", "Chris Archer", "Chris Hatcher (pitcher)", "Chris Heston", "Chris Rusin", "Chris Stratton", "Chris Withrow", "Christian Bergman", "Christian Friedrich (baseball)", "Christy Mathewson", "Cincinnati Reds", "Citi Field", "Class A-Advanced", "Class A-Short Season", "Clayton Kershaw", "Cody Hall (baseball)", "Cody Reed", "Colin Rea", "Colorado Rockies", "Comcast SportsNet Bay Area", "Conor Gillaspie", "Corey Knebel", "Cory Gearrin", "Craig Kimbrel", "Curse of Coogan's Bluff", "Curtis Granderson", "Cy Young Award", "Dan Straily", "Daniel Hudson", "Daniel Mengden", "Dave Flemming", "Dave Righetti", "David Phelps (baseball)", "David Price (baseball)", "David Ross (baseball)", "Denard Span", "Denison Field", "Derek Law", "Dexter Fowler", "Dillon Overton", "Dodgers–Giants rivalry", "Dominic Leone", "Dominican Summer League", "Dominican Summer League Giants", "Don't Stop Believin'", "Double-A (baseball)", "Drew Pomeranz", "Duane Kuiper", "Dustin McGowan", "Dylan Bundy", "Eastern League (1938–2020)", "Eastern Time Zone", "Eddie Butler (baseball)", "Eduardo Núñez", "Edwin Jackson (baseball)", "Ehíré Adríanza", "Eli Whiteside", "Elvis Araújo", "Enrique Burgos (baseball, born 1990)", "Error (baseball)", "Eugene Emeralds", "Fernando Rodney", "Flamingo Field", "Fort Bragg Game", "Games behind", "Gaylord Perry", "George Kontos", "Germán Márquez", "GiantsVision", "Giants–Yankees rivalry", "Gio González", "Gordon Beckham", "Gorkys Hernández", "Grant Green (baseball)", "Gregor Blanco", "Hector Neris", "Henry Cotto", "Hensley Meulens", "Hilltop Park", "History of the New York Giants (baseball)", "History of the San Francisco Giants", "Hit (baseball)", "Home (sports)", "Home run", "Hunter Pence", "Hunter Strickland", "Héctor Rondón", "Héctor Sánchez (baseball)", "I Left My Heart in San Francisco", "J. A. Happ", "J. C. Ramírez", "Jackie Robinson", "Jacob deGrom", "Jake Arrieta", "Jake Barrett", "Jake McGee", "Jake Peavy", "Jake Smith (pitcher, born 1990)", "James Shields (baseball)", "Jared Hughes", "Jarred Cosart", "Jarrett Parker", "Jason Heyward", "Javier Báez", "Javier López (baseball)", "Jeanmar Gómez", "Jeff Locke (baseball)", "Jeff Samardzija", "Jeremy Hellickson", "Jeremy Jeffress", "Jeurys Familia", "Jim Johnson (baseball, born 1983)", "Jimmy Nelson (baseball)", "Joe Blanton", "Joe Maddon", "Joe Nathan", "Joe Panik", "Joe Smith (pitcher)", "Joel De La Cruz", "John Lackey", "John McGraw", "Johnny Cueto", "Jon Gray", "Jon Lester", "Jon Miller", "Jon Niese", "Jordan Lyles", "Jorge De La Rosa", "Jorge de la Rosa", "Josh Osich", "José Alguacil", "José Fernández (pitcher)", "Juan Marichal", "Juan Nicasio", "Julio Urías", "Junichi Tazawa", "Justin Miller (baseball, born 1987)", "KKSF (AM)", "KNBR (AM)", "KNTV", "KTRB", "Kelby Tomlinson", "Kenley Jansen", "Kenta Maeda", "Kevin Gausman", "Kevin Quackenbush", "Kris Bryant", "Kyle Barraclough", "Kyle Hendricks", "Larry Baer", "Lights (Journey song)", "Lipso Nava", "List of National League Wild Card winners", "List of San Francisco Giants Opening Day starting pitchers", "List of San Francisco Giants broadcasters", "List of San Francisco Giants first-round draft picks", "List of San Francisco Giants managers", "List of San Francisco Giants minor league affiliates", "List of San Francisco Giants no-hitters", "List of San Francisco Giants owners and executives", "List of San Francisco Giants seasons", "List of San Francisco Giants team records", "Los Angeles Dodgers", "Loss (baseball)", "Louis Coleman", "Lucius Fox (baseball)", "Luis García (pitcher)", "Luis Perdomo (baseball, born 1993)", "Luke Weaver (baseball)", "Mac Williamson", "Madison Bumgarner", "Major League Baseball", "Mark Gardner (baseball)", "Mark Melancon", "Marlon Byrd", "Marvin Benard", "Matt Barnes (baseball)", "Matt Cain", "Matt Cain's perfect game", "Matt Duffy", "Matt Moore (baseball)", "Matt Reynolds (pitcher)", "Matt Wisler", "Max Scherzer", "McCovey Cove", "Mel Ott", "Merkle's Boner", "Miami Marlins", "Miguel Ojeda", "Mike Broadway", "Mike Foltynewicz", "Mike Krukow", "Mike Montgomery (baseball)", "Milwaukee Brewers", "Minnesota Twins", "Minor League Baseball", "Monte Irvin", "NBC", "NL West", "Nathan Eovaldi", "National League", "National League West", "New York Brickley Giants", "New York City", "New York Giants (National League)", "New York Mets", "New York Yankees", "Noah Syndergaard", "Nori Aoki", "Northwest League", "Oakland Athletics", "Oakland Park, New Jersey", "Oracle Park", "Orlando Cepeda", "Pacific Coast League", "Patrick Corbin", "Paul Clemens (baseball)", "Payne Park", "Phil Bickford", "Philadelphia Phillies", "Phoenix Municipal Stadium", "Pittsburgh Pirates", "Polo Grounds", "Ramiro Peña", "Rich Hill (pitcher)", "Richmond Flying Squirrels", "Rick Porcello", "Road (sports)", "Robbie Ray (baseball)", "Roberto Kelly", "Roberto Osuna", "Ron Wotus", "Rookie League", "Ross Stripling", "Rubby De La Rosa", "Rubén Tejada", "Run (baseball)", "Ryan Madson", "Ryan Tepera", "Ryan Vogelsong", "Sacramento River Cats", "Salem-Keizer Volcanoes", "San Diego Padres", "San Francisco", "San Francisco, California", "San Francisco Bay Area", "San Francisco Giants", "San Francisco Giants all-time roster", "San Jose Giants", "Santiago Casilla", "Save (baseball)", "Scott Kazmir", "Scottsdale Stadium", "Seals Stadium", "Sean Manaea", "Sergio Romo", "Seth Lugo", "Seung-hwan Oh", "Severino González", "Shawn Kelley", "Shawon Dunston", "Shelby Miller", "Shot Heard 'Round the World (baseball)", "Single-A (baseball)", "South Atlantic League", "St. George Cricket Grounds", "St. Louis Cardinals", "Stephen Strasburg", "Steve Decker", "Steven Matz", "Steven Okert", "Subway Series", "Tampa Bay Rays", "Tanner Roark", "Temple Cup", "The Catch (baseball)", "The Echoing Green (book)", "The Fan (1996 film)", "The Franchise (TV series)", "Tito Fuentes", "Tom Koehler", "Tony Cingrani", "Tony Watson", "Toronto Blue Jays", "Travis Wood", "Trevor Brown (baseball)", "Trevor Cahill", "Trevor Rosenthal", "Tri-Cornered Baseball Game", "Triple-A (baseball)", "Ty Blach", "Tyler Anderson", "Tyler Chatwood", "Tyler Clippard", "Tyler Lyons", "Tyler Thornburg", "Tyler Wagner", "Vin Mazzaro", "Washington Nationals", "Wayback Machine", "White Flag Trade", "Wilfredo Boscán", "Will Smith (pitcher)", "Willie Mac Award", "Willie Mays", "Willie McCovey", "Willson Contreras", "Wilson Defensive Player of the Year Award", "Wily Peralta", "Win (baseball)", "Winning percentage", "Win–loss record (pitching)", "Wrigley Field", "Xavier Cedeño", "You Dropped a Bomb on Me", "Yusmeiro Petit", "Zach Britton", "Zach Neal", "Zack Greinke", "Álex Colomé", "Ángel Pagán"]}