{"url": "https://en.wikipedia.org/wiki/Ahuriri_Lagoon", "title": "Ahuriri Lagoon", "summary": "Ahuriri Lagoon (Māori: Te Whanganui-a-Orotū) was a large tidal lagoon at Napier, on the east coast of New Zealand's North Island, that largely drained when the area was raised by the 1931 Hawke's Bay earthquake.\nBefore the earthquake, the lagoon stretched several kilometres from north to south, and covered roughly 4000 hectares (ha), or 40 km². The Tūtaekurī River flowed into the southern end, and the Esk River into the northern end. Following the earthquake, the Esk was no longer able to flow into the lagoon and ran more directly to the sea. The Tūtaekurī still flowed into the lagoon after the earthquake but it caused flooding for the next few years, and by the end of the 1930s it had been diverted away from the lagoon to enter the sea at the mouth of the Ngaruroro River.The land rise in the earthquake drained much of the lagoon, leaving a smaller estuary. Land reclamation and drainage work further reduced the estuary to its present size of 470 ha.", "content": "Ahuriri Lagoon (Māori: Te Whanganui-a-Orotū) was a large tidal lagoon at Napier, on the east coast of New Zealand's North Island, that largely drained when the area was raised by the 1931 Hawke's Bay earthquake.\nBefore the earthquake, the lagoon stretched several kilometres from north to south, and covered roughly 4000 hectares (ha), or 40 km². The Tūtaekurī River flowed into the southern end, and the Esk River into the northern end. Following the earthquake, the Esk was no longer able to flow into the lagoon and ran more directly to the sea. The Tūtaekurī still flowed into the lagoon after the earthquake but it caused flooding for the next few years, and by the end of the 1930s it had been diverted away from the lagoon to enter the sea at the mouth of the Ngaruroro River.The land rise in the earthquake drained much of the lagoon, leaving a smaller estuary. Land reclamation and drainage work further reduced the estuary to its present size of 470 ha.\n\n\n== Cultural history ==\nMāori named the lagoon Te Whanganui-a-Orotū (the Great Harbour of Orotū) after the chief Te Orotū. It was an important food source for Māori and supported a large population.European settlers established Napier on  Scinde Island (present day Bluff Hill) in the harbour, and it soon became a prosperous region on New Zealand's east coast. Napier's growth then halted, as there was not enough flat land to build on. The southern end of the lagoon stretched between Scinde Island and the mainland, separating Napier from the settlement of Taradale, and many people moving into the region chose Taradale over Napier because of the abundance of land. In the 1931 Hawke's Bay earthquake the lagoon was uplifted, exposing roughly 30 km² (3000ha) of seabed. This included a new land bridge between Napier and Taradale. The towns grew over the years and Taradale amalgamated with Napier, forming Napier City, in 1968.\n\n\n== Current use ==\nMost of what was the lagoon is now low-lying land. Hawke's Bay Airport and suburbs of Napier are built on part of it. Much of the rest is used for agriculture. A broad shallow river channel runs along the western edge and across the southern half of the reclaimed land, flowing into Hawke Bay at Ahuriri Estuary, to the west of the suburb of Ahuriri and Bluff Hill. The suburb of Westshore occupies a thin strip between the sea and State Highway 2.\n\n\n== References ==", "links": ["1931 Hawke's Bay earthquake", "Ahuriri", "An Encyclopaedia of New Zealand", "Esk River (Hawke's Bay)", "Estuary", "Geographic coordinate system", "Hawke's Bay Airport", "Hawke Bay", "Lagoon", "Māori language", "Māori people", "Napier, New Zealand", "Napier Hill", "New Zealand", "Ngaruroro River", "North Island", "Scinde Island", "State Highway 2 (New Zealand)", "Tūtaekurī River", "Westshore, New Zealand"]}