{
    "url": "https://en.wikipedia.org/wiki/Alfonso_Mart%C3%ADn",
    "title": "Alfonso Martín",
    "summary": "Alfonso Martín Castillo (born 10 June 1994), sometimes known as Alfonsito, is a Spanish footballer who plays for CD Atlético Baleares on loan from AD Alcorcón as a midfielder.",
    "content": "Alfonso Martín Castillo (born 10 June 1994), sometimes known as Alfonsito, is a Spanish footballer who plays for CD Atlético Baleares on loan from AD Alcorcón as a midfielder.\n\n\n== Club career ==\nBorn in Jerez de la Frontera, Cádiz, Martín graduated from Xerez CD's youth system, and made his senior debut with the reserves on 7 January 2013, against GE Bazán CF.On 3 May 2013, Martín made his debut for the first team, in a 1–3 home defeat against Córdoba CF in the Segunda División championship. In August he moved to the latter, being assigned to the B-side in Segunda División B.In January 2014, after being rarely used, Martín moved to Écija Balompié also in the third division. On 21 August, he joined Tercera División side CD Guadalcacín.On 11 July 2016, Martín returned to the third level after agreeing to a contract with Real Balompédica Linense. Roughly one year later he signed for another reserve team, CD Vitoria in the same division.On 2 August 2018, Martín signed for UD Melilla still in the third tier. The following 12 July, he agreed to a three-year contract with AD Alcorcón in the second division, but was immediately loaned to Cultural y Deportiva Leonesa for one year.On 25 August 2020, Martín was loaned to fellow third division side CD Atlético Baleares for the 2020–21 campaign.\n\n\n== References ==\n\n\n== External links ==\nAlfonso Martín at BDFutbol\nAlfonso Martín at Soccerway\nAlfonso Martín at LaPreferente.com (in Spanish)",
    "links": [
        "2020–21 Segunda División B",
        "AD Alcorcón",
        "Association football",
        "CD Atlético Baleares",
        "CD Guadalcacín",
        "CD Vitoria",
        "Cultural y Deportiva Leonesa",
        "Cádiz (province)",
        "Córdoba CF",
        "Córdoba CF B",
        "Jerez de la Frontera",
        "Marca (newspaper)",
        "Midfielder",
        "Real Balompédica Linense",
        "Reserve team",
        "Segunda División",
        "Segunda División B",
        "Tercera División",
        "UD Melilla",
        "Wayback Machine",
        "Xerez CD",
        "Xerez CD B",
        "Écija Balompié"
    ]
}