{"url": "https://en.wikipedia.org/wiki/All_India_Radio", "title": "All India Radio", "summary": "All India Radio (AIR), officially known since 1957 as Akashvani (literary meaning \"Voice from the Sky\"), is the national public radio broadcaster of India and is a division of Prasar Bharati. It was established in 1936.It is the sister service of Prasar Bharati's Doordarshan, an Indian television broadcaster. Headquartered in the Akashvani Bhavan building in New Delhi, it houses the Drama Section, the FM Section, the National Service, and is also home to the Indian television station Doordarshan Kendra, (Delhi).\nAll India Radio is the largest radio network in the world, and one of the largest broadcasting organisations in the world in terms of the number of languages broadcast and the spectrum of socio-economic and cultural diversity it serves. AIR's home service comprises 420 stations located across the country, reaching nearly 92% of the country's area and 99.19% of the total population. AIR originates programming in 23 languages and 179 dialects.", "content": "All India Radio (AIR), officially known since 1957 as Akashvani (literary meaning \"Voice from the Sky\"), is the national public radio broadcaster of India and is a division of Prasar Bharati. It was established in 1936.It is the sister service of Prasar Bharati's Doordarshan, an Indian television broadcaster. Headquartered in the Akashvani Bhavan building in New Delhi, it houses the Drama Section, the FM Section, the National Service, and is also home to the Indian television station Doordarshan Kendra, (Delhi).\nAll India Radio is the largest radio network in the world, and one of the largest broadcasting organisations in the world in terms of the number of languages broadcast and the spectrum of socio-economic and cultural diversity it serves. AIR's home service comprises 420 stations located across the country, reaching nearly 92% of the country's area and 99.19% of the total population. AIR originates programming in 23 languages and 179 dialects.\n\n\n== Etymology ==\n\nĀkāśavānī (आकाशवाणी) is a Sanskrit word meaning 'celestial announcement' or 'voice from the sky/heaven'. In Hinduism, Jainism and Buddhism, Akashvanis are often featured in stories as a medium of communication from heaven to mankind.\nWhen the Indian State Broadcasting Service (ISBS) was renamed All India Radio, Rabindranath Tagore rechristened it as Akashvani, the voice that comes over from the skies, through a poem penned for the inauguration of Calcutta’s shortwave service.'Akashvani' was also used in the context of radio by M. V. Gopalaswami in 1936 after setting up India's first private radio station in his residence, \"Vittal Vihar\" (about two hundred yards from AIR's current Mysore radio station). Akashvani was later given as All India Radio's on-air name in 1957; given its literal meaning in Sanskrit, it was believed to be a more than suitable name for a broadcaster.\n\n\n== History ==\n\nBroadcasting began in June 1923 during the British Raj with programs by the Bombay Presidency Radio Club and other radio clubs. According to an agreement on 23 July 1927, the private Indian Broadcasting Company Ltd (IBC) was authorized to operate two radio stations: the Bombay station which began on 23 July 1927, and the Calcutta station which followed on 26 August 1927. The company went into liquidation on 1 March 1930. The government took over the broadcasting facilities and began the Indian State Broadcasting Service (ISBS) on 1 April 1930 on an experimental basis for two years, and permanently in May 1932 it then went on to become All India Radio on 8 June 1936.In August 1947, All India Radio hired its first female newsreader, Saeeda Bano, who read the news in Urdu.On 1 October 1939, the External Service began with a broadcast in Pushtu. It was intended to counter radio propaganda from Germany directed at Afghanistan, Persia and Arab nations. 1939 also saw the opening of the Dhaka station of Eastern India, in what is now Bangladesh. This station catered and nurtured the pioneers of Bengali intellectuals. The foremost among them, Natyaguru Nurul Momen, became the trail-blazer of the talk-show in 1939. He wrote and directed the first modern radio-play for this station in 1942. When India became independent in 1947, the AIR network had only six stations (Delhi, Mumbai, Kolkata, Chennai, Lucknow, and Tiruchirappalli). The three radio stations at Lahore, Peshawar and Dhaka remained in what became Pakistan after the division. The total number of radio sets in India at that time was about 275,000. On 3 October 1957, the Vividh Bharati Service was launched, to compete with Radio Ceylon. Television broadcasting began in Delhi in 1959 as part of AIR, but was split off from the radio network as Doordarshan on 1 April 1976. FM broadcasting began on 23 July 1977 in Chennai, and expanded during the 1990s.Deccan Radio (Nizam Radio 1932), the first radio station in Hyderabad State (now Hyderabad, India), went live on air on 3 February 1935. It was launched by Mir Osman Ali Khan the seventh Nizam of Hyderabad with a transmitting power of 200 Watts. On 1 April 1950, Deccan Radio was taken over by the Indian Government, and in 1956 it was merged with All India Radio (AIR). Since then, it has been known as AIR-Hyderabad (100 kW).\n\n\n== Domestic services ==\nAIR has many services in a number of languages, each serving different regions across India.\n\n\n=== Vividh Bharati ===\nVividh Bharati is one of the best-known services of All India Radio. Its name roughly translates as \"Diverse Indian\". It is also known as the Commercial Broadcasting Service or CBS. Commercially, it is the most accessible AIR network and is popular in Mumbai and other large cities. Vividh Bharati offers a wide range of programs including news, film music, short plays, music and comedy. It operates on different medium wave-band as well as FM frequencies in each city. Vividh Bharati service started in 1957.\nSome programs broadcast on Vividh Bharati are:\n\nHawa-mahal: Radio plays based on novels and plays\nSantogen ki mehfil: Comedy\nAaj ke fankar: description of life and works of a film artist\nChhayageet: songs of announcer's choice with impeccable scripting\n\n\n=== Central Sales Unit ===\nCentral Sales Unit (CSU) is single window services of All India Radio for commercial purposes. Its name roughly translates as \"Centralised Sales Unit\". It is situated in Mumbai. http://prasarbharati.gov.in/AIRCSUContact.php\n\n\n=== Other services ===\nPrimary Channel\nNational Channel\n\n\n=== Regional services ===\nThe headquarters of the Regional Deputy Directors General are located in Delhi and Chandigarh (NR), Lucknow and Bhopal (CR), Guwahati (NER), Kolkata (ER), Mumbai and Ahmedabad (WR), Chennai and Bangalore (SR). All frequencies are in kHz, unless otherwise noted. Most of the channels are also available online.\n\n\n== External services ==\nThe external services of All India Radio are broadcast in 27 languages to countries outside India via high-power shortwave band broadcasts. Medium wave is also used to reach neighbouring countries. In addition to broadcasts targeted at specific countries by language, there is a General Overseas Service broadcasting in English with 8+1⁄4 hours of programming each day aimed at a general international audience. The external broadcasts were begun on 1 October 1939 by the British government to counter the propaganda of the Nazis directed at the Afghan people. The first broadcasts were in Pashto, beamed to Afghanistan and the North-West Frontier Province. Broadcasts soon began in other languages including: Dari, Persian, Arabic, English, Burmese, Japanese, Chinese, Malay and French. The external services broadcast in 16 foreign and 11 Indian languages, with a total program output of 70¼ hours per day on medium and shortwave frequencies.\n\nTwo high powered FM stations of All India Radio are being installed in Amritsar and Fazilka in the Punjab to supplement the programs broadcast from transmitters operating from Jalandhar, New Delhi, Chandigarh and Mumbai and to improve the broadcast services during unfavourable weather conditions in the border regions of Punjab.\nToday, the External Services Division of All India Radio broadcasts daily with 57 transmissions with almost 72 hours or programming covering over 108 countries in 27 languages, of which 15 are foreign and 12 Indian. The foreign languages are: Arabic, Baluchi, Burmese, Chinese, Dari, French, Indonesian, Persian, Pushtu, Russian, Sinhala, Swahili, Thai, Tibetan and English (General Overseas Service). The Indian languages are Bengali, Gujarati, Marathi, Konkani, Kashmiri, Hindi, Kannada, Malayalam, Nepali, Punjabi, Saraiki, Sindhi, Tamil, Telugu and Urdu.\nThe longest daily broadcast is the Urdu Service to Pakistan, around the clock on DTH (direct-broadcast satellite) and on short- and medium wave for 121⁄4 hrs. The English-language General Overseas Service is broadcast 81⁄4 hours daily. During Hajj, there are special broadcasts beamed to Saudi Arabia in Urdu. AIR is planning to produce programmes in the Baluchi language.The external services of AIR are also broadcast to Europe in DRM (Digital Radio Mondiale) on 9950 kHz between 1745 and 2230 UTC. These external transmissions are broadcast by high-power transmitters located at Aligarh, Bengaluru, Chennai, Delhi, Gorakhpur, Guwahati, Mumbai and Panaji on shortwave and from Jalandhar, Kolkata, Nagpur, Rajkot and Tuticorin on medium wave. Soon All India Radio Amritsar will also start a booster service on the FM band. Some of these transmitters are 1000 kW (1 MW) or 500 kW. Programs are beamed to different parts of the world except for the Americas and the reception quality is very good in the target areas. In each language service, the program consists of news, commentary, a press review, talks on matters of general or cultural interest, feature programmes, documentaries and music from India and the target region. Most programs originate at New Broadcasting House on Parliament Street in New Delhi, with a few originating at SPT Bengaluru, Chennai, Hyderabad, Jalandhar, Kolkata, HPT Malad Mumbai, Thiruvananthapuram and Tuticorin.\nThe External Services Division of AIR is a link between India and rest of the world, especially in countries with Indian emigrants and people of Indian origin. It broadcasts the Indian point of view on matters of national and international importance, and demonstrates the Indian way of life through its programs. QSL cards (which are sought-after by international radio hobbyists) are issued to radio hobbyists by AIR in New Delhi for reception reports of their broadcasts.\n\n\n== Direct-To-Home ==\nDirect-to-home (DTH) service is a satellite broadcast service in which a large number of radio channels are digitally beamed down over a territory from a high-power satellite. AIR broadcasts various national and regional stations available to listen on DD Free Dish. The DTH signals can be received directly at homes using a small-sized dish receiver unit containing a dish antenna installed on a building's rooftop or on a wall facing clear south and one indoors. DTH service is offered on twenty one channels via Insat.\n\n\n=== List of DTH channels ===\n\n\n==== National ====\nVividh Bharati – Hindi Music Radio\nAIR FM Rainbow India – Hindi & English Music Radio\nAIR FM Gold Delhi – Classic Hindi Music & News Radio\nAIR Live News 24×7 – Hindi & English News Radio\nAIR Urdu – Urdu Entertainment Radio\nRaagam – Indian Classical Music Radio\nGyan Vani – Hindi & English Educational Radio\n\n\n=== Regional ===\nAIR Assamese\nAIR Bangla\nAIR Gujarati\nAIR Hindi\nAIR Kannada\nAIR Malayalam\nAIR Marathi\nAIR Odia\nAIR Punjabi\nAIR Tamil\nAIR Telugu\nAIR Agartala – Bengali & Kokborok\nAIR Aizawl – Mizo\nAIR Bhopal – Hindi\nAIR Dehradun – Hindi\nAIR Gangtok – Nepali\nAIR Imphal – Manipuri\nAIR Itanagar – Hindi & Nyishi\nAIR Jaipur – Hindi & Rajasthani\nAIR Jammu – Dogri & Hindi\nAIR Kohima – Nagamese & English\nAIR Leh – Ladakhi\nAIR Lucknow – Hindi & Urdu\nAIR North East – Hindi & English\nAIR Panaji - Konkani & Marathi\nAIR Patna – Hindi\nAIR Port Blair - Hindi\nAIR Puducherry - Tamil\nAIR Raipur – Hindi & Chhattisgarhi\nAIR Ranchi – Hindi\nAIR Rohtak – Hindi\nAIR Shillong – Khasi & English\nAIR Shimla – Hindi\nAIR Srinagar – Kashmiri & Urdu\nAIR Vijayawada – Telugu\n\n\n== Online services ==\nAIR Live News\nKASHMIR ONLINE RADIO\nVividh Bharati\nFM Gold Delhi\nFM Rainbow Delhi\nAIR Urdu\nRaagam\nAIR Gujarati\nAIR Marathi\nAIR Punjabi\nAIR Malayalam\nAIR Tamil\nAIR Telugu\nAIR Kannada\nAIR Bangla\nAIR Jammu\nAIR Odia\nAIR Assamese\nAIR North East\nFM Tragopan Kohima\nFM Rainbow Goa\nAIR Shimla\nAIR Bhuj\nAIR Indore\nAIR Mysuru\nAIR Jodhpur\nAmrutvarshini\nVividh Bharati Bengaluru\nFM Rainbow Kannada Kaamaanbilu\nAIR Bengaluru\nSun City FM Jodhpur\nAIR Pune\nAIR Rohtak\nFM Rainbow Lucknow\nAIR Jabalpur\nAIR Bhopal\nFM Rainbow Mumbai\nFM Gold Mumbai\nSamvadita Mumbai\nAIR Aadilabad\nAIR Jaipur\nAIR Varanasi\nAIR Raipur\nAIR Sangli\nAIR Rajkot\nAIR Nagpur\nAIR Prayagraj\nAIR Patna\nAIR Patiala\nAIR Mhadei Panaji\nAIR Gorakhpur\nAIR Hassan\nAIR Dehradun\nAIR Solapur\nAIR Kota\nAIR Madurai\nAIR Kolhapur\nAIR Suratgarh\nFM Rainbow Visakhapatnam\nAIR Kurnool\nAIR Bikaner\nAIR Kochi\nAIR Calicut\nAIR Mathura\nAIR Agra\nFM Rainbow Vijayawada\nAIR Vijayawada\nAIR Kannur\nFM Ananthapuri\nAIR Lucknow\nAIR Mount Abu\nAIR Dharwad\nAIR Chandigarh\nAIR Chitradurga\nAIR Manjeri\nAIR Aurangabad\nAIR Surat\nAIR Tirupati\nAIR Kodaikanal\nAIR Alwar\n\n\n== Other services ==\n\n\n=== Digital Radio Mondiale ===\nDetails of the Digital Radio Mondiale (DRM) transmissions and frequencies are as follows:\n\n0130–0230 UTC on 11715 kHz Nepali (Nepal)\n0315–0415 UTC on 15185 kHz Hindi (E. Africa, Mauritius)\n0415–0430 UTC on 15185 kHz Gujarati (E. Africa, Mauritius)\n0430–0530 UTC on 15185 kHz Hindi (E. Africa, Mauritius)\n1300–1500 UTC on 15050 kHz Sinhala (Sri Lanka)\n1615–1715 UTC on 15140 kHz Russian (E. Europe)\n2245–0045 UTC on 11645 GOS-I English (NE Asia)Above transmissions are in addition to following existing DRM txn's:\n\n0900–1100 on 6100 Vividh Bharati, DRM NVIS\n1745–1965 UTC on 9950 English (W. Europe)\n1945–2045 UTC on 9950 Hindi (W. Europe)\n2045–2630 UTC on 9950 English (W. Europe)\n\n\n=== News-on-phone ===\nAll India Radio launched news-on-phone service on 25 February 1998 in New Delhi; it now has service in Chennai, Mumbai, Hyderabad, Indore, Patna and Bangalore. The service is accessible through Subscriber trunk dialling (STD), International Direct Dialing (ISD) and local calls. There are plans to establish the service in 11 additional cities including: Ahmedabad, Bhopal, Guwahati, Gwalior, Jabalpur, Jaipur, Kolkata, Lucknow, Ranchi and Shimla. English and Hindi hourly news bulletins may be heard live. News in MP3 format may be directly played from the site, and filenames are time-stamped. AIR news bulletins are available in nine regional languages: Tamil, Kannada, Gujarati, Bengali, Marathi, North East, Punjabi, Telugu and Urdu.\n\n\n=== Documentaries ===\nThere is a long tradition of broadcasting documentary features on AIR. There is great interest in radio documentaries, particularly in countries like India, Iran, South Korea and Malaysia. The most prominent broadcaster of English Features was Melville de Mellow, and of Hindi Features, Shiv Sagar Mishra. This format has been revived by AIR producers across India because of its flexibility, its relative low cost to produce, its messaging potential and its creative potential.\n\n\n=== Central Drama Unit ===\nAIR's Central Drama Unit (CDU) is responsible for the national broadcast of plays. Plays produced by the CDU are translated and produced by regional stations. Since its inception in the 1960s, the unit has produced more than 1,500 plays, and the CDU houses a repository of old scripts and productions. The National Programme of Plays is broadcast by the CDU on the fourth Thursday of each month at 9.30 pm. Each play included in the National Programme of Plays is produced in 22 Indian languages and broadcast at the same time by all regional and national network stations. The CDU also produces Chain Plays, half-hour dramas broadcast in succession by a chain of stations.\n\n\n=== Social Media Cell ===\nThe News Service Division's Social Media Cell was established on 20 May 2013 and is responsible for providing AIR news on new media platforms such as websites, Twitter, Facebook, and SMS.\n\n\n== Gallery ==\n\n\t\t\n\n\n== See also ==\n\nRadio in India\n106.4 FM Radio Gold\nTelugu Radio\nRadio Kashmir\nTelecommunications in India\n\n\n== References ==\n\n\n== External links ==\nAll India Radio Official web-site\nAll India Radio Commercial Broadcasting Service Vividh Bharati On Line\nAll India Radio Commercial Broadcasting Service Vividh Bharati On Line Archived 22 October 2014 at the Wayback Machine\nAll India Radio General Overseas Service / External Services Division\nAll India Radio General Overseas Service / External Services Division (English)\nKnow India: Radio\nAll India Radio (AIR) Station Frequencies (National/International)\nChildren's wing of All India Radio", "links": ["106.4 FM Radio Gold", "AIR FM Gold", "AIR FM Rainbow", "AIR FM Tragopan", "AIR Manjeri FM", "AIR Srinagar", "ARD (broadcaster)", "ARPANET", "AVROTROS", "Aakashavaani", "Afghanistan", "Afghans", "Akashavani", "Akashvani (word)", "Alexander Graham Bell", "Alexander Stepanovich Popov", "Alfred Vail", "All-Russia State Television and Radio Broadcasting Company", "All India Radio (band)", "Almon Brown Strowger", "Amateur radio in India", "American Broadcasting Company", "American Public Media", "Amos Dolbear", "Antena 3 Radio", "Antonio Meucci", "Arabic", "Arte", "Asia Television", "Asian News International", "Audio coding format", "Australian Broadcasting Corporation", "BBC", "BITNET", "BNNVARA", "Baluchi language", "Bandwidth (computing)", "Bangladesh", "Bangladesh Television", "Banns Radio International", "Bayerischer Rundfunk", "Beacon", "Belteleradio", "Bengali language", "Bob Kahn", "Bombay", "Bombay Presidency Radio Club", "British Raj", "Buddhism", "Bulgarian National Radio", "Bulgarian National Television", "Burmese language", "Business Standard", "CBS", "CYCLADES", "Cable protection system", "Cable television", "Cadena COPE", "Cadena SER", "Calcutta", "Camille Tissot", "Canadian Broadcasting Corporation", "Canal+", "Canal 13 (Chilean TV channel)", "Caribbean Broadcasting Corporation", "Catalunya Ràdio", "Cellnex", "Cellular network", "Central Board of Film Certification", "Channel Africa", "Channel Four Television Corporation", "Channel One Russia", "Charles Bourseul", "Charles Grafton Page", "Charles K. Kao", "Charles Sumner Tainter", "Charles Wheatstone", "Chennai", "Chhattisgarhi", "Children's Film Society, India", "China Central Television", "China Global Television Network", "China Media Group", "China National Radio", "China Radio International", "Cinema of India", "Circuit switching", "Claude Chappe", "Claude Shannon", "Coaxial cable", "Code-division multiple access", "Communication protocol", "Communications satellite", "Computer network", "Croatian Radio", "Cuban Institute of Radio and Television", "Cultural diversity", "Cyprus Broadcasting Corporation", "Czech Radio", "Czech Television", "Czechoslovak Television", "DD Free Dish", "DR (broadcaster)", "Daniel Davis Jr.", "Dari", "Data communication", "Data compression", "Data transmission circuit", "Dawon Kahng", "Deccan Radio (Nizam Radio 1932)", "Delhi", "Democracy Now!", "Deutsche Welle", "Deutschlandradio", "Dhaka", "Digital Radio Mondiale", "Digital media", "Digital television", "Direct-broadcast satellite", "Direct-to-home television in India", "Directorate of Advertising and Visual Publicity", "Directorate of Film Festivals", "Discrete cosine transform", "Dogri", "Donald Davies", "Doordarshan", "Drums in communication", "Duna Média", "ERTT", "Edholm's law", "Editors Guild of India", "Edwin Howard Armstrong", "Eesti Raadio", "Eesti Rahvusringhääling", "Eesti Televisioon", "Egyptian Radio and Television Union", "Electrical telegraph", "Elisha Gray", "Emile Berliner", "Erna Schneider Hoover", "Ethernet", "Euronews", "Europe 1", "European Broadcasting Union", "Evangelische Omroep", "FM broadcasting", "Fake news in India", "Fax", "Fiber-optic communication", "FidoNet", "Film Certification Appellate Tribunal", "Film and Television Institute of India", "Films Division", "Foundation Management for SR, SVT, and UR", "France Médias Monde", "France Télévisions", "Francis Blake (telephone)", "Free-space optical communication", "FreeTV Australia", "Frequency-division multiplexing", "Fuji TV", "Fundação Padre José de Anchieta", "Gambia Radio & Television Service", "Gardiner Greene Hubbard", "Georgian Public Broadcasting", "Glenn Hauser", "Godi-media", "Government of India", "Guglielmo Marconi", "Gyan Vani", "Hajj", "Harold Hopkins (physicist)", "Hawa Mahal (radio program)", "Hedy Lamarr", "Heliograph", "Hellenic Broadcasting Corporation", "Hellenic Radio", "Henry Sutton (inventor)", "Hessischer Rundfunk", "Hindi", "Hinduism", "History of broadcasting", "History of mobile phones", "History of prepaid mobile phones", "History of radio", "History of telecommunication", "History of television", "History of the Internet", "History of the telephone", "History of the transistor", "History of videotelephony", "Hrvatska radiotelevizija", "Humanistische Omroep", "Hyderabad, India", "Hyderabad State", "Hydraulic telegraph", "IRIB World Service", "ISBN (identifier)", "ISNI (identifier)", "ITV plc", "Image compression", "Imedi Media Holding", "Independent Broadcasting Authority", "Independent Television Authority", "India", "Indian Express", "Indian Institute of Mass Communication", "Indian National Satellite System", "Indo-Asian News Service", "Indore", "Information Age", "Information revolution", "Innocenzo Manzetti", "Integrated Services Digital Network", "International Broadcasting Bureau", "International Direct Dialing", "Internet", "Internet2", "Internet video", "Islamic Republic of Iran Broadcasting", "Israel Broadcasting Authority", "Israel Radio International", "Israeli Public Broadcasting Corporation", "JANET", "Jagadish Chandra Bose", "Jainism", "Japan Consortium", "Jeem TV", "Johann Philipp Reis", "John Bardeen", "John Logie Baird", "Jordan Radio and Television Corporation", "Jun-ichi Nishizawa", "KBR (news agency)", "KBS World Radio", "KRO-NCRV", "Kalaallit Nunaata Radioa", "Karnataka", "Kashmiri language", "Khabar Agency", "Khasi language", "Khyber Pakhtunkhwa", "Kokborok", "Kolkata", "Konkani", "Korean Broadcasting System", "La7", "Ladakhi language", "Lahore", "Latvijas Radio", "Latvijas Televīzija", "Lee de Forest", "Libya National Channel", "Libyan Jamahiriya Broadcasting Corporation", "List of Indian-language radio stations", "List of Internet pioneers", "List of Prime Ministers of India", "List of journalists killed in India", "List of magazines in India", "List of news channels in India", "List of news media ownership in India", "List of newspapers in India", "List of newspapers in India by circulation", "List of newspapers in India by readership", "List of telecommunications regulatory bodies", "List of television stations in India", "Lithuanian National Radio and Television", "Local area network", "Lucknow", "MBC Group", "MOSFET", "MP3", "MTV3", "MTVA (Hungary)", "Macedonian Radio Television", "Magyar Rádió", "Magyar Televízió", "Malay language", "Mangaluru", "Marathi language", "Mass media", "Mass media in Syria", "Mauritius Broadcasting Corporation", "Media bias in India", "Media of India", "Medium wave", "Meitei language", "Melville de Mellow", "Ministry of Information and Broadcasting (India)", "Minnesota Public Radio", "Mir Osman Ali Khan", "Mitteldeutscher Rundfunk", "Mizo language", "Mobile telephony", "Mohamed M. Atalla", "Molecular communication", "Monaco Media Diffusion", "Motto", "Multiplexing", "Mumbai", "Munhwa Broadcasting Corporation", "Mysore", "NBC", "NHK", "NHK World Radio Japan", "NPL network", "NPR", "NRK", "Nagamese", "Narinder Singh Kapany", "Nasir Ahmed (engineer)", "National Film Archive of India", "National Film Development Corporation of India", "Natyaguru", "Nederlandse Omroep Stichting", "Nederlandse Publieke Omroep (organization)", "Nepal Television", "Nepali language", "Network switch", "Network topology", "New Delhi", "New Hellenic Radio, Internet and Television", "Next-generation network", "Nikola Tesla", "Nippon TV", "Nishi language", "Nizam", "Node (networking)", "Non-resident Indian and person of Indian origin", "Norddeutscher Rundfunk", "Nurul Momen", "ORF (broadcaster)", "Office de Radiodiffusion Télévision Française", "Oliver Heaviside", "Omroep MAX", "Omroep NTR", "Online journalism in India", "Online video platform", "Optical communication", "Optical fiber", "Optical telegraph", "Orbital angular momentum multiplexing", "Outline of telecommunication", "Packet switching", "Pager", "Paid news in India", "Pakistan Television Corporation", "Palestinian Broadcasting Corporation", "Pashto", "Pashto language", "Paul Baran", "Persian language", "Peshawar", "Philo Farnsworth", "Photophone", "Polarization-division multiplexing", "Polskie Radio", "PowNed", "Prasar Bharati", "Press Council of India", "Press Information Bureau", "Press Trust of India", "Prime Minister's Office (India)", "Prime Minister of India", "Propaganda", "Public Broadcasting Services", "Public Broadcasting of Latvia", "Public Establishment of Television", "Public Radio of Armenia", "Public Television Company of Armenia", "Public broadcasting", "Public switched telephone network", "QSL cards", "Qatar Radio", "RAI", "RCTV", "RMC (France)", "RNZ International", "RTBF", "RTHK", "RTL Group", "RTSH", "RTVE", "RTÉ", "RTÉ Radio", "Raagam (radio channel)", "Rabindranath Tagore", "Radia Perlman", "Radio 100,7", "Radio Algeria", "Radio Australia", "Radio Bremen", "Radio Caracas Radio", "Radio Ceylon", "Radio Damascus", "Radio Exterior", "Radio France", "Radio France Internationale", "Radio Guangdong", "Radio Havana Cuba", "Radio Kashmir", "Radio Kashmir Jammu", "Radio Kuwait", "Radio Mayak", "Radio Nacional de España", "Radio New Zealand", "Radio Orpheus", "Radio Pakistan", "Radio Poland", "Radio Prague", "Radio Romania International", "Radio Slovakia International", "Radio Taiwan International", "Radio Television of Serbia", "Radio Television of Vojvodina", "Radio Televisyen Malaysia", "Radio Thailand World Service", "Radio Tunis Chaîne Internationale", "Radio Tunisienne", "Radio and Television of Bosnia and Herzegovina", "Radio and Television of Montenegro", "Radio and Television of Slovakia", "Radio broadcasting", "Radio in India", "Radio network", "Radio play", "Radio wave", "Radiocentre", "Radiodiffusion-Télévision Française", "Radiodiffusion Télévision Sénégalaise", "Radiodifusión Argentina al Exterior", "Radiotelephone", "Radiotelevizija Slovenija", "Rajasthani language", "Reception report", "Reginald Fessenden", "Registrar of Newspapers for India", "Retevisión", "Robert Hooke", "Robert Metcalfe", "Romanian Radio Broadcasting Company", "Rundfunk Berlin-Brandenburg", "Russian Television and Radio Broadcasting Network", "Rustavi 2", "RÚV", "Ràdio i Televisió d'Andorra", "Rádio e Televisão de Portugal", "S4C", "SNRT", "SR International – Radio Sweden", "STV Group", "SUDOC (identifier)", "Saarländischer Rundfunk", "Saeeda Bano", "Samuel Morse", "San Marino RTV", "Sansad Marg", "Sanskrit", "Satyajit Ray Film and Television Institute", "Semaphore", "Semiconductor", "Semiconductor device", "Sentech", "Shanghai Media Group", "Shortwave band", "Slovenská televízia", "Slovenský rozhlas", "Smartphone", "Smoke signal", "Social media", "South African Broadcasting Corporation", "Space-division multiple access", "Special Broadcasting Service", "Sputnik (news agency)", "Stichting Ether Reclame", "Store and forward", "Streaming media", "Streaming television", "Submarine communications cable", "Subscriber trunk dialling", "Sultanate of Oman Television", "Suspilne", "Sveriges Radio", "Sveriges Television", "Swedish Educational Broadcasting Company", "Swiss Broadcasting Corporation", "Swissinfo", "Südwestrundfunk", "TBS Television (Japan)", "TDF Group", "TF1", "TG4", "TMC (TV channel)", "TV4 (Sweden)", "TV5Monde", "TVB", "TVNZ", "TVR (TV network)", "TV 2 (Denmark)", "TV 2 (Norway)", "TV Asahi", "TV de Mauritanie", "Tamil language", "Telautograph", "Telecommunication", "Telecommunication circuit", "Telecommunications", "Telecommunications equipment", "Telecommunications in India", "Telecommunications link", "Telecommunications network", "Telegraphy", "Telephone exchange", "Teleprinter", "Teleradio-Moldova", "Televisa", "Television broadcasting", "Television channel", "Television in India", "Televisión Española", "Telewizja Polska", "Telex", "Telugu Radio", "Telugu language", "Terminal (telecommunication)", "The Telephone Cases", "Thomas A. Watson", "Thomas Edison", "Tim Berners-Lee", "Time-division multiplexing", "Tiruchirappalli", "Tivadar Puskás", "Toasternet", "Tokyo FM", "Transmission line", "Transmission medium", "Turkish Radio and Television Corporation", "Télé Liban", "Télédiffusion d'Algérie", "Télévision Tunisienne", "UUCP", "Udruženje javnih radija i televizija", "Union Council of Ministers", "United Kingdom Independent Broadcasting", "United Nations Radio", "United News of India", "Urdu", "Usenet", "VIAF (identifier)", "VPRO", "VRT (broadcaster)", "Vatican Radio", "Video coding format", "Vint Cerf", "Vividh Bharati", "Vividh Bharti", "Vladimir K. Zworykin", "Voice of Korea", "Voice of Turkey", "Voice of the Strait", "WFMT", "WNL (broadcaster)", "WRN Broadcast", "Walter Houser Brattain", "Watt", "Wayback Machine", "Webcast", "West Bengal", "Westdeutscher Rundfunk", "Whistled language", "Wide area network", "Wireless", "Wireless network", "Wireless revolution", "Yle", "Yogen Dalal", "Yugoslav Radio Television", "ZDF", "Zimbabwe Broadcasting Corporation", "İctimai Television"]}