{"url": "https://en.wikipedia.org/wiki/Anne_Rey", "title": "Anne Rey", "summary": "Anne Rey (1944 – 31 January 2012) was a French musicologist, pianist, journalist and educator.", "content": "Anne Rey (1944 – 31 January 2012) was a French musicologist, pianist, journalist and educator.\n\n\n== Life ==\nBorn in 1944, Rey is the daughter of an architect and a psychoanalyst. She was trained as a pianist and musicologist.\nIn 1968, she became a freelancer for the newspaper Le Monde. In 1978, she was part of the founding team of the monthly magazine Le Monde de la musique. There, she worked in collaboration with Louis Dandrel, Francis Mayor, Bernard Lauzanne...\nShe wrote numerous articles on music and a biography of Erik Satie for Éditions du Seuil.For le Monde de la musique, she proposed to open the editions of the monthly magazine specialized in classic music to jazz, rock, song, dance, musical theatre.\nIn the 1980s, she worked in the culture department of the newspaper Le Monde, and created the supplement Arts et spectacles, open to rock, contemporary dance, world musics. She left the newspaper in 1995 to teach cultural mediation at the university.\nIn 2006, she published Mozart et ses masques in the Omnibus series.Rey died in Paris 31 January 2012 and is buried in the Île d'Yeu.\n\n\n== Bibliography ==\nAnne Rey, Erik Satie, Éditions du Seuil - Series Solfèges, No 35, 1974 (1st edition), 1995 (2nd edition).\nAnne Rey, Historical and literary file and selection of texts by various authors for Une vie by Maupassant, Editions Presses Pocket, 1990 (1st edition), 1998 (2e édition).\nAnne Rey, in collaboration with Claude Aziza, La Littérature policière, Pocket, Paris, 2003.\nAnne Rey, Mozart et ses masques, Omnibus, 2006 (includes Vie de Mozart by Stendhal, extracts from Vies de Haydn, Mozart et Métastase, Mozart, l'homme by Alfred Einstein, extracts from Mozart, l'homme et l'œuvre, Le Dieu Mozart et le monde des oiseaux by Marcel Moré, Mozart on the way to Prague by Eduard Mörike, Don Juan by E. T. A. Hoffmann, extracts from Nouvelles musicales, Sa carrière posthume by Jean Barraqué, extracts from Mozart and Mozart and Amadeus by Anthony Burgess).\n\n\n== References ==", "links": ["Alfred Einstein", "Anthony Burgess", "Claude Aziza", "Contemporary dance", "Dance", "E. T. A. Hoffmann", "Eduard Mörike", "Erik Satie", "Haydn", "ISNI (identifier)", "Jazz", "Jean Barraqué", "Le Monde", "Le Monde de la musique", "Louis Dandrel", "Marcel Moré", "Musical theatre", "Musicology", "Rock music", "SUDOC (identifier)", "Song", "Stendhal", "Une vie (Maupassant)", "VIAF (identifier)", "World music", "Éditions Gallimard", "Éditions du Seuil", "Île d'Yeu"]}