{"url": "https://en.wikipedia.org/wiki/Anti-Normanism", "title": "Anti-Normanism", "summary": "Normanism (also known as Normanist theory, Norman theory) is a name (more often used by its opponents than its proponents) for a historiographical theory about the origin of Russia, Ukraine, Belarus and their historic predecessor, Kievan Rus'. The theory holds that Kievan Rus' was founded by Norse settlers, predominantly from Sweden, rather than by Slavs. In one form or another, this has become the mainstream narrative of the Viking Age in Eastern Europe and the consensus position of most professional historians. Anti-Normanism is a movement of historical revisionism in opposition to the Normanist theory, and is current particularly among some Russian and Ukrainian historians.\nAt the centre of the disagreement is the Rus' people, a people generally considered to be of Scandinavian origin and who arrived in Eastern Europe in the 8th and 9th centuries, but who during the 10th and 11th centuries merged with Fenno-Ugrics, Balts and East Slavs, and together with them formed Kievan Rus' with Old East Slavic as a common language, and with the name Rus' as a common marker of identity.\nThe origin of Kievan Rus' is infamously contentious, and relates to its perceived importance for the legitimation of nation-building, imperialism, and independence movements within the Slavonic-speaking world, and for legitimating different political relationships between eastern and western European countries. The Norsemen that ventured into the waterways of Eastern Europe feature prominently in the history of the Baltic states, Scandinavia, Poland, and the Byzantine Empire. They are particularly important in the historiography and cultural history of Russia, Belarus, and Ukraine but have also featured in the history of Poland. Nevertheless, contention has centred around whether the development of Kievan Rus' was influenced by non-Slavic, Viking migrants (this idea is characterised as the 'Normanist theory'), or whether the people of Kievan Rus' emerged solely from autochthonous Slavic political development (known as the 'anti-Normanist theory'). Added to this ideological force is a scarcity of contemporary evidence for the emergence of Kievan Rus', and the great ethnic diversity and complexity of the wide area where these Norsemen were active.", "content": "Normanism (also known as Normanist theory, Norman theory) is a name (more often used by its opponents than its proponents) for a historiographical theory about the origin of Russia, Ukraine, Belarus and their historic predecessor, Kievan Rus'. The theory holds that Kievan Rus' was founded by Norse settlers, predominantly from Sweden, rather than by Slavs. In one form or another, this has become the mainstream narrative of the Viking Age in Eastern Europe and the consensus position of most professional historians. Anti-Normanism is a movement of historical revisionism in opposition to the Normanist theory, and is current particularly among some Russian and Ukrainian historians.\nAt the centre of the disagreement is the Rus' people, a people generally considered to be of Scandinavian origin and who arrived in Eastern Europe in the 8th and 9th centuries, but who during the 10th and 11th centuries merged with Fenno-Ugrics, Balts and East Slavs, and together with them formed Kievan Rus' with Old East Slavic as a common language, and with the name Rus' as a common marker of identity.\nThe origin of Kievan Rus' is infamously contentious, and relates to its perceived importance for the legitimation of nation-building, imperialism, and independence movements within the Slavonic-speaking world, and for legitimating different political relationships between eastern and western European countries. The Norsemen that ventured into the waterways of Eastern Europe feature prominently in the history of the Baltic states, Scandinavia, Poland, and the Byzantine Empire. They are particularly important in the historiography and cultural history of Russia, Belarus, and Ukraine but have also featured in the history of Poland. Nevertheless, contention has centred around whether the development of Kievan Rus' was influenced by non-Slavic, Viking migrants (this idea is characterised as the 'Normanist theory'), or whether the people of Kievan Rus' emerged solely from autochthonous Slavic political development (known as the 'anti-Normanist theory'). Added to this ideological force is a scarcity of contemporary evidence for the emergence of Kievan Rus', and the great ethnic diversity and complexity of the wide area where these Norsemen were active.\n\n\n== Mainstream view ==\n\nWhereas the term Normans in English usually refers to the Scandinavian-descended ruling dynasty of Normandy in France from the 10th century onwards, and their scions elsewhere in Western Europe, in the context of the Rus' people, \"Normanism\" is the idea that the Rus' had their origins among the Normans (i.e. among 'Northmen'). However, the term \"Normanism\" is used to cover a diverse range of opinions, not all of which are held by all mainstream scholars (some, indeed, may mostly exist as accusations about the views of \"Normanists\" by polemical anti-Normanists).  Nevertheless, the close connection of Rus' with Scandinavians is confirmed by both archaeological evidence for extensive Scandinavian settlement in Russia and Slavic influences in the Swedish language.\n\n\n=== Early scholarship ===\nModern studies of the Rus' began when the German historian Gerhardt Friedrich Müller (1705–1783) was invited to work in the Russian Academy of Sciences in 1725. Müller presented research made by his predecessor Gottlieb-Siegfried Bayer in the papers De Varagis ('on the Varangians', 1729) and Origines russicae ('Russian origins', 1736), and on the Russian Primary Chronicle, written in the 12th century, and covering the years 852 to 1110. At the beginning of an important speech in 1749, later published as Origines gentis et nominis Russorum ('The Origins of the People and the Name of the Russians'), Müller argued that the Rurikid dynasty descended from ethnically Scandinavian Varangians and that the term \"Russia\" originated from Old Norse. This statement caused such uproar in his Russian audience that he was unable to finish his presentation, and appeals to the president of the Academy and the Empress led to the formation of a committee to determine if his research was \"harmful to the interests and glory of the Russian Empire\". Before the committee, scathing criticism from Lomonosov, Krasheninnikov, and other Russian historians led to Müller being forced to suspend his work on the issue until Lomonosov's death. It was even thought during the 20th century that much of his research was destroyed, but recent research suggests that this is not the case: Müller managed to rework it and had it reprinted as Origines Rossicae in 1768.: 58–59 Despite the negative reception in the mid-18th century, by the end of the century, Müller's views were the consensus in Russian historiography, and this remained largely the case through the 19th century and early twentieth centuries. Russian historians who accepted this historical account included Nikolai Karamzin (1766–1826) and his disciple Mikhail Pogodin (1800–1875), who gave credit to the claims of the Primary Chronicle that the Varangians were invited by East Slavs to rule over them and bring order.\nThe theory was not without political implications. For some, it fitted with embracing and celebrating the multiethnic character of the Russian Empire. However, it was also consistent with the racial theory widespread at the time that Germanics (and their descendants) were naturally suited to government, whereas Slavs were not. According to Karamzin the Norse migration formed the basis and justification for Russian autocracy (as opposed to anarchy of the pre-Rurikid period), and Pogodin used the theory to advance his view that Russia was immune to social upheavals and revolutions, because the Russian state originated from a voluntary treaty between the people of Novgorod and Varangian rulers.\n\n\n=== Emergence of Western scholarly consensus ===\nDuring the historical debates of the 20th century, the key evidence for the mainstream view that Scandinavian migrants had an important role in the formation of Kievan Rus' emerged as the following:\n\nNotwithstanding other suggestions, the name Rus' can readily be interpreted as originating in Old Norse.\nThe personal names of the first few Rus' leaders are etymologically Old Norse, from Rurik (from Old Norse Hrærekr) down to Olga of Kiev (from Old Norse Helga). (From Olga's son Sviatoslav I of Kiev onwards, Slavonic names take over.)\nThe list of cataracts on the Dnieper listed by Constantine VII in his De Administrando Imperio as belonging to the language of the Rhos can most readily be etymologised as Old Norse.\nThe Annals of St. Bertin account of the Rhos for 839 has them identify themselves as sueoni (Swedes).\n13th-century Icelandic historiography portrays close connections between the 11th-century rulers of Rus' and Scandinavian dynasties in England and Norway.In the 21st century, analyses of the rapidly growing range of archaeological evidence further noted that high-status 9th- to 10th-century burials of both men and women in the vicinity of the Upper Volga exhibit material culture largely consistent with that of Scandinavia (though this is less the case away from the river, or further downstream). This has been seen as further demonstrating the Scandinavian character of elites in Old Rus'.It is also agreed, however, that ancestrally Scandinavian Rus' aristocrats, like Scandinavians elsewhere, swiftly assimilated culturally to a Slavic identity: in the words of F. Donald Logan, \"in 839, the Rus were Swedes; in 1043 the Rus were Slavs\". This relatively fast integration is noteworthy, and the processes of cultural assimilation in Rus' are an important area of research.There is uncertainty as to how large the Scandinavian migration to Rus' was, but some recent archaeological work has argued for a substantial number of free farmers settling in the upper Volga region.\n\n\n== Anti-Normanism ==\n\nProponents of anti-normanism are of the opinion that the old Russian state existed even before the vocation of Rurik. Starting with Lomonosov (1711–1765), Slavophilic East Slavic scholars have criticised the idea of Norse invaders. By the early 20th century, the traditional anti-Normanist doctrine (as articulated by Dmitry Ilovaisky) seemed to have lost currency, but in Stalinist Russia, the anti-Normanist arguments were revived and adopted in official Soviet historiography, partly in response to Nazi propaganda, which posited that Russia owed its existence to a Germanic ruling elite. In the earlier 20th century, Nazi Germany had promoted the idea that Russia owed its statehood to a Germanic, racially superior, elite.  Mikhail Artamonov ranks among those who attempted to reconcile both theories by hypothesizing that the Kievan state united the southern Rus' (of Slavic stock) and the northern Rus' (of Germanic stock) into a single nation.\n\nThe staunchest advocate of the anti-Normanist views in the period following the Second World War was Boris Rybakov, who argued that the cultural level of the Varangians could not have warranted an invitation from the culturally advanced Slavs. This conclusion leads Slavicists to deny the Primary Chronicle, which writes that the Varangian Rus' were invited by the native Slavs. Rybakov assumed that Nestor, putative author of the Chronicle, was biased against the pro-Greek party of Vladimir Monomakh and supported the pro-Scandinavian party of the ruling prince Svyatopolk. He cites Nestor as a pro-Scandinavian manipulator and compares his account of Rurik's invitation with numerous similar stories found in folklore around the world.By the twenty-first century, most professional scholars, in both Anglophone and Slavonic-language scholarship, had reached a consensus that the origins of the Rus' people lay in Scandinavia and that this originally Scandinavian elite had a significant role in forming the polity of Kievan Rus'. Indeed, in 1995, the Russian archaeologist Leo Klejn \"gave a paper entitled 'The End of the Discussion', in the belief that anti-Normanism 'was dead and buried'\". However, Klejn soon had to revise this opinion as anti-Normanist ideas gained a new prominence in both public and academic discourse in Russia, Ukraine, and Belarus. Anglophone scholarship has identified the continued commitment to anti-Normanism in these countries since the collapse of the Soviet Union as being motivated by present-day ethno-nationalism and state-formation.: 63  One prominent Russian example occurred with an anti-Normanist conference in 2002, which was followed by publications on the same theme, and which appears to have been promoted by Russian government policy of the time. Accordingly, anti-Normanist accounts are prominent in some 21st century Russian school textbooks. Meanwhile, in Ukraine and to a lesser extent Belarus, post-Soviet nation-building opposed to a history of Russian imperialism has promoted anti-Normanist views in academia and, to a greater extent, popular culture.\n\n\n=== Other anti-Normanist interpretations ===\n\nThere have been quite a few alternative, non-Normanist origins for the word Rus', although none was endorsed in the Western academic mainstream:\n\nThree early emperors of the Urartian Empire at Caucasus from 8th to 6th century BC had their names Russa I, Russa II and Russa III, documented in cuneiform monuments.\nThe medieval legend of three brothers, one named Rus, had also its predecessor in very similar legend from ancient Armenians with almost the same classical name (studies by D. J. Marr). Furthermore, Kiev was founded centuries before the Rus' rule.\nThe ancient Sarmatian tribe of the Roxolani (from the Ossetic, ruhs 'light'; R русые волосы / rusyje volosy / \"light-brown hair\"; cf. Dahl's dictionary definition of Русь /rus/: Русь ж. в знач. мир, белсвет. Rus, fig. world, universe [белсвет: lit. \"white world\", \"white light\"]).\nFrom the Old Slavic name that meant \"river-people\" (tribes of fishermen and ploughmen who settled near the rivers Dnieper, Don, Dniester and Western Dvina and were known to navigate them). The rus root is preserved in the modern Slavic and Russian words ruslo (river-bed), rusalka (water sprite), etc.\nFrom one of two rivers in Ukraine (near Kiev and Pereyaslav), Ros and Rusna, whose names are derived from a postulated Slavic term for water, akin to rosa (dew) (related to the above theory).\nA Slavic word rusy (refers only to hair color – from dark ash-blond to light-brown), cognate with ryzhy (red-haired) and English red.\nA postulated proto-Slavic word for bear, cognate with Greek arctos and Latin ursus.\n\n\n== Other views ==\n\nThere are some Anglophone scholars who remain skeptical about the origin of Rus', however, either because the evidence is not good enough, or because they remain uncertain whether Rus' was an ethnic group with a clear point of origin.Scholars such as Omeljan Pritsak and Horace G. Lunt offer explanations that go beyond simplistic attempts to attribute 'ethnicity' on first glance interpretation of literary, philological, and archaeological evidence. They view the Rus' as disparate, and often mutually antagonistic, clans of charismatic warriors and traders who formed wide-ranging networks across the North and Baltic Seas. They were a \"multi-ethnic, multilingual and non-territorial community of sea nomads and trading settlements\" that contained numerous Norsemen—but equally Slavs, Balts, and Finns.Evidence provided by the Primary Chronicle, written some three centuries later, cannot be taken as an accurate ethnographic account; as tales of 'migration' from distant lands were common literary tropes used by rulers to legitimise their contemporary rule whilst at the same time differentiating themselves from their \"Baltic\" and \"Slavic\" subject tribes. Tolochko argues \"the story of the royal clan's journey is a device with its own function within the narrative of the chronicle. ... Yet if we take it for what it actually is, if we accept that it is not a documentary ethnographic description of the 10th century, but a medieval origo gentis masterfully constructed by a Christian cleric of the early 12th century, then we have to reconsider the established scholarly narrative of the earliest phase of East European history, which owes so much to the Primary Chronicle.Archaeological research, synthesizing a wide range of 20th-century excavations, has begun to develop what Jonathan Shepard has called a 'bottom up' vision of the formation of the Rus' polity, in which, during the ninth and 10th century increasingly intensive trade networks criss-crossed linguistically and ethnically diverse groups around rivers like the Volga, the Don, the Dnieper. This may have produced \"an essentially voluntary convergence of groupings in common pursuit of primary produce exchangeable for artefacts from afar\". This fits well with the image of Rus' that dominates the Arabic sources, focusing further south and east, around the Black and Caspian Seas, the Caucasus and the Volga Bulghars. Yet this narrative, though plausible, contends with the 'top-down' image of state development implied by the Primary Chronicle, archaeological assemblages indicating Scandinavian-style weapon-bearing elites on the Upper Volga, and evidence for slave-trading and violent destruction of fortified settlements.Numerous artefacts of Scandinavian affinity have been found in northern Russia (as well as artefacts of Slavic origin in Sweden). However, exchange between the north and southern shores of the Baltic had occurred since the Iron Age (albeit limited to immediately coastal areas). Northern Russia and adjacent Finnic lands had become a profitable meeting ground for peoples of diverse origins, especially for the trade of furs, and attracted by the presence of oriental silver from the mid-8th century AD. There is an undeniable presence of goods and people of Scandinavian origin; however, the predominant people remained the local (Baltic and Finnic) peoples.The increasing volume of trade and internal competition necessitated higher forms of organization. The Rus' appeared to emulate aspects of Khazar political organization—hence the mention of a Rus' chaganus in the Carolingian court in 839 (Royal Frankish Annals). Legitimization was sought by way of adopting a Christian and linguistically Slavic high culture that became the Kievan Rus'. Moreover, there is doubt if the emerging Kievan Rus' were the same clan as the \"Rus\" who visited the Carolingians in 839 or who attacked Constantinople in 860 AD.The rise of Kiev itself is mysterious. Devoid of any silver dirham finds in the 8th century AD, it was situated west of the profitable fur and silver trade networks that spanned from the Baltic to the Muslim lands, via the Volga–Kama basins. At the prime hill in Kiev, fortifications and other symbols of consolidation and power appear from the 9th century, thus preceding the literary appearance of 'Rus' in the middle Dnieper region. By the 10th century, the lowlands around Kiev had extensive 'Slavic' styled settlements, and there is evidence of growing trade with the Byzantine lands. This might have attracted Rus' movements, and a shift in power, from the north to Kiev. Thus, Kiev does not appear to have evolved from the infrastructure of the Scandinavian trade networks, but rather it forcibly took them over, as evidenced by the destruction of numerous earlier trade settlements in the north, including the famous Staraja Ladoga.\n\n\n== See also ==\nIndigenous Aryans\nMacedonia naming dispute\nVenetic theory\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Bibliography ==\n\n\n== External links ==\nJames E. Montgomery, 'Ibn Faḍlān and the Rūsiyyah', Journal of Arabic and Islamic Studies, 3 (2000), 1-25. Archive.org. Includes a translation of Ibn Fadlān's discussion of the Rūs/Rūsiyyah.", "links": ["2014 pro-Russian unrest in Ukraine", "2022 Russian invasion of Ukraine", "2022 Ukrainian refugee crisis", "Administrative divisions of Ukraine", "Adrabaecampi", "Alemanni", "Ambrones", "Ampsivarii", "Angles", "Anglo-Saxon burial mounds", "Anglo-Saxon law", "Anglo-Saxon mythology", "Anglo-Saxon paganism", "Anglo-Saxon warfare", "Anglo-Saxons", "Angrivarii", "Annals of St. Bertin", "Annexation of Crimea by the Russian Federation", "Armalausi", "Armed Forces of Ukraine", "Armenia", "Atuatuci", "Auiones", "Avarpi", "Baemi", "Baetasii", "Baiuvarii", "Balts", "Banking in Ukraine", "Banochaemae", "Bastarnae", "Batavi (Germanic tribe)", "Bateinoi", "Bear", "Belarus", "Belgae", "Bibliography of Ukraine", "Boris Rybakov", "Brill Publishers", "Brisigavi", "Brockhaus and Efron", "Brondings", "Bructeri", "Bucinobantes", "Burgundians", "Buri tribe", "Byzantine Empire", "Caerosi", "Cambridge University Press", "Cananefates", "Caritni", "Carolingian Empire", "Casuari", "Caucasus", "Censuses in Ukraine", "Chaedini", "Chaemae", "Chali", "Chamavi", "Charudes", "Chasuarii", "Chatti", "Chattuarii", "Chauci", "Chernobyl disaster", "Cherusci", "Christianisation of Anglo-Saxon England", "Christianisation of the Germanic peoples", "Christianization of Iceland", "Christianization of Scandinavia", "Christianization of the Franks", "Cimbri", "Cinema of Ukraine", "Cobandi", "Condrusi", "Constantine VII", "Constitution of Ukraine", "Continental Germanic mythology", "Corconti", "Corruption in Ukraine", "Crime in Ukraine", "Crimean Gothic", "Crimean Goths", "Cugerni", "Culture of Ukraine", "Cuneiform script", "Dahl, Vladimir Ivanovich", "Dance in Ukraine", "Danes (Germanic tribe)", "Dauciones", "De Administrando Imperio", "Declaration of Independence of Ukraine", "Demographics of Ukraine", "Diduni", "Dmitry Ilovaisky", "Dnieper", "Dniester", "Doi (identifier)", "Don River, Russia", "Dulgubnii", "Early Germanic architecture", "Early Germanic calendars", "Early Germanic clothing", "Early Germanic culture", "Early Germanic festivals", "Early Germanic funerary practices", "Early Germanic literature", "Early Germanic symbols", "Early Germanic warfare", "Early Slavs", "East Germanic languages", "East Slavs", "Eastern Europe", "Eastern Front (World War II)", "Eburones", "Economy of Ukraine", "Education in Ukraine", "Elections in Ukraine", "Elizabeth of Russia", "Energy in Ukraine", "Ethnic nationalism", "Ethnolinguistic group", "Euromaidan", "Europe: A History", "F. Donald Logan", "Family in early Germanic culture", "Favonae", "Finno-Ugric languages", "Firaesi", "Flag of Ukraine", "Foreign relations of Ukraine", "Fosi", "France", "Franks", "Frisiavones", "Frisii", "Galicia (Eastern Europe)", "Gambrivii", "Geats", "Gender inequality in Ukraine", "Geography of Ukraine", "Gepids", "Gerhardt Friedrich Müller", "Germani cisrhenani", "Germanic Iron Age", "Germanic languages", "Germanic law", "Germanic name", "Germanic paganism", "Germanic parent language", "Germanic peoples", "Gothic Christianity", "Gothic alphabet", "Gothic and Vandal warfare", "Gothic name", "Gothic paganism", "Goths", "Gottlieb-Siegfried Bayer", "Governance of Ukraine", "Government of Ukraine", "Grand Duchy of Lithuania", "Grand Prince of Kiev", "Greuthungi", "Gutes", "Gutones", "Harii", "Hasdingi", "Health in Ukraine", "Heaðobards", "Helga", "Helisii", "Helveconae", "Henry Melvill Gwatkin", "Hermunduri", "Heruli", "Hilleviones", "Historical revisionism", "History of Christianity in Ukraine", "History of Ukraine", "History of Ukrainian animation", "Holodomor", "Hrærekr", "Human rights in Ukraine", "ISBN (identifier)", "ISSN (identifier)", "Ilmen Slavs", "Immigration to Ukraine", "Index of Ukraine-related articles", "Index of Ukraine–related articles", "Indigenous Aryans", "Indigenous peoples", "Infobase Publishing", "Infrastructure of Ukraine", "Ingaevones", "Irminones", "Istvaeones", "J. B. Bury", "JSTOR (identifier)", "Judiciary of Ukraine", "Jutes", "Juthungi", "Kama River", "Khagan", "Khazar", "Kiev", "Kievan Rus'", "Kingdom of Galicia–Volhynia", "Kirill Razumovski", "Kuyaba", "Lacringi", "Languages of Ukraine", "Law of Ukraine", "Lech, Čech, and Rus", "Legitimacy (political)", "Lemovii", "Lentienses", "Leo Klejn", "Lingua franca", "List of Nature Reserves of Ukraine", "List of World Heritage Sites in Ukraine", "List of ancient Germanic peoples", "List of islands of Ukraine", "List of longest rivers of Ukraine", "List of mountains in Ukraine", "List of waterfalls of Ukraine", "Lombards", "Lugii", "Macedonia naming dispute", "Magocsi, Paul R.", "Makhnovshchina", "Manimi", "Marcomanni", "Marsacii", "Marsi (Germanic)", "Mattiaci", "Medieval Scandinavian law", "Migration Period art", "Mikhail Illarionovich Artamonov", "Mikhail Lomonosov", "Mikhail Pogodin", "Military of Ukraine", "Ministry of Internal Affairs (Ukraine)", "Mongol invasion of Kievan Rus'", "Morini", "Music of Ukraine", "Nahanarvali", "National Parks of Ukraine", "National symbols of Ukraine", "Nemetes", "Nervii", "Nestor the Chronicler", "Nikolai Mikhailovich Karamzin", "Njars", "Nordic Bronze Age", "Norman Davies", "Normandy", "Normans", "Norse funeral", "Norse mythology", "Norsemen", "North Germanic languages", "Northern Europe", "Novgorod", "Nuithones", "Old East Slavic", "Old English", "Old English literature", "Old Gutnish", "Old Norse", "Old Norse literature", "Old Norse religion", "Olga of Kiev", "Omeljan Pritsak", "Orange Revolution", "Origin myth", "Osi (tribe)", "Ossetic language", "Ostrogoths", "Outline of Ukraine", "Paemani", "Pereiaslav Agreement", "Pereyaslav", "Polish–Lithuanian Commonwealth", "Political parties in Ukraine", "Politics of Ukraine", "Pre-Roman Iron Age", "President of Ukraine", "Prince of Novgorod", "Proto-Germanic folklore", "Proto-Germanic language", "Public holidays in Ukraine", "Pysanka", "Quadi", "Racial theory", "Raetovari", "Religion in Ukraine", "Reudigni", "Revolution of Dignity", "Ripuarian Franks", "Roman Iron Age", "Ros River", "Roxolani", "Royal Frankish Annals", "Rugii", "Rugini", "Runes", "Rurik", "Rurik dynasty", "Rurikid dynasty", "Rus' people", "Rusalka", "Russia", "Russian Academy of Sciences", "Russian Empire", "Russian Primary Chronicle", "Russo-Ukrainian War", "Ruthenians", "S2CID (identifier)", "Salian Franks", "Sarmatians", "Sarmats", "Saxons", "Science and technology in Ukraine", "Sciri", "Scythians", "Segni (tribe)", "Semnones", "Seven Natural Wonders of Ukraine", "Sicambri", "Silingi", "Sineus", "Sitones", "Slavophilia", "Slavs", "Sport in Ukraine", "Stalinist", "Staraya Ladoga", "Stepan Krasheninnikov", "Stock exchanges in Ukraine", "Suarines", "Suebi", "Sunici", "Sviatoslav I of Kiev", "Svyatopolk II of Kiev", "Swedes (Germanic tribe)", "Taifals", "Taylor & Francis", "Telecommunications in Ukraine", "Tencteri", "Teutons", "Texandri", "Thelir", "Thervingi", "Thracian Goths", "Thuringii", "Tourism in Ukraine", "Transport in Ukraine", "Treveri", "Triboci", "Truvor", "Tubantes", "Tulingi", "Tungri", "Ubii", "Ukraine", "Ukraine–European Union relations", "Ukrainian People's Republic", "Ukrainian Soviet Socialist Republic", "Ukrainian War of Independence", "Ukrainian architecture", "Ukrainian cuisine", "Ukrainian diaspora", "Ukrainian hryvnia", "Ukrainian literature", "Ukrainians", "Urartian Empire", "Usipetes", "Vagoth", "Vandals", "Vangiones", "Varangian", "Varisci", "Venetic theory", "Verkhovna Rada", "Victohali", "Vidivarii", "Viking Age", "Viking raid warfare and tactics", "Vikings", "Viktor Vasnetsov", "Vinoviloth", "Visigoths", "Vladimir Monomakh", "Volga region", "Volodymyr the Great", "Vyshyvanka", "War in Donbas (2014–2022)", "Warini", "Water sprite", "West Germanic languages", "West Ukrainian People's Republic", "Western Dvina", "Wildlife of Ukraine", "World Network of Biosphere Reserves in Europe and North America", "Zaporozhian Cossacks"]}