{"url": "https://en.wikipedia.org/wiki/Appearance_and_Character_of_Wolfgang_Amadeus_Mozart", "title": "Appearance and Character of Wolfgang Amadeus Mozart", "summary": "The Appearance and character of Wolfgang Amadeus Mozart are the subject of multiple investigations at present. The fact that it has not been possible to exhume Mozart's remains — due to the exact location of the community grave in which he was buried is unknown — nor are masks or mortuary casts preserved, lends a degree of uncertainty to the composer's physical appearance. Although an alleged skull of Mozart exists, its authenticity, more than questionable, has not been verified to date. This skull has been subjected to various DNA tests, comparing it with those of his alleged niece and maternal grandmother, but not only did they find that the former's DNA did not match those of his two relatives, but also that theirs did not match each other either. Also, an alleged lock of his hair of dubious legitimacy has been preserved. However, there are reliable sources and references concerning both his appearance and clothing as well as his personality. This information is found in artworks, descriptions, and testimonies of the time, which allow us to get a more or less accurate idea of what Mozart was like physically and psychologically.\nRegarding his clothing and personal effects, recent studies based on documents such as the Order of Suspension drawn up after his death or the record of receipts for the purchase of costumes, have done much to shed light on Mozart's tastes in clothing.\nAs for his personality, knowledge of it is mainly due to the descriptions of his contemporaries that have been preserved, as well as to the analysis of the composer's extensive personal correspondence.", "content": "The Appearance and character of Wolfgang Amadeus Mozart are the subject of multiple investigations at present. The fact that it has not been possible to exhume Mozart's remains — due to the exact location of the community grave in which he was buried is unknown — nor are masks or mortuary casts preserved, lends a degree of uncertainty to the composer's physical appearance. Although an alleged skull of Mozart exists, its authenticity, more than questionable, has not been verified to date. This skull has been subjected to various DNA tests, comparing it with those of his alleged niece and maternal grandmother, but not only did they find that the former's DNA did not match those of his two relatives, but also that theirs did not match each other either. Also, an alleged lock of his hair of dubious legitimacy has been preserved. However, there are reliable sources and references concerning both his appearance and clothing as well as his personality. This information is found in artworks, descriptions, and testimonies of the time, which allow us to get a more or less accurate idea of what Mozart was like physically and psychologically.\nRegarding his clothing and personal effects, recent studies based on documents such as the Order of Suspension drawn up after his death or the record of receipts for the purchase of costumes, have done much to shed light on Mozart's tastes in clothing.\nAs for his personality, knowledge of it is mainly due to the descriptions of his contemporaries that have been preserved, as well as to the analysis of the composer's extensive personal correspondence.\n\n\n== Physical appearance ==\n\nAs Franz Xaver Niemetschek, one of his early biographers, wrote, \"there was nothing special in [his] physique. [...] He was small and his countenance, except for his large, intense eyes, showed no sign of his genius.\"\nMozart was described by tenor Michael Kelly, actor and irish singer of the Vienna Opera, in his work Reminiscences. This provides one of the most valuable and complete descriptions of the Mozart's figure:\nHe entertained visitors by playing fantasias and capriccios on the piano. His sensitivity, his feeling, the speed of his fingers and, above all, the agility and power of his left hand, left me absorbed. After the splendid performance, we would sit at the dinner table, and I had the honor of sitting between him and his wife. After dinner, if the occasion was propitious and there were more guests, they would all march to the ball, and Mozart would join them with great enthusiasm. Physically, he was a man of small build, very thin and of pale complexion, with abundant hair, though somewhat thin and fair, of which he was, by the way, very proud. I remember that once he invited me to his house and I stayed there for a long time, where I was always received with hospitality and esteem; on that occasion I could see his great fondness for punch, which he mixed with other drinks and ingested, in truth with little moderation. He was very fond of billiards, and we played many games together, although he always beat me. He was a kind-hearted man, and his spirit was constantly ready to please others. He was only somewhat different when he played his music: he was capable of interrupting his performance if he heard the slightest noise. He gave concerts every Sunday, which I do not remember missing on any occasion.\nFrom direct accounts of the composer's physique, various specialists on Mozart's life conclude that he was a man of small stature (152 cm, approximately), very thin and pale. His short height is attested by the diary of Count Ludwig von Bentheim-Steinfurt, Mozart's contemporary aristocrat who attended one of his concerts, held on 15 October at the Vienna Municipal Theater, at which Mozart performed several pieces. In the entry for October 15, the count states that \"Herr Mozart is a small man, of pleasing figure.\" His pallor, short stature and thinness are also attested to by some comments written in 1792 by Maria Anna Mozart, Wolfgang's sister, for the future biography of Friedrich Schlichtegroll:\nMozart's parents were the best-looking couple in Salzburg of their time, and in their younger years the daughter passed for possessing remarkable beauty. But the son, Wolfgang, was small, thin, of pale complexion and without any extraordinary appearance in his outward appearance and figure.\nHe had an ordinary face, which was marked by the scars of the smallpox he suffered in his childhood, and in which a large nose stood out. His eyes were large and clear (apparently a deep blue color) and he sported a thick headful of hair, with fine, wheat-colored strands pulled back in a ponytail. His hands were medium-sized, with long, slender fingers, and his mouth was small. Mozart's left ear was missing the usual circumvolution or concha (this rare congenital malformation is now known in medical literature under the name \"Mozart's ear\").He was rather clumsy in manipulating objects, all the more so the smaller they were, and he could not stop fiddling or drumming his hands when talking to someone or when eating: his body was always in motion.For her part, Constanze later wrote that \"he was a tenor, rather soft in oratory and delicate in singing, but when something excited him, or it was necessary to exert himself, he was as powerful as he was energetic.\"\n\n\n=== Illnesses ===\nGiven his thin and weak build, Mozart was from the age of six a person who suffered from numerous illnesses throughout his life, which gradually deteriorated his health until leading to his death at age thirty-five. Thus, he contracted a streptococcal infection in the upper airways in 1762, later suffering from erythema nodosum, which Dr. Peter J. Davies of St. Vincent's Hospital in Melbourne (Australia) considers to be of probable streptococcal origin. In the same year, he contracted a new streptococcal infection and suffered a mild attack of rheumatic fever. In 1764, he suffered from tonsillitis, and in 1765 he contracted it again, in this case complicated with sinusitis. At the end of that year, he suffered a endemic typhoid fever that led to a coma, the following year he suffered a new attack of rheumatic fever. In 1767, he contracted smallpox, three years later he would suffer frostbite during his travels in Italy, and in 1771 he suffered from tracheobronchitis with jaundice. Three years later, he suffered an acute tooth abscess, and four years after that, he suffered from bronchitis.At the age of twenty-five, in 1781, he contracted a viral infection, but it was in 1784 when he suffered a serious illness in Vienna, whose symptoms are terrible colics ending in violent vomiting, and inflammatory rheumatic fever, which could have originated a chronic kidney disease. This infection is considered to be the origin of his death seven years later. In 1787, Mozart \"again contracted a streptococcal infection which gave rise to a second occurrence of Henoch–Schönlein purpura; in addition, his kidneys, already in poor condition, were further damaged.\"\n\n\n=== Portraits and paintings of the composer ===\n\nCurrently, there are more than sixty Mozart portraits and pictorial representations of all kinds, despite the fact that much of them show little fidelity to the model.\nArthur Hutchings expressed his point of view about the contradiction offered by the opposition between the enormous amount of artworks that represent the genius and the scarce iconographic value of them with the sentence: \"Too many images\". For his part, Alfred Einstein, also a Mozart specialist, expressed his opinion about these portraits in the following statement:\nWe have nothing to give us an idea of Mozart's physical appearance, except for a few mediocre canvases that do not even resemble each other.\nWith the exception of French artist Jean-Baptiste Greuze, no other major painter undertook the task of faithfully reproducing Mozart's physique. On the other hand, one of the characteristics of the 18th century as far as painting is concerned was precisely, although only in some schools, the lack of fidelity to the features of the reproduced model.All this led the musicologist Arthur Schuring to state in 1923 the following:\nMozart has been the famous composer of whom most fictitious portraits have been made, pictorial material that has contributed, not a little, to confuse later generations about his appearance.\nThese statements led the musicologists and art historians to undertake a rigorous analysis of all existing paintings, sketches, drawings, cameos and engravings of the composer. The conclusion of this was that only eight works of art, all of them of unequal interest, were produced by authors who knew Mozart directly, or by sketches taken from drawings made from life. From this selection, Mozart's \"biographical paintings\" have been published with more care, generally following the criteria that emerged from this analysis.\n\nThus, it seems appropriate to point out a list of authors, contemporaries of the composer, who signed loose portraits of Mozart: Pompeo Girolamo Battoni, François Joseph Bosio, Breitkopf, Joseph Duplessis, Nicolò Grassi, Jean-Baptiste Greuze, Klass, Langernhöffel, Rigaud, Saint-Aubin, Van Smissen, Thelott, Tischbein, and Johann Zoffany. Nevertheless, the study of these portraits can be interesting since, although they are not faithful to the physical features of the composer, they provide important iconographic data, either on musical instruments, or on other personalities that appear in them.To all the above list of authors, including some great names in painting, we should add all the artists of the 19th century who represented Mozart, such as Hermann von Kaulbach (whose portrait of the composer is reproduced in the left margin) or Shields, who offer a purely romantic and not very rigorous vision of the physical appearance of the genius of Salzburg. From this statement we should exclude the portrait painted by Barbara Krafft in 1819 since, despite having been painted almost thirty years after the composer's death, it is considered one of his most faithful representations. This is because Krafft relied on portraits made during Mozart's lifetime and considered by the composer's sister to bear a strong resemblance to the genius. Thus, Krafft took as models the family portrait by Della Croce (1780–1781) and the unfinished oil painting by Joseph Lange (1789–1790, reproduced in the right margin), which were provided to her by Mozart's own sister, in Salzburg.Apart from any iconographic study, the current knowledge about the similarity of the portraits with respect to the figure of Mozart is rather based on opinions that are a reliable source, such as, for example, the testimony and descriptions of some of his friends, his wife or his eldest son, Karl Thomas Mozart.Finally, it is worth mentioning that the portrait of Mozart by his brother-in-law, Joseph Lange (c. 1789, depicted in the right margin) is now considered to be the most accurate representation of the composer. Lange was the husband of Constanze's older sister, Aloysia Weber, and worked as an actor at the Burgtheater in Vienna. Despite being only an amateur painter, his work was considered by Constanze to be the best of all portraits of her husband, stating:\nUndoubtedly, the one painted by Madame Lange's husband, which, although it is an unfinished work, bears an admirable resemblance.\nMaria Anna Mozart, sister of the composer, also admitted that the portrait's resemblance to the model was uncanny.\n\n\n== Clothing ==\nMozart, like Constanze, was fond of elegant clothes, and always wore the latest fashions and expensive dresses, regardless of his financial situation. This was partly because he was a man who attached great importance to outward appearance.Mozart was intensely socially active, including such duties as appearing at court functions, visiting the elegant halls of the likes of Johann Tost and the chancellor of the Greiner court, and frequenting Prague court circles and receptions in his capacity as Hofcompositeur.  His wife attended many of these events; this meant that the Mozarts had to be well dressed, and Mozart's hair required constant attention. On the latter point, the direct testimony of his hairdresser, herr Haderlein, has been preserved:\nWhile I was doing Mozart's hair one morning, just as I was finishing his ponytail, Mozart suddenly jumped up and, although I was still holding his ponytail in my hands, he went into the next room, dragging me behind him, and began to play the piano. Admiring his playing and the beautiful tonality of the instrument – it was the first time I had ever heard a piano like that – I let go of his ponytail and did not finish combing his hair until he got up. One day, as I was turning the corner from Kärtnerstrasse into Himmelpfortgasse to go to Mozart's service, he rode up, stopped, and, as he walked a few steps forward, took a small tablet [out of his pocket] and began to write music. I spoke to him again, asking if he could receive me, and he said yes.\nMusicologist Bernhard Paumgartner (1991) believes that Mozart not only attached importance to his appearance for social reasons, but also because he suffered from a lack of physical qualities. The actor Backhaus is said to have taken him for a tailor's officer, and to the poet Johann Ludwig Tieck, who saw him in Berlin in May 1789, hovering restlessly around the music stands of an empty, dark hall where The Abduction from the Seraglio (KV 384) was to be performed, he seemed a man of trivial figure. Sociologist Norbert Elias (2002) also emphasizes the insignificance of his appearance, although he points out that his countenance is friendly and humanly pleasing.There is no information on how Constanze Mozart dressed, but we do know what her husband's clothing was like in 1791, thanks to the Order of Suspension drawn up in December of the same year, after the genius' death. This document has an inventory of his clothing and personal effects:\n1 white cloth coat.\n1 blue ditto.\n1 red ditto.\n1 ditto in nanquin color.\n1 ditto in brown satin [braun = marine brune?] with breeches, embroidered in silk.\n1 full suit of black cloth.\n1 brown greatcoat.\n1 ditto of lighter cloth.\n1 blue cloth jacket with fur.\n1 ditto Kiria with fur trim.\n4 assorted vests, 9 assorted breeches, two ordinary hats, 3 pairs of boots, 3 pairs of shoes.\n9 pairs of silk stockings.\n9 shirts.\n4 white handkerchiefs, 1 night cap, 18 pocket handkerchiefs.\n8 underpantss, 2 nightshirts, 5 pairs of socks.Such a wardrobe was what a well-to-do merchant might have: these were expensive and luxurious clothes. Kelly recalled it in an essay as follows:\n\nHe was on stage with his crimson pince-nez and his bicorne with gold lace, giving the tempo of the music to the orchestra.\nMozart's wardrobe appears to have been purchased according to the latest fashion; according to H. C. Robbins Landon, musicologist and specialist in Mozart's life and works, he probably had to acquire elegant clothes for the coronation festivities in Frankfurt, for attendance at public concerts and private receptions. The following excerpt from a contemporary newspaper gives an idea of the fashion of the time:\nShorts have been worn for a long time... in worsted (for everyday wear) and in summer in straw color; also in ash gray and the couleur sur couleur striped nanquin (the latest fashion); also in off-white, greenish or sulfur-colored fabric... Another very used garment is the vest... Now they are beginning to wear plain, striped or checked Manchester [cotton].... Boots are also beginning to be worn... if shoes are worn it is with... pearl gray silk stockings. [The Coat] reaches almost to the shoes and is worn in all colors.\nAn illustration of \"an elegant German dressed in the latest fashion\" is included and his costume is described:\n\nThe elegant gentleman is a combination of English and French: 1) the hairstyle en Grecque carré à dos d'âne; 2) an English handkerchief of black muslin; 3) an Anglo-French coat; 4) a vest en fond filoche; 5) tight breeches en bleu mignon or strong blue worsted; 6) two large watch chains; 7) blue and white checked silk stockings; 8) black shoes are still worn; 9) in the hand a hat à l'Andromane, with rose-colored lining, because the hat is more for the hand than for the head.\nAfter the composer's death, his estate was valued at 595 guilders and 9 kreutzer, of which 55 guilders were for costumes and undergarments. Among the outstanding debts (totaling 918 guilders and 16 kreutzer) were three considerable bills including that of a tailor, to whom he owed 282 guilders and 7 kreutzer.\n\n\n== Personality and beliefs ==\n\nAs numerous testimonies of the time claim, the most characteristic trait of Mozart's personality was his optimism. When the English musician and publisher couple Vincent and Mary Novello interviewed Constanze in 1829 and asked her about her husband's character, she replied without hesitation: \"He was always cheerful.\"Most researchers point to Mozart's childish and even somewhat irresponsible character, which led him, at times, to make impulsive decisions. This idea is supported in a text written in 1792 by Maria Anna Mozart, Wolfgang's sister, for the future biography of Friedrich Schlichtegroll:\nExcept for his music he remained a child, and this is the main characteristic of the dark side of his personality: he always needed a father, a mother or someone to look after him; he was incapable of managing money; he married, against his father's will, a young woman who was not at all suitable for him, and hence the great disorder in his home during and after his death.\nMozart was also described by his contemporaries as a hospitable man, generous, jealous of his own genius and a workaholic. On the other hand, he had great self-esteem and could, at times, come across as somewhat proud. Although he was not endowed with great psychological strength, he reached his last days with surprising fortitude in every respect. He was outgoing, sociable and nonconformist, since he refused to accept the \"status\" of servants that musicians had at the time, which caused him no small amount of trouble in the course of his existence.On this social nonconformism that Mozart displayed throughout his life, it is worth mentioning the parting of ways with who had been his patron and protector since childhood, Hieronymus von Colloredo, Prince-Archbishop of Salzburg, who had an excellent relationship with the composer's father. Mozart never officially ceased to be a musician at the archiepiscopal court of Salzburg. Because of his cheerful and cosmopolitan spirit, the composer gradually distanced himself from the archbishop, who considered him \"an insolent young man.\" Colloredo summoned him to Vienna in 1781 to deliver an ultimatum for his irresponsible attitude; Mozart arrived in the city to meet him on 16 March. At this meeting, a harsh confrontation took place between the two, which led to the presentation of a letter of resignation by Mozart, and concluded with the famous \"farewell kick\" that Count Arco, a member of the archbishop's court, gave Mozart in the backside. The archbishop, aware of Mozart's worth as a composer, refused to sign the letter of resignation that Mozart had presented to him, making Mozart for the rest of his days a runaway vassal, a dangerous condition in 18th century Europe.In correspondence with his father, Mozart recounts how the meeting with Count Arco unfolded:\nWhat a way to soften people up! He did not dare, out of cowardice, to say anything to the Archbishop and kept me in suspense for a month before finally kicking me in the ass. That's a hell of a thing to do!\nLeopold was deeply troubled by the fear of losing his salary, as Wolfgang wrote to him in anger, listing the numerous reprisals he planned to carry out against the count. This is a very interesting letter, in that it shows Mozart's most vindictive side, closely linked to the spirit of the Enlightenment:\n... I shall write very soon to that ill-fated man to tell him what I think of him, and as soon as he stands before my eyes I shall give him a kick that he will remember in his flesh forever... Although I am not a count, I have more gallantry and honor in my heart than many of those who enjoy such a title. Whoever insults me, be he a lackey or a count, will deserve my contempt.\nIn reality, Leopold's fears were unfounded, for Mozart was a man of peaceful, quiet and gentle character; he was not much given to violence, and only in his writings do traces of physical vengeance surface.Mozart generally worked long and energetically, completing compositions at a great pace due to tight deadlines. He often made sketches and outlines although, unlike Ludwig van Beethoven, these have not been preserved, as Constanze destroyed them after his death. With regard to his own compositions, Mozart was wont to judge them impartially, and often with a severity and rigor that he would not easily have endured from another person.When it came to money management, Mozart was rather carefree, but not as carefree as popular belief claims. However, this attitude led him to spend it sometimes excessively, and to depend for several years on loans made to him by some friends, especially Johann Michael Puchberg. On the other hand, and since settling in Vienna, Mozart lived long periods of time during which he did not possess a fixed salary. Once, on a trip the composer took to Berlin, King Frederick William II of Prussia offered him three thousand escudos in fees if he wished to take up residence at his court and take over the direction of his orchestra. Mozart refused the proposal, replying, \"I like living in Vienna; the emperor loves me, and money matters little to me.\" Music publishers and theater impresarios abused Mozart's well-known disinterest in money to such an extent that most of his piano compositions yielded him nothing. Also, performances of Mozart's operas in Germany brought him fame, but no money, due to the non-existence of \"performance rights\"; and German publishers could reprint Mozart's music at will without consulting him, since there was no copyright law either.He was brought up according to Catholic morals, but without coercion or spiritual fetters that might divert the free initiative of genius. He was a loyal member of the Catholic Church at all stages of his life, despite belonging to Freemasonry for the last seven years of his life. This was possible because in Mozart's time, Freemasonry was considered an enlightened extension of Christian beliefs, so that being Catholic and Mason was not mutually exclusive, but perfectly compatible.\n\n\n== Training and intellectual qualities ==\nMozart was a cultured and enlightened person, fluent in four languages (German, Italian, French and English, and had advanced knowledge of Latin), he experienced a deep interest in reading, especially for the literature of William Shakespeare, and was drawn to the Fine Arts. Leopold Mozart himself was very proud of the education he had provided for his son, boasting that Wolfgang had received a more solid culture than the boys who attended the celebrated Imperial School in Vienna, where the Haydn brothers and Schubert were trained, a school whose training included painstaking instruction in Latin and music, both instrumental and vocal. Arthur Hutchings, musicologist and specialist in the life and work of Mozart, states that the genius received a fairly complete education, being suitable at least in the musical field: little Mozart found enjoyment in music.He possessed great skill in languages and in mathematics (especially algebra), his favorite childhood subject. Moreover, he had absolute pitch, an innate quality invaluable in music, as well as a prodigious photographic and auditory memory, which enabled him to retain ideas in his head for years. To these two qualities testifies the famous anecdote of the Miserere by Gregorio Allegri: this musicalization of the fiftieth psalm, one of the finest examples of Italian Renaissance polyphonic style, was performed twice every Holy Week, once on Holy Wednesday and once on Good Friday, in the Sistine Chapel. Considered patrimony of the Vatican, the execution of the work outside the Chapel was strictly forbidden, under penalty of excommunication for whoever copied it. However, on his trip to Italy in Holy Week of 1770, Mozart attended with his father the performance of the Wednesday Miserere in the Sistine Chapel, and made a point of retaining it by heart. Thus, when he returned that evening to the inn where he was staying, he put it in writing. Two days later, on Friday, he returned to witness the performance of that day and, hiding the manuscript in his hat, he was able to make some corrections. When the feat reached the ears of Pope Clement XIV, he not only did not excommunicate Mozart, then fourteen years old, but decided to award him a knighthood in the Order of the Golden Spur in the first degree.\n\n\n== Environment ==\nMozart lived in the center of the Viennese musical world and knew a great number and variety of people: fellow musicians; theatrical performers; friends who, like him, had moved from Salzburg; and many aristocrats, including an acquaintance of the emperor Joseph II of Austria. He had numerous friends among the intellectuals, and he regularly attended the soirées held in the salons of prominent families where artists and thinkers met. However, his presence at such gatherings became increasingly sporadic as his ties with Freemasonry became tight.Maynard Solomon considers that the three closest friends of the composer may have been Gottfried Janequin, Count August Hatzfeld, and Sigmund Barisani. Many others included among his friendships his longtime colleague Joseph Haydn, the singers Franz Xaver Gerl and Benedikt Schack, and the horn Joseph Leutgeb. Leutgeb and Mozart maintained a curious kind of friendly banter, often with Leutgeb being the butt of Mozart's practical jokes.\n\n\n== Hobbies ==\n\nHe enjoyed playing billiards, possibly because it was a form of exercise. He also loved dancing, especially masquerades, which he always attended dressed as a harlequin. He had several pets: a canary, a starling, a dog, and also a horse for playful riding. There is not the slightest indication that Mozart engaged in gambling (except billiards or home card games, with small stakes), and he certainly did not go to the famous Viennese gambling dens, since, among other things, his purchasing power did not allow it. He was fond of drinking coffee in a cup, as well as smoking a pipe, but in moderation.Especially in his youth, Mozart had a special predilection for scatological humor, not so unusual in his time, which is apparent in many of his surviving letters, especially those written to his cousin Maria Anna Thekla Mozart (around 1777 and 1778), but also in correspondence with his sister Nannerl and his parents. Mozart even wrote scatological music, such as the canon Leck mich im Arsch KV 231 (literally \"Lick my ass\", sometimes idiomatically translated as \"Kiss my ass.\")\n\n\n== Daily routine ==\nAs can be seen from a text written by Mozart himself, his daily program in 1782 was as follows:\nAt six o'clock, I am always combed. At seven o'clock, fully dressed. Then I write until nine o'clock. From nine o'clock until one o'clock, I teach. Then I eat, when I am not invited, and in that case lunch is at two or three o'clock. I can't work before five or six o'clock, and often an academy prevents me from doing so; otherwise, I write until nine o'clock at night [...]. Because of the academies and the eventuality of being asked here or there, I am never sure of being able to compose in the afternoon, so I have got into the habit (especially when I get back early) of writing something before I go to bed. I often do so until one o'clock, only to get up again at six o'clock.\nMonths after this writing, Mozart married Constanze Weber; therefore, his routine underwent certain modifications from that moment on. Nevertheless, and as various entries in his diary after the marriage show, Mozart's daily life as a married man presented a rather similar organization, including some new activities, such as horseback riding in the early morning, and billiard games with his wife in the afternoon.\n\n\n=== Compositional method ===\n\nIn general, Mozart worked energetically, finishing compositions at a great pace due to tight deadlines and the accumulation of commissions. He spent between five and seven hours a day composing, depending on whether he had a concert or not, which was usually divided between the early afternoon and the evening.At the present time, the speed with which Mozart composed is well known. In a letter to his mother, the composer's sister, Nannerl Mozart, jokes that her brother is writing a sonata while he is mentally composing another one.Thus it took Mozart a month to write the Piano Concerto No. 21, eighty-three pages long – many composers would have taken a month just to copy a concerto of such dimensions.Mozart was able to write his Symphony \"Linz\", KV 425, in only five days, during his vacation period in the aforementioned city. This fact is reflected in Wolfgang's correspondence with his father:\nOn Tuesday, November 4, I will give an academy at the theater here, and as I do not have a single symphony at hand here, I am writing a new one on the spur of the moment, which must be finished by then...\nAnother example of his compositional speed is found in the overture of the opera Don Giovanni, on which Mozart worked only on the evening preceding the first performance and when the dress rehearsal had already taken place.Mozart was not in the habit of making copies of his compositions, so he wrote them directly in the final version, without resorting to a prior draft. However, his autograph scores show surprisingly few corrections and revisions, since Mozart would put a work to paper only when it had already been completed in his mind.Mozart used to follow a very peculiar compositional process, which was characterized by the fact that he did not finish a work completely, but left blank spaces in the sheet music that he was sure he would be able to remember after a while, and when the date of delivery or premiere of the work approached, he would fill in the empty spaces. In this way, he was able to optimize the time spent working on the various compositions, giving preference to those whose delivery or premiere dates were closest.Thus, Mozart's usual method of working was to complete the first violins part, the second violins if necessary, and the bass and remaining parts, usually of a solo nature, if he deemed it necessary to aid his memory.In the case of a large vocal work, such as the Great Mass (KV 427) or the Réquiem (KV 626), Mozart notated the choir, the basso continuo and the ritornello sections of the orchestral and also usually the first violins and the complicated polyphonic or canonic entries of the strings or the solo sections of the woodwind instruments. With such a particella, Mozart could have kept even a work of importance for up to three years, as he did with the Piano Concerto No. 27 (KV 595), then dust it off and \"refill\" it in due course.\n\n\n== See also ==\nMozart family grand tour\nMozart's nationality\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== Sources ===\n\n\n=== Further reading ===", "links": ["Absolute pitch", "Age of Enlightenment", "Alfred Einstein", "Algebra", "Allgemeine musikalische Zeitung", "Aloysia Weber", "Alte Mozart-Ausgabe", "Anna Maria Mozart", "Antonio Salieri", "Aristocracy", "Art history", "Arthur Hutchings", "Arthur Schuring", "Australia", "Autograph", "Barbara Krafft", "Basso continuo", "Beethoven and Mozart", "Beethoven–Haydn–Mozart Memorial", "Benedikt Schack", "Berlin", "Bernhard Paumgartner", "Bicorne", "Billiards", "Biographer", "Biographies of Mozart", "Blue", "Bohemia", "Boot", "Bowed string instrument", "Breeches", "Breitkopf & Härtel", "Bronchitis", "Burgtheater", "Cameo (carving)", "Canon (music)", "Capriccio (music)", "Catholic Church", "Catholicism", "Chancellor", "Choir", "Chronic kidney disease", "Claude V. Palisca", "Clement XIV", "Coat", "Colic", "Concert", "Constanze Mozart", "Constanze Weber", "Count", "Cäcilia Weber", "DNA", "Death mask", "Death of Wolfgang Amadeus Mozart", "Die Entführung aus dem Serail", "Dog", "Don Giovanni", "Donald Jay Grout", "Ear", "Emperor", "English language", "Equestrianism", "Erythema nodosum", "Excommunication (Catholic Church)", "Fantasia (music)", "Fashion", "Fine Arts", "Frankfurt", "Franz Xaver Gerl", "Franz Xaver Niemetschek", "Franz Xaver Wolfgang Mozart", "François Joseph Bosio", "Frederick William II of Prussia", "Freemasonry", "French language", "Friedrich Schlichtegroll", "Frostbite", "Genius", "Georg Nikolaus von Nissen", "German language", "Germany", "Giovanni Battista Martini", "Good Friday", "Great Mass (Mozart)", "Greatcoat", "Gregorio Allegri", "H. C. Robbins Landon", "Hair", "Handkerchief", "Hat", "Haydn and Mozart", "Henoch–Schönlein purpura", "Hermann von Kaulbach", "Hieronymus von Colloredo", "Holy See", "Holy Wednesday", "Holy Week", "Horn (instrument)", "Horn Concertos (Mozart)", "Horse", "ISBN (identifier)", "Italian language", "Italy", "J. Peter Burkholder", "Jaundice", "Jean-Baptiste Greuze", "Johann Georg Mozart", "Johann Michael Puchberg", "Johann Tost", "Johann Zoffany", "Joseph Deym von Strižtež", "Joseph Duplessis", "Joseph Haydn", "Joseph II, Holy Roman Emperor", "Joseph Lange", "Joseph Leutgeb", "Joseph Sonnleithner", "Josepha Weber", "Karl Thomas Mozart", "Kidney", "Kärntner Straße", "Köchel catalogue", "La clemenza di Tito", "Latin", "Leck mich im Arsch", "Leopold II of Austria (Babenberg)", "Leopold Mozart", "Linz", "List of compositions by Wolfgang Amadeus Mozart", "List of concert arias, songs and canons by Wolfgang Amadeus Mozart", "List of masses by Wolfgang Amadeus Mozart", "List of operas by Wolfgang Amadeus Mozart", "List of solo piano compositions by Wolfgang Amadeus Mozart", "List of sonatas by Wolfgang Amadeus Mozart", "List of symphonies by Wolfgang Amadeus Mozart", "Ludwig Tieck", "Ludwig van Beethoven", "Ludwig von Bentheim-Steinfurt", "Maria Anna Mozart", "Maria Anna Thekla Mozart", "Mary Cowden Clarke", "Masonic lodge", "Mathematics", "Maynard Solomon", "Melbourne", "Merchant", "Michael Kelly (tenor)", "Michael Lorenz (musicologist)", "Miserere (Allegri)", "Mozart's Berlin journey", "Mozart's birthplace", "Mozart's compositional method", "Mozart's name", "Mozart's nationality", "Mozart's starling", "Mozart Monument, Vienna", "Mozart and Freemasonry", "Mozart and dance", "Mozart and scatology", "Mozart and smallpox", "Mozart family", "Mozart family grand tour", "Mozart in Italy", "Musical instrument", "Musicologist", "Musicology", "Muslin", "Nannerl", "Nannerl Mozart", "Neue Mozart-Ausgabe", "Nicolò Grassi", "Norbert Elias", "Opera", "Orchestra", "Otto Erich Deutsch", "Overture", "Oxford University Press", "PMC (identifier)", "PMID (identifier)", "Painting", "Part (music)", "Personality", "Piano", "Piano Concerto No. 21 (Mozart)", "Piano Concerto No. 27 (Mozart)", "Piano concertos by Wolfgang Amadeus Mozart", "Pince-nez", "Pompeo Batoni", "Portrait", "Portrait painting", "Prague", "Prince-Archbishopric of Salzburg", "Requiem (Mozart)", "Rheumatic fever", "Ritornello", "Scatology", "Serinus canaria", "Sheet music", "Shirt", "Shoe", "Silk", "Sinusitis", "Sistine Chapel", "Skull", "Smallpox", "Sophie Weber", "St. Stephen's Cathedral, Vienna", "Stockings", "Streptococcus", "Suit", "Symphony No. 36 (Mozart)", "Symphony orchestra", "Tenor", "The Marriage of Figaro", "Tonsillitis", "Tooth abscess", "Typhoid fever", "Underpants", "Vest", "Vienna Opera", "Vincent Novello", "Violin", "Vomiting", "Wig", "William Shakespeare", "Wolfgang Amadeus Mozart", "Wolfgang Amadeus Mozart and Prague", "Wolfgang Amadeus Mozart and the Catholic Church", "Wolfgang Amadeus Mozart in popular culture", "Woodwind"]}