{"url": "https://en.wikipedia.org/wiki/Arc_Iris", "title": "Arc Iris", "summary": "Arc Iris is an American indie rock band from Providence, Rhode Island, United States, that began in 2012 as a solo project of Jocie Adams, formerly a member of The Low Anthem. Arc Iris has had several lineup changes since their inception and have since settled on a trio that is the nucleus of Jocie Adams (lead vocals, guitar), Zach Tenorio Miller (keyboards), Ray Belli (drums).  They have released four albums and toured internationally.", "content": "Arc Iris is an American indie rock band from Providence, Rhode Island, United States, that began in 2012 as a solo project of Jocie Adams, formerly a member of The Low Anthem. Arc Iris has had several lineup changes since their inception and have since settled on a trio that is the nucleus of Jocie Adams (lead vocals, guitar), Zach Tenorio Miller (keyboards), Ray Belli (drums).  They have released four albums and toured internationally.\n\n\n== Career ==\nAdams developed an interest in music at an early age and became proficient in the clarinet. She studied composition at Brown University where she graduated in 2008. While performing with the Low Anthem, Adams released a solo album Bed of Notions in 2011. Adams met Miller in 2012 and began collaborating, inviting Belli to join later that year. In 2013, it was announced that Adams had left the Low Anthem to pursue her new project, noting that she wanted \"to have more creative freedom\". In between, Adams briefly worked as a NASA technician.Arc Iris’s first, self-titled album was released on April 1, 2014 through the Los Angeles-based record label ANTI- Records. Co-produced by Dan Cardinal, it was recorded in Boston while the artwork was created by Kacie Smith. It was described as 'traditional music thrillingly positioned at the nexus of the old and new'. The band toured as support to Nicole Atkins, St. Vincent and Tweedy  and filmed a video for the song \"Whiskey Man\" directed by Matt Wignall.On June 2, 2016, Bella Union announced the release of Arc Iris's second record, Moon Saloon. The album's first single, \"Kaleidoscope\" premiered on Stereogum. The band recorded the album over a five day period as they had been invited to perform as support to St Vincent on her UK tour.On August 5, 2016, NPR's All Songs Considered debuted the video for 'Moon Saloon' which was shot entirely on a 360 degree camera.In 2017, Arc Iris toured a complete reimagination of Joni Mitchell's Blue.On August 7, 2017, Arc Iris announced the formation of an offshoot band called Bwahaha that featured Ryan Miller of Guster.In early 2018, the band toured alongside Kimbra. On July 27, 2018, Arc Iris released their third album, Foggy Lullaby, a complete re-imagination of Joni Mitchell's Blue.\nShortly after releasing Foggy Lullaby, the band announced the release of Icon of Ego on Ba Da Bing Records and premiered \"$GNMS\" a reworking of \"Money Gnomes\" off their debut album.\n\n\n== Discography ==\n\n\n=== Albums ===\nArc Iris (2014, ANTI-North America, Bella Union Rest of World)\nMoon Saloon (2016, Bella Union)\nFoggy Lullaby (2018)\nIcon of Ego (2018, Ba Da Bing Records)\n\n\n=== Singles ===\n\"Singing So Sweetly\" (2014, ANTI- Records)\n\"Kaleidoscope\" (2016, Bella Union Records)\n\"$GNMS\" (2018, Ba Da Bing Records)\n\n\n== References ==\n\n\n== External links ==\nOfficial website", "links": ["ANTI-", "AllMusic", "All Songs Considered", "Ba Da Bing Records", "Bella Union", "Blue (Joni Mitchell album)", "Brown University", "Consequence of Sound", "Guster", "ISNI (identifier)", "Indie rock", "Jeff Tweedy", "Joni Mitchell", "Kimbra", "MBA (identifier)", "NPR", "Nicole Atkins", "Pop rock", "Providence, Rhode Island", "St. Vincent (musician)", "Stereogum", "The Boston Globe", "The Low Anthem", "VIAF (identifier)"]}