{"url": "https://en.wikipedia.org/wiki/Arif_Mardin", "title": "Arif Mardin", "summary": "Arif Mardin (March 15, 1932 – June 25, 2006) was a Turkish-American music producer, who worked with hundreds of artists across many different styles of music, including jazz, rock, soul, disco and country. He worked at Atlantic Records for over 30 years, as producer, arranger, studio manager, and vice president, before moving to EMI and serving as vice president and general manager of Manhattan Records. His collaborations include working with The Rascals, Queen, John Prine, the Bee Gees, Hall & Oates, Anita Baker, Aretha Franklin, Dionne Warwick, Donny Hathaway & Roberta Flack, Bette Midler, Michael Crawford, Chaka Khan, Laura Nyro, Ringo Starr, Carly Simon, Phil Collins, Daniel Rodriguez, Danny O'Keefe, and Norah Jones. Mardin was awarded eleven Grammy Awards.", "content": "Arif Mardin (March 15, 1932 – June 25, 2006) was a Turkish-American music producer, who worked with hundreds of artists across many different styles of music, including jazz, rock, soul, disco and country. He worked at Atlantic Records for over 30 years, as producer, arranger, studio manager, and vice president, before moving to EMI and serving as vice president and general manager of Manhattan Records. His collaborations include working with The Rascals, Queen, John Prine, the Bee Gees, Hall & Oates, Anita Baker, Aretha Franklin, Dionne Warwick, Donny Hathaway & Roberta Flack, Bette Midler, Michael Crawford, Chaka Khan, Laura Nyro, Ringo Starr, Carly Simon, Phil Collins, Daniel Rodriguez, Danny O'Keefe, and Norah Jones. Mardin was awarded eleven Grammy Awards.\n\n\n== Biography ==\n\n\n=== Early life ===\nMardin was born in Istanbul into a renowned family that included statesmen, diplomats and leaders in the civic, military and business sectors of the Ottoman Empire and the Turkish Republic. His father was co-owner in a petroleum gas station chain.\nMardin grew up listening to the likes of Bing Crosby and Glenn Miller. Through his sister he met jazz critic Cuneyt Sermet, who turned him onto this music and eventually became his mentor. After graduating from Istanbul University in Economics and Commerce, Mardin studied at the London School of Economics. Influenced by his sister's music records and jazz, he was also an accomplished orchestrator and arranger, but he never intended to pursue a career in music.\nHowever, his fate changed in 1956 after meeting the American jazz musicians Dizzy Gillespie and Quincy Jones at a concert in Ankara. He sent three demo compositions to his friend Tahir Sur who worked at a radio station in America. Sur took these compositions to Quincy Jones and Mardin became the first recipient of the Quincy Jones Scholarship at the Berklee College of Music in Boston. In 1958 he and his fiancé Latife moved from Istanbul to Boston. After graduating in 1961, he taught at Berklee for one year and then moved to New York City to try his luck. Arif Mardin was later made a trustee of Berklee and was awarded an honorary doctorate.\n\n\n=== Career ===\n\nMardin began his career at Atlantic Records in 1963 as an assistant to Nesuhi Ertegün. A fellow Turkish émigré, Nesuhi was the brother of Ahmet Ertegün, Atlantic's co-founder and a jazz enthusiast when they met at the Newport Jazz Festival. Mardin rose through the ranks quickly, becoming studio manager, label house producer and arranger. In 1969, he became the Vice President and later served as Senior Vice President until 2001. He worked closely on many projects with co-founders Ertegün and Jerry Wexler, as well as noted recording engineer Tom Dowd; the three legends (Dowd, Mardin, and Wexler) were responsible for establishing the \"Atlantic Sound\". Arif Mardin retired from Atlantic Records in May 2001 and re-activated his label Manhattan Records. He maintained ties to the Turkish music industry.He produced many hit artists including Margie Joseph, Thereza Bazar, The Rascals, Carly Simon, Petula Clark, Bette Midler, Barbra Streisand, the Bee Gees, Diana Ross, Queen, Patti Labelle, Aretha Franklin, Lulu, Anita Baker, Judy Collins, Phil Collins, Scritti Politti, Culture Club, Roberta Flack, Average White Band, Hall & Oates, Donny Hathaway, Jeffrey Osborne, Norah Jones, Daniel Rodriguez, Chaka Khan, George Benson, Melissa Manchester, The Manhattan Transfer, Modern Jazz Quartet, Willie Nelson, John Prine, Leo Sayer, Dusty Springfield, David Bowie, Jewel and Ringo Starr.Mardin is listed on Stephen Stills' first album (1970) issued by Atlantic Records, as a contributing artist for string arrangement on the songs \"Church\" and \"To a Flame\".\nArif Mardin, when producing the Bee Gees' 1975 Main Course album track \"Nights on Broadway\" discovered the distinctive falsetto of Barry Gibb, which became a familiar trademark of the band throughout the disco era.\nMardin made three solo albums: Glass Onion, in 1970, Journey, in 1975, and All My Friends Are Here, in 2006. In Journey, he was the composer and arranger, but he also played electric piano and percussion, and was accompanied by many stars of jazz (Randy and Michael Brecker, Joe Farrell, Gary Burton, Ron Carter, Steve Gadd, Billy Cobham and many others). Mardin composed, arranged, conducted and produced The Prophet, an interpretation of The Prophet by Kahlil Gibran, in 1974, featuring Richard Harris.In his career of more than 40 years, he collected over 40 gold and platinum albums, over 15 Grammy nominations and 12 Grammy Awards. In 1990, Arif Mardin was inducted into the National Academy of Recording Arts and Sciences Hall of Fame.\n\n\n=== All My Friends Are Here ===\nMardin considered All My Friends Are Here his life's work.  He wrote or co-wrote all but one of the 13 tracks.  The album features performances by Bette Midler, Chaka Khan, David Sanborn, Norah Jones, Carly Simon, Phil Collins, among the artists whom he produced over the years. Recording sessions and interviews were filmed for the companion documentary The Greatest Ears in Town: The Arif Mardin Story.\n\n\n== Personal life ==\nHe came to the United States in 1958 with his wife, Latife Mardin, who was a playwright and translator. They had three children: Nazan Joffre, Joe Mardin and Julie Mardin.Mardin died at his home in New York on June 25, 2006, following a lengthy battle with pancreatic cancer. His remains were brought to Turkey and were interred at Karacaahmet Cemetery in Üsküdar district of Istanbul on July 5, 2006. Bee Gees' soloist Robin Gibb and his wife Dwina attended the funeral service, among other prominent people.His son, Joe, created a documentary about his father called The Greatest Ears in Town: The Arif Mardin Story which was released on June 15, 2010. The documentary was directed by Doug Biro. It was premiered at several screenings at different chapters of The Recording Academy. The first screening took place in New York on June 15, 2010.\n\n\n== Awards ==\nGrammy Awards\nAlbum of the Year 1979 (Saturday Night Fever soundtrack), 2003 (Come Away with Me - Norah Jones)\nBest Female Pop Vocal Performance 1982 (\"You Should Hear How She Talks About You\" - Melissa Manchester)\nBest Female R&B Vocal Performance 1985 (\"I Feel for You\" - Chaka Khan)\nBest Album Notes 1993 (Queen of Soul: The Atlantic Recordings- Aretha Franklin)\nBest Jazz Vocal Album 2004 (A Little Moonlight - Dianne Reeves)\nBest Musical Show Album 1996 (Smokey Joe's Cafe)\nBest Pop Vocal Album 2003 (Come Away with Me)\nBest Vocal Arrangement for Two or More Voices 1984 (\"Be Bop Medley\" with Chaka Khan)\nProducer of the Year, Non-Classical 1976, 2003 (Come Away with Me)\nRecord of the Year 1990 (\"Wind Beneath My Wings\"), 2003 (\"Don't Know Why\")\nTrustees Award 2002\nTrustee Award for a Lifetime of Achievement in Music by the National Academy of Recording Arts and Sciences (NARAS) 2001\n\"Man of the Year\" by the Nordoff-Robbins Music Foundation 2001\nErtegün Impact Award\n\n\n== See also ==\nCategory: Albums produced by Arif Mardin\n\n\n== References ==\n\n\n== External links ==\nThe Arif Mardin Story on YouTube", "links": ["A Little Moonlight", "Ahmet Ertegün", "Albhy Galuten", "All My Friends Are Here", "Amy Kohn", "Andrew Watt (record producer)", "Anita Baker", "Aretha Franklin", "Atlantic Records", "Average White Band", "Babyface (musician)", "Barbra Streisand", "Barry Gibb", "Bee Gees", "Berklee College of Music", "Bette Midler", "Billy Cobham", "Bing Crosby", "Boston", "Boy Meets Girl (band)", "Brendan O'Brien (record producer)", "Brian Eno", "Carly Simon", "Chaka Khan", "Come Away with Me", "Country music", "Culture Club", "Dan Auerbach", "Danger Mouse (musician)", "Daniel Lanois", "Daniel Rodríguez (tenor)", "Danny O'Keefe", "David Bowie", "David Foster", "David Sanborn", "Diana Ross", "Dianne Reeves", "Dionne Warwick", "Disco", "Dizzy Gillespie", "Don't Know Why", "Don Was", "Donny Hathaway", "Dr. Dre", "Dr. John", "Dusty Springfield", "EMI", "Finneas O'Connell", "Gary Burton", "George Benson", "Glenn Miller", "Grammy Award for Album of the Year", "Grammy Award for Best Album Notes", "Grammy Award for Best Female Pop Vocal Performance", "Grammy Award for Best Female R&B Vocal Performance", "Grammy Award for Best Jazz Vocal Album", "Grammy Award for Best Musical Show Album", "Grammy Award for Best Pop Vocal Album", "Grammy Award for Best Vocal Arrangement for Two or More Voices", "Grammy Award for Producer of the Year, Non-Classical", "Grammy Award for Record of the Year", "Grammy Awards", "Grammy Trustees Award", "Greg Kurstin", "Hall & Oates", "Hugh Padgham", "ISNI (identifier)", "I Feel for You", "Istanbul", "Istanbul University", "Jack Antonoff", "James Anthony Carmichael", "Jazz", "Jeff Bhasker", "Jeffrey Osborne", "Jerry Wexler", "Jewel (singer)", "Jimmy Jam and Terry Lewis", "Joe Farrell", "Joe Mardin", "John Prine", "John Shanks", "Journey (Arif Mardin album)", "Judy Collins", "Kahlil Gibran", "Karacaahmet Cemetery", "Katreese Barnes", "L.A. Reid", "Lalah Hathaway", "Larry Butler (producer)", "Laura Nyro", "Leo Sayer", "Lionel Richie", "London School of Economics", "Lulu (singer)", "MBA (identifier)", "Main Course", "Manhattan Records", "Marc Shaiman", "Margie Joseph", "Margo Guryan", "Mark Ronson", "Max Martin", "Melissa Manchester", "Michael Brecker", "Michael Crawford", "Michael Jackson", "Modern Jazz Quartet", "Narada Michael Walden", "National Academy of Recording Arts and Sciences", "Neil Dorfsman", "Nesuhi Ertegün", "New York City", "Newport Jazz Festival", "Nights on Broadway", "Norah Jones", "Ottoman Empire", "Pancreatic cancer", "Patti Labelle", "Paul Epworth", "Peter Asher", "Petula Clark", "Pharrell Williams", "Phil Collins", "Phil Ramone", "Queen (band)", "Queen of Soul: The Atlantic Recordings", "Quincy Jones", "Randy Brecker", "Raul Midon", "Richard Harris", "Rick Rubin", "Ringo Starr", "Rob Cavallo", "Roberta Flack", "Robin Gibb", "Rock music", "Ron Carter", "Roxanne Seeman", "Saturday Night Fever (soundtrack)", "Scritti Politti", "Smokey Joe's Cafe (revue)", "So Blue (Arif Mardin feat. Chaka Khan & David Sanborn song)", "Soul music", "Stephen Stills (album)", "Steve Gadd", "Steve Lillywhite", "Stevie Wonder", "T Bone Burnett", "The Greatest Ears in Town: The Arif Mardin Story", "The Manhattan Transfer", "The Neptunes", "The New York Times", "The Prophet (book)", "The Rascals", "Thereza Bazar", "Thom Bell", "Tom Dowd", "Toto (band)", "Turkish Republic", "VIAF (identifier)", "Walter Afanasieff", "Willie Nelson", "Wind Beneath My Wings", "YouTube", "You Should Hear How She Talks About You", "Üsküdar"]}