{"url": "https://en.wikipedia.org/wiki/Arizona_State_Route_989", "title": "Arizona State Route 989", "summary": "State Route 989, also known as SR 989, is an unmarked state highway in Oro Valley, Arizona, that consists of a 2-mile (3 km) stretch of Tangerine Road west of State Route 77.", "content": "State Route 989, also known as SR 989, is an unmarked state highway in Oro Valley, Arizona, that consists of a 2-mile (3 km) stretch of Tangerine Road west of State Route 77.\n\n\n== Route description ==\nThe route was established in 1991. It is the highest numbered route in the Arizona state highway system. The number 989 was initially assigned as part of a proposed highway network for the Tucson area (in this case, the Tangerine Highway) that was never implemented.No signage has ever existed for this highway. According to ADOT Spokesperson Donal Cassano, \"SR 989 was turned back to Oro Valley (as of June 2012) and is no longer a state highway.\" Nonetheless, the Arizona Department of Transportation (ADOT) continues to log the highway in its official state highway system.\n\n\n== History ==\nThe route was originally conceived in 1988, to connect SR 77 (then-signed as US 89) in Oro Valley to SR 86 west of Tucson. It was proposed as an urban freeway to serve Tucson. The road was established as a state highway on its current routing through Oro Valley in 1991. Following its establishment, the road was not otherwise adjusted and remains today with its original routing. As of January 2016, there are no plans to widen Tangerine Rd. or expand it to expressway or freeway standards.\n\n\n== Major intersections ==\nThe highway from milepost 0.00-33.96 was proposed but never implemented as part of the route.\nThe entire route is in Oro Valley, Pima County.\n\n\n== References ==\n\n\n== External links ==\n\nSR 989 at Arizona Roads", "links": ["ADOT", "Arizona", "Arizona Department of Transportation", "Arizona State Route 77", "Arizona State Route 802", "Former state routes in Arizona", "Historic U.S. Route 80 (Arizona)", "Interstate 8", "List of Interstate Highways in Arizona", "List of U.S. Highways in Arizona", "List of state routes in Arizona", "Oracle, Arizona", "Oro Valley, Arizona", "Pima County, Arizona", "State Route 77 (Arizona)", "Tucson, Arizona", "U.S. Route 89 in Arizona", "Unconstructed state routes in Arizona", "United States"]}