{"url": "https://en.wikipedia.org/wiki/Artane,_Dublin", "title": "Artane, Dublin", "summary": "Artane, sometimes spelled Artaine (Irish: Ard Aidhin), historically Tartaine is a northside suburb of Dublin city, Ireland. \nArtane is also a civil parish in the ancient barony of Coolock. Neighbouring districts include Kilmore West, Coolock, Beaumont, Killester, Raheny and Clontarf; to the south is a small locality, Harmonstown, straddling the Raheny-Artane border.", "content": "Artane, sometimes spelled Artaine (Irish: Ard Aidhin), historically Tartaine is a northside suburb of Dublin city, Ireland. \nArtane is also a civil parish in the ancient barony of Coolock. Neighbouring districts include Kilmore West, Coolock, Beaumont, Killester, Raheny and Clontarf; to the south is a small locality, Harmonstown, straddling the Raheny-Artane border. \n\n\n== History ==\n\nArtaine, now usually Artane, has a recorded history spanning over 900 years, but for much of that time was a quiet rural area.\nArtane, as described from Thom's Almanac and Official Directory: County Dublin Directory, in 1862: \"A village and parish in Coolock barony, Dublin county, three miles (5 km) N. from the General Post Office, Dublin, comprising an area of 954 acres (3.86 km2). Population, 457. The village is on the road to Malahide. The parish, anciently called \"Tartaine,\" for centuries formed part of the estate of the Hollywood family, and the castle of Artane likewise belonged to that of the Donnellans. The ruins were taken down in 1825, and on its site, Artane House was erected.\"Artane Castle is recorded from about 1360 when Robert de Holywood, Chief Baron of the Irish Exchequer and founder of the Hollywood family, purchased it.The civil parish of Artaine, linked with Finglas before the Reformation, comprises the townlands of Artaine North, Artaine South, Artaine West, Artaine East (originally Skillinglass), Puckstown (where Bram Stoker once resided with his family) and two-thirds of the townland of Oldtown (the remainder being in the civil parish of Coolock).\nArtane Cottages Lower and Upper, built circa 1900, on the Malahide Road, are in the townland of Killester North.\n\n\n=== Silken Thomas and Artane Castle ===\nIn 1534, when Silken Thomas appeared in Dublin, the citizens, feeling unable to defend the city, allowed his troops to enter and lay siege to Dublin Castle. Among those who had taken refuge in the Castle was John Alen, Archbishop of Dublin. He had incurred the enmity of the FitzGeralds (also known as the Geraldines) by zeal in promoting Wolsey's plans and now dreaded their vengeance. He tried to escape by sea, but his ship was driven ashore at Clontarf. He sought refuge at Artane Castle, the home of his friend and fellow councillor Thomas St. Lawrence: St. Lawrence willingly took him in, but his hiding place was betrayed and he was captured. When brought before Silken Thomas, he implored the Earl to spare his life, but the young lord turned away with contempt, saying \"Beir uaim an bodach\" (\"take the fellow away\"). These words were interpreted as an order to put him to death and he was murdered in cold blood. For this crime, Silken Thomas was excommunicated by the Pope and thus lost many of his adherents. A slab bearing his name is still to be seen in the Archbishop's cemetery. In this old cemetery, there is also the 18th-century tomb of Richard Hollywood of Elm Park and the ruins of the 13th-century parish church.\nArtane Castle was used as a garrison during the 1641 Rebellion for a small army under the command of Luke Netterville of Corballis. The army raided two vessels at Clontarf led by the Commander of the Garrison of Dublin, Sir Charles Coote. They then battled in an area called Bloody Hallow, south of Swords. The Castle was pulled down in 1825 and using material from the castle a house was built on the site by Matthew Boyle. Boyle was a wealthy linen merchant which a business on Mary Street.\n\n\n=== Artane Industrial School ===\nThe Artane Industrial School was set up in 1871 in Artane House by the Congregation of Christian Brothers. Industrial Schools were established to take in orphaned or abandoned boys or those who were involved in petty crime, and even such a minor offence as skipping school could be enough for a boy to be sent there. It has been said that about 5% of the children in Artane, indeed in all Industrial Schools, were actually orphans. Most of the incarcerated children were from families that had broken down and as separation was not allowed either, the children of these broken marriages were incarcerated and the religious institution in whose charge the children were put were paid one-third of a labourer's wage to feed, educate and clothe each child. In today's money, this would be equal to about €120 per child per week.\nThe school housed around 900 boys at any one time and they stayed there until they were 16 years of age. More than 15,000 youngsters passed through the gates of the school from 1871 to its closure in 1966. Subsequently, many allegations of abuse of boys at the school emerged.\n\n\n==== After the industrial school - St. David's Primary and Secondary School ====\nSt. David's Primary School, BNS, began operations on the lower floors of the old industrial school in 1969. St. David's Secondary School, CBS, moved into the upper floors of the industrial school building in 1974 from the pre-fabricated buildings on Kilmore Road which it had occupied since 1966. The school building today is solely St. David's Secondary School, with grass playing fields, an all-weather pitch, sports hall, and exercise room, among its sports facilities, also science labs, computer rooms, metalwork and wood workrooms, art and a music room. St. David's CBS won the Leinster Colleges Senior Football Championship in 1986. They had been runners-up in 1984.\n\n\n=== The Stardust ===\n\nThe Stardust was a popular nightclub located near the Artane end of the Kilmore Road leading from Artane to Coolock. In the early hours of 14 February 1981, a fire took place at a disco. Forty-eight people lost their lives and 214 were injured. More than 800 people had attended the disco that night. The site of the disaster is today a business park which houses (amongst other things) a pub, opposite Artane Castle Shopping Centre. On the site was originally the factory of Scotts Foods, making jams and jarred vegetables.\nOn 14 November 2008, a second fire occurred at the same site as the Stardust, which had been used as a children's play centre. However, no one was in the building at the time, and there were no injuries. Once the fire was put out, firefighters found cancer-causing asbestos hanging from the roof.\n\n\n== Amenities ==\nRetail facilities in the Artane area include several shops on the Malahide Road, as well as the Artane Castle Shopping Centre, which is anchored by Tesco. Butterly Business Park holds a Lidl, a Mr Price and a number of other retailers. \nArtane Beaumont Family Recreation Centre (A.B.F.R.C)  is situated on the Kilmore Road at the Skellys Lane junction; Artane Montessori Circle Preschool is based at the recreation centre, which also hosts an after-school club for children of local schools, while other activities include basketball, badminton, fitness classes, Zumba and weight watchers; a number of music groups also use the centre.\nArtane is also the site of the Coolock-Artane Credit Union main office, and the Donnycarney-Beaumont Credit Union, located in Artane Castle Shopping Centre.Artane Beaumont Football Club is based at Rockfield Park, as is Rockfield Tennis Club. St. Pauls Artane F.C. is located at Gracefield Avenue. Killester Basketball Club uses the facilities at St. David's CBS, Artane.\n\n\n== Education ==\nSchools in Artane include St. David's CBS and St. David's Boys National schools, as well as St. John of God Girls National School on Kilmore Road.\n\n\n== Religion ==\nArtane is a parish in the Fingal South East deanery of the Roman Catholic Archdiocese of Dublin. There are two Roman Catholic churches serving the area: Our Lady of Mercy, Brookwood Grove (Artane parish), and St John Vianney, Ardlea Road (Ardlea parish). The Serbian Orthodox Church Parish of Saint George uses Artane's Oratory of the Resurrection, Kilmore Road, for its services. Designed by the architect Liam McCormick the oratory contains stained glass windows by the artist Ruth Brandt.\n\n\n== Public transport ==\n\n\n=== Dublin Bus ===\nThe area is served by a number of Dublin Bus routes, including: 14, 15, 27, 27B, 27X, 42, 42A, 42B 43, 104, 27a. The Artane roundabout bus stop is nearly always occupied by passengers.\n\n\n=== DART ===\nArtane is close to two Dublin Area Rapid Transit (DART) stations: Harmonstown railway station, which divides Artane and Harmonstown, and Killester railway station.\n\n\n== Notable people ==\nActor Jason Barry of Titanic and Love/Hate fame is from Artane.\nIvan Beshoff, survivor of Russian battleship Potemkin lived in Artane, where he founded the Beshoff's chain of fish and chip shops\nStephen Cluxton, who scored the winning All-Ireland point for Dublin in 2011, born here and attended St David's CBS.\nActor Liam Cunningham was educated at St David's CBS.\nJohannes de Sacrobosco, known locally as John de Hollywood (1195–1256), is believed to have come from Artane.\nRobert de Holywood, founder of the Hollywood family and Chief Baron of the Irish Exchequer (died 1384).\nKevin Doherty, ex-footballer and former first team manager of Shelbourne FC, was born here.\nEnya and her managers Nicky Ryan and wife Roma Ryan, who is also her lyricist, lived in Artane, the former for a few years, the latter two for many years.\nBrendan Gleeson, actor, born and grew up here.\nVeronica Guerin (1958–1996), Irish crime reporter, murdered during the course of an investigation.\nFootballer Jeff Hendrick of Newcastle United F.C and Ireland grew up in Artane playing with Artane Beaumont.\nThomas Kettle (1880–1916), writer, barrister, economist, Irish Nationalist politician, and World War I volunteer (KIA), was born here.\nEx-professional cyclist and award-winning journalist Paul Kimmage grew up in Artane.\nColombia goalkeeping coach Des McAleenan grew up in Artane.\nBrian McFadden, singer/musician, was born and grew up here.\nLarry Mullen, drummer with the Irish band U2, and perhaps the most famous former member of the Artane Boy's Band, born and grew up here.\nEx-Big Brother star, now TV/radio presenter, Ray Shah grew up and went to school in St David's NBS & CBS, Artane; he went on to become a popular disc jockey.\nBBC TV presenter Peter Snow\nFootballer Frank Stapleton\nBorn in Clontarf, Bram Stoker lived in Artane Lodge during the 1850s. His brother George was born in Artane.\nFormer Aer Lingus, later British Airways, CEO Willie Walsh was born near Artane.\n\n\n== See also ==\nList of towns and villages in the Republic of Ireland\n\n\n== References ==\n\n\n== External links ==\nSt.Davids CBS, boys secondary school, Artane", "links": ["Adamstown, Dublin", "Alexander Thom (almanac editor)", "Applewood, Swords", "Arbour Hill", "Archbishop of Dublin (Roman Catholic)", "Artane Castle Shopping Centre", "Artane Industrial School", "Ashtown, Dublin", "BBC News", "Baldoyle", "Balgriffin", "Ballinteer", "Ballsbridge", "Ballyboden", "Ballybough", "Ballyboughal", "Ballybrack", "Ballyfermot", "Ballygall", "Ballymount", "Ballymun", "Ballyroan, County Dublin", "Balrothery", "Barony (Ireland)", "Bayside, Dublin", "Beaumont, Dublin", "Belfield, Dublin", "Blackrock, Dublin", "Blanchardstown", "Bluebell, Dublin", "Booterstown", "Brackenstown, Swords", "Bram Stoker", "Brendan Gleeson", "Brian McFadden", "Brittas, County Dublin", "Broadstone, Dublin", "Cabinteely", "Cabra, Dublin", "Carpenterstown (townland, Castleknock)", "Carrickmines", "Castleknock", "Chapelizod", "Cherrywood, Dublin", "Chief Baron of the Irish Exchequer", "Churchtown, Dublin", "Citywest", "Civil parishes in Ireland", "Clondalkin", "Clonee", "Clongriffin", "Clonsilla", "Clonskeagh", "Clontarf, Dublin", "Congregation of Christian Brothers", "Coolmine", "Coolock", "Coolock (barony)", "Corduff", "Cornelscourt", "Counties of Ireland", "County Dublin", "Crumlin, Dublin", "Dalkey", "Damastown", "Darndale", "Dartry", "Daylight saving time", "Deansgrange", "Des McAleenan", "Dollymount", "Dolphin's Barn", "Donabate", "Donaghmede", "Donnybrook, Dublin", "Donnycarney", "Drimnagh", "Drumcondra, Dublin", "Dublin", "Dublin (European Parliament constituency)", "Dublin Area Rapid Transit", "Dublin Bay North (Dáil constituency)", "Dublin Bus", "Dublin City Council", "Dundrum, Dublin", "Dáil Éireann", "Dún Laoghaire", "East Wall", "Edmondstown", "Enya", "European Parliament constituency", "Fairview, Dublin", "Finglas", "Firhouse", "FitzGerald", "Foxrock", "Frank Stapleton", "Garristown", "Geographic coordinate system", "Glasnevin", "Glasthule", "Glenageary", "Glencullen", "Goatstown", "Grand Canal Dock", "Grangegorman", "Greenhills, Dublin", "Harmonstown", "Harmonstown railway station", "Harold's Cross", "Harvard University Press", "Holywell, Swords", "Hot Press", "Howth", "Huntstown and Littlepace", "Inchicore", "Industrial Schools in Ireland", "Irish Independent", "Irish Rebellion of 1641", "Irish Standard Time", "Irish grid reference system", "Irish language", "Irishtown, Dublin", "Jason Barry", "Jeff Hendrick", "Jobstown", "Johannes de Sacrobosco", "John Alen", "Johnstown, Dublin", "Kevin Doherty (footballer)", "Kilbarrack", "Kill of the Grange", "Killester", "Killester Basketball Club", "Killester railway station", "Killiney", "Kilmacud", "Kilmainham", "Kilmore, Dublin", "Kilmore West", "Kilternan", "Kimmage", "Kinsealy", "Knocklyon", "Knocksedan, Swords", "Larry Mullen Jr.", "Leinster", "Leinster Colleges Senior Football Championship", "Leopardstown", "Liam Cunningham (actor)", "Liam McCormick", "List of parishes of the Roman Catholic Archdiocese of Dublin by deanery", "List of towns and villages in the Republic of Ireland", "Local government in the Republic of Ireland", "Loughlinstown", "Loughshinny", "Love/Hate (TV series)", "Lucan, Dublin", "Lusk, Dublin", "Malahide", "Man of War, Fingal", "Marino, Dublin", "Mary Street, Dublin", "Milltown, Dublin", "Monkstown, County Dublin", "Mount Merrion", "Mulhuddart", "National Inventory of Architectural Heritage", "Naul, Dublin", "Newcastle, South Dublin", "Newcastle United F.C.", "Nicky Ryan", "North Strand", "North Wall, Dublin", "Northside, Dublin", "Northside (Dublin)", "Oldbawn", "Oldtown, Dublin", "Ongar, Dublin", "Oxmantown", "Palmerstown", "Palmerstown, Fingal", "Parish", "Paul Kimmage", "Perrystown", "Peter Snow", "Phibsborough", "Point Village", "Poolbeg", "Poppintree", "Portmarnock", "Portobello, Dublin", "Portrane", "Priorswood, Dublin", "Provinces of Ireland", "Raheny", "Ranelagh", "Rathbeale, Swords", "Rathcoole, County Dublin", "Rathfarnham", "Rathgar", "Rathmichael", "Rathmines", "Ray Shah", "Republic of Ireland", "Republic of Ireland national football team", "Rialto, Dublin", "Ringsend", "River Liffey", "Robert de Holywood", "Rockbrook", "Rolestown", "Roma Ryan", "Roman Catholic", "Roman Catholic Archdiocese of Dublin", "Rush, Dublin", "Russian battleship Potemkin", "Ruth Brandt", "Saggart", "Sallynoggin", "Sandycove", "Sandyford", "Sandymount", "Santry", "Shankill, Dublin", "Shelbourne FC", "Sheriff Street", "Silken Thomas", "Sir Charles Coote, 1st Baronet", "Skerries, Dublin", "Smithfield, Dublin", "Southside, Dublin", "Spencer Dock", "Springhill, Dublin", "Stardust Memorial Park", "Stardust fire", "Stepaside, Dublin", "Stephen Cluxton", "Stillorgan", "Stoneybatter", "Strawberry Beds", "Summerhill, Dublin", "Sutton, Dublin", "Swords, Dublin", "Tallaght", "Telephone numbering plan", "Templeogue", "Terenure", "Tesco Ireland", "The Liberties, Dublin", "Thomas Kettle", "Thomas St. Lawrence (judge)", "Time zone", "Titanic (1997 film)", "Tyrrelstown", "U2", "UTC+0", "UTC-1", "Urban area", "VIAF (identifier)", "Veronica Guerin", "Walkinstown", "West European Time", "Western European Summer Time", "Whitechurch, County Dublin", "Whitehall, Dublin", "Willie Walsh (Irish businessman)", "Windy Arbour"]}