{"url": "https://en.wikipedia.org/wiki/Astro_Boy_(film)", "title": "Astro Boy (film)", "summary": "Astro Boy is a 2009 American computer-animated superhero film loosely based on the manga series of the same name by the Japanese writer and illustrator Osamu Tezuka. Produced by the Hong Kong-based company Imagi Animation Studios, it was directed by David Bowers, who co-wrote the screenplay with Timothy Hyde Harris. The film stars Freddie Highmore, Kristen Bell, Nathan Lane, Eugene Levy, Matt Lucas, Bill Nighy, Samuel L. Jackson, Donald Sutherland, Charlize Theron, and Nicolas Cage.\nThe film was first released in Hong Kong on October 8, 2009, and in the United States on October 23, 2009. It received generally mixed reviews from film critics and was a  financial failure, earning $42 million worldwide against its $65 million budget. As a result of the film's poor performance, Imagi shut down on February 5, 2010, and Astro Boy became the last film produced by the studio.", "content": "Astro Boy is a 2009 American computer-animated superhero film loosely based on the manga series of the same name by the Japanese writer and illustrator Osamu Tezuka. Produced by the Hong Kong-based company Imagi Animation Studios, it was directed by David Bowers, who co-wrote the screenplay with Timothy Hyde Harris. The film stars Freddie Highmore, Kristen Bell, Nathan Lane, Eugene Levy, Matt Lucas, Bill Nighy, Samuel L. Jackson, Donald Sutherland, Charlize Theron, and Nicolas Cage.\nThe film was first released in Hong Kong on October 8, 2009, and in the United States on October 23, 2009. It received generally mixed reviews from film critics and was a  financial failure, earning $42 million worldwide against its $65 million budget. As a result of the film's poor performance, Imagi shut down on February 5, 2010, and Astro Boy became the last film produced by the studio.\n\n\n== Plot ==\nIn the 22nd century, Toby Tenma is a teenager who lives in the futuristic city-state of Metro City, which floats above the polluted surface on Earth. His father, Dr. Tenma, works at the Ministry of Science, alongside Dr. Elefun. They create the Peacekeeper, an advanced defensive robot that is powered using two powerful energy spheres that emit respective opposing positive and negative energy and respectively in colors blue and red, discovered by Dr. Elefun. The two scientists brief the President of Metro City, Stone, who is running for re-election. Against the scientists' warnings, Stone loads the negative red colored core into the Peacekeeper, causing it to go on a rampage. Toby is accidentally killed by the Peacekeeper, as it attempts to violently leave the research facility before it is put down by Dr. Elefun.\nA distraught-driven Tenma revives Toby as a robot programmed with all his memories, but also makes his body with built-in defenses to protect him. Powered by the positive blue colored core, the robot activates and believes himself to be Toby, but although he has his original brain and a similar personality, Tenma realizes he could never be revived as the son he lost. Toby discovers his new robot capabilities including the ability to understand non-talking robots and rocket-powered flight. Stone has his forces pursue Toby, but the chase leads to him falling off the city's edge when Stone's flagship blasts him with missiles. Meanwhile, Tenma escapes arrest by agreeing to disable Toby and give up the blue core.\nToby awakens in an enormous junkyard, created from the redundant robots of Metro City it dumped there. He meets a group of orphaned children, Zane, Sludge, Widget, and Cora, accompanied by a dog-like robot named Trashcan. Toby also meets the members of the Robot Revolutionary Front (RRF), Sparx, Robotsky, and Mike the Fridge, who plan to free robots from mankind's control, but are very inept and bound by the Laws of Robotics. While attempting to recruit him for their cause, they rename Toby \"Astro Boy\". Hamegg, the caretaker of the orphans, takes Astro in. The next day, Astro comes across an old, offline construction robot named Zog, whom he reactivates through sharing some of the Blue Core's energy. Hamegg scans Astro, finding he is actually a robot, and paralyzes Astro with his electrical-blaster to use him in the fighting ring.\nAstro reluctantly defeats Hamegg's fighters until Zog gets deployed. Astro and Zog refuse to fight and Hamegg attempts to disable both of them, but Zog, who predates the Laws of Robotics, fights back. Zog nearly kills Hamegg but gets saved by Astro, shocking the crowd. Moments later, Stone's forces arrive to take Astro back to Metro City, and he willingly surrenders himself. Astro reunites with Tenma and Elefun and allows them to disable him. Realizing even though Astro is not Toby, he is still his son, Dr. Tenma defies Stone, reactivates Astro, and lets him escape. Angry, Stone reloads the Red Core into the Peacekeeper to send it after Astro, only for it to absorb and merge with him. The Peacekeeper absorbs weapons and buildings, becoming bigger and stronger, and attacks Metro City, prompting Astro to battle it. Metro City's power station gets destroyed during the fight, causes the city to fall, and Astro uses his superhuman strength to help it land safely.\nThe Peacekeeper tries absorbing Astro to get his Blue Core using the Red Core, but the cores' connection causes a violent reaction and separates them. Dr. Tenma tells Astro that the two cores united can destroy themselves. The Peacekeeper captures Astro's friends from the junkyard, and he flies into the Red Core, sacrificing himself to destroy it, while Stone survives from its destruction and gets arrested for his actions. As Elefun and the children find Astro's body, Zog reactivates Astro by sharing back the Blue Core energy that reactivated him, and Astro reunites with all his friends and his father. The city is later attacked by a monstrous cycloptic extraterrestrial, but Astro punches it as he leaps into action.\n\n\n== Cast ==\n\nFreddie Highmore as Toby Tenma/Astro Boy, Astro is a robot of Toby, Dr. Tenma's teenager son.\nNicolas Cage as Dr. Tenma, Toby's father, Astro's creator, and the head of the Ministry of Science of Metro City.\nKristen Bell as Cora, a teenager girl who lives on the Earth's surface and befriends Astro.\nSamuel L. Jackson as Zog, a 100-year-old construction robot brought back to life by Astro Boy's blue-core energy.\nMatt Lucas as Sparx, the leader of the Robot Revolutionary Front.\nEugene Levy as Orrin, Tenma's cowardly robot household servant.\nBill Nighy as Dr. Elefun, Dr. Tenma's best friend & associate; and as Robotsky, the muscle of the Robot Revolutionary Front.\nDonald Sutherland as President Stone, a ruthless, rogue, and ambitious President of Metro City who is running for re-election.\nNathan Lane as Hamegg, a surface-dweller who repairs machines and then uses them in his fighting tournament.\nCharlize Theron as the \"Our Friends\" narrator, the voice used for an educational video seen at the film's beginning.\nDavid Bowers as Mike the Fridge, a talking refrigerator and third member of the Robot Revolutionary Front.\nMoisés Arias as Zane, a surface-dwelling child.\nAlan Tudyk as Mr. Squeegee, a cleaning robot that Astro encounters.\nDavid Alan Grier as Mr. Squirt, a cleaning robot that Astro encounters.\nMadeline Carroll as Widget, Sludge's twin.\nSterling Beaumon as Sludge, Widget's twin.\nDee Bradley Baker as Trashcan, a dog-like robot that eats the rubbish.\nElle Fanning as Grace, a girl from Hamegg's house who kicks President Stone's leg.\nRyan Stiles as Mr. Mustachio, Toby's teacher.\nNewell Alexander as General Heckler, President Stone's assistant.\nVictor Bonavida as Sam, a teenage boy from Hamegg's house.\nTony Matthews as Cora's dad.\nBob Logan as Stinger One, former President Stone's pilot man who leads a group of aircraft with suction tubes and is dispatched to arrest Astro.\nRyan Ochoa as Rick, another teenage boy from Hamegg's house.\n\n\n== Production ==\n\n\n=== Development ===\nIn 1997, Sony Pictures Entertainment purchased the film rights to Astro Boy from Tezuka Productions, intending to produce a live-action feature film. Todd Alcott was set to write the screenplay, but the film halted in 2000 when Steven Spielberg began A.I. (2001), another film with a robot boy who replaces a dead child. In December 2001, Sony hired Eric Leighton to direct an all-CGI film, with Angry Films and Jim Henson Productions producing it for a 2004 release. A screenplay draft was written, but the film did not go into production, and Leighton left in early 2003 to pursue other film projects. In June 2004, animator and Dexter's Laboratory creator Genndy Tartakovsky was hired to direct a live-action/animatronics/CGI feature film. After writing the script, the film didn't go into the production, and Tartakovsky left next year to direct 3-D-animated feature films at a new studio, Orphanage Animation Studios. Few months later it was revealed, that he was set to direct The Dark Crystal (1982) sequel, The Power of the Dark Crystal, another co-production with Jim Henson Productions. In September 2006, it was announced that Hong Kong-based animation firm Imagi Animation Studios would produce a CGI animated Astro Boy film, with Colin Brady directing it. A year later, the studio made a three-picture distribution deal with Warner Bros. and The Weinstein Company, which also included TMNT (2007) and Gatchaman. In 2008, Summit Entertainment took over the film's distribution rights. The same year, Brady was replaced with David Bowers, who previously directed Flushed Away (2006), the last project under the relationship between DreamWorks Animation, the creators of the Shrek and Madagascar franchises and Aardman, the creators of the Wallace & Gromit franchise and Chicken Run.\n\n\n=== Design ===\n\nLike Imagi did with TMNT, the film was animated on Maya and rendered on Pixar's RenderMan at Imagi's Los Angeles facility and it's main studio in Hong Kong. Some changes to Astro's design had to be made in order to appeal to a western audience and making the leap from 2D to 3D. The more challenging was his kawaii portrayal, part of which were his large eyes and curly eyelashes, features that the filmmakers thought made him too feminine. Imagi had several discussions on how round and curvy Astro's body proportions should be and in the end they were made slimmer.\nThe by-product of these changes was Astro's Caucasian look. In early development Astro's design was younger, resembling his iconic design of a 9-year-old boy. The design team changed that and made him look like a 13-year-old to appeal to a larger audience. They also gave him a white shirt, and a blue jacket since they thought it would be strange to have a normal boy running around without one. They also replaced his heart-shaped energy core with a glowing blue one.\n\n\n=== Music ===\nThe score to Astro Boy was composed by John Ottman, who recorded his score with a 95-piece orchestra and choir at Abbey Road Studios. A soundtrack album was released on October 20, 2009, by Varèse Sarabande Records.\nSongs in Astro Boy not composed by John Ottman are as follows: \nBreezy Day, composed by Roger-Roger.\nAlright, written by Daniel Goffey, Gaz Coombes, and Michael Quinn and performed by Supergrass.\nMarching Down the Field, composed by Harry Edwards.\n\n\n== Release ==\n\n\n=== Marketing ===\nSummit Entertainment partnered with McDonald's to produce marketing tie-ins for Astro Boy. Beginning in May 2009 and continuing through September 2009, IDW Publishing published a \"prequel\" and comic book adaptation of the film as both mini-series and in graphic novel format to coincide with the North American release of the film in October 2009. A model of a motionless Astro Boy waiting to be powered up was set up at Peak Tower, Hong Kong, outside Madame Tussauds Hong Kong in September 2009. A panel of the film was held at the San Diego Comic-Con on July 23, 2009.\n\n\n=== Home media ===\nAstro Boy was released on DVD and Blu-ray in the United States on March 16, 2010 by Summit Entertainment. Both releases include two new animated sequences, a featurette with the voice cast, three other featurettes about drawing Astro Boy, making an animated movie and getting the Astro Boy look, and an image gallery.In Japan, a limited edition Astro Boy premium box set was released on April 2, 2010. It featured the same content from the American release with the exception of it spanning two DVD discs (one containing the film, the other containing special features with two that are exclusive to Japan) and has both English and Japanese dub (along with English and Japanese subtitles.) The box set also comes with a DVD (containing a single story on Astro's first flight and an image gallery), Dr Tenma's Project Notes (featuring 80 pages of 3-D-CGI models, character art and set designs from the film), a Micro SD (featuring the motion manga Atomu Tanjo (Birth of Astro Boy) originally written by Osamu Tezuka), a postcard of 1980 Astro Boy flying, a small bookmark (a reel from the film inside a plastic cover), and Astro's blueprints from the film.\n\n\n== Reception ==\n\n\n=== Critical response ===\nOn the review aggregator website Rotten Tomatoes, the film has an approval rating of 50% based on 139 reviews, with an average score of 5.6/10. The website's critical consensus reads, \"While it isn't terribly original, and it seems to have a political agenda that may rankle some viewers, Astro Boy boasts enough visual thrills to please its target demographic.\" On Metacritic, the film has a weighted average score of 53 out of 100 based on 22 critics, indicating \"mixed or average reviews\".Owen Gleiberman of Entertainment Weekly gave the film a B and wrote that it had a \"little too much lost-boys-and-girls mopiness\", but \"Astro Boy is a marvelously designed piece of cartoon kinetics...\" Glenn Whipp of the Los Angeles Times gave the mixed review claiming \"The kids won't get it but will enjoy the big, climactic robot rumpuses, which owe a heavy debt to Brad Bird's The Iron Giant (1999)\". Manohla Dargis of The New York Times gave it a mixed review, criticizing the film's confused tonal mixture of darkness and \"commercially motivated\" optimism. Conversely, Roger Ebert gave the film three out of four stars, stating that \"The movie contains less of its interesting story and more action and battle scenes than I would have preferred. [...] Still, 'Astro Boy' is better than most of its recent competitors, such as 'Monsters vs. Aliens' and 'Kung Fu Panda.'\"\n\n\n=== Box office ===\nThe film was a flop in Japan, appearing at the bottom of the opening week's Top 10 rankings and earning only $328,457. Conversely, the film was very successful in China, breaking a box-office record for a CGI animated film. This follows the same pattern as Dragonball Evolution (2009) and Speed Racer (2008), other American-produced films based on Japanese sources that were not big hits in the land of their origin but were very successful in China. The film also was a box office bomb in the U.S., opening at #6, grossing $6.7 million, losing out to the similarly retro Where the Wild Things Are (2009). It remained in the Top 10 for three weeks. When it closed in January 2010, it had a total gross of $20 million. Due to these factors, the film would only produce a worldwide gross of $44.6 million against a $65 million budget.\n\n\n== Video game ==\n\nA video game based on the film was released on October 20, 2009, by D3 Publisher to coincide with the film's theatrical release. The Wii, PlayStation 2 and PSP versions were developed by High Voltage Software, and the Nintendo DS version by Art Co., Ltd.\n\n\n== References ==\n\n\n== External links ==\nOfficial website (archived)\nAstro Boy at IMDb\nAstro Boy at AllMovie", "links": ["A.I. Artificial Intelligence", "A Thousand and One Nights (1969 film)", "Aardman", "Abbey Road Studios", "Age of Adventure", "Alabaster (manga)", "Alakazam the Great", "Alan Tudyk", "AllMovie", "Alright (Supergrass song)", "Ambassador Atom", "Ambassador Magma", "Angel's Hill", "Angel Gunfighter", "Angry Films", "Anime News Network", "Animerama", "Apollo's Song", "Art Co., Ltd", "Astro Boy", "Astro Boy: Mighty Atom - Visitor of 100,000 Light Years, IGZA", "Astro Boy: Mighty Atom – Visitor of 100,000 Light Years, IGZA", "Astro Boy: Omega Factor", "Astro Boy: Tap Tap Rush", "Astro Boy: The Video Game", "Astro Boy (1963 TV series)", "Astro Boy (1980 TV series)", "Astro Boy (2003 TV series)", "Astro Boy (2004 video game)", "Astro Boy (character)", "Atom: The Beginning", "Autodesk Maya", "Ayako (manga)", "Bagi, the Monster of Mighty Nature", "Belladonna of Sadness", "Big X", "Biiko-chan", "Bill Nighy", "Birdman Anthology", "Black Jack (manga)", "Black Jack (manga character)", "Blu-ray", "Blue Blink", "Bomba!", "Box office bomb", "Brad Bird", "Brave Dan", "Buddha (manga)", "Busan", "Captain Ken", "Charlize Theron", "Chicken Run", "Chief Detective Kenichi", "City-state", "Cleopatra (1970 film)", "Colin Brady", "Computer-animated", "Crime and Punishment (manga)", "D3 Publisher", "DVD", "David Alan Grier", "David Bowers (director)", "Dee Bradley Baker", "Dexter's Laboratory", "Diary of Ma-chan", "Diary of a Wimpy Kid: Dog Days (film)", "Diary of a Wimpy Kid: Rodrick Rules (film)", "Diary of a Wimpy Kid: The Long Haul (film)", "Digital Monster X-Evolution", "Don Dracula", "Donald Sutherland", "Dororo", "Dororo (1969 TV series)", "Dororo (2019 TV series)", "Dr. Elefun", "Dr. Tenma", "Dr. Thrill", "Dragonball Evolution", "DreamWorks Animation", "Duke Goblin", "Earth", "Elle Fanning", "Entertainment Weekly", "Eugene Levy", "Fandango Media", "Father of the Pride", "Faust (manga)", "Flushed Away", "Freddie Highmore", "Galaxy Boy Troop", "Gatchaman", "Gaz Coombes", "Genndy Tartakovsky", "Go Astro Boy Go!", "Gokū no Daibōken", "Grand Dolls", "Gringo (manga)", "Gum Gum Punch", "Hamegg", "Hidamari no Ki", "High Voltage Software", "Highlander: The Search for Vengeance", "Hosuke Sharaku", "IMDb", "Imagi Animation Studios", "In the Beginning: The Bible Stories", "Jetter Mars", "Jim Henson Productions", "John Ottman", "Jungle Emperor Leo", "Kadokawa Daiei Studio", "Kawaii", "Kimba the White Lion", "Kristen Bell", "Kung Fu Panda", "Laws of Robotics", "Leo the Lion (TV series)", "Lion Books", "List of Astro Boy (1963 TV series) episodes", "List of Astro Boy (1980 TV series) episodes", "List of Astro Boy (2003 TV series) episodes", "List of Astro Boy chapters", "List of Astro Boy characters", "List of Osamu Tezuka anime", "List of Osamu Tezuka manga", "Little Astro Boy", "Little Wansa", "Los Angeles Times", "Lost World (manga)", "Ludwig B", "MRC (company)", "MW (manga)", "Madagascar (franchise)", "Madame Tussauds Hong Kong", "Madeline Carroll", "Manohla Dargis", "Marvelous Melmo", "Matt Lucas", "McDonald's", "Message to Adolf", "Metacritic", "Metropolis (2001 film)", "Metropolis (manga)", "Mick Quinn", "Microsuperman", "Mighty Atom (1988 video game)", "Mighty Atom (1994 video game)", "Mighty Atom (TV series)", "Moisés Arias", "Monsters vs. Aliens", "Mr. Mustachio", "Mushi Production", "Naoki Urasawa", "Nathan Lane", "Nextworld", "Nicolas Cage", "Nintendo DS", "Nintendo Entertainment System", "Ode to Kirihito", "Osamu Tezuka", "Osamu Tezuka's Star System", "Otaku USA", "Owen Gleiberman", "Peak Tower", "Phoenix (manga)", "Phoenix 2772", "PlayStation 2", "PlayStation Portable", "Pluto (manga)", "Princess Knight", "Rainbow Parakeet", "Rainbow Prelude", "Ravex in Tezuka World", "Red Ventures", "RenderMan Interface Specification", "Robita", "Robot", "Rock (manga)", "RogerEbert.com", "Roger Ebert", "Rotten Tomatoes", "Ryan Ochoa", "Ryan Stiles", "Samuel L. Jackson", "San Diego Comic-Con", "Shin Takarajima", "Short film", "Shrek (franchise)", "Son of Godfather", "Sony Pictures Entertainment", "Speed Racer (film)", "Sterling Beaumon", "Steven Spielberg", "Summit Entertainment", "Super Famicom", "Supergrass", "Superhero film", "Suspicion (manga)", "Swallowing the Earth", "TMNT (film)", "Tezuka Award", "Tezuka Osamu Cultural Prize", "Tezuka Productions", "The Adventure of Rock", "The Amazing 3", "The Book of Human Insects", "The Crater", "The Dark Crystal", "The Devil of the Earth", "The Film Lives On", "The Fossil Island", "The Hollywood Reporter", "The Iron Giant", "The New Adventures of Kimba The White Lion", "The New York Times", "The Numbers (website)", "The Original Astro Boy", "The Orphanage (company)", "The Osamu Tezuka Story: A Life in Manga and Anime", "The Thief Akikazu Inoue", "The Three-Eyed One", "The Vampires (manga)", "The Weinstein Company", "Tie-in", "Timothy Harris (writer)", "Todd Alcott", "Tokiwa-sō", "Triton of the Sea", "Undersea Super Train: Marine Express", "Unico", "Variety (magazine)", "Varèse Sarabande Records", "Wallace & Gromit", "Warner Bros.", "Weighted average", "Where the Wild Things Are (film)", "Wii", "Zentrix"]}