{"url": "https://en.wikipedia.org/wiki/Athletics_at_the_1932_Summer_Olympics_%E2%80%93_Men%27s_100_metres", "title": "Athletics at the 1932 Summer Olympics – Men's 100 metres", "summary": "The men's 100 metres sprint event at the 1932 Summer Olympics in Los Angeles, California, United States, were held at the Los Angeles Memorial Coliseum on July 31 and August 1. Thirty-three runners from 17 nations competed. The 1930 Olympic Congress in Berlin had reduced the limit from 4 athletes per NOC to 3 athletes.The photo finish final was won by American Eddie Tolan in a world record-equalling time of 10.38 seconds. Teammate Ralph Metcalfe won the silver and was credited with the same time as Tolan. It was the first American victory since 1920, after the United States was kept off the podium entirely in 1928. Germany won its second consecutive bronze medal in the event. Defending Olympic champion and world record holder Percy Williams of Canada did not advance past the semifinals. Takayoshi Yoshioka was the first Asian to make the final.", "content": "The men's 100 metres sprint event at the 1932 Summer Olympics in Los Angeles, California, United States, were held at the Los Angeles Memorial Coliseum on July 31 and August 1. Thirty-three runners from 17 nations competed. The 1930 Olympic Congress in Berlin had reduced the limit from 4 athletes per NOC to 3 athletes.The photo finish final was won by American Eddie Tolan in a world record-equalling time of 10.38 seconds. Teammate Ralph Metcalfe won the silver and was credited with the same time as Tolan. It was the first American victory since 1920, after the United States was kept off the podium entirely in 1928. Germany won its second consecutive bronze medal in the event. Defending Olympic champion and world record holder Percy Williams of Canada did not advance past the semifinals. Takayoshi Yoshioka was the first Asian to make the final.\n\n\n== Background ==\nThis was the ninth time the event was held, having appeared at every Olympics since the first in 1896. Notable entrants included Canada's Percy Williams, the defending gold medalist and world record holder, and American Ralph Metcalfe, NCAA champion and U.S. Olympic trial winner.Two electrical timing devices, one hand-operated and one camera-based, were introduced to \"double check\" the stop watches.China was represented in the event for the first time. The United States was the only nation to have appeared at each of the first nine Olympic men's 100 metres events.\n\n\n== Competition format ==\nThe event retained the four round format from 1920–1928: heats, quarterfinals, semifinals, and a final. There were 7 heats, of 4–6 athletes each, with the top 3 in each heat advancing to the quarterfinals. The 21 quarterfinalists (19 after two withdrawals) were placed into 4 heats of 4 or 5 athletes. Again, the top 3 advanced. There were 2 heats of 6 semifinalists, once again with the top 3 advancing to the 6-man final.\n\n\n== Records ==\nThese are the standing world and Olympic records (in seconds) prior to the 1932 Summer Olympics.\n\nArthur Jonath equalled the standing Olympic record with 10.6 in the third heat of the first round. Eddie Tolan set a new Olympic record with 10.4 in the first heat of the quarterfinals, and in the final, Tolan and Ralph Metcalfe equalled the world record of 10.3.\n\n\n== Results ==\n\n\n=== Heats ===\n\n\n==== Heat one ====\n\n\n==== Heat two ====\n\n\n==== Heat three ====\n\n\n==== Heat four ====\n\n\n==== Heat five ====\n\n\n==== Heat six ====\n\n\n==== Heat seven ====\n\n\n=== Quarterfinals ===\nBerra and Lambrou withdrew before the quarterfinals.\n\n\n==== Quarterfinal one ====\n\n\n==== Quarterfinal two ====\n\n\n==== Quarterfinal three ====\n\n\n==== Quarterfinal four ====\n\n\n=== Semifinals ===\n\n\n==== Semifinal one ====\nThe finish was so close that the timing system displayed errors.\nFilm of the race indicates that Yoshioka won with Joubert second and Tolan third, while officials clocked Tolan at 10.81 seconds, with Joubert also at 10.81 seconds, and Yoshioka at 10.83 seconds. \nHowever, this discrepancy was a moot point, as all three men advanced to the final in any event.\n\n\n==== Semifinal two ====\n\n\n=== Final ===\nUnder the rules in force at the time, runners were judged to have finished the race when they had crossed the line; in 1933, this was changed so that runners finished the race when they reached the line.\nThe final was close enough that had this rule been in force at the Games, Metcalfe would have been the winner: Melcalfe reached the finish line first, but Tolan, who was shorter, crossed the line first.\n\n\n== References ==\n\n\n== External links ==\n[1], from http://www.omegawatches.com/; retrieved 2012-10-01.", "links": ["10,000 metres", "100 metres", "100 metres at the Olympics", "110 metres hurdles", "1500 metres", "1932 Summer Olympics", "200 metres", "400 metres", "400 metres hurdles", "4 × 100 metres relay", "4 × 400 metres relay", "5000 metres", "60 metres at the Olympics", "800 metres", "Allan Elliot", "Amsterdam", "Andrej Engel", "André Théard", "Angelos Lambrou", "Antwerp", "António Rodrigues (athlete)", "Argentina at the 1932 Summer Olympics", "Arthur Jonath", "Athletics at the 1896 Summer Olympics – Men's 100 metres", "Athletics at the 1900 Summer Olympics – Men's 100 metres", "Athletics at the 1900 Summer Olympics – Men's 60 metres", "Athletics at the 1904 Summer Olympics – Men's 100 metres", "Athletics at the 1904 Summer Olympics – Men's 60 metres", "Athletics at the 1906 Intercalated Games – Men's 100 metres", "Athletics at the 1908 Summer Olympics – Men's 100 metres", "Athletics at the 1912 Summer Olympics – Men's 100 metres", "Athletics at the 1920 Summer Olympics – Men's 100 metres", "Athletics at the 1924 Summer Olympics – Men's 100 metres", "Athletics at the 1928 Summer Olympics – Men's 100 metres", "Athletics at the 1928 Summer Olympics – Women's 100 metres", "Athletics at the 1932 Summer Olympics", "Athletics at the 1932 Summer Olympics – Men's 10,000 metres", "Athletics at the 1932 Summer Olympics – Men's 110 metres hurdles", "Athletics at the 1932 Summer Olympics – Men's 1500 metres", "Athletics at the 1932 Summer Olympics – Men's 200 metres", "Athletics at the 1932 Summer Olympics – Men's 3000 metres steeplechase", "Athletics at the 1932 Summer Olympics – Men's 400 metres", "Athletics at the 1932 Summer Olympics – Men's 400 metres hurdles", "Athletics at the 1932 Summer Olympics – Men's 4 × 100 metres relay", "Athletics at the 1932 Summer Olympics – Men's 4 × 400 metres relay", "Athletics at the 1932 Summer Olympics – Men's 5000 metres", "Athletics at the 1932 Summer Olympics – Men's 50 kilometres walk", "Athletics at the 1932 Summer Olympics – Men's 800 metres", "Athletics at the 1932 Summer Olympics – Men's decathlon", "Athletics at the 1932 Summer Olympics – Men's discus throw", "Athletics at the 1932 Summer Olympics – Men's hammer throw", "Athletics at the 1932 Summer Olympics – Men's high jump", "Athletics at the 1932 Summer Olympics – Men's javelin throw", "Athletics at the 1932 Summer Olympics – Men's long jump", "Athletics at the 1932 Summer Olympics – Men's marathon", "Athletics at the 1932 Summer Olympics – Men's pole vault", "Athletics at the 1932 Summer Olympics – Men's shot put", "Athletics at the 1932 Summer Olympics – Men's triple jump", "Athletics at the 1932 Summer Olympics – Women's 100 metres", "Athletics at the 1932 Summer Olympics – Women's 4 × 100 metres relay", "Athletics at the 1932 Summer Olympics – Women's 80 metres hurdles", "Athletics at the 1932 Summer Olympics – Women's discus throw", "Athletics at the 1932 Summer Olympics – Women's high jump", "Athletics at the 1932 Summer Olympics – Women's javelin throw", "Athletics at the 1936 Summer Olympics – Men's 100 metres", "Athletics at the 1936 Summer Olympics – Women's 100 metres", "Athletics at the 1948 Summer Olympics – Men's 100 metres", "Athletics at the 1948 Summer Olympics – Women's 100 metres", "Athletics at the 1952 Summer Olympics – Men's 100 metres", "Athletics at the 1952 Summer Olympics – Women's 100 metres", "Athletics at the 1956 Summer Olympics – Men's 100 metres", "Athletics at the 1956 Summer Olympics – Women's 100 metres", "Athletics at the 1960 Summer Olympics – Men's 100 metres", "Athletics at the 1960 Summer Olympics – Women's 100 metres", "Athletics at the 1964 Summer Olympics – Men's 100 metres", "Athletics at the 1964 Summer Olympics – Women's 100 metres", "Athletics at the 1968 Summer Olympics – Men's 100 metres", "Athletics at the 1968 Summer Olympics – Women's 100 metres", "Athletics at the 1972 Summer Olympics – Men's 100 metres", "Athletics at the 1972 Summer Olympics – Women's 100 metres", "Athletics at the 1976 Summer Olympics – Men's 100 metres", "Athletics at the 1976 Summer Olympics – Women's 100 metres", "Athletics at the 1980 Summer Olympics – Men's 100 metres", "Athletics at the 1980 Summer Olympics – Women's 100 metres", "Athletics at the 1984 Summer Olympics – Men's 100 metres", "Athletics at the 1984 Summer Olympics – Women's 100 metres", "Athletics at the 1988 Summer Olympics – Men's 100 metres", "Athletics at the 1988 Summer Olympics – Women's 100 metres", "Athletics at the 1992 Summer Olympics – Men's 100 metres", "Athletics at the 1992 Summer Olympics – Women's 100 metres", "Athletics at the 1996 Summer Olympics – Men's 100 metres", "Athletics at the 1996 Summer Olympics – Women's 100 metres", "Athletics at the 2000 Summer Olympics – Men's 100 metres", "Athletics at the 2000 Summer Olympics – Women's 100 metres", "Athletics at the 2004 Summer Olympics – Men's 100 metres", "Athletics at the 2004 Summer Olympics – Women's 100 metres", "Athletics at the 2008 Summer Olympics – Men's 100 metres", "Athletics at the 2008 Summer Olympics – Women's 100 metres", "Athletics at the 2012 Summer Olympics – Men's 100 metres", "Athletics at the 2012 Summer Olympics – Women's 100 metres", "Athletics at the 2016 Summer Olympics – Men's 100 metres", "Athletics at the 2016 Summer Olympics – Women's 100 metres", "Athletics at the 2020 Summer Olympics – Men's 100 metres", "Athletics at the 2020 Summer Olympics – Women's 100 metres", "Athletics at the Summer Olympics", "Belgium", "Bert Pearson (athlete)", "Brazil at the 1932 Summer Olympics", "Bunoo Sutton", "California", "Canada", "Canada at the 1932 Summer Olympics", "Carlos Bianchi (athlete)", "Charlie Paddock", "Chris Berger", "Czechoslovakia at the 1932 Summer Olympics", "Danie Joubert", "Decathlon", "Discus throw", "Donald Lippincott", "Eddie Tolan", "Ernie Page (athlete)", "Ernst Geerling", "Fernando Ortíz (athlete)", "Fernando Ramírez (Mexican athlete)", "France", "Fred Reid (athlete)", "George Simpson (sprinter)", "Germany at the 1932 Summer Olympics", "Grantland Rice", "Great Britain at the 1932 Summer Olympics", "Greece at the 1932 Summer Olympics", "Haiti at the 1932 Summer Olympics", "Hammer throw", "Harold Abrahams", "Harold Wright (athlete)", "Helmut Körnig", "High jump", "Héctor Berra", "India at the 1932 Summer Olympics", "Izuo Anno", "Japan at the 1932 Summer Olympics", "Javelin throw", "Jesús Moraila", "José de Almeida", "List of Olympic records in athletics", "List of world records in athletics", "Liu Changchun", "Long jump", "Los Angeles", "Los Angeles Memorial Coliseum", "Marathon", "Mario Marques (athlete)", "Mexico at the 1932 Summer Olympics", "Netherlands", "Netherlands at the 1932 Summer Olympics", "New Zealand at the 1932 Summer Olympics", "North American Newspaper Alliance", "Paris", "Percy Williams (sprinter)", "Photo finish", "Pole vault", "Portugal at the 1932 Summer Olympics", "Racewalking", "Ralph Metcalfe", "Republic of China at the 1932 Summer Olympics", "Ricardo Guimarães (athlete)", "Robert McAllister (athlete)", "Ronald Vernieux", "Samuel Giacosa", "Shot put", "South Africa", "South Africa at the 1932 Summer Olympics", "Sprint (running)", "Stanley Fuller", "Steeplechase (athletics)", "Stockholm", "Sweden", "Taiwan", "Takayoshi Yoshioka", "Toronto", "Triple jump", "United Kingdom", "United States", "United States at the 1932 Summer Olympics", "Wilfred Legg", "World record progression 100 metres men", "YouTube"]}