{
    "url": "https://en.wikipedia.org/wiki/Autosplenectomy",
    "title": "Autosplenectomy",
    "summary": "An autosplenectomy (from 'auto-' self, '-splen-' spleen, '-ectomy' removal) is a negative outcome of disease and occurs when a disease damages the spleen to such an extent that it becomes shrunken and non-functional. The spleen is an important immunological organ that acts as a filter for red blood cells, triggers phagocytosis of invaders, and mounts an immunological response when necessary. Lack of a spleen, called asplenia, can occur by autosplenectomy or the surgical counterpart, splenectomy. Asplenia can increase susceptibility to infection.  Autosplenectomy can occur in cases of sickle-cell disease where the misshapen cells block blood flow to the spleen, causing scarring and eventual atrophy of the organ. Autosplenectomy is a rare condition that is linked to certain diseases but is not a common occurrence. It is also seen in systemic lupus erythematosus (SLE).",
    "content": "An autosplenectomy (from 'auto-' self, '-splen-' spleen, '-ectomy' removal) is a negative outcome of disease and occurs when a disease damages the spleen to such an extent that it becomes shrunken and non-functional. The spleen is an important immunological organ that acts as a filter for red blood cells, triggers phagocytosis of invaders, and mounts an immunological response when necessary. Lack of a spleen, called asplenia, can occur by autosplenectomy or the surgical counterpart, splenectomy. Asplenia can increase susceptibility to infection.  Autosplenectomy can occur in cases of sickle-cell disease where the misshapen cells block blood flow to the spleen, causing scarring and eventual atrophy of the organ. Autosplenectomy is a rare condition that is linked to certain diseases but is not a common occurrence. It is also seen in systemic lupus erythematosus (SLE).\n\n\n== Consequences ==\n\nAbsence of effective splenic function or absence of the whole spleen (asplenia) is associated with increased risks of overwhelming post splenectomy infection, especially from polysaccharide encapsulated bacteria and organisms that invade erythrocytes. People without a spleen have a weakened immune system, although other immune organs compensate for the missing spleen.  Vaccination against encapsulated bacteria and prophylactic antibiotics can be used to counteract lowered immunity in asplenic patients. Specifically, people without a spleen are recommended to be vaccinated against pneumonia, influenza, Haemophilus influenzae type b and meningococci.\n\n\n=== Testing for autosplenectomy ===\nOne of the spleen's main tasks is to filter the blood and remove and recycle damaged or old red blood cells. Splenic function can be measured by filtering capabilities, as indicated by number of Howell-Jolly bodies or pitted erythrocytes in the blood. Both of these tests examine whether or not the spleen is functioning normally by testing splenic outputs.\n\n\n==== Howell-Jolly bodies ====\nHowell–Jolly bodies are found on red blood cells and contain chromatin remnants from basophilic cells. Under normal conditions, these nuclear remnants are removed from the blood by the spleen's filtering capabilities. Howell-Jolly bodies can be identified and quantified using a blood smear or by flow cytometry. A high number of Howell-Jolly bodies is indicative of splenic hypofunction and potentially autosplenectomy.\n\n\n==== Pitted erythrocytes ====\nErythrocytes with membrane pits can be indicative of splenic dysfunction as a healthy spleen clears blood of pitted erythrocytes. Pitted erythrocytes can be counted using Normarsky optics. Humans with healthy spleens have less than two percent of their red blood cells contain pits. In comparison, a person with asplenia may have up to 50% of their red blood cells contain pits.\n\n\n== Diseases that cause autosplenectomy ==\n\n\n=== Sickle cell anemia ===\nThe most frequent cause of autosplenectomy is sickle cell anemia which causes progressive splenic hypofunction over time. Increased deoxygenation causes sickling of red blood cells, which adhere to the spleen wall and splenic macrophages causing ischemia.  This ischemia can result in splenic sequestration, where large amounts of blood pool in the spleen but do not flow within vasculature. This lack of blood flow can cause atrophy in the spleen and can lead to autosplenectomy.\n\n\n=== Pneumococcal sepsis ===\nPneumococcal sepsis, or whole-body infection caused by the Streptococcus pneumoniae bacteria, has been reported to cause autosplenectomy but is a very rare and poorly understood complication of the infection.\n\n\n== References ==",
    "links": [
        "Asplenia",
        "Atrophy",
        "Disease",
        "Doi (identifier)",
        "Fibrosis",
        "Haemophilus influenzae",
        "Howell–Jolly body",
        "ISSN (identifier)",
        "Influenza",
        "Ischemia",
        "List of -ectomies",
        "Meningococci",
        "Overwhelming post splenectomy infection",
        "PMC (identifier)",
        "PMID (identifier)",
        "Phagocytosis",
        "Pneumonia",
        "Polysaccharide encapsulated bacteria",
        "Red blood cell",
        "S2CID (identifier)",
        "Sickle-cell disease",
        "Sickle cell anemia",
        "Spleen",
        "Splenectomy",
        "Systemic lupus erythematosus",
        "Vaccination"
    ]
}