{"url": "https://en.wikipedia.org/wiki/Band_society", "title": "Band society", "summary": "A band society, sometimes called a camp, or in older usage, a horde, is the simplest form of human society. A band generally consists of a small kin group, no larger than an extended family or clan. The general consensus of modern anthropology sees the average number of members of a social band at the simplest level of foraging societies with generally a maximum size of 30 to 50 people.", "content": "A band society, sometimes called a camp, or in older usage, a horde, is the simplest form of human society. A band generally consists of a small kin group, no larger than an extended family or clan. The general consensus of modern anthropology sees the average number of members of a social band at the simplest level of foraging societies with generally a maximum size of 30 to 50 people.\n\n\n== Origins of usage in anthropology ==\nBand was one of a set of three terms employed by early modern ethnography to analyse aspects of hunter-gatherer foraging societies. The three were respectively 'horde,' 'band', and 'tribe'. The term 'horde', formed on the basis of a Turkish/Tatar word úrdú (meaning 'camp'), was inducted from its use in the works of J. F. McLennan by Alfred William Howitt and Lorimer Fison in the mid-1880s to describe a geographically or locally defined division within a larger tribal aggregation, the latter being defined in terms of social divisions categorized in terms of descent. Their idea was then developed by A. R. Radcliffe-Brown, as a model for all Australian indigenous societies, the horde being defined as a group of parental families whose married males all belonged to the one patrilineal clan. 'Horde' from the outset bore stereotypical connotations of Australian Aboriginal societies as primitive, closed, rigid and simple, and came to be discarded not only for its implication of 'swarming savages' but also because it suggested a fixed tribal-territorial entity which compromised the actual field data, the field data allowing for a far more fluid concept of the group.In 1936, Julian Steward reformulated Radcliffe Brown's highly restrictive definition, by proposing the idea of a band society at the hunter-gatherer level which could be patrilineal, matrilineal or a composite of both. Over time, 'band' has tended to replace the earlier word 'horde' as more extensive comparative work on hunter-gatherer societies shows they are not classifiable as simply closed patrilineal groups, and better approached in terms of a notion of a flexible, non-exclusive social band, having bilateral relations for marriage and other purposes with similar groups in a circumscribed territory.In 1962, Les Hiatt invalidated Radcliffe-Brown's theory of the horde, demonstrating that the empirical evidence from Aboriginal societies contradicted Radcliffe-Brown's generalisations.The word \"band\" is also used in North America, for example among the indigenous peoples of the Great Basin. With African hunter-gatherers, for instance among the Hadza, the term \"camp\" tends to be used.\n\n\n== Characteristics ==\nBands have a loose organization. They can split up (in spring/summer) or group (in winter camps), as the Inuit, depending on the season, or member families can disperse to join other bands. Their power structure is often egalitarian. The best hunters would have their abilities recognized, but such recognition did not lead to the assumption of authority, as pretensions to control others would be met by disobedience. Judgments determined by collective discussion among the elders were formulated in terms of custom, as opposed to the law-governed and coercive agency of a specialized body, as occurred with the rise of the more complex societies that arose upon the establishment of agriculture.\n\n\n== Definitions and distinctions ==\nA. R. Radcliffe-Brown defined the horde as a fundamental unit of Australian social organizations according to the following five criteria:\n\nIt denotes people who customarily share the same camp and lifestyle.\nIt is the primary landowner of a given territory.\nEach horde was independent and autonomous, regulating its social life by a camp-council, generally under the direction of a headman.\nChildren pertained to the father's horde\nA unified horde identity was affirmed in all relations with external tribes.In his 1975 study, The Notion of the Tribe, Morton Fried defined bands as small, mobile, and fluid social formations with weak leadership that do not generate surpluses, pay taxes or support a standing army.Bands are distinguished from tribes in that tribes are generally larger, consisting of many families. Tribes have more social institutions, such as a chief, big man, or elders. Tribes are also more permanent than bands; a band can cease to exist if only a small group splits off or dies. Many tribes are subdivided into bands. On occasion hordes or bands with common backgrounds and interests could unite as a tribal aggregate in order to wage war, as with the San, or they might convene for collective religious ceremonies, such as initiation rites or to feast together seasonally on an abundant resource as was common in Australian aboriginal societies.  Among the Native Americans of the United States and the First Nations of Canada, some tribes are made up of official bands that live in specific locations, such as the various bands of the Ojibwa tribe.\n\n\n== Examples ==\nBand societies historically were found throughout the world, in a variety of climates, but generally, as civilisations arose, were restricted to sparsely populated areas, tropical rainforests, tundras and deserts. With the spread of the modern nation-state around the globe there are few true band societies left, some historical examples include the Shoshone of the Great Basin in the United States, the Bushmen of Southern Africa, the Mbuti of the Ituri Rainforest in Central Africa, and many groups of indigenous Australians, such as the Pitjantjatjara from Central Australia and the Palawa from Tasmania.\n\n\n== See also ==\nChiefdom, hierarchical political organizations in non-industrial societies.\nLineage-bonded societies, acephalous societies predicated on claims of a common ancestor.\nBand government, in which a \"band\" forms a fundamental component.\n\n\n== Notes ==\n\n\n=== Citations ===\n\n\n== Sources ==", "links": ["A. C. Burnell", "A. R. Radcliffe-Brown", "Aboriginal Tasmanians", "Acephalous society", "Achieved status", "African Political Systems", "Age grade", "Age set", "Aidan Southall", "Alfred Radcliffe-Brown", "Alfred William Howitt", "Anangu", "Ancestor", "Army", "Ascribed status", "Band government", "Big man (anthropology)", "Bjorn Thomassen", "Bushmen", "Cambridge University Press", "Canada", "Cargo cult", "Caste", "Central Africa", "Central Australia", "Chiefdom", "Circumscription theory", "Clan", "Complex society", "Cultural anthropology", "Current Anthropology", "Customary law", "Desert", "Doi (identifier)", "Douglas R. White", "E. Adamson Hoebel", "E. E. Evans-Pritchard", "Edmund Leach", "Egalitarian", "Elder (administrative title)", "Elizabeth Mertz", "Elman Service", "Eric Wolf", "Ernest Gellner", "Ethnic group", "Europe and the People Without History", "Extended family", "F. G. Bailey", "First Nations in Canada", "Fredrik Barth", "Georges Balandier", "Great Basin", "Hadza people", "Henri J. M. Claessen", "Henry Yule", "House society", "Hunter-gatherer", "ISBN (identifier)", "Indigenous Australians", "Indigenous peoples of the Great Basin", "Inuit", "Ituri Rainforest", "JSTOR (identifier)", "James C. Scott", "Jean Comaroff", "Jeremy Boissevain", "John Comaroff", "John Ferguson McLennan", "Jonathan Spencer", "Julian Steward", "June Helm", "Kapu", "Kin group", "Leadership", "Left–right paradigm", "Legal anthropology", "Legal culture", "Les Hiatt", "Lesley Gill", "Leveling mechanism", "Lineage-bonded society", "Lorimer Fison", "Mandala (Southeast Asian political model)", "Marshall Sahlins", "Matriarchy", "Mbuti", "Meyer Fortes", "Moka exchange", "Morton Fried", "Nation-state", "Native Americans in the United States", "Negara: The Theatre State in Nineteenth-Century Bali", "Network Analysis and Ethnographic Problems", "Oceania (journal)", "Ojibwa", "Oxford University Press", "Pantribal sodalities", "Paramount chief", "Patriarchy", "Pierre Clastres", "Political anthropology", "Political economy in anthropology", "Power (sociology)", "Ralph Linton", "Robert L. Carneiro", "Robert Laurens Kelly", "Rodney Needham", "S2CID (identifier)", "Sally Falk Moore", "San people", "Segmentary lineage", "Shoshone", "Sidney Mintz", "Social anthropology", "Social status", "Society", "Southern Africa", "State formation", "Tasmania", "Tax", "Technology, Tradition, and the State in Africa", "Ted C. Lewellen", "The Art of Not Being Governed", "The Journal of the Royal Anthropological Institute of Great Britain and Ireland", "Theatre state", "Thomas Blom Hansen", "Tribal chief", "Tribe", "Tropical rainforest", "Tundra", "Ulf Hannerz", "United States", "University of Iowa Press", "Walter de Gruyter", "Wolfgang Fikentscher"]}