{"url": "https://en.wikipedia.org/wiki/Barbara_Arrowsmith_Young", "title": "Barbara Arrowsmith Young", "summary": "Barbara Arrowsmith Young (born November 28, 1951) is a Canadian author, entrepreneur and lecturer. She is the founder of the Arrowsmith School in Toronto and the controversial Arrowsmith Program which forms the basis of the school's teaching method. In 2012 she published The Woman Who Changed Her Brain which combines an autobiographical account of her own severe learning disabilities and the method she developed to overcome them with case studies of learning disabled children who she claims overcame similar problems by using her method.", "content": "Barbara Arrowsmith Young (born November 28, 1951) is a Canadian author, entrepreneur and lecturer. She is the founder of the Arrowsmith School in Toronto and the controversial Arrowsmith Program which forms the basis of the school's teaching method. In 2012 she published The Woman Who Changed Her Brain which combines an autobiographical account of her own severe learning disabilities and the method she developed to overcome them with case studies of learning disabled children who she claims overcame similar problems by using her method.\n\n\n== Early life ==\nArrowsmith Young was born in Toronto on November 28, 1951 to Jack and Barbara Young. Her father was an electrical engineer who worked for Canadian General Electric. Her mother was a teacher. As a child she had  exceptional visual and auditory memory, but it was coupled with several severe deficits in other areas, including dyslexia, dyscalculia, and problems with spatial reasoning, logic, and kinesthetic perception. With the help of her mother she eventually achieved basic literacy and numeracy. However, she struggled throughout elementary and high school.\n\n\n== Education ==\nDespite her learning difficulties, she graduated with a BA.Sc in child studies from the University of Guelph in 1974. After graduating she worked for two years as the head teacher of the university's laboratory preschool before embarking on a master's degree in applied psychology at the University of Toronto's Ontario Institute for Studies in Education (OISE). She completed her Masters dissertation, A follow up study of a clinical sample, in 1982. It examined the progress of 62 students who had been previously assessed as learning disabled at the OISE's education clinic.In 1977 she had met Joshua Cohen, a PhD. student at OISE who also had learning disabilities and ran a small clinic for learning disabled children. Cohen introduced her to the work of Alexander Luria. According to Arrowsmith Young, Luria's 1971 book The Man with the Shattered World which documented the recovery under his treatment of the brain-injured soldier Lev Zasetsky was profoundly influential on her, as was the work of Mark Rosenzweig on neuroplasticity. Using the ideas of Luria and Rosenzweig, she began developing a series of exercises in 1978 which she states finally helped to overcome her learning disabilities.\n\n\n== Career ==\n\nArrowsmith Young and Cohen married in 1980 and opened the Arrowswmith School for learning disabled children in Toronto that same year. Its curriculum was based on the exercises which Arrowsmith Young had developed for herself and which came to be known as the Arrowsmith Program. She named the school after her paternal grandmother (born Louie May Arrowsmith in 1883), who as a young girl had been one of the pioneer settlers of Creston, British Columbia. The Toronto school gradually expanded and in 1991 she and Cohen opened a second school in Brooklyn, New York. The Toronto branch was wound down and closed. However, the New York school folded a few years later, and in 1994, Arrowsmith Young and Cohen's marriage ended. She returned to Toronto and re-opened the original school. Cohen remained in New York and died there in 2000.\n\n\n=== The Arrowsmith Program ===\nThe re-opened Arrowsmith School in Toronto attracted increasing numbers of students and eventually opened other branches. The Arrowsmith Program was also franchised to other private schools and in some public ones as well. In 2012 she published The Woman Who Changed Her Brain, an autobiographical account of how she overcame her own severe learning disabilities combined with 30 case studies of learning disabled children who she says overcame similar problems by using her method.Her method, which was the subject of a 2008 CBC documentary Fixing My Brain, has proved controversial. Psychiatrist Norman Doidge devoted one of the chapters in his book, The Brain That Changes Itself, to Arrowsmith Young and described her approach as \"an important discovery\". However, the Arrowsmith Program has been criticized by several neuroscientists, psychologists and cognitive scientists, including Anne Castles, Max Coltheart, Emma Burrows and Linda Siegel, for basing its claims on anecdotal evidence. They have noted that there have been no peer-reviewed studies published which use randomized controlled trials to evaluate whether it is actually more effective than any other \"brain training\" programs.Additionally, other experts, including clinical psychologist and neuropsychologist Tim Hannan, speech pathologist Alison Clarke, and at least one human rights tribunal have made similar concerns, citing lack of evidence and improper tests on the program. Clarke even argues the program to be based on pseudoscientific methodology.Robert Shepard, a clinical psychologist with twenty-five years of private practice, forensic and family health team experience, as well as a critic of Norman Doidge and his work, makes a ten point argument against the Arrowsmith Program. Explaining each point in short essay format, he argues that these are essential to marketing a product when no evidence exists that it actually works.\n\n\n== References ==\n\n\n== External links ==\nBarbara Arrowsmith Young's official website", "links": ["Alberta Human Rights Commission", "Alexander Luria", "Anecdotal evidence", "Anne Castles", "Arrowsmith School", "Auditory memory", "Australian Broadcasting Corporation", "Brooklyn, New York", "Canadian Broadcasting Corporation", "Canadian General Electric", "Creston, British Columbia", "Dyscalculia", "Dyslexia", "Elementary school", "High school", "ISBN (identifier)", "ISNI (identifier)", "Linda Siegel", "Mark Rosenzweig (psychologist)", "Max Coltheart", "Medium (website)", "Neuroplasticity", "Norman Doidge", "OCLC (identifier)", "Ontario Institute for Studies in Education", "Preschool", "Proprioception", "Pseudoscience", "Psychology of reasoning", "Randomized controlled trial", "Spatial reasoning", "Sydney Morning Herald", "The Brain That Changes Itself", "The Globe and Mail", "Toronto", "Toronto Star", "University of Guelph", "University of Toronto", "VIAF (identifier)", "Vancouver Sun", "Visual memory", "Wayback Machine", "Zasetsky"]}