{"url": "https://en.wikipedia.org/wiki/Bastable_Theatre", "title": "Bastable Theatre", "summary": "The Bastable Theatre was a theatre in Syracuse, New York, from 1893 to 1923, when it burnt down. Sam S. Shubert began his theatre management at the Bastable. He and his brothers established The Shubert Organization, which became a major theatre owner. During Shubert's early years of management, he competed with the city's Wieting Opera House, which was controlled by The Theatrical Syndicate. The Bastable itself hosted a number of touring companies in the city and became known for  hosting stock companies and melodramas. The State Tower Building was constructed on the site of the theatre after it burnt down.", "content": "The Bastable Theatre was a theatre in Syracuse, New York, from 1893 to 1923, when it burnt down. Sam S. Shubert began his theatre management at the Bastable. He and his brothers established The Shubert Organization, which became a major theatre owner. During Shubert's early years of management, he competed with the city's Wieting Opera House, which was controlled by The Theatrical Syndicate. The Bastable itself hosted a number of touring companies in the city and became known for  hosting stock companies and melodramas. The State Tower Building was constructed on the site of the theatre after it burnt down.\n\n\n== Description ==\nThe Bastable Block was six stories and had offices in addition to the theatre. The theatre itself was two balconies, four boxes (two on each side).\n\n\n== History ==\nThe area where the theatre was constructed was occupied by the Bastable block, which had been standing since at least 1852. The block was four stories tall and housed the Shakespeare Hall and arcade. It burnt down on November 20, 1891.The Bastable Theatre was built by Frederick Bastable in 1893, at a reported cost of $50,000. Archimedes Russell designed the building. It incorporated portions of the walls from the old block that were still standing. In competition with the established Wieting Opera House and Grand Opera House it opened on October 10 that year, with Frank D. Hennessay as its manager. The first show was Beau Brummell starring Richard Mansfield. It was generally unprofitable for the first four years. The theatre had an early success showing the 1897 film The Corbett-Fitzsimmons Fight, on two occasions that year: the first shortly after March, and the second in October.\n\nSam S. Shubert took over management on December 14, 1897. Competing with the Wieting, Shubert initially booked \"an old-fashioned stock company in old-fashioned plays at old-fashioned prices.\"  The following year, he diversified the theatre, a move coupled with renovation, and exclusively booked touring shows. The Wieting, controlled by The Theatrical Syndicate, had a virtual monopoly on the biggest names and shows, so Shubert focused on booking a variety of sensational shows and comedies. He began the season with a performance of A Stranger in New York by Charles H. Hoyt.  Shubert showed films by the American Biograph Company to great success beginning in January 1898. The theatre was finally successful and profitable, and the Shubert family began leasing both the Bastable and Grand Opera House in the city. They quickly expanded across New York state. The Shuberts created The Shubert Organization, which became a major theatre owner. The Bastable grew to be known for hosting stock companies and melodramas. In 1902 Hurtig & Seamon became managers. By 1908 they were succeeded by Syracuse's General Amusement Company.\n\n\n=== 1923 fire ===\nOn February 12, 1923, the Bastable Theatre caught fire and burnt down. At the time, it had about 150 tenants. The fire was noted around 5:30 pm, but the top of the building was engulfed in flame before effective firefighting could begin. They focused their efforts on rescuing people. The fire resulted in three deaths and $1.5 million damages. Several other buildings caught fire, and the Bastable block was virtually completely razed. Syracuse revised its fire response policies in the fire's aftermath. Several months after burning down, the owner of the block announced construction of a new office building on the lot. It became the State Tower Building, Syracuse's tallest building.\n\n\n== References ==\n\n\n== Bibliography ==\nBeauchamp, William Martin (1908). Past and Present of Syracuse and Onondaga County, New York: From Prehistoric Times to the Beginning of 1908. S.J. Clarke Publishing Company.\nHirsch, Foster (1998). The Boys from Syracuse: The Shuberts' Theatrical Empire. SIU Press. ISBN 978-0-8093-2156-8.\nMcNamara, Brooks (1990). The Shuberts of Broadway : a history drawn from the collections of the Shubert Archive. New York : Oxford University Press. ISBN 978-0-19-506542-8.", "links": ["A Stranger in New York", "American Biograph Company", "Archimedes Russell", "Balcony", "Beau Brummell (play)", "Box (theatre)", "Charles H. Hoyt", "Grand Opera House (Syracuse, New York)", "Hurtig & Seamon", "ISBN (identifier)", "ISSN (identifier)", "JSTOR (identifier)", "Melodrama", "Richard Mansfield", "Sam S. Shubert", "Shubert family", "State Tower Building", "Stock companies", "Syracuse, New York", "The Corbett-Fitzsimmons Fight", "The Shubert Organization", "The Theatrical Syndicate", "Wieting Opera House"]}