{"url": "https://en.wikipedia.org/wiki/Berlin-Brandenburg_Academy_of_Sciences_and_Humanities", "title": "Berlin-Brandenburg Academy of Sciences and Humanities", "summary": "The Berlin-Brandenburg Academy of Sciences and Humanities (German: Berlin-Brandenburgische Akademie der Wissenschaften), abbreviated BBAW, is the official academic society for the natural sciences and humanities for the German states of Berlin and Brandenburg. Housed in three locations in and around Berlin, Germany, the BBAW is the largest non-university humanities research institute in the region.The BBAW was constituted in 1992 by formal treaty between the governments of Berlin and Brandenburg on the basis of several older academies, including the historic Prussian Academy of Sciences from 1700 and East Germany's Academy of Sciences of the German Democratic Republic from 1946. By this tradition, past members include the Brothers Grimm, Wilhelm and Alexander von Humboldt, Lise Meitner, Theodor Mommsen, Albert Einstein, and Max Planck. Today the BBAW operates as a public law corporation under the auspices of the German National Academy of Sciences, and has over 300 fellows and 250 additional staff members. Its elected scientific membership has included 78 Nobel laureates.The BBAW operates several subsidiary research centers. Projects include compiling large dictionaries; editing texts from ancient, medieval, and modern history; and editing the classical literature from diverse fields. Notable examples include Inscriptiones Graecae, the Corpus Inscriptionum Latinarum, the German Dictionary (German: Deutsches Wörterbuch), the Ancient Egyptian Dictionary (Altägyptisches Wörterbuch), the bibliography of works by Alexander von Humboldt, and a scholarly edition of the works of Ludwig Feuerbach.", "content": "The Berlin-Brandenburg Academy of Sciences and Humanities (German: Berlin-Brandenburgische Akademie der Wissenschaften), abbreviated BBAW, is the official academic society for the natural sciences and humanities for the German states of Berlin and Brandenburg. Housed in three locations in and around Berlin, Germany, the BBAW is the largest non-university humanities research institute in the region.The BBAW was constituted in 1992 by formal treaty between the governments of Berlin and Brandenburg on the basis of several older academies, including the historic Prussian Academy of Sciences from 1700 and East Germany's Academy of Sciences of the German Democratic Republic from 1946. By this tradition, past members include the Brothers Grimm, Wilhelm and Alexander von Humboldt, Lise Meitner, Theodor Mommsen, Albert Einstein, and Max Planck. Today the BBAW operates as a public law corporation under the auspices of the German National Academy of Sciences, and has over 300 fellows and 250 additional staff members. Its elected scientific membership has included 78 Nobel laureates.The BBAW operates several subsidiary research centers. Projects include compiling large dictionaries; editing texts from ancient, medieval, and modern history; and editing the classical literature from diverse fields. Notable examples include Inscriptiones Graecae, the Corpus Inscriptionum Latinarum, the German Dictionary (German: Deutsches Wörterbuch), the Ancient Egyptian Dictionary (Altägyptisches Wörterbuch), the bibliography of works by Alexander von Humboldt, and a scholarly edition of the works of Ludwig Feuerbach.\n\n\n== History ==\n\n\n=== Society of Sciences (1700–52) ===\nThe roots of the BBAW can be traced to the Society of Sciences of the Elector of Brandenburg (German: Kurfürstlich Brandenburgische Sozietät der Wissenschaften), founded in 1700 by Gottfried Wilhelm Leibniz under the patronage of Frederick I of Prussia. The institution was created on the principle of uniting the natural sciences and the humanities, making it a prototype for other academies across Europe. The rise of the field of physics can be genealogically traced to this period of the Academy, as well as modern European mathematics.\n\n\n=== Royal Academy (1752–1918) ===\nUnder Frederick the Great, an enthusiastic patron, the Academy rose to even wider significance. In 1752 it merged with the Nouvelle Société Littéraire to form the Royal Academy of Sciences (German: Königliche Akademie der Wissenschaften). The new Academy attracted prominent scientists and philosophers, including Immanuel Kant, who were able publish writings which would have been censored elsewhere in Europe. While it was an important center in the Age of Enlightenment, due to its royal patronage the Academy did not enjoy complete freedom. Political writings in its Proceedings throughout the 18th century argued the merits of monarchies over republics, warned against the French Revolution, and defended Prussia against accusations that it was despotic. In the 19th century the von Humboldt brothers reorganized the Academy along more open lines. Prominent critical thinkers such as Theodor Mommsen, Friedrich Wilhelm Joseph Schelling, Friedrich Schleiermacher were all active members for many decades.\n\n\n=== Prussian Academy (1918–33) ===\n\nWith the collapse of the German monarchy in 1918, the Royal Academy was renamed the Prussian Academy of Sciences (German: Preußische Akademie der Wissenschaften). During this period it rose to international fame and its members included top academics in their fields such as Albert Einstein, Max Planck, Hermann Diels, and Ernst Bloch.\n\n\n=== Nazi Germany (1933–45) ===\nDuring the Nazi period, as with all institutions across Germany, the Academy became subject to the \"Law for the Restoration of the Professional Civil Service.\" As a result, Jewish employees and political opponents were expelled. Albert Einstein resigned in 1933 before he could be expelled and Max Planck, the Academy's president, was coerced to publicly support nationalist socialism. However, despite initial resistance, over time the Academy and many of its scientists became willing tools of the Nazis. New statutes in 1938 reorganized the Academy according to the Führer principle, causing Planck to resign his presidency in protest. The mathematician Theodor Vahlen, proponent of the anti-Semitic Deutsche Mathematik movement, became its president. By war's end the Academy's reputation was destroyed and many of its prominent scientists were stigmatized. Planck died in 1947.\n\n\n=== Modern history (1946–present) ===\nAfter World War II, what remained of the Academy wound up in the Soviet Zone of Occupation. Re-opened by the Russians in 1946 as the German Academy of Sciences at Berlin (German: Deutsche Akademie der Wissenschaften zu Berlin), it moved to the former Prussian Maritime Trade Company building on the Gendarmenmarkt in 1949. The Academy was renamed the Academy of Sciences of the German Democratic Republic (German: Akademie der Wissenschaften der DDR) or AdW in 1972, by which time it had over 400 members and 24,000 employees. After German reunification the AdW was dissolved in December 1991 due to its controversial role in support of the East German regime. In August 1992, the BBAW was reconstituted by interstate treaty between the landtags of Berlin and Brandenburg using the original model of the old Prussian Academy. Today its headquarters are located at the former AdW building, with special projects conducted at the old Prussian Academy on the Unter den Linden. It also has a third office in Potsdam.\n\n\n== Research ==\n\n\n=== Research projects ===\nThe academy sponsors a variety of interdisciplinary, long-term and externally funded projects. These include large German and foreign-language dictionaries; historical-critical publications of ancient, medieval, and modern texts; and editing and interpreting the classical literature by scholars from diverse academic fields. In 2012 the BBAW was home to 47 major projects, the most notable include:\nAlexander von Humboldt Research Project (German: Alexander-von-Humboldt-Forschung): a research initiative is focused on Alexander von Humboldt’s correspondence and diaries written during his famous journey to America (1799–1804).\nCorpus Inscriptionum Latinarum\nThe Dictionary of Ancient Egyptian (German: Altägyptisches Wörterbuch): A 3000-year corpus publicly available online and continuously updated.\nThe German Dictionary (German: Deutsches Wörterbuch), begun by the Brothers Grimm\nThe Goethe Dictionary (German: Goethe-Wörterbuch): A conceptual history project that interprets the works of Goethe, containing 3.2 million quotations and 93,000 headwords\nInscriptiones Graecae: collects and edits all of Europe’s ancient Greek inscriptions\nThe Complete Works of Marx and Engels (German: Marx-Engels-Gesamtausgabe)\nMonumenta Germaniae Historica: publishes source materials for the constitutional history of the Holy Roman Empire from the 14th century\nSchleiermacher: Critical Edition of the Complete Works (German: Schleiermacher: Kritische Gesamtausgabe): The official edition of Friedrich Schleiermacher’s correspondence has been edited by the BBAW since 1979\n\n\n=== Research centers ===\nThe Academy has established a number of research centres over time, including centres for basic research, language and history. Each seeks to pool expertise from various fields with the goal of improving cooperation between university and non-university institutions and stimulating regional and international research innovation. In 2012 the BBAW operated three such centers:\nZentrum Grundlagenforschung Alte Welt: a centre for research of primary sources of the ancient world\nZentrum \"Preußen-Berlin\": The \"Prussia-Berlin\" Research Centre, an amalgamation of projects on the history and culture Prussia and Berlin\nZentrum Sprache: The Language Research Centre\n\n\n== Facilities and funding ==\nThe BBAW operates at three locations in and around Berlin:\nHeadquartersJägerstrasse 22/2310117 Berlin\nFormer Prussian Academy of Sciences buildingUnter den Linden 810117 Berlin\nNew buildingAm Neuen Markt 814467 PotsdamFunding for the Academy comes primarily from the states of Berlin and Brandenburg, with a significant portion of its research supported by the federal and state governments of Germany.\n\n\n== Salon Sophie Charlotte ==\nThe Salon Sophie Charlotte is a public evening event organized by the BBAW bringing together leading academics and the general public. Being selected as an academic panelist or speaker is considered highly prestigious. The number of visitors increased over the years to up to 3000 visitors (2017) including academics, public intellectuals and politicians such as Chancellor Angela Merkel.Eponym of the salon is Sophia Charlotte of Hanover (1668-1705), Queen consort in Prussia as wife of King Frederick I., who initiated, together with Gottfried Wilhelm Leibniz, the founding of the scientific academy in Berlin in 1700. On her estate Lietzow (Charlottenburg) near Berlin maintained Sophie Charlotte, who had a great passion for philosophy, free-spirited salons, which formed a counter-world to strict Prussia etiquette as a social meeting place for discussions, readings or musical events.\nThe event takes place in BBAW's academy building at Berlin's Gendarmenmarkt. Every year it is organized with a different thematic focus.\n\n2006: Kick-off (Auftaktveranstaltung)\n2007: Europe in the Middle East - The Middle East in Europe (Europa im Nahen Osten – Der Nahe Osten in Europa)\n2008: Do you know Prussia - really? (Kennen Sie Preußen – wirklich?)\n2009: The evolution welcomes your children (Die Evolution empfängt Ihre Kinder)\n2010: Escape from the amazement? (Flucht vor dem Staunen?)\n2011: Reciprocity. Patrons and donors of the sciences and the arts (Gegenliebe. Gönner und Geber der Wissenschaften und der Künste)\n2012: Artifacts. Knowledge is art - art is knowledge (Artefakte. Wissen ist Kunst – Kunst ist Wissen)\n2013: The science and the love (Die Wissenschaft und die Liebe)\n2014: Europe - a place of the future (Europa - ein Zukunftsort)\n2015: Put in the light (Ins Licht gerückt)\n2016: Do we live in the best of all possible worlds? (Leben wir in der besten aller möglichen Welten?)\n2017: Rebellions, revolutions or reforms? (Rebellionen, Revolutionen oder Reformen?)\n2018: Language (Sprache)\n\n\n== Medals, prizes and lectures ==\nThe Academy bestows a number of scientific medals and awards and is host to prestigious lectures:\n\n\n=== Medals ===\nHelmholtz Medal: Awarded biennially to individuals who have made significant academic contributions to the humanities, social sciences, natural sciences, or medicine. It was first awarded on 2 June 1892 to the physiologist Emil Du Bois-Reymond, physicist Lord Kelvin, and mathematician Karl Weierstraß.\nLeibniz Medal: Awarded to individuals or groups for special services in support of scientific research. It was first awarded to the Berlin art collector James Simon, patron of archeological excavations and museums.\n\n\n=== Prizes ===\nAcademy Prize: An annual prize awarded for outstanding scientific achievement in any disciplinary field.  It is awarded at the Academy’s Leibniz Day celebration in the summer and includes 50,000 Euros.\nPrize of the Academy (endowed by the Commerzbank Foundation): Awarded biennially for outstanding scientific achievement in the area of research in legal and economic principles. It includes 30,000 Euros is conferred at a joint ceremonial session of the Academy and the Commerzbank Foundation.\nEva and Klaus Grohe Prize of the Academy: Awarded biennially for outstanding scientific achievement by German scientists with a doctorate in the area of infectious diseases. The prize includes 20,000 Euros and is conferred at the Academy’s annual Einstein Day celebration.\nPrize of the Academy (endowed by the Monika Kutzner Foundation): Awarded annually for outstanding scientific achievement in the area of cancer research. It includes 10,000 Euros and is conferred at the Academy’s annual Einstein Day celebration.\nPrize of the Academy (endowed by the Peregrinus Foundation): Awarded biennially for outstanding achievements by scholars from eastern and southeastern Europe. It includes 5,100 Euros  and is conferred at the Academy’s annual Einstein Day celebration.\nTechnical Scientific Prize: Awarded for outstanding achievement in the engineering sciences by young engineers and scientists in research or industry. It includes 10,000 Euros and is awarded at the Academy's annual Day of Engineering.\nWalter de Gruyter-Prize: Awarded biennially for outstanding achievement in a subject area covered by the publishing house Walter de Gruyter. It includes 7,500 Euros and is preferably awarded to those who are young, relative to their achievements.\nLiselotte Richter-Prize of the Leibniz-Edition Potsdam: Awarded biennially to senior school students in the province of Brandenburg and includes 1,000 Euros.\n\n\n=== Lectures ===\nPaul B. Baltes Lecture: Each year a leading international scientist is selected by the Academy to present a lecture which commemorates Paul Baltes` achievements in psychological research and his contributions to psychology. The lecture series is hosted by the Free University of Berlin, the Humboldt University of Berlin, the Technical University of Berlin and the University of Potsdam in collaboration with the Max Planck Institute for Human Development, and is supported by the Margret M. and Paul B. Baltes Foundation.\n\n\n== Publications ==\nThe Academy's Proceedings have been variously titled throughout history:\nMiscellanea Berolinensia (1710–43)\nHistoire de l'académie royale des sciences et belles lettres (1745–69)\nNouveaux mémoires de l'académie royal (1770–86)\nSammlung der deutschen Abhandlungen (1788–1803)\nAbhandlungen der Königlich Preußischen Akademie (1804–1917)Today the BBAW's publications appear in a wide variety of established journals, as well as its own publications such as Jahrbuch, Berichte und Abhandlungen, Debatten and the journal Gegenworte.\n\n\n== See also ==\nOpen access in Germany\n\n\n== References ==\n\n\n== External links ==\nOfficial Website", "links": ["Academy of Sciences of the German Democratic Republic", "Age of Enlightenment", "Albert Einstein", "Alexander von Humboldt", "Altägyptisches Wörterbuch", "Angela Merkel", "Basic research", "Berlin", "Brandenburg", "Brothers Grimm", "Classical literature", "Classics", "Conceptual history", "Corpus Inscriptionum Latinarum", "Der Tagesspiegel", "Despotic", "Deutsche Mathematik", "Dictionary of Ancient Egyptian", "Doi (identifier)", "East Germany", "Emil Du Bois-Reymond", "Ernst Bloch", "Frederick I of Prussia", "Frederick the Great", "Free University of Berlin", "French Revolution", "Friedrich Engels", "Friedrich Schleiermacher", "Friedrich Wilhelm Joseph Schelling", "Führerprinzip", "Gendarmenmarkt", "Geographic coordinate system", "German Academy of Sciences Leopoldina", "German Academy of Sciences at Berlin", "German Democratic Republic", "German Dictionary", "German language", "German reunification", "Germany", "Goethe", "Gottfried Wilhelm Leibniz", "Headword", "Henri James Simon", "Hermann Diels", "Holy Roman Empire", "Humanities", "Humboldt University of Berlin", "ISBN (identifier)", "ISNI (identifier)", "Immanuel Kant", "Inscriptiones Graecae", "Jewish", "Karl Marx", "Karl Weierstraß", "Landtag", "Law for the Restoration of the Professional Civil Service", "Lietzow (Charlottenburg)", "Lise Meitner", "Lord Kelvin", "Ludwig Feuerbach", "Martin Grötschel", "Max Planck", "Max Planck Institute for Human Development", "Monumenta Germaniae Historica", "National Socialism", "Natural science", "Nazi Germany", "Nobel laureate", "Open access in Germany", "Paul B. Baltes Lecture", "Physics", "Potsdam", "Prussia", "Prussian Academy of Sciences", "Quotation", "Research institute", "SUDOC (identifier)", "Sophia Charlotte of Hanover", "Soviet Zone of Occupation", "States of Germany", "Technical University of Berlin", "Theodor Mommsen", "Theodor Vahlen", "Trove (identifier)", "University of Potsdam", "Unter den Linden", "VIAF (identifier)", "Walter de Gruyter", "Wayback Machine", "Wilhelm von Humboldt", "World War II"]}