{"url": "https://en.wikipedia.org/wiki/Bharat-Bangladesh_Maitri_Udyan", "title": "Bharat-Bangladesh Maitri Udyan", "summary": "Bharat-Bangladesh Maitri Udyan (Bengali: ভারত-বাংলা মুক্তি মৈত্রী পার্ক , transl. India-Bangladesh Friendship Park) in Chottakhola was one of the base camps of Bangladeshi Freedom Fighters from where they launched guerrilla warfare against the Pakistani army in Chittagong, Comilla and greater Noakhali.", "content": "Bharat-Bangladesh Maitri Udyan (Bengali: ভারত-বাংলা মুক্তি মৈত্রী পার্ক , transl. India-Bangladesh Friendship Park) in Chottakhola was one of the base camps of Bangladeshi Freedom Fighters from where they launched guerrilla warfare against the Pakistani army in Chittagong, Comilla and greater Noakhali.\n\n\n== Location ==\nLocated near the international border, the Maitri Udyan is a park built at Chottakhola as a tribute to the Bangladeshi Freedom Fighters and Indian soldiers, who sacrificed their lives during the Liberation War. A war museum, hillocks, verdant valleys, lakes, plants, sculptures, graveyards of Bangladeshi Freedom Fighters with various other elements, this is not just a park but much more than that.\n\n\n== History ==\nThe memorial park was a long cherished demand of Tripura people as they were actively involved in the Liberation War. They provided all-out support to Freedom Fighters and sheltered around 1.6 million people, a number exceeding the then population of the state. Chottakhola, 130 kilometres from Tripura's capital Agartala, had functioned as one of the 11 warfront-camps in Tripura in 1971. The beautiful location comprises seven hillocks partly separated by a natural lake over 20 hectares of land. It saw intense activities during the Liberation War and still bears its memorabilia in the form of remnants of a number of bunkers and trenches built on it in 1971.\n\n\n== Inauguration ==\nFormer Tripura Chief Minister Manik Sarkar inaugurated the memorial and park in the presence of Indian and Bangladeshi artists, intellectuals and freedom fighters on December 16, the Victory Day of Bangladesh. The then Bangladesh's Education Minister Dipu Moni laid the foundation stone of the park on 11 November 2010.\n\n\n== Statues ==\nPrime Minister Indira Gandhi\nFounder of Bangladesh- Bangabandhu Sheikh Mujibur Rahman\nBijoy 1971\nGonohotta 1971\nTerracotta\n\n\n== Artists and sculptors ==\nRenowned artists from Tripura and Bangladesh are part of the project with their creations - from statues to paintings -that added to the memorial's attraction.\n\n\n=== Bangladeshi artists and sculptors ===\nHashem Khan\nMahmudul Hasan Shohag\nShyamal Chowdhury\nTejosh Halder Joshdepicted sculptures for the park.\nThe memorial park would help successive generations of Bangladesh learn the history of their hard-won independence and how the two friendly neighbours joined forces to bring about the country's liberation.\n\n\n== References ==", "links": ["1971 Bangladesh genocide", "Agartala", "Bangladesh Freedom Fighter Welfare Trust", "Bangladesh Liberation War", "Bangladeshis", "Bengali language", "Bijoy 1971 (sculpture)", "Bunker", "Chittagong", "Chottakhola", "Comilla", "Dipu Moni", "Geographic coordinate system", "Gonohotta 1971", "Gonohotta 1971 (sculpture)", "Guerrilla warfare", "Hashem Khan (artist)", "Indian Army", "Indira Gandhi", "Liberation War Memorial Sculpture, Durgapur", "Mahmudul Hasan Shohag", "Manik Sarkar", "Noakhali District", "Pakistanis", "Sheikh Mujibur Rahman", "Shyamal Chowdhury", "Susang (sculpture)", "Tejosh Halder Josh", "Tripura", "Victory day of Bangladesh"]}