{"url": "https://en.wikipedia.org/wiki/Bitches_Broken_Hearts", "title": "Bitches Broken Hearts", "summary": "\"Bitches Broken Hearts\" (stylized in all lowercase) is a song recorded by American singer Billie Eilish. The song was written by Eilish, and its producers: Emmit Fenn and Finneas O'Connell. Originally released via SoundCloud on November 10, 2017, it was released as a single on all digital platforms on March 30, 2018. The song was released on a 7-inch vinyl as the B-Side to her single \"You Should See Me in a Crown\". It was also included on the expanded edition of Eilish's debut EP, Don't Smile at Me (2017), as well as on the deluxe edition of her debut album, When We All Fall Asleep, Where Do We Go? (2019).\nThe lyrics of \"Bitches Broken Hearts\" address the aftermath of a breakup. The song received mainly positive reviews from music critics, several of whom praised the music and lyrics. It was certified platinum in the  States and Canada by the Recording Industry Association of America (RIAA) and Music Canada (MC), respectively.", "content": "\"Bitches Broken Hearts\" (stylized in all lowercase) is a song recorded by American singer Billie Eilish. The song was written by Eilish, and its producers: Emmit Fenn and Finneas O'Connell. Originally released via SoundCloud on November 10, 2017, it was released as a single on all digital platforms on March 30, 2018. The song was released on a 7-inch vinyl as the B-Side to her single \"You Should See Me in a Crown\". It was also included on the expanded edition of Eilish's debut EP, Don't Smile at Me (2017), as well as on the deluxe edition of her debut album, When We All Fall Asleep, Where Do We Go? (2019).\nThe lyrics of \"Bitches Broken Hearts\" address the aftermath of a breakup. The song received mainly positive reviews from music critics, several of whom praised the music and lyrics. It was certified platinum in the  States and Canada by the Recording Industry Association of America (RIAA) and Music Canada (MC), respectively.\n\n\n== Background and release ==\n\"Bitches Broken Hearts\" was originally released through Eilish's SoundCloud on November 10, 2017. The song was later released for digital download and streaming on March 30, 2018, through Darkroom and Interscope Records. It was included as the B-side on the 7-inch vinyl of \"You Should See Me in a Crown\", released on October 20, 2018, and was sold exclusively during her 1 By 1 Tour. The song was included on the expanded edition of her debut EP, Don't Smile at Me, in December 2018, and the reissue of her debut album, When We All Fall Asleep, Where Do We Go?, the following December. \"Bitches Broken Hearts\" was written by the singer, her brother Finneas O'Connell and Emmit Fenn. The song was co-produced by Finneas and Fenn, making it the first Billie Eilish song to feature production from someone other than Finneas.\n\n\n== Composition ==\nCritical commentary described \"Bitches Broken Hearts\" as an R&B track. According to sheet music published at Musicnotes.com, \"Bitches Broken Hearts\" has a moderately fast tempo of 120 beats per minute (BPM) and is played in the key of A minor. Eilish's vocals span one octave from G3 to G4. Lyrically, the song delves into the aftermath of a breakup, Eilish pretends that she no longer needs or cares about her former lover: “You can pretend you don’t miss me/You can pretend you don’t care/All you wanna do is kiss me/Oh, what a shame, I’m not there.” Eilish continues to her lovers' incompatibility, calling them \"suicide and stolen art\"; she also knows they'll both eventually move on and start to meet new people: \"Somebody new is gonna comfort you/Like you want me to/Somebody new is gonna comfort me/Like you never do\".\n\n\n== Reception ==\n\"Bitches Broken Hearts\" was met with generally favorable reviews from music critics. Insider's Claudia Willen, praised Eilish's vocals, saying she \"[has] smooth vocals [that] float seamlessly through the track, effectively capturing the fleeting nature that often comes with young love\". Kirsten Spruch of Billboard commented that the song has \"subdued like a lot of the siblings' work\" but has \"a tropical flare, which makes it a great Eilish cut for those looking for something a bit more relaxing\". Laurence Day of The Line of Best Fit viewed the song as a \"intimacy and free-flowing energy of a raw demo take\" and \"it's still got all of Eilish's sensational vocal power\". Commercially, \"Bitches Broken Hearts\" has been awarded a platinum certification in the United States and Canada by the Recording Industry Association of America (RIAA) and Music Canada (MC), respectively.\n\n\n== Live performances ==\nIn July 2018, Eilish performed \"Bitches Broken Hearts\" for Vevo Lift. A video for the performance was released to YouTube on July 30, 2018, and was directed by Ryan Booth. Booth shot the basketball docu-series about Penny Hardaway called The Harder Way.\n\n\n== Personnel ==\nCredits adapted from liner notes of You Should See Me in a Crown / Bitches Broken Hearts.\nBillie Eilish – vocals, songwriter\nFinneas O'Connell – producer, songwriter, guitar, synthesizers, arrangement\nEmmit Fenn – producer, songwriter, engineer, mixer, mastering engineer, drum programming, piano, synthesizers, vocals\n\n\n== Certifications ==\n\n\n== Release history ==\n\n\n== References ==\n\n\n== External links ==\nAudio on YouTube", "links": ["&Burn", "A-side and B-side", "A minor", "All the Good Girls Go to Hell", "Asociación Mexicana de Productores de Fonogramas y Videogramas", "Associação Fonográfica Portuguesa", "Australian Recording Industry Association", "Bad Guy (Billie Eilish song)", "Bellyache (Billie Eilish song)", "Billboard (magazine)", "Billie Eilish", "Billie Eilish: The World's a Little Blurry", "Billie Eilish discography", "Bored (song)", "Brian Baird", "British Phonographic Industry", "Bury a Friend", "Come Out and Play (Billie Eilish song)", "Complex Networks (company)", "Contemporary R&B", "Copycat (Billie Eilish song)", "Depop", "Don't Smile at Me", "Don't Smile at Me Tour", "Dork (magazine)", "Empik", "Everything I Wanted", "Extended play", "Finneas O'Connell", "G (musical note)", "Happier Than Ever", "Happier Than Ever, The World Tour", "Happier Than Ever (song)", "Hostage (song)", "Hotline Bling", "I Love You (Billie Eilish song)", "Idontwannabeyouanymore", "Ilomilo (song)", "Insider (website)", "Interscope Records", "Letter case", "Liner notes", "List of awards and nominations received by Billie Eilish", "List of music recording certifications", "List of songs recorded by Billie Eilish", "Live at Third Man Records (Billie Eilish album)", "Lo Vas a Olvidar", "Lost Cause (Billie Eilish song)", "Lovely (Billie Eilish and Khalid song)", "MBRG (identifier)", "MTV", "Maggie Baird", "Male Fantasy", "Music Canada", "Music download", "Music genre", "Music journalism", "Music recording certification", "My Boy (Billie Eilish song)", "My Future", "My Strange Addiction (song)", "NDA (song)", "No Time to Die (song)", "Nobody Like U", "Not My Responsibility", "Ocean Eyes (song)", "Oxytocin (song)", "Party Favor (song)", "Penny Hardaway", "Polish Society of the Phonographic Industry", "Record label", "Record producer", "Recording Industry Association of America", "Reissue", "Single (music)", "Six Feet Under (Billie Eilish song)", "Songwriter", "SoundCloud", "Spotify", "Streaming media", "Tempo", "The Line of Best Fit", "Therefore I Am (song)", "Universal Music Group", "Variance (magazine)", "Vevo", "Watch (Billie Eilish song)", "When Billie Met Lisa", "When I Was Older", "When We All Fall Asleep, Where Do We Go?", "When We All Fall Asleep Tour", "When the Party's Over (song)", "Where's My Mind Tour", "Where Do We Go? World Tour", "Wish You Were Gay", "Xanny (song)", "YouTube", "You Should See Me in a Crown", "Your Power"]}