{"url": "https://en.wikipedia.org/wiki/Bite_the_Bullet_(EP)", "title": "Bite the Bullet (EP)", "summary": "Bite the Bullet is the fourth EP released by the band Black Tide. It was scheduled to be released in the fall of 2013 under the label InnerCat Music Group. The EP was produced and engineered by Mariano Aponte. This is the first release without drummer Steven Spence. The first single titled \"Not Afraid\", was released on August 31.", "content": "Bite the Bullet is the fourth EP released by the band Black Tide. It was scheduled to be released in the fall of 2013 under the label InnerCat Music Group. The EP was produced and engineered by Mariano Aponte. This is the first release without drummer Steven Spence. The first single titled \"Not Afraid\", was released on August 31.\n\n\n== Background ==\nIn an interview with The Vinne Langdon show, bassist Zakk Sandler stated that he was not invited to be a part of the Just Another Drug EP. Later, it led to the departure of him and drummer Steven Spence.According to Gabriel Garcia, \"“So as you all know we've been working on a six song EP. We're excited to let you all know it'll be titled Bite The Bullet. We recently finished tracking Bite The Bullet at Live House studios in Miami, FL with producer/engineer Mariano Aponte formerly of Silvia Massy's world famous RadioStar Studios. We really went back to our roots on this one and it is being mixed right now! Can't wait for you all to hear this!”On August 31, the band released their first single off their forthcoming EP, titled \"Not Afraid\".\n\n\n== Writing and recording ==\nOn October 13, 2012, Gabriel tweeted \"So excited to let all our fans know that I'm currently on my way to Georgia to start working on demos for Black Tide's 3rd cd!!!!\".On July 3, 2013, Black Tide stated that they were going through a line-up change, and that they are working on a new Black Tide EP (6 songs).Bite the Bullet was tracked at Live House Studios in Miami with producer and engineer Mariano Aponte at the helm.\n\n\n== Track listing ==\n\n\n== Personnel ==\nBlack TideGabriel Garcia – lead vocals, lead guitar, bass\nAustin Diaz – rhythm guitar, backing vocals\nTim D'Onofrio – drums, percussion\n\n\n== References ==", "links": ["Al Cielo EP", "Backing Vocalist", "Bass guitar", "Black Tide", "Black Tide Discography", "Bury Me", "Chasing Shadows (Black Tide album)", "Drum kit", "Extended play", "Gabriel Garcia (musician)", "Georgia (U.S. state)", "Hard rock", "Honest Eyes", "Just Another Drug", "Lead guitar", "Lead vocalist", "Light from Above", "Melodic metalcore", "Miami, Florida", "Music genre", "Percussion", "Post Mortem (album)", "Record label", "Record producer", "Rhythm guitar", "Road Warrior (EP)", "Shockwave (Black Tide song)", "Shout (Black Tide song)", "Single (music)", "Steven Spence", "Studio album", "That Fire", "Walking Dead Man", "Warriors of Time"]}