{"url": "https://en.wikipedia.org/wiki/Bob_Kloppenburg", "title": "Bob Kloppenburg", "summary": "Robert G. Kloppenburg (born July 28, 1927) is an American basketball coach. Kloppenburg played college basketball at USC and Fresno State. In a career spanning from the 1950s to 1990s, Kloppenburg coached at the high school, college, and professional levels. From 1958 to 1976 and 1977 to 1978, Kloppenburg was head coach at California Western (later United States International) University. For much of the 1980s and 1990s, Kloppenburg was an NBA assistant coach with the Cleveland Cavaliers, Seattle SuperSonics, Denver Nuggets, and Toronto Raptors; he also had brief stints as interim head coach for the Cavaliers and SuperSonics. Utilizing an influential press defense system, Kloppenburg is regarded as one of the best defensive coaches.", "content": "Robert G. Kloppenburg (born July 28, 1927) is an American basketball coach. Kloppenburg played college basketball at USC and Fresno State. In a career spanning from the 1950s to 1990s, Kloppenburg coached at the high school, college, and professional levels. From 1958 to 1976 and 1977 to 1978, Kloppenburg was head coach at California Western (later United States International) University. For much of the 1980s and 1990s, Kloppenburg was an NBA assistant coach with the Cleveland Cavaliers, Seattle SuperSonics, Denver Nuggets, and Toronto Raptors; he also had brief stints as interim head coach for the Cavaliers and SuperSonics. Utilizing an influential press defense system, Kloppenburg is regarded as one of the best defensive coaches.\n\n\n== Early life and college playing career ==\nKloppenburg graduated from John Marshall High School in Los Angeles. Graduating in 1945, Kloppenburg was the Los Angeles City Basketball Player of the Year as a senior. He then played one season in 1945–46 for the University of Southern California (USC) under head coach Sam Barry. Averaging 10.9 points per game, Kloppenburg was USC's leading scorer that season. Kloppenburg then transferred to Fresno State College (now California State University, Fresno), where he played for the Fresno State Bulldogs in the 1949–50 season under head coach Cornelius \"Dutch\" Warmerdam, averaging 9.0 points in eight games.\n\n\n== Coaching career ==\n\n\n=== Early coaching career (1951–1958) ===\nIn the 1951–52 season, Kloppenburg was junior varsity coach for Fresno State. The following season, Kloppenburg was head coach at Lindsay High School at Lindsay, California. At Lindsay, Kloppenburg emphasized defense and ball control in a coaching style inspired by Hank Iba and Pete Newell. Kloppenburg returned to Southern California to be head coach at Victor Valley High School in Victorville, California beginning in 1953–54. In 1956, Kloppenburg became head coach at Paramount High School in Paramount, California. Although Paramount had a strong interior defense, Kloppenburg adapted his defensive coaching to compete against teams like Compton High School that specialized in jump shooting.\n\n\n=== California Western/U.S. International and Donar (1958–1978) ===\nKloppenburg had his first varsity college head coaching position in 1958 as the first head coach at California Western University, an NAIA independent school in San Diego, in 1958. California Western University became United States International University in 1968; U.S. International was merged into Alliant International University in 2001. In 19 seasons at California Western/U.S. International, Kloppenburg had a cumulative 322–192 record from 1958 to 1978 with NAIA Tournament appearances in 1963, 1965, 1966, and 1975.In the 1976–77 season, Kloppenburg left U.S. International to coach for Dutch team Nationale Nederlanden Donar. Kloppenburg led Donar to a 19–17 record. After one final season at U.S. International in 1977–78, in which the team went 12–15, Kloppenburg left for the second and final time due to what he believed were inferior facilities that affected recruiting.\n\n\n=== NBA scout and assistant (1978–1998) ===\nBeginning in 1978, Kloppenburg coached the Marine Corps Base Camp Pendleton basketball team and scouted for the Houston Rockets. In the 1979–80 season, Kloppenburg was the lead scout for the Seattle SuperSonics. The following season, Kloppenburg was promoted to assistant coach on Lenny Wilkens's staff. Kloppenburg later was an assistant coach for the Cleveland Cavaliers in 1981–82. On December 3, 1981, Kloppenburg became interim head coach for the Cavaliers after the firing of head coach Don Delaney.  Kloppenburg went 0–3 as interim coach before Chuck Daly formally took over. The team finished the season 15–67 under four different head coaches.After leaving the Cavaliers, Kloppenburg was a scout for the San Diego Clippers in 1982–83 and Washington Bullets in 1983–84. In 1984–85, Kloppenburg was an assistant coach at UNLV under Jerry Tarkanian. UNLV went 28–4 and qualified for the second round of the NCAA Tournament.After UNLV, Kloppenburg returned to the NBA for a second stint as assistant coach for the SuperSonics that lasted from 1985 to 1995 under head coaches Bernie Bickerstaff, K. C. Jones, and George Karl. The SuperSonics made the playoffs in all but two years (1986 and 1990) and qualified for the Western Conference Finals in 1987 and 1993 during Kloppenburg's second stint. Beginning January 15, 1992, Kloppenburg served as interim head coach of the SuperSonics after the firing of Jones. The SuperSonics went 2–2 under Kloppenburg before the hiring of Karl on January 23; the SuperSonics finished the season 47–35 and qualified for the Western Conference Semifinals.Prior to the 1995–96 season, Kloppenburg reunited with Bickerstaff as an assistant coach for the Denver Nuggets for one season. Kloppenburg's final coaching job was with the Toronto Raptors in 1997–98. After retiring from coaching, Kloppenburg co-founded the coaching website HoopTactics.net.\n\n\n== Coaching style ==\nKloppenburg is regarded as the innovator of the SOS defensive system, known for its ability to create turnovers because of \"contact switching\" on every screen and intense ball pressure with trapping principles.\n\n\n== Personal life ==\nKloppenburg lives in Bellevue, Washington. He is married to Gayle Kloppenburg. They have two children, including Gary Kloppenburg, a head coach for the WNBA teams Tulsa Shock (2012–2013) and Seattle Storm (2017, 2020–present). Granddaughter Carlotta Kloppenburg-Pruitt has been an assistant women's basketball coach at San Jose State since 2018.\n\n\n== Coaching record ==\n\n\n=== College ===\nSources:\n\n\n=== NBA ===\n\n\n== References ==\n\n\n== External links ==\nBob Kloppenburg on Twitter\nBasketballReference.com: Bob Kloppenburg", "links": ["1963 NAIA Men's Basketball Tournament", "1965 NAIA Men's Basketball Tournament", "1966 NAIA Men's Basketball Tournament", "1975 NAIA Men's Basketball Tournament", "1981–82 Cleveland Cavaliers season", "1981–82 NBA season", "1982–83 San Diego Clippers season", "1983–84 Washington Bullets season", "1985 NCAA Division I Men's Basketball Tournament", "1991–92 NBA season", "1991–92 Seattle SuperSonics season", "1995–96 Denver Nuggets season", "1997–98 Toronto Raptors season", "Al Bianchi", "Alliant International University", "Basketball", "Bellevue, Washington", "Bernie Bickerstaff", "Bill Fitch", "Bill Musselman", "Bill Russell", "Bill Sheridan (basketball)", "Billy Donovan", "Bob Hill", "Bob Hopkins", "Bob Weiss", "Brendan Malone", "Bucky Buckwalter", "Byron Scott", "California State University, Fresno", "Chuck Champione", "Chuck Daly", "Cleveland Cavaliers", "Compton High School", "Cornelius Warmerdam", "David Blatt", "Denver Nuggets", "Don Delaney", "Donar (basketball club)", "Erik Braal", "Fresno State Bulldogs men's basketball", "Gary Kloppenburg", "GasTerra Flames", "Gene Littles", "George Karl", "Glenn Pinas", "Hakim Salem", "Hank Iba", "Hans Perrier", "Houston Rockets", "Ivan Rudež", "Ivica Skelin", "J. B. Bickerstaff", "Jam Willem Jansen", "Jan Castelein", "Jan Kamman", "Jerry Tarkanian", "Jim Parks (basketball)", "John Beilein", "John Lucas II", "John Marshall High School (Los Angeles)", "Josep Clarós", "K. C. Jones", "Keith Smart", "Klaas Bruin", "Larry Drew", "Lenny Wilkens", "Lindsay, California", "List of Cleveland Cavaliers head coaches", "List of Oklahoma City Thunder head coaches", "Los Angeles", "Maarten van Gent", "Marco van den Berg", "Marine Corps Base Camp Pendleton", "Mark Daigneault", "Marten Scheepstra", "Matthew Otten", "Mike Brown (basketball, born 1970)", "Mike Fratello", "NAIA Men's Basketball Championships", "NAIA independent schools", "Nate McMillan", "P. J. Carlesimo", "Paramount, California", "Paramount High School", "Pat Stewart (basketball)", "Paul Silas", "Paul Westphal", "Pete Miller (basketball)", "Pete Newell", "Randy Wittman", "Rupport Clements", "Ruud Skála", "Sam Barry", "San Diego", "San Jose State Spartans women's basketball", "Scott Brooks", "Seattle Storm", "Seattle SuperSonics", "Stan Albeck", "Tom Nissalke", "Ton Boot", "Toronto Raptors", "Tulsa Shock", "Twitter", "Tyronn Lue", "UNLV Runnin' Rebels basketball", "USC Trojans men's basketball", "Victor Valley High School", "Victorville, California", "WNBA"]}