{"url": "https://en.wikipedia.org/wiki/Bokros_package", "title": "Bokros package", "summary": "The Bokros package (Hungarian: Bokros-csomag; named after the then-Minister of Finance Lajos Bokros) was a series of austerity measures announced by the Cabinet of Prime Minister Gyula Horn in Hungary on 12 March 1995.", "content": "The Bokros package (Hungarian: Bokros-csomag; named after the then-Minister of Finance Lajos Bokros) was a series of austerity measures announced by the Cabinet of Prime Minister Gyula Horn in Hungary on 12 March 1995.\n\n\n== Background ==\nHaving lost the free election in 1990 to the right-wing, reformist parties, the Hungarian Socialist Party, which had been in opposition to the Magyar Democrat Forum's government 1990–1994, won an absolute majority (54.1% of seats) in parliament on the 1994 election, running on a platform of more social harmony and attention to the needs of the poor. Despite winning a majority of seats, the reformed socialists formed a coalition government with the economically liberal Free Democrats. In addition, the socialists themselves were divided between a more traditional leftist wing and an economically liberal wing, some representatives of which could even be characterized as economically to the right of Free Democrats.\nIndeed, initially the new government initiated negotiations over a 'social pact'; there were also tensions between the prime minister Horn and his finance minister László Békesi, a leading liberal. However, as the danger of a financial crash became evident, the government changed its course, choosing neoliberal shock therapy, arguably well to the right of the previous government's policies.\n\n\n== Key elements ==\nThe catalog of restrictive fiscal policy measures was aimed at preventing the threat of a national bankruptcy. First, in March 1995 the ministry introduced a mechanism of gradual devaluation of the forint (called crawling peg) to cope with the looming deficit in the balance of accounts. The social benefits were limited in September 1995, tuition fees were introduced, the nominal wages in the public service were to increase from that time on only by 6–15%, which meant in the conditions of an inflation rate of 20% a significant reduction of real wages. In addition to this, the privatization process was accelerated.\n\n\n== Reactions ==\nThe Bokros package sparked fierce criticism and was deeply unpopular with the population. The right-wing opposition (including Fidesz) denounced the measures as catastrophic, there was also dissatisfaction and criticism from the left wing of the MSZP and its trade union wing. As a consequence, three ministers resigned. Nevertheless, the Prime Minister Horn won the majority of the Socialists behind himself. Thousands participated in a demonstration organized by the Hungarian Teachers' Union on 1 May protesting welfare and education cuts; the head of the teachers' union was Ilona Szőllősi, a Socialist MP, revealing deep splits in the ruling Socialist Party. Szőllősi stated that \"The economic philosophy the government is pursuing is a wild-liberal, not a socialist policy\".\n\n\n== Consequences ==\nThe package, including its deep social cuts, has been characterized as the most radical adjustment program ever attempted in Hungary.Although the Bokros package had as a result a significant reduction in real income, the Hungarian economy experienced a revival since 1997: 1997–2000 it grew at an annual rate of 4.2% to 5.2%.\n\n\n== See also ==\nEconomy of Hungary\nLajos Bokros\n\n\n== References ==", "links": ["Economy of Hungary", "Fidesz", "Gyula Horn", "Hungarian Socialist Party", "Hungarian economy", "Hungarian forint", "Hungarian language", "Hungarian parliamentary election, 1994", "Hungary", "Ilona Szőllősi", "Lajos Bokros", "László Békesi", "MSZP", "Minister of Finance of Hungary", "Prime Minister of Hungary", "Shock therapy (economics)"]}