{
    "url": "https://en.wikipedia.org/wiki/Brenda_Frese",
    "title": "Brenda Frese",
    "summary": "Brenda Sue Frese (born April 30, 1970) is an American women's basketball head coach and former player. Since 2002, she has served as the head coach of the University of Maryland women's basketball team. In her fourth year as head coach, she won the 2006 Women's National Championship. She won the 2009 ACC Regular Season and Tournament Championships – the women's first ACC Championship since 1989. She won another ACC Championship in 2012 and reached another Final Four in 2014. Maryland moved to the Big Ten for the 2014–15 season and Frese led the Terrapins to an undefeated 18–0 conference record and a Big Ten Regular Season Championship in their first year in the Big Ten. She was voted AP National Coach of the Year in 2002 and 2021, ACC Coach of the Year in 2013, Big Ten Coach of the Year in 2002, 2015, 2019, and 2021, and MAC Coach of the Year in 2000. At Maryland, she's coached four ACC Players of the Year and four ACC Freshmen of the Year.",
    "content": "Brenda Sue Frese (born April 30, 1970) is an American women's basketball head coach and former player. Since 2002, she has served as the head coach of the University of Maryland women's basketball team. In her fourth year as head coach, she won the 2006 Women's National Championship. She won the 2009 ACC Regular Season and Tournament Championships – the women's first ACC Championship since 1989. She won another ACC Championship in 2012 and reached another Final Four in 2014. Maryland moved to the Big Ten for the 2014–15 season and Frese led the Terrapins to an undefeated 18–0 conference record and a Big Ten Regular Season Championship in their first year in the Big Ten. She was voted AP National Coach of the Year in 2002 and 2021, ACC Coach of the Year in 2013, Big Ten Coach of the Year in 2002, 2015, 2019, and 2021, and MAC Coach of the Year in 2000. At Maryland, she's coached four ACC Players of the Year and four ACC Freshmen of the Year.\n\n\n== Early life ==\nBrenda Frese is the daughter of Bill and Donna Frese. She has five siblings: Deb, Cindy, Marsha, Stacy, and Jeff. She attended Washington High School in Cedar Rapids, Iowa. While in high school, Frese played on the basketball and volleyball teams for four years, as well as the track and softball teams for one year. She was a four-year basketball letterwinner, an Honorable Mention All-American and Iowa state champion in 1988, and an all-state and all-metro player from 1986 to 1988.Frese attended the University of Arizona as an undergraduate student. From 1989 until 1993 she played three seasons for the varsity basketball team. In 1989, she was selected for a Pac-10 tour of West Germany. Frese graduated from the university with a Bachelor of Arts in Communications in 1993. In 1995, she graduated from Kent State University with a master's degree in Athletic Administration.\n\n\n== Coaching career ==\nWhile injured as a player at the University of Arizona, Brenda Frese volunteered as an assistant coach at Pima Community College in Tucson, Arizona. Upon graduation, she immediately began pursuing a career in coaching, driving across the country to attend an NCAA Final Four and working various basketball camps. Frese's career officially started in 1994 as an assistant coach at Kent State and Iowa State and then spent three years as head coach at Ball State and Minnesota. In her very first game as a head coach, Frese led Ball State to an upset win over Minnesota. Less than two years later, Minnesota hired Frese as their new head coach. During her 2001–02 season at Minnesota, she led a one-year turnaround of 8–20 to 22–8, one of the biggest in NCAA history. Minnesota made it to the 2nd round of the NCAA Championship that year, and Frese was named the AP National Coach of the Year for 2002.  Minnesota's fan base quickly grew and the team was able to make a move to start playing its games in the same arena as the men's team.  After turning around the Minnesota program, Frese became a sought after coach and drew interest from Maryland, Ohio State and Florida. Maryland Athletic Director Debbie Yow sealed the deal the night of the 2002 Men's NCAA Basketball Championship game, in which Maryland defeated Indiana for the national championship.\nFrese was awarded the US Basketball Writers Association (USBWA) Coach of the Year award in 2002.\n\n\n=== Maryland ===\n\nWhen Frese arrived at Maryland prior to the 2002–03 season, she brought with her the buzz of a rising star in the women's hoops coaching world, as well as a remarkable recruiting acumen. Her first highly coveted recruits, Shay Doron and Kalika France, marked the beginning of an ever-expanding stream of blue-chip talent choosing to take their talents to College Park.\nDespite winning only 10 games in her first season, Frese, the 2002 AP National Coach of the Year, has quickly returned Maryland to national prominence.  As of the end of the 2012–13 season, Frese has guided Maryland to an overall record of 278–94 (.750) including nine NCAA tournament berths, nine consecutive 20-win seasons, six 25+ win seasons, four 30+ win seasons, four Elite Eights, the program's fourth NCAA Final Four appearance and the 2006 NCAA Women's Basketball National Championship. Maryland received its first-ever No. 1 preseason national ranking in 2006–07. The Terps remained in the top spot in the polls for 10-consecutive weeks. Frese led Maryland to the 2008–09 ACC regular season and 2009 ACC Tournament championships, as well as the 2012 ACC Tournament championship.\nPlayer-wise, all seniors to play for Frese at Maryland have graduated.  Frese's high octane Maryland program has also produced six \"Top Ten\" WNBA Draft Picks- Crystal Langhorne (2008), Laura Harper (2008), Marissa Coleman (2009), Kristi Toliver (2009), Tianna Hawkins (2012) and Alyssa Thomas (2014). Shay Doron was a 2nd round pick in the 2007 WNBA Draft- a remarkable accomplishment considering her final two college choices were Harvard and an at the time rebuilding Maryland program. Lynetta Kizer and Anjale Barrett were selected in the 2012 WNBA Draft.\n\n\n==== 2005–06: Championship season ====\n\nFrese coached Maryland's Terrapins to a 34–4 record during the 2006 season. The team finished the season by winning the 2006 NCAA Women's Division I Basketball Tournament. In the final game, Maryland's Kristi Toliver tied the game with a jump shot over center Alison Bales with six seconds left, forcing Duke into overtime, and eventually led Maryland to a win by a score of 78–75. She is the fifth youngest women's coach to win a national championship.\nIn October 2006, Frese and writer Chris King released a book chronicling the Terrapins' rise to their 2006 championship win entitled Overtime Is Our Time. The 200-page book, published by Terrapin State Publishing, earned acclaim by national TV basketball analyst Debbie Antonelli.\n\n\n==== After the championship ====\nThe Terp women were ranked #1 in major preseason polls entering the 2006–07 season, a first for the program. They were also set to debut star Tennessee transfer Sa'de Wiley-Gatewood, who was unfortunately limited by tendinitis in both knees but still contributed on and off the court. The team, however, did not deliver a performance as stirring or convincing as in their championship year; they went 0–3 in the regular season against ACC rivals North Carolina and Duke, were eliminated by the Tar Heels in the ACC Tournament and were upset in the NCAA Tournament's round of 32 by Ole Miss. Maryland had beaten Ole Miss decisively (110–79) during the regular season at a tournament in the Bahamas.Maryland spent much of the 2007–08 season ranked among the nation's top five teams and finished the season 33–4. The Terps advanced to the NCAA's Elite Eight, where they lost an entertaining, high-scoring affair to Stanford, 98–87. During the season, Coach Frese gave birth to twin boys- Markus William Thomas and Tyler Joseph Thomas- on February 17, 2008. That same day, Maryland won on the road at Duke, 76–69, giving Maryland a sweep of the regular season series. Maryland won the preseason WNIT, defeating LSU in the championship game, 75–62. Kristi Toliver won the Nancy Lieberman Award, which is given annually to the nation's top point guard. Crystal Langhorne was voted ACC Player of the Year. Both Langhorne and Toliver were named State Farm All-Americans. Langhorne and fellow senior Laura Harper were top 10 picks in the WNBA Draft.\nIn 2008–09, after losing five seniors and dropping the season opener at Texas Christian University, Frese was able to coach the team to both the ACC Regular Season and Tournament championships, as well as an NCAA Elite Eight appearance and 31–5 record.  Kristi Toliver was named ACC Player of the Year, Marissa Coleman won ACC Tournament MVP and freshman Lynetta Kizer won ACC Rookie of the Year.  Coleman and Toliver were selected #2 and #3, respectively, overall in the '09 WNBA Draft.\nIn 2010–11, Maryland bounced back from a year's absence from the NCAA Tournament with a fourth-place finish in the ACC regular season. The team had no seniors on its roster. Alyssa Thomas earned seven ACC Rookie of the Week honors and won ACC Rookie of the Year. Four freshmen under Frese have won the ACC's Rookie of the Year award (Langhorne, Coleman, Kizer and Thomas). Lynetta Kizer and Alyssa Thomas earned 2nd team All-ACC honors.\n\n\n== Personal life ==\nFrese was previously married to Steven Oldfield from 1998 to 2002 and was known as Brenda Oldfield at the time.Frese married Mark Thomas in 2005. In the 2007 offseason, Frese learned she was pregnant with twins. She gave birth to sons Markus William and Tyler Joseph on February 17, 2008. Her youngest son was diagnosed with leukemia (ALL) on September 28, 2010.\nFrese's sister Marsha Frese is also a college basketball coach, having worked under Brenda Frese as an assistant at Ball State, Minnesota, and Maryland. In 2012, Marsha Frese became head coach at UMKC.\n\n\n== Head coaching record ==\n\n\n== References ==\n\n\n== External links ==\nMaryland profile",
    "links": [
        "2002 NCAA Women's Division I Basketball Tournament",
        "2004 NCAA Women's Division I Basketball Tournament",
        "2005 NCAA Women's Division I Basketball Tournament",
        "2005–06 Maryland Terrapins women's basketball team",
        "2006 NCAA Division I Women's Basketball Tournament",
        "2006 NCAA Women's Division I Basketball Tournament",
        "2006–07 NCAA Division I women's basketball rankings",
        "2007 NCAA Division I Women's Basketball Tournament",
        "2007 NCAA Women's Division I Basketball Tournament",
        "2007–08 NCAA Division I women's basketball rankings",
        "2008 NCAA Women's Division I Basketball Tournament",
        "2008 WNBA draft",
        "2009 NCAA Women's Division I Basketball Tournament",
        "2009 WNBA draft",
        "2009–10 Maryland Terrapins women's basketball team",
        "2010 Women's National Invitation Tournament",
        "2011 NCAA Women's Division I Basketball Tournament",
        "2012 NCAA Women's Division I Basketball Tournament",
        "2013 NCAA Women's Division I Basketball Tournament",
        "2014 NCAA Women's Division I Basketball Tournament",
        "2014–15 Maryland Terrapins women's basketball team",
        "2015 NCAA Women's Division I Basketball Tournament",
        "2015–16 Maryland Terrapins women's basketball team",
        "2016 NCAA Women's Division I Basketball Tournament",
        "2016–17 Maryland Terrapins women's basketball team",
        "2017 NCAA Women's Division I Basketball Tournament",
        "2017–18 Maryland Terrapins women's basketball team",
        "2018 NCAA Women's Division I Basketball Tournament",
        "2018–19 Maryland Terrapins women's basketball team",
        "2019 NCAA Women's Division I Basketball Tournament",
        "2019–20 Maryland Terrapins women's basketball team",
        "2020 NCAA Women's Division I Basketball Tournament",
        "2020–21 Maryland Terrapins women's basketball team",
        "2021 NCAA Division I Women's Basketball Tournament",
        "2021–22 Maryland Terrapins women's basketball team",
        "2022 NCAA Division I Women's Basketball Tournament",
        "Acute lymphoblastic leukemia",
        "Alison Bales",
        "Alyssa Thomas",
        "Amy Williams (basketball)",
        "Andy Landers",
        "Angie Lee",
        "Arizona Wildcats",
        "Arizona Wildcats women's basketball",
        "Associated Press College Basketball Coach of the Year",
        "Atlantic Coast Conference",
        "Ball State",
        "Ball State Cardinals women's basketball",
        "Big Ten Conference",
        "Big Ten Conference Women's Basketball Coach of the Year",
        "Bud VanDeWege",
        "C. Vivian Stringer",
        "COVID-19",
        "Carolyn Kieger",
        "Carolyn Peck",
        "Ceal Barry",
        "Cedar Rapids, Iowa",
        "Cheryl Littlejohn",
        "Chris Weller",
        "Connie Yori",
        "Coquese Washington",
        "Courtney Banghart",
        "Crystal Langhorne",
        "Dawn Staley",
        "Deb Wilson",
        "Debbie Ryan",
        "Debbie Yow",
        "Don Perrelli",
        "Duke Blue Devils women's basketball",
        "ESPN's National Coach of the Year",
        "Ellen Mosher Hanson",
        "Gail Goestenkors",
        "Geno Auriemma",
        "Guard (basketball)",
        "Head coach",
        "ISSN (identifier)",
        "Illinois Fighting Illini women's basketball",
        "Indiana Hoosiers women's basketball",
        "Iowa Hawkeyes women's basketball",
        "Iowa State",
        "Iowa State Cyclones women's basketball",
        "Jane Albright",
        "Jeff Walz",
        "Jenny Johnson (basketball)",
        "Jim Foster (basketball)",
        "Joan Stevenson",
        "Joanna Bernabei-McNamee",
        "Joanne P. McCallie",
        "Joe Curl",
        "Joe McKeown",
        "Karen Langeland",
        "Katie Gearlds",
        "Katie Meier",
        "Kent State",
        "Kent State Golden Flashes women's basketball",
        "Kevin McGuff",
        "Kim Barnes Arico",
        "Kim Mulkey",
        "Kristi Toliver",
        "LaRue Fields",
        "Laura Harper (basketball)",
        "Leon Barmore",
        "Lin Dunn",
        "Linda Hill-MacDonald",
        "Linda Wells (softball)",
        "Lindsay Whalen",
        "Lisa Bluder",
        "Lisa Stone",
        "Marisa Moseley",
        "Marissa Coleman",
        "Marlene Stollings",
        "Marsha Frese",
        "Mary Murphy (basketball)",
        "Maryland Terrapins women's basketball",
        "Michigan State Spartans women's basketball",
        "Michigan Wolverines women's basketball",
        "Mid-American Conference",
        "Minnesota Golden Gophers women's basketball",
        "Muffet McGraw",
        "NCAA Basketball Tournament Most Outstanding Player",
        "NCAA Women's Division I Basketball Championship",
        "Nancy Lieberman Award",
        "Nebraska Cornhuskers women's basketball",
        "Nell Fortner",
        "Northwestern Wildcats",
        "Ohio State Buckeyes women's basketball",
        "Ole Miss Rebels",
        "Pac-12 Conference",
        "Pam Borton",
        "Pat Summitt",
        "Penn State Lady Lions basketball",
        "Pima Community College",
        "Pokey Chatman",
        "Purdue Boilermakers women's basketball",
        "Rene Portland",
        "Rutgers Scarlet Knights women's basketball",
        "Ruth Jones (coach)",
        "Shauna Green",
        "Shay Doron",
        "Sue Guevara",
        "Sue Semrau",
        "Suzy Merchant",
        "Sylvia Hatchell",
        "TCU Horned Frogs",
        "Tara VanDerveer",
        "Teri Moren",
        "The Athletic's National Coach of the Year",
        "The Baltimore Sun",
        "The Washington Post",
        "Theresa Grentz",
        "Tianna Hawkins",
        "UMKC Kangaroos",
        "USBWA Women's National Coach of the Year",
        "University of Arizona",
        "University of Maryland, College Park",
        "University of Minnesota",
        "University of Tennessee",
        "Vic Schaefer",
        "Washington High School (Cedar Rapids, Iowa)",
        "Wendy Larry",
        "West Germany",
        "Wisconsin Badgers women's basketball",
        "Women's basketball"
    ]
}