{"url": "https://en.wikipedia.org/wiki/Brisbane_City_Council_Tramways_Substation_No._8", "title": "Brisbane City Council Tramways Substation No. 8", "summary": "Brisbane City Council Tramways Substation No. 8 is a heritage-listed electrical substation at 134 Kedron Park Road, Wooloowin, City of Brisbane, Queensland, Australia. It was built from 1934 to 1937. It was added to the Queensland Heritage Register on 5 August 2003.\n\n", "content": "Brisbane City Council Tramways Substation No. 8 is a heritage-listed electrical substation at 134 Kedron Park Road, Wooloowin, City of Brisbane, Queensland, Australia. It was built from 1934 to 1937. It was added to the Queensland Heritage Register on 5 August 2003.\n\n\n== History ==\nThe former Brisbane City Council Tramway substation no 8 is a two-storey building of dark brick built to the design of Brisbane City Council Tramways architect R R Ogg between 1934-37.Horse-drawn trams operated in Brisbane from August 1885, operated by an English company, Metropolitan Tramway and Investment Co. Ltd. The first public supply of electricity in Brisbane was from a generator in Edison Lane, which supplied the General Post Office in 1888. Early development in the industry was in the hands of a number of private companies and the situation was complex because the metropolitan area comprised fourteen separate local authorities. After various liquidations and restructurings the City Electric Light Company Limited (CEL) was established in 1904. Parallel development took place in electric traction. The Brisbane Tramways Company, a private enterprise formed in 1895, introduced the first electric trams to Brisbane in 1897 after purchasing the early horse car system, converting it to electric operation and expanding and extending the routes. A power station to supply current to the electric trams was constructed in Countess Street in 1897.As the tramway system extended out into the suburbs, the Countess Street power station was unable to supply all the energy requirements. Two engine sets from Countess Street were transferred to a building in Logan Road to provide for a feeding point for the system on the south side of the river. Supply was also fed from the tramway 550-volt DC mains to a number of establishments along the tramway routes, such as butcher shops, sawmills and factories. By 1918, the whole of the tramways public power supply equipment in South Brisbane was sold to the City Electric Light Company, which developed a supply for South Brisbane from its power station in William Street. At the conclusion of World War I there was general support for the notion that the tramway system should be owned and operated by a public authority rather than a private company. In 1922, an Act of Parliament inaugurated the Brisbane Tramway Trust.The establishment in 1925 of the Brisbane City Council created a single public authority that could plan for the provision of electrical services throughout the entire city. Expansion of electricity supply and the development of better public transport networks were important issues for the Greater Brisbane City Council and were closely linked to the spread of suburban development. At a time when few working people owned their own transport, a reliable public transport system was essential to link people with their work and with schools, shops and services. However, the situation of energy generation and supply was chaotic. Three small obsolete power stations generated energy for trams and electricity for Ithaca and Toowong and the supply for all other suburbs was purchased in bulk from CEL under 10 year agreements.The 1920s and 1930s was a period of tramways expansion following the BCC acquisition of the tramways system from the Brisbane Tramways Trust in 1925. In 1926 the Greater Brisbane Council, anxious to control the city's electricity supply, decided to build its own powerhouse at New Farm, under the supervision of the BCC Tramways Department. Opened on 28 June 1928, New Farm Power Station distributed 1100 kW AC power to a network of 11 suburban tramways substations erected in the 1920s and 1930s. The substations were located at strategic points throughout the system - substations No. 2 (Russell Street) and No. 6 (Windsor) came into service in 1927, No. 4 (Petrie Terrace) and No. 5 (Newstead) in 1928; Substation No. 9 (Norman Park) came on line in 1935.Considerable attention was given to the design of the substations serving the tramway system. The architecture was marked by the stylistic preferences of individual architects particularly the Brisbane City Architects AH Foster and FG Costello and the BCC Tramways architect RR Ogg. Although they were robust utility buildings, generally small in scale, elegant proportions and such details as finely crafted brickwork distinguished them.By 1933 an additional substation was urgently required at Kedron in order to relieve a serious overload being carried every afternoon by the substation at Windsor, where the 500 kW mercury arc rectifier plant was carrying 700 volts. Council minutes suggest that provision for this new substation should have been made two or three years prior to 1933, but that the expenditure was delayed for financial reasons until it became essential for safety.On 29 May 1934 the council authorised purchase of an allotment facing Kedron Brook Road and adjoining the Kedron Park Hotel for the purpose of constructing a tramway substation. Tenders were received on 8 June 1934 and that of General Electric Industries Limited Brisbane was accepted using materials supplied by British Thomson Houston Ltd of Rugby. A further portion of land to be used as an easement was purchased in August 1934.Prior to 1940, the design of substations was the responsibility of BCC Tramways Department architect and construction engineer, Roy Rusden Ogg. In conjunction with the tramway's chief engineers Nelson and Arundell, he designed at least 10 Brisbane substations between 1926 and 1936 and the first two stages of the New Farm powerhouse. Ogg also designed the Tramways Departments Head Office building on Coronation Drive in 1929.The Kedron substation remained in service until the phasing out of Brisbane's trams in the late 1960s. In 1969 the line was closed and the substation's electrical equipment was removed, though the travelling crane remained. The building became a State Emergency Services Depot and changes were made to the interior to accommodate this use. The lower level of the original two level floor has been extended to park a rescue boat and a mezzanine level was inserted in the mid 1980s. A single storey brick garage has been added.\n\n\n== Description ==\n\nThe former substation is a two-storey building of austere appearance and is constructed of dark, glazed bricks laid in English bond.It has a metal clad gabled roof concealed by a brick parapet at the front and sides. The parapet on the front and western sides is decorated with a moulded brickwork stringcourse and a decorative band comprising three-course corbelling, brick dentils and a cornice. The sheet metal rainwater heads and downpipes are also finely detailed. The window openings have flush concrete render heads and sills, although a projecting concrete sill spans the row of three windows high on the Kedron Park Road elevation. A large galvanised sheet steel roller shutter is fitted to the opening below these windows.The lower part of the main building is spare in detail. Entry is by a concrete and steel stair supported on brick piers. The exterior reveals a series of changes to the building, with openings variously enlarged, added and filled in. The rear wall is clad in colour-finished corrugated iron. There is a single storey garage of stretcher bond brick at the southwest corner and a shipping container has been positioned immediately to the south of the main building.The interior has a steel and timber mezzanine floor and the ceiling is lined with fibrous cement sheeting and timber cover strips. The travelling crane survives complete with ropes and pulleys. It runs north to south on steel rails supported on corbelled brickwork and intermittently by a series of engaged piers. The face brickwork is variously painted and unpainted and a number of remnant openings and brackets provide evidence of the building's previous function.Adjoining the main space is a kitchen area, leading to a toilet and storage area. The external areas of the site are paved in bitumen and flow into the car park of the adjoining hotel.\n\n\n== Heritage listing ==\nBrisbane City Council Tramways Substation No. 8 (former) was listed on the Queensland Heritage Register on 5 August 2003 having satisfied the following criteria.The place is important in demonstrating the evolution or pattern of Queensland's history.\nThe former tramway substation is important in demonstrating an important aspect of Queensland's industrial development and is closely linked to Brisbane's suburban expansion in the 1920s and 30s and with the development of the electricity supply system.The place demonstrates rare, uncommon or endangered aspects of Queensland's cultural heritage.\nThe former substation is now uncommon evidence for an important mode of transport, which was discontinued in Brisbane in 1969 and for which much of the infrastructure has since been removed.The place is important in demonstrating the principal characteristics of a particular class of cultural places.\nIn design, scale and materials, the former substation is important in demonstrating the principal characteristics of the Brisbane tramways substations.As a well-conceived utility structure, it is important as a fine example of the municipal work of tramways architect Roy Rusden Ogg.The place is important because of its aesthetic significance.\nThe former substation contributes to the streetscape, its quality of design and materials enabling the prominently placed building to successfully combine function and a pleasing appearance.The place has a special association with the life or work of a particular person, group or organisation of importance in Queensland's history.\nAs a well-conceived utility structure, it is important as a fine example of the municipal work of tramways architect Roy Rusden Ogg.\n\n\n== See also ==\nTrams in Brisbane\nBrisbane tramways substations\nBrisbane Tramways Substation No. 6 at Windsor\nBrisbane City Council Tramways Substation No 9 at Norman Park\n\n\n== References ==\n\n\n=== Attribution ===\n This Wikipedia article was originally based on \"The Queensland heritage register\" published by the State of Queensland under CC-BY 3.0 AU licence (accessed on 7 July 2014, archived on 8 October 2014). The geo-coordinates were originally computed from the \"Queensland heritage register boundaries\" published by the State of Queensland under CC-BY 3.0 AU licence (accessed on 5 September 2014, archived on 15 October 2014).\n\n\n== External links ==\n Media related to Brisbane City Council Tramways Substation No. 8 at Wikimedia Commons", "links": ["Bracket (architecture)", "Brisbane", "Brisbane City Council", "Brisbane City Council Tramways Substation No 9", "Brisbane Tramways Substation No. 6", "Brisbane Tramways substations", "City of Brisbane", "Classical architecture", "Cornice", "Coronation Drive, Brisbane", "Dentil", "Electrical substation", "General Post Office, Brisbane", "Geographic coordinate system", "Ithaca, Queensland", "Kedron, Queensland", "Kedron Brook", "Logan Road, Brisbane", "Mezzanine", "New Farm, Queensland", "Newstead, Queensland", "Norman Park, Queensland", "Petrie Terrace, Queensland", "Queensland", "Queensland Heritage Register", "South Brisbane, Queensland", "Span (architecture)", "State of Queensland", "Toowong", "Trams in Brisbane", "Windsor, Queensland", "Wooloowin, Queensland"]}