{"url": "https://en.wikipedia.org/wiki/Business_routes_of_Interstate_70", "title": "Business routes of Interstate 70", "summary": "Business routes of Interstate 70 (I-70) exist in three states, though historically they have existed in five. Utah and Missouri each have three existing Interstate 70 (I-70) business routes. Business routes in Kansas have either been proposed and rejected or decommissioned. Another 13 I-70 business routes also exist in Colorado, and four others have also existed in the past, leading to a grand total of 17 within the Centennial State.", "content": "Business routes of Interstate 70 (I-70) exist in three states, though historically they have existed in five. Utah and Missouri each have three existing Interstate 70 (I-70) business routes. Business routes in Kansas have either been proposed and rejected or decommissioned. Another 13 I-70 business routes also exist in Colorado, and four others have also existed in the past, leading to a grand total of 17 within the Centennial State.\n\n\n== Utah ==\n\n\n=== Richfield business loop ===\nInterstate 70 Business (I-70 Bus.) is a business loop of I-70 along State Route 120 (SR-120) in Richfield that runs between exits 37 and 40.\n\n\n=== Salina business spur ===\nInterstate 70 Business (I-70 Bus.) is a business spur of I-70 along U.S. Route 50 (US 50)/US 89 in Salina running north from exit 56 for 1.8 miles (2.9 km) until terminating at the end of the US 50/US 89 overlap.\n\n\n=== Green River business loop ===\nInterstate 70 Business (I-70 Bus.) is a business loop of I-70 along SR-19 in Green River that runs between exits 160 and 164.\n\n\n== Colorado ==\n\n\n== Kansas ==\nThe majority of business routes of I-70 in Kansas consist of former business routes and formerly proposed business route.\n\n\n=== Goodland business loop ===\nInterstate 70 Business (I-70 Bus.) was a formerly proposed business loop of I-70 along parts of K-27 and former US 24 in Goodland that was to run between exits 17 and 19. It was suggested in 1979 but rejected by Goodland, who opted for US 24 Bus. instead.\n\n\n=== Colby business loop ===\nInterstate 70 Business (I-70 Bus.) was a former business loop of I-70 that ran from US 24 at exit 45 to K-25 at exit 53 in Colby.\n\n\n=== Oakley business loop ===\nInterstate 70 Business (I-70 Bus.) was a former business loop of I-70 that ran south from US 83 at exit 70 to US 40 at exit 76 in Oakley.\n\n\n=== WaKeeney business loop ===\nInterstate 70 Business (I-70 Bus.) was a formerly proposed business loop of I-70 along parts of US 283 and former US 40 in WaKeeney that was to run between exits 127 and 128. It was suggested in 1979 but rejected by the American Association of State Highway and Transportation Officials (AASHTO), who opted for US 40 Bus. instead.\n\n\n=== Hays business loop ===\nInterstate 70 Business (I-70 Bus.) was a former business loop of I-70 that ran south from US 183 Bypass (US 183 Byp., formerly US 183 Alternate (US 183 Alt.)) at exit 157 to Eighth Street then north along US 183 at exit 159 in Hays.\n\n\n=== Russell business loop ===\nInterstate 70 Business (I-70 Bus.) was a formerly proposed business loop of I-70 along parts of US 281 and former US 40 in Russell that was to run between exits 184 and 189. It was suggested in 1979 but rejected immediately by AASHTO, who opted for US 40 Bus. instead.\n\n\n=== Junction City–Grandview Plaza business loop ===\nInterstate 70 Business (I-70 Bus.) was a formerly proposed business loop of I-70 along parts of former US 40 Alt. and former US 77 Alt. (current K-57) that was to travel between exit 296 in Junction City and exit 300 in Grandview Plaza. It was suggested in 1979 but rejected immediately by AASHTO, who opted for US 40 Bus. instead.\n\n\n== Missouri ==\n\n\n=== Boonville business loop ===\nInterstate 70 Business (I-70 Bus.) is a business loop of I-70 in Boonville. It runs from exit 101 on I-70, taking the overlap with US 40 with it and also overlapping Route 5. I-70 Bus./US 40/Route 5 run northeast, where it intersects both Old Highway 40 and Sombart Road, the latter of which serves as a connection to the Santa Fe Trail. As it passes by Frederick T. Kemper Park, the routes curve to the east and approaches Route 87 (Main Street), where US 40/Route 5 turns left at a northbound overlap while I-70 Bus. turns south at a southbound overlap, until both routes turn southeast onto Bingham Road and Main Street becomes \"Highway B\". The further the road gets away from Boonville, the more chances the suburban settings give way to rural and agricultural ones. Aside from the western terminus of Route 98, the only other site is the Hail Ridge Golf Course and a local street leading to Jesse Viertel Memorial Airport. I-70 Bus. ends in Windsor Place at exit 106 on I-70, while Route 87 continues south toward Eldon.\n\n\n=== Columbia business loop ===\n\nInterstate 70 Business (I-70 Bus.) is a business loop of I-70 in Columbia between exits 125 and 128.\n\n\n=== St. Charles business loop ===\nInterstate 70 Business (I-70 Bus.) is a business loop of I-70 in St. Charles. It runs from exit 228 to 229, partially along Route 94, as well as otherwise unmarked First Capitol Drive and Fifth Street.\nI-70 Bus. begins at exit 228, a single-point urban interchange (SPUI) with Route 94 (First Capitol Drive) and turns north, immediately having an unconventional interchange with Boone's Lick Road. From there, it passes by a city water tower just south of West Clay Street. As it runs past Lindenwood University, I-70 Bus./Route 94 curves around a former segment of First Capitol Drive, then reencounters that road as I-70 Bus. makes a sharp right turn to the east while Route 94 continues to the northeast along Kings Highway. First Capitol Drive runs at a straight line toward Riverside Drive and the Katy Trail State Park along the Missouri River, but I-70 Bus. does not go that far. Instead, it makes a sharp right turn at South Fifth Street, which becomes North Fifth Street two blocks north of this intersection. South Fifth Street is four lanes wide with a center left-turn lane for one block but narrows down to two lanes between Jackson and Tompkins Streets, only to widen again south of McDonough Street. The route becomes a divided highway before the intersection with Boone's Lick Road, and the last intersection along the route is Bass Pro Drive and Ameristar Boulevard. I-70 Bus. ends at exit 229 as it loops into a partial cloverleaf interchange with I-70, just before that road crosses a bridge over the Missouri River.\n\n\n== Ohio ==\n\n\n=== Springfield business loop ===\nInterstate 70 Business (I-70 Bus.) was a former business loop for I-70 in Springfield. It ran from exit 47 at the east end of the State Route 4 (SR 40) overlap onto an expressway. The first interchange was a diamond interchange with Enon Road, then a partial cloverleaf with the southern terminus of SR 369. The route made an easterly turn before crossing a bridge over a railroad line, then encountered a west-to-southbound only flyunder interchange with Lower Valley Pike shortly before another westbound only flyunder interchange with US 40, where the expressway ended.\nAfter the interchange with US 68, which also included a bridge over the Mad River, I-70 Bus./US 40/SR 4 branched off to the northeast to break away from the Historic National Road onto Park Road, then became part of North Street. The route became a one-way pair after Bechtle Avenue, with the eastbound lanes moving to Columbia Street. Continuing to pass through downtown Springfield, the routes were joined by SR 41 at North Yellow Springs Street. Eastbound I-70 Bus./US 40/SR 4/SR 41 passed under a bridge that carried SR 72 on North Spring Street, while westbound I-70 Bus./US 40/SR 4/SR 41 intersected SR 72 directly. Access to SR 72 was from North Spring Street to either East Main Street or the westbound routes along North Street.\nSR 4 left the concurrency remaining on Columbia Street, when the one-way pair ended at an interchange for Lagonda Avenue, then turned southeast on another brief limited-access segment which ended as it rejoined Main Street at an at-grade interchange that included North and South Greenmount Avenues. SR 41 left the concurrency at the intersection with North and South Belmont Avenues, specifically turning onto South Belmont Avenue. East of South Fostoria Avenue, I-70 Bus./US 40 ran over another bridge over a railroad line, then widened to a four-lane divided highway with a wider grassy median. Some portions of this segment were also flanked by frontage roads. Among the sites along the road were the mothballed Melody Drive-In, the Harmony Farm Market, and the Heart of Ohio Antique Center as the last notable sites before I-70 Bus. ended at exit 62 on I-70 while US 40 continued toward Columbus, Ohio; Zanesville, Ohio; Baltimore, Maryland; and Atlantic City, New Jersey.\nSince 2008, I-70 Bus. has been decommissioned, but all other routes that ran concurrent with the route remain intact. Additionally, North Street was realigned between east of North Wittenburg Avenue and North Yellow Springs Street in 2011 to make way for a parking lot expansion at Mercy Health—Springfield Regional Medical Center.\n\n\n== References ==\n\n\n== External links ==\nInterstate Business Route 70 (Interstate Guide)", "links": ["American Association of State Highway and Transportation Officials", "Atlantic City, New Jersey", "Baltimore, Maryland", "Boonville, Missouri", "Business Loop", "Business loop", "Business route", "Business routes of Interstate 70 in Colorado", "Colby, Kansas", "Colorado State Highway 470", "Columbia, Missouri", "Columbus, Ohio", "E-470", "Eldon, Missouri", "Goodland, Kansas", "Grandview Plaza, Kansas", "Green River, Utah", "Hays, Kansas", "Historic National Road", "Interstate 170", "Interstate 170 (Maryland)", "Interstate 270 (Colorado)", "Interstate 270 (Maryland)", "Interstate 270 (Missouri–Illinois)", "Interstate 270 (Ohio)", "Interstate 370", "Interstate 470 (Kansas)", "Interstate 470 (Missouri)", "Interstate 470 (Ohio–West Virginia)", "Interstate 670 (Kansas–Missouri)", "Interstate 670 (Ohio)", "Interstate 70", "Interstate 70 Business (Columbia, Missouri)", "Interstate 70 in Colorado", "Interstate 70 in Illinois", "Interstate 70 in Kansas", "Interstate 70 in Maryland", "Interstate 70 in Missouri", "Interstate 70 in Ohio", "Interstate 70 in Utah", "Interstate 70 in West Virginia", "Interstate Highway System", "Jesse Viertel Memorial Airport", "Junction City, Kansas", "K-25 (Kansas highway)", "K-27 (Kansas highway)", "K-57 (Kansas highway)", "Katy Trail State Park", "Lindenwood University", "List of Interstate Highways", "List of auxiliary Interstate Highways", "List of business routes of the Interstate Highway System", "List of future Interstate Highways", "List of suffixed Interstate Highways", "Missouri River", "Missouri Route 370", "Missouri Route 5", "Missouri Route 87", "Missouri Route 94", "Missouri Route 98", "Oakley, Kansas", "Ohio State Route 369", "Ohio State Route 4", "Ohio State Route 41", "Ohio State Route 72", "One-way pair", "Richfield, Utah", "Russell, Kansas", "Salina, Utah", "Santa Fe Trail", "Single-point urban interchange", "Springfield, Ohio", "St. Charles, Missouri", "U.S. Route 183 Alternate (Hays, Kansas)", "U.S. Route 183 Bypass (Hays, Kansas)", "U.S. Route 183 in Kansas", "U.S. Route 24 Business (Goodland, Kansas)", "U.S. Route 24 in Kansas", "U.S. Route 281 in Kansas", "U.S. Route 283 in Kansas", "U.S. Route 40 Alternate (Junction City–Grandview Plaza, Kansas)", "U.S. Route 40 Business (Junction City-Grandview Plaza, Kansas)", "U.S. Route 40 Business (Russell, Kansas)", "U.S. Route 40 Business (WaKeeney, Kansas)", "U.S. Route 40 in Kansas", "U.S. Route 40 in Missouri", "U.S. Route 40 in Ohio", "U.S. Route 50 in Utah", "U.S. Route 68 in Ohio", "U.S. Route 77 Alternate (Junction City, Kansas)", "U.S. Route 83 in Kansas", "U.S. Route 89 in Utah", "United States", "Utah State Route 120", "Utah State Route 19", "WaKeeney, Kansas", "Windsor Place, Missouri", "Zanesville, Ohio"]}