{"url": "https://en.wikipedia.org/wiki/Camomile_Hixon", "title": "Camomile Hixon", "summary": "Camomile Hixon (born Camomile Mary Weiss in 1970) is an American visual artist whose primary medium is glitter and paint on canvas. Her works range from large-scale installations and environments to The Search for the Missing Unicorn, an interactive street art project that has reached over 120 countries.", "content": "Camomile Hixon (born Camomile Mary Weiss in 1970) is an American visual artist whose primary medium is glitter and paint on canvas. Her works range from large-scale installations and environments to The Search for the Missing Unicorn, an interactive street art project that has reached over 120 countries.\n\n\n== Early life and education ==\nHixon was born in New York City and raised in Milford, Connecticut. She studied filmmaking and philosophy at Hofstra University.\n\n\n== Career ==\nShe moved to Los Angeles to work in the film industry as an executive for Sanford-Pillsbury Productions. During that time, Hixon developed independent film projects and focused on music; composing, singing and recording. She also studied the classical music of North India under Guruji Mala Ganguly including voice in Sanskrit/Bengali and harmonium. After a number of years, Hixon returned to New York City with her husband, Dylan, and two sons.\n\n\n=== Glitter paintings ===\nIn 2010 Hixon made the first Glitter YES painting for a party and the mood in the room was unusually joyous. Art dealer, Latifa Metheny of Tria Gallery couldn't help but notice and offered her a solo show on the spot. Sparkle followed in April 2010, an exhibition of paintings featuring words, punctuation, flowers, and fireworks. This show was a near sellout and another show, Scintilla followed a few months later at the same space on West 25th St in Chelsea. Tastemakers Bob and Cortney Novogratz took notice by acquiring two pieces for their townhouse in the West Village and featuring her art on two episodes of the internationally syndicated HGTV show Home by Novogratz. Hixon's work was also featured on the nationally syndicated Wendy Williams show in 2011. Hixon has since exhibited glitter paintings in Singapore and on three separate occasions in Japan with Giant Mango Gallery as well as in Austria and Germany with Velvinoir Gallery. Shows and works on view in the U.S. include Los Angeles at Bergamot Station with Frank Pictures Gallery, Dallas, Texas at Gallery Noir, San Francisco with Stephanie Breitbard Fine Art and Washington D. C. at Dalton Pratt. Her museum shows include the American Textile Museum, Lowell Massachusetts, The Lyman Allyn Museum of Art, New London Connecticut, and The Cornell Museum of Art, Delray Beach, Florida.\n\n\n=== The Missing Unicorn Project ===\nThe search for the Missing Unicorn began in New York City in the Fall of 2010 when Hixon and a team posted thousands of fliers that read: Missing Unicorn~ Large female with friendly disposition last seen entering Central Park at West. 72nd St. If seen, please call and leave a message. Denizens of New York City participated by leaving thousands of phone calls to the dedicated phone-line as the project went viral. New York Magazine, MSNBC and The Los Angeles Times. covered the story and famed fashion photographer Terry Richardson took an art photo of the poster. People from over 120 countries and in various languages have contributed to this ongoing interactive street art piece by leaving messages on the Unicorn Hotline, uploading images of their sightings on missingunicorn.com and downloading the poster to begin their own searches. \nHixon believes in the power of dialogue to defuse conflicts and promote understanding among cultures around the world, and she sees the Missing Unicorn Project as an olive branch for the 21st century, capable of disarming people, so they may focus on their likenesses as they tell stories of joy, hope, and the possibility of unrequited dreams fulfilled. The notion of infinite possibility for one's self and the world is symbolized by the Unicorn.\n\n\n=== Unicorns in Residence Providence ===\nUnicorns in Residence Providence 2015 represents a partnership with Camomile Hixon and the major institutions of Providence, Rhode Island to bring imaginative play to its citizens through the arts. The public is invited on an interactive search for the Missing Unicorn and to be inspired by unicorn art throughout the city. A number of unicorn related exhibitions have taken place and are being hosted by the partners: Brown University Libraries, RISD Museum, RISD Library, Department of Parks and Recreation, Department of Art, Culture and Tourism, Partnership for Providence Parks, Providence Athenaeum, Providence Children's Museum, Providence Community Libraries, and Providence Public Library. The Project is being curated by RISD Museum Board Member Helene Miller.\n\n\n=== Super-sized flower installations ===\nHixon's enormous kinetic flower sculptures are made of PVC, cellophane and other materials including copper wire and feathers. Her first such installation, Windblown Lavender 2011 was installed across the façade of the Lyme Art Association, Old Lyme, Connecticut. The Children's Museum of the Arts in SoHo commissioned a 15’ Dandelion Plant made of cellophane for their lobby in 2012. For Armory Art week, as part of the Armory sponsored lecture series, Hixon exhibited Fly Away Dandelions, an installation that filled a gallery with dandelion seed heads made of brass wire and cellophane.\n\n\n=== Head in The Clouds installation (2015) ===\nFor Brown University's 250th Anniversary, Hixon was invited to fill five floors of Brown's Granoff Center for the Creative Arts Building with wire mesh clouds. The cloud formation was seen floating through the building at an oblique angle with corresponding video projection on five large screens and a GroudCloud environment where the viewer was invited to climb into a cloud and read poetry.\n\n\n== Exhibitions ==\nHixon exhibited nine glitter paintings on canvas entitled Textile Studies at the American Textile History Museum, Lowell MA in 2010. \nHixon was invited by the Central Park Conservancy in November 2010 to exhibit two life-sized glitter unicorns in Central Park as part of the Missing Unicorn Project. These works were on view during the NYC Marathon. \nThe Lyman Allyn Museum of Art in New London, CT hosted Hixon's Unicorn Stampede in 2013, consisting of an environment with 24 life-sized glitter unicorns, elaborate lighting and music composed and sung by Hixon \nThe Cornell Museum of American Art in Delrey Beach FL is currently exhibiting a group show entitled \"Bling: Art that Shines\" featuring Hixon, Damien Hirst and others through July 2015\nMaison 24, a high-end gift shop on Park Ave and 58th St. regularly invites Hixon to design windows using her glitter paintings.\n\n\n== Media Appearances ==\n891 ABC Adelaide, two radio interviews in Australia November 24, 2010\nHome by Novogratz appearance, September 10, 2011 Episode HHBN-103H\nNational Talk Radio Ireland, Camomile met with Sean Moncrieff, September 19, 2012\nNews Channel 8 interview with Ann Nyberg November 13, 2013\n\n\n== References ==\nNotes\n\n\n== External links ==\nCamomile Hixon website", "links": ["American Textile History Museum", "Armory Show", "Austria", "Bachelor of Fine Arts", "Bergamot Station", "Brown University", "Canvas", "Cellophane", "Central Park", "Central Park Conservancy", "Chelsea, Manhattan", "Children's Museum of the Arts", "Connecticut", "Cornell Museum of Art & American Culture", "Dallas, Texas", "Damien Hirst", "Delray Beach, Florida", "Florida", "Germany", "Glitter", "Hofstra University", "Installation art", "Japan", "Kinetic art", "Los Angeles", "Lowell, Massachusetts", "Lyman Allyn Art Museum", "Lyme Art Association", "Massachusetts", "Milford, Connecticut", "New London, Connecticut", "New York City", "New York City, New York", "New York City Marathon", "North India", "Old Lyme, Connecticut", "PVC", "Park Avenue", "Poetry", "Providence, Rhode Island", "Providence Athenaeum", "Providence Children's Museum", "Providence Public Library", "Republic of Singapore", "Rhode Island", "Rhode Island School of Design", "Robert and Cortney Novogratz", "San Francisco, California", "SoHo, Manhattan", "Street art", "Taraxacum", "Terry Richardson", "Texas", "Unicorn", "Washington D. C.", "Wendy Williams"]}