{"url": "https://en.wikipedia.org/wiki/Canadian_Television_Fund", "title": "Canadian Television Fund", "summary": "The Canadian Television Fund (CTF, French: Fonds canadien de télévision - FCT) supported the production and broadcast of Canadian television programs. A non-profit corporation operating as a public-private partnership, the CTF was financed by contributions from the Government of Canada through the Department of Canadian Heritage and the Canadian cable and direct-to-home satellite industries.\nThe CTF developed and implemented policies to offer financial contributions to Canadian producers through specific program funding streams. File administration of these programs was contracted to the Television Business Unit at Telefilm Canada.\nOn 1 April 2010, the Canadian Television Fund became the Canada Media Fund after merging with the \"Canada New Media Fund\".", "content": "The Canadian Television Fund (CTF, French: Fonds canadien de télévision - FCT) supported the production and broadcast of Canadian television programs. A non-profit corporation operating as a public-private partnership, the CTF was financed by contributions from the Government of Canada through the Department of Canadian Heritage and the Canadian cable and direct-to-home satellite industries.\nThe CTF developed and implemented policies to offer financial contributions to Canadian producers through specific program funding streams. File administration of these programs was contracted to the Television Business Unit at Telefilm Canada.\nOn 1 April 2010, the Canadian Television Fund became the Canada Media Fund after merging with the \"Canada New Media Fund\".\n\n\n== Responsibilities ==\nThe Department of Canadian Heritage sets out objectives for the CTF within a Contribution Agreement. The main goal of the CTF is to support the creation and broadcast in peak viewing hours of high-quality Canadian television programs in both official languages in the genres of Drama, Children's and Youth, Documentary, and Variety and Performing Arts, and to build audiences for these programs.\nThe CTF must also:\n\nallocate one-third of its resources to French-language programming and two-thirds to English-language programming;\nsupport the production of Aboriginal-language programming;\nencourage production by majority and minority official-language sectors;\nprovide incentives for regionally based productions;\nset aside an envelope to support French-language productions from producers outside of Quebec;\nimplement a mechanism that enhances access to the CTF by programs supported by educational broadcasters;\nprovide developmental support, including script and pilot development;\nallocate an envelope for programs licensed by CBC/Radio-Canada;\nensure appropriate levels of market access for broadcaster-affiliated production companies and independent production companies, with no competitive advantage in French or English broadcast markets;\nsupport language versioning and subtitling.The CTF provides financing for the development, production and broadcast of Canadian-made programming in French, English and Aboriginal languages in the following genres: Drama, Children's and Youth, Documentary, and Variety and Performing Arts. The CTF provides four types of contributions to projects: repayable advances (development); grants (versioning); licence fee top-ups (production); and equity investments (production).\nThe CTF makes financial contributions through five funding streams: Broadcaster Performance Envelopes, Development, French-language Projects Outside Quebec, Aboriginal-language Projects, and Versioning Assistance.\nEligible projects must meet the following four Essential Requirements (4ER) before they can be submitted for consideration to any stream of funding (with the exception of 2ER documentaries):\n\nThe project speaks to Canadians about and reflects Canadian themes and subject matter.\nThe project will be certified by the Canadian Audio-Visual Certification Office (CAVCO) and has achieved 10/10 points (or the maximum number of points appropriate to the project), as determined by the CTF using the CAVCO scale.\nUnderlying rights are owned and significantly and meaningfully developed by Canadians.\nThe project is shot and primarily set in Canada.The level of the CTF's contribution to a production varies by genre, language and the stream of funding through which the contribution is obtained. Each funding stream may provide a mix of licence fee top-ups and equity investments, according to a set formula.\nNB: Some contributions may take forms other than equity or licence fee top-up, such as grants or advances.\n\n\n== Timeline ==\nIn 1994, the Canadian Radio-television and Telecommunications Commission (CRTC) proposed establishing a funding initiative that would focus on facilitating the production and broadcast of high-quality Canadian television programs in under-represented categories during peak viewing periods. Its revenues were to come from contributions by broadcasting distribution undertakings (i.e., cable and direct-to-home satellite providers) at a certain percentage of their revenues. What follows is a brief history of the Canadian Television Fund (CTF):\n1995\tCRTC establishes Cable Production Fund (CPF). Goal: Facilitate the production and broadcast of high-quality Canadian television programs in under-represented categories during peak viewing periods.\n1996\tDepartment of Canadian Heritage invites the CPF to join it in a redefined public-private partnership in conjunction with Telefilm Canada's Broadcast Development Production Fund. Result: CPF renamed Canada Television and Cable Production Fund (CTCPF).\n1997\tRegulatory framework changes made. Result: CTCPF renamed Canadian Television Fund (CTF) in 1998.\n2005     Transition begins, establishing new relationship with Telefilm Canada. Goal: Telefilm Canada becomes responsible for the administration of CTF files, while the CTF continues to lead the development of strategic policy and program guidelines, research and to report on audiences and funding results.\nThe Canadian Television Fund (CTF) receives its funding from two primary sources: the Department of Canadian Heritage and broadcasting distribution undertakings (BDUs). In addition, the CTF receives revenue from recoupment on production investments made through its Equity Investment Program.\nUnder licence agreements with the Canadian Radio-television and Telecommunications Commission, BDUs are required to contribute up to 5% of their gross broadcasting revenue to Canadian programming, with 1.5% to 5% to be contributed to production funds. Of the total contributions to production funds, at least 80% must be directed to the CTF.\nBy fostering the growth of television production in Canada through financial investment and industry research, the Canadian Television Fund (CTF) supports the development of Canadian talent, programs and audiences. Since 1995, the CTF has contributed to the creation of over 25,000 hours of Canadian programming and has infused over $2.5 billion into the industry, triggering the production of over $8 billion of Canadian programming. CTF-supported productions have cultivated thousands of jobs in the Canadian television sector.\nOn December 20, 2006, Jim Shaw, CEO of Shaw Communications Inc. informed the Canadian Television Fund that he would be pulling approximately $56 million per year out of the fund.1 The move was later followed by Vidéotron (a subsidiary of Quebecor Inc.) who announced their plans to withdraw their contributions on January 23, 2007.2\nOn July 20, 2007, Keith Mahar, a former manager at broadcaster CHUM Limited, submitted a report to the CRTC, entitled Profiteering in the Name of Culture, respecting the Canadian Television Fund [1]. The submission recommends a judicial review of alleged CRTC corruption related to the Fund which he contends has unjustly enriched cable companies. As per Mr. Mahar, Canadian Radio-television and Telecommunications Commission (CRTC) regulations, cable and satellite television distributors in Canada are required to contribute 5% of their revenue to the fund, which the companies can pass on to their  customers in the form of inflated rates service. Since such consumer costs are embedded in their fees for service, consumers are subject to pay the 5% levy plus P.S.T. and G.S.T. on the cost of the company subsidy program.   A copy of the submission is posted on the CRTC public file. On February 7, 2008, Mahar issued a press release covered by Reuters [2] Archived 2008-07-25 at the Wayback Machine which was critical of Prime Minister Stephen Harper for his alleged failure to act on information respecting related activities by the CRTC and corporations in the affair.\n\n\n== External links ==\nCanadian Television Fund website", "links": ["Aboriginal peoples in Canada", "Canada Media Fund", "Canadian Broadcasting Corporation", "Canadian Radio-television and Telecommunications Commission", "Department of Canadian Heritage", "English Canadian", "French Canadian", "French language", "Public-private partnership", "Quebec", "Quebecor Inc.", "Reuters", "Shaw Communications", "Shaw Communications Inc.", "Stephen Harper", "Telefilm Canada", "Télévision de Radio-Canada", "Vidéotron", "Wayback Machine"]}