{"url": "https://en.wikipedia.org/wiki/Carlton_Haselrig", "title": "Carlton Haselrig", "summary": "Carlton Lee Haselrig (January 22, 1966 – July 22, 2020) was an American heavyweight wrestler and NFL player. Haselrig wrestled for University of Pittsburgh at Johnstown. He is the only person to win six NCAA titles in wrestling, three times in Division II and three times in Division I. His Three-Peat of Division II & Division I NCAA National Championships were won in 1987, 1988, and 1989. All six championships were won for Pitt–Johnstown. Haselrig then moved on to professional football, where he played five seasons in the NFL, becoming a Pro Bowl guard in 1992. In 2008, he made his mixed martial arts debut in Atlantic City, New Jersey.", "content": "Carlton Lee Haselrig (January 22, 1966 – July 22, 2020) was an American heavyweight wrestler and NFL player. Haselrig wrestled for University of Pittsburgh at Johnstown. He is the only person to win six NCAA titles in wrestling, three times in Division II and three times in Division I. His Three-Peat of Division II & Division I NCAA National Championships were won in 1987, 1988, and 1989. All six championships were won for Pitt–Johnstown. Haselrig then moved on to professional football, where he played five seasons in the NFL, becoming a Pro Bowl guard in 1992. In 2008, he made his mixed martial arts debut in Atlantic City, New Jersey.\n\n\n== Wrestling ==\nHaselrig won the Pennsylvania Interscholastic Athletic Association (PIAA) state high school championship in 1984 despite not wrestling during the regular season due to Johnstown High's lack of a wrestling team.Haselrig was the 1985 Junior Greco-Roman World Champion, and the 1986 Junior Freestyle World Champion, while competing for the United States in the heavyweight division.\nWhile in college Haselrig would defeat future NCAA and Olympic champion Kurt Angle. In 2009, he was inducted into Pitt–Johnstown's Athletics Hall of Fame.The Pennsylvania native began his collegiate career as a football player at Lock Haven, but a knee injury before the start of his freshman year prevented him from ever suiting up for a game. During winter break, he decided to transfer to his hometown school and take classes at Pittsburgh-Johnstown, which did not have a football team.\nWith that move, Haselrig set in motion the most prolific career in NCAA wrestling history — one that ended in, of all places, the National Football League (NFL).\nHe would finish in third place at the NCAA Division II meet his freshman year in 1986, then go on to win both the Division I and Division II titles in his sophomore, junior and senior seasons, to become the only wrestler in history to win more than four NCAA titles.\nBefore 1990, the Divisions II and III individual champions earned bids to the Division I championships, allowing Haselrig the chance to win both titles. After Haselrig's run of NCAA titles, the Division I Wrestling Committee voted to rescind the bids to the Division II and III champions. As a result, Haselrig's feat cannot be matched unless the rule is changed again.\nHaselrig had never wrestled for a team before arriving at Pittsburgh-Johnstown. His uncle introduced him to the sport as a child, and he participated in occasional tournaments.\nHe stopped wrestling in high school because his school didn't have a team. But in his junior year, a neighboring high school needed a training partner for a standout wrestler, so Haselrig helped out. After seeing his success against one of the state's top wrestlers, Haselrig's high school petitioned the Pennsylvania Interscholastic Athletic Association to let him compete in wrestling, beginning with the postseason district tournament his senior year. Haselrig went on to win every match, including a state title.\nAt Pittsburgh-Johnstown, Haselrig finished his career with a record of 143-2-1, including an, at the time, NCAA-record 122 consecutive matches without a loss. He never lost a match at the NCAA Division I meet, going 15-0 at the heavyweight class in the 1987, 1988 and 1989 tournaments.\n\n\n== NFL ==\nAfter a brief run in wrestling on the international level, Haselrig turned his attention to pro football. Despite never having played football in college, Haselrig was drafted by the Pittsburgh Steelers and became a Pro Bowl offensive guard in his third NFL season. 1992 was his best season in the NFL, making the 1992 Pro Bowl, while helping the Steelers win the 1992 AFC Central Division title. He also helped the Steelers to three AFC playoff appearances (1989, 1992, 1993). After four years with the Steelers, Haselrig spent one season with the New York Jets before retiring from the NFL.\n\n\n== Mixed martial arts ==\nHaselrig made his professional MMA debut on April 19, 2008 for Battle Cage Xtreme IV in Atlantic City against IFL veteran Shane Ott. He defeated Shane Ott by a technical knockout at 4:09 in the first round.  Haselrig defeated Carlos Moreno on May 31, 2008 during the undercard of EliteXC's first-ever CBS telecast.  He displayed his superior wrestling skills during the first round keeping Carlos on the mat. Carlos did not return to the ring for the second round. His final record in MMA was 3-2 before retiring.\n\n\n== Mixed martial arts record ==\n\n\n== Death ==\nHaselrig died on July 22, 2020 in Johnstown, Pennsylvania from liver disease.\n\n\n== Honors ==\nCarlton was honored on January 19, 2016 with \"Carlton Haselrig Day\" in Johnstown, PA.\n\n\n== References ==\nProfessional MMA record for Carlton Haselrig from Sherdog \nAudio for interview with wrestling411.tv", "links": ["1989 NFL Draft", "1989 NFL draft", "1989 NFL season", "1992 Pro Bowl", "1993 NFL season", "1995 NFL season", "American football", "Atlantic City, New Jersey", "Carnell Lake", "Chris Asbeck", "Community Newspaper Holdings", "D. J. Johnson (cornerback, born 1966)", "David Arnold (American football)", "Derek Hill (gridiron football)", "EliteXC: Primetime", "Greater Johnstown High School", "Guard (gridiron football)", "Jerrol Williams", "Jerry Olsavsky", "Johnstown, Pennsylvania", "Kurt Angle", "Mark Stock (American football)", "Mixed martial arts", "NCAA Division I", "NCAA Division II", "NCAA Division II Wrestling Championships", "NCAA Division I Wrestling Championships", "National Collegiate Athletic Association", "National Football League", "National Wrestling Hall of Fame and Museum", "New York Jets", "Newark, New Jersey", "Pennsylvania Interscholastic Athletic Association", "Pittsburgh, Pennsylvania", "Pittsburgh Press", "Pittsburgh Steelers", "Pro Bowl", "Shawn Jordan", "Sherdog", "Technical knockout", "The Tribune-Democrat", "Tim Worley", "Tom Ricketts (American football)", "USA Today", "University of Pittsburgh at Johnstown"]}