{
    "url": "https://en.wikipedia.org/wiki/Carson_Block",
    "title": "Carson Block",
    "summary": "Carson Block is an American investor and the founder of Muddy Waters Research. Block is known for documenting and alleging fraudulent accounting practices in publicly traded Chinese companies.",
    "content": "Carson Block is an American investor and the founder of Muddy Waters Research. Block is known for documenting and alleging fraudulent accounting practices in publicly traded Chinese companies.\n\n\n== Early life and career ==\nBlock grew up in Summit, New Jersey, and holds a J.D. degree from Chicago-Kent College of Law.Block went to work with his father, a period he describes as “very embittering” as he was “lied to by a parade of management” of internet companies. He quit equity analysis for law school, later moving to Shanghai before leaving law and setting up the self-storage business in 2007.In 2011, Block was ranked as a 50 Most Influential Thinker by Bloomberg Markets.In September 2017, Block initiated a private lawsuit against Equifax, accusing the latter of neglecting to safeguard his personally identifiable information. He appears in the documentary The China Hustle, outlining his research into Securities fraud of Chinese companies through Muddy Waters.\nIn early 2018, he was also forced to settle a case with St. Jude Medical Inc. in order to avoid a lawsuit.Muddy Waters Investment Funds are domiciliated in the Cayman Island and Delaware. The Board of the Cayman domiciled fund includes a Director - Andrew Hersant - appearing in the \"Paradise papers\".\n\n\n== References ==",
    "links": [
        "50 Most Influential (Bloomberg Markets ranking)",
        "Bloomberg Markets",
        "Chicago-Kent College of Law",
        "Equifax",
        "Juris Doctor",
        "Muddy Waters Research",
        "Personally identifiable information",
        "Public company",
        "Securities fraud",
        "Summit, New Jersey",
        "The China Hustle"
    ]
}