{
    "url": "https://en.wikipedia.org/wiki/Central_European_Media_Enterprises",
    "title": "Central European Media Enterprises",
    "summary": "Central European Media Enterprises Ltd. (CME) is a media and entertainment company that operates television channels in Bulgaria, Croatia, Czech Republic, Romania, Slovakia and Slovenia. Until its acquisition by PPF Group N.V., the company was listed on NASDAQ and Prague Stock Exchange under the ticker symbol CETV.",
    "content": "Central European Media Enterprises Ltd. (CME) is a media and entertainment company that operates television channels in Bulgaria, Croatia, Czech Republic, Romania, Slovakia and Slovenia. Until its acquisition by PPF Group N.V., the company was listed on NASDAQ and Prague Stock Exchange under the ticker symbol CETV.\n\n\n== History ==\nCentral European Media Enterprises Ltd. was co-founded in 1991 by Americans Ronald Lauder and Mark Palmer in Germany as CEDC GmbH (Central European Development Corporation). That same year it changed its name and reincorporated in the Netherlands as Central European Media Enterprises (CME). Objections brought by the Czech Republic over the legal distinguishing of the two corporations were rejected by the International Court of Arbitration of the International Chamber of Commerce as irrelevant.\nCEDC GmbH's capital interests were all transferred to CME on July 28, 1994. CME moved its headquarters and reincorporated in Bermuda later that year.\nIn early September 2007, Ronald Lauder announced that Ihor Kolomoyskyi would have a 3% stake in CME and be on the board and that Petr Kellner has a 3% stake and is on the board as well.In 2008, the company bought in Romania from Adrian Sârbu, former CEO of Pro TV and CME, MediaPro Entertainent, which operated Media Pro Pictures, MediaPro Studios, MediaPro Distribution (later acquired film distributors in the Czech Republic, Slovakia and Hungary), MediaPro Music, ProVideo home video company, (later expanded in Hungary), Cinema Pro and Hollywood Multiplex cinemas. The company eventually sold off a number of its assets from 2013 to 2015. MediaPro Music was sold to Universal Music Romania, MediaPro Distribution to Vertical Entertainment, and other assets were sold to private investors.\nOn 23 March 2009, Time Warner (now Warner Bros. Discovery) announced that it would invest $241.5 million, for a 31% stake, in CME. Two years later on 3 March 2011, Time Warner bought another 3.1 million shares taking its stake in CME up to 34.4% with around 47 percent of voting rights and a total of 22.1 million shares.In 2010, CME sold 1+1 television group in Ukraine for US$300 million. In July 2012 CME exercised its put option and Time Warner increased its economic interest in CME to 49.9%. During the second quarter of 2013, Time Warner maintained its 49.9% voting interest during a public offering of CME Class A Shares, and additionally purchased 200,000 shares of Series B Convertible Redeemable Preferred Stock in a private placement.\nIn 2018, CME sold its television networks in Croatia (and Slovenia) to United Group for €230 million.\n By October 2019, AT&T have signed agreement to sell WarnerMedia's stake to PPF. The transaction valued at $2.1 billion is subject to shareholder and regulatory approval and due to be completed in 2020.On 14 February 2022, Central European Media Enterprises announced buying RTL Hrvatska from RTL Group for €50 million. The transaction was closed on 1 June 2022.\n\n\n== Operations ==\nCME is the broadcast market leader in every country where it has television stations. It started broadcasting its first channel in the Czech Republic in 1994. CME operates 30 television channels broadcasting to approximately 45 million people across 5 countries. CME develops and produces content for its television channels, and its content is also consumed through subscription and advertising VOD.\nThe company also operates 4 radio channels in Bulgaria.\n\n\n== Television channels ==\nBulgaria\n\nbTV\nbTV Cinema\nbTV Comedy\nbTV Action\nbTV Lady\nRingCroatia\n\nRTL\nRTL 2\nRTL Kockica\nRTL Living\nRTL Crime\nRTL Passion\nRTL Adria\nRTL Croatia WorldCzech Republic\n\nTV Nova\nNova Cinema\nNova Sport 1\nNova Sport 2\nNova Sport 3\nNova Sport 4\nNova Fun\nNova Lady\nNova Action\nNova Gold\nNova InternationalRomania\n\nPro TV (also broadcast in Republic of Moldova as a simulcast feed)\nAcasă (also broadcast in Republic of Moldova as a simulcast feed)\nAcasă Gold\nPro Arena\nPro Cinema\nPro TV InternaționalSlovakia\n\nMarkíza\nMarkíza Doma\nMarkíza Dajto\nMarkíza International\nMarkíza Krimi\nNova Sport 1\nNova Sport 2Slovenia\n\nPop\nKanal A\nBrio\nOto\nKino\n\n\n== Board of directors ==\nNon-Independents\n\nTrey Turner\nGerhard ZeilerIndependents\n\nJohn Billock\nAlfred W. Langer\nParm Sandhu\nKelli Turner\n\n\n== See also ==\n\nCME/Lauder v. Czech Republic\n\n\n== References ==\n\n\n== External links ==\nOfficial website",
    "links": [
        "1+1 (TV channel)",
        "Acasă",
        "Amsterdam",
        "BTV (Bulgaria)",
        "BTV Action",
        "BTV Cinema",
        "BTV Comedy",
        "BTV Lady",
        "Bermuda",
        "Brio (TV channel)",
        "Bulgaria",
        "CEO",
        "CFO",
        "CME/Lauder v. Czech Republic",
        "Croatia",
        "Czech Republic",
        "Dajto",
        "Doi (identifier)",
        "Erste Group",
        "European Corporate Governance Institute",
        "Hamilton, Bermuda",
        "Hrvatska radiotelevizija",
        "Ihor Kolomoyskyi",
        "International Chamber of Commerce",
        "International Court of Arbitration",
        "Kanal A",
        "Kofola ČeskoSlovensko",
        "Komerční banka",
        "Mark Palmer",
        "Markíza",
        "Mass media",
        "MediaPro Music",
        "MediaPro Studios",
        "Media Pro Pictures",
        "NASDAQ",
        "Net income",
        "Netherlands",
        "Nova Cinema (Czech Republic)",
        "Nova Sport 1",
        "PPF (company)",
        "PX Index",
        "Parent company",
        "Pegas Nonwovens",
        "Petr Kellner",
        "Philip Morris CR",
        "Pop (Slovenian TV channel)",
        "Prague",
        "Prague Stock Exchange",
        "Pro Arena",
        "Pro Cinema",
        "Pro TV",
        "Pro TV Internațional",
        "RTL (Croatian TV channel)",
        "RTL 2 (Croatia)",
        "RTL Croatia World",
        "RTL Group",
        "RTL Kockica",
        "Republic of Moldova",
        "Ring (Bulgaria)",
        "Romania",
        "Ronald Lauder",
        "S2CID (identifier)",
        "Slovakia",
        "Slovenia",
        "Stock Spirits Group",
        "TV Doma",
        "TV Nova (Czech Republic)",
        "Telefónica Czech Republic",
        "Television broadcasting",
        "Television channel",
        "Television production",
        "Ukraine",
        "United Group",
        "Universal Music",
        "VIAF (identifier)",
        "Vertical Entertainment",
        "Video on demand",
        "Vienna Insurance Group",
        "Warner Bros. Discovery",
        "ČEZ Group"
    ]
}