{"url": "https://en.wikipedia.org/wiki/Charles_Cobelle", "title": "Charles Cobelle", "summary": "Charles Cobelle, born Carl Edelman (1902–1994) was a modern French master of painting, lithography and a fine muralist, who was born in Alsace-Lorraine, France. He is considered the last link to the great tradition of the Open Line School of Paris.", "content": "Charles Cobelle, born Carl Edelman (1902–1994) was a modern French master of painting, lithography and a fine muralist, who was born in Alsace-Lorraine, France. He is considered the last link to the great tradition of the Open Line School of Paris.\n\n\n== Biography ==\nCobelle received his Bachelor's and Master's Degrees from the University of Munich and continued his studies at the École des Beaux-Arts in Paris. Much more influential in his development, however, were his private studies with Marc Chagall and his apprenticeship in the studio of Raoul Dufy in Menton on the Riviera.\nCobelle lived and painted in Paris until the late 1920s and established himself within the great tradition of the School of Paris. In the late 1920s, Cobelle moved to the United States, where his paintings were immediately sought after by galleries and private collectors alike. Cobelle became a U.S. citizen before the outbreak of World War II. In the late 1940s to 1950s, Cobelle lived in Westport, Connecticut.Charles Cobelle lived in Ridgefield CT in a private lake community called Twixt Hills until his death.\nBy the 1950s, spurred by the commercial success of his mentor, Dufy, Cobelle had achieved phenomenal success commercially with his Parisian-influenced style. Much like contemporary artists and designers at the time, his designs graced a number of pottery patterns for various pottery companies, including Midwinter Stylecraft, Universal Potteries and Homer Laughlin China Company.In addition to creating advertising illustrations for everything from hosiery to French perfume, Cobelle created a number of murals throughout the country in noteworthy public locations such as The Painted Desert Room of the Desert Inn in Las Vegas, the Mark Hopkins Hotel in San Francisco, Neiman-Marcus in Dallas and on the cruise ships of the Holland America Line.\n\n\n== Art ==\nThroughout his long and prosperous career, Cobelle painted his favorite subjects; Paris street scenes, race tracks, regattas and casinos. The subjects in Cobelle's paintings were not of actual locations or events, but they nevertheless convey the excitement of the places that they depict. This imagery, combined with a vibrant palette of expressive colors, creates a world full of verve and wit that effortlessly transcends reality.His paintings are characterized by thin, descriptive line-work over broad patches of bold color. First, Cobelle would map out a scene in blocks of bold, expressive color. Then, he would define the imagery with spontaneous, fluid line work. Many of his paintings were painted on canvas with mixed media - oils, acrylics, tempera, conte crayon, ink, whatever was at hand.In 1965, a fire ravaged his studio at his home in Ridgefield, Connecticut.  As a result, most of his early work was lost, as were all school records and correspondence.\nIn his later years, which ended with his death in July 1994, he signed his paintings \"Chas Cobelle.\"\n\n\n== Exhibitions ==\nIn addition to his mixed media paintings his work has graced the covers of many of this country's leading magazines and his murals have adorned the walls of many elegant residences, public buildings, fine hotels and restaurants.Collections:\n\nHartford Antheneum\nWm. Snaith - Pres. Raymond Lowry Assoc.\nMr. Von Rumohr - Collector\nHugh Leighton - Collector St. Croix, V.I.\nMrs. Helen Hart- American Brass Co.\nDonald Deskey - Designer\nTamanaco Hotel- Caracas, Venezuela\nMark Hopkins Hotel- San Francisco, Calif.\nHenry End - Collector-Int. Designer\nDaniel Whitlock - Lazard Freres\nStuart M. Seymour - American Distilling Co.\nParke Bernet Galleries - Paintings sold in 1961, 1962, 1963\nHoward Hughes - Collector/Industrialist\nBurt Parks - Collector/CelebrityCobelle Exhibits:\n\nNiveau Galleries - Palm Beach\nSchoneman Galleries\nLord & Taylor\nGallery Revel - New York\n70th St. Gallery - New York\nPark West Galleries - MichiganMagazine and Brochure Covers:\n\nCue Magazine\nThis Week Magazine\nElizabeth Arden\nRound Hill Publishing\nEmerald Beach Hotel\nDistinguished ResortsMurals:\n\nNeiman Marcus Co. - Dallas, Texas\nThe Royal Box - American Hotel, New York\nPainted Desert Room at the Desert Inn - Las Vegas, Nevada\nRaymond Lowry Associates\nRichs - Atlanta, Georgia\nKenyon Hall - Michigan State University\nAmerican Tobacco - Caracas, Venezuela\nHenry Ford Museum - Murals & Sculpture\nNorman Belle Geddes - Murals & Sculpture\nHolland American Line - Murals & Sculpture\nCruise Ships of Wilson Line - Murals & Sculpture\nGimbel Bros. - Philadelphia, Pa\nTeheran Restaurant - New York\nAdministration Building - City of New York\nBali-Hi-Room - Robert Meyer Hotel Jacksonville, Florida\nEstate Carlton Hotel - St. Croix, V.I.\nW.&J. Sloane for Country Club - Spring Lake, N.J.\n200 Fifth Ave. Club - New York\nChalfonte Haddon Hall Hotel - Atlantic City, N.J.\n\n\n== References ==", "links": ["Alsace-Lorraine", "Dallas", "Desert Inn", "France", "Holland America Line", "Homer Laughlin China Company", "Las Vegas, Nevada", "Marc Chagall", "Mark Hopkins Hotel", "Neiman-Marcus", "Raoul Dufy", "Ridgefield, Connecticut", "San Francisco", "This Week Magazine", "University of Munich", "Wayback Machine", "Westport, Connecticut", "École des Beaux-Arts"]}