{"url": "https://en.wikipedia.org/wiki/Church_of_Nuestra_Se%C3%B1ora_de_la_Candelaria,_Bogot%C3%A1", "title": "Church of Nuestra Señora de la Candelaria, Bogotá", "summary": "The Church of Nuestra Señora de la Candelaria, often called theIglesia de la Candelaria, is a Catholic parish church in Bogotá, Colombia. It is dedicated to the Virgin Mary under the patronage of Virgin of la Candelaria and is located on Calle 11 with Carrera 4, in La Candelaria neighborhood, this Clergy house is located near the Primatial Cathedral of Bogotá in the historic sector of Bogotá. It is administered by the Archdiocese of Bogotá.\nOf colonial origin, it was part of the old Convent of San Nicolás de los Agustinos Recoletos, where the Colegio Agustiniano de San Nicolás operated for many years. The building is made up of three naves, the main or central one and two side ones, and has two towers on the front façade. Its construction began in 1686 and was completed in 1703. The church houses important works of religious art of colonial origin.\nDue to its historical significance, architectural and cultural value, the church and the old convent were declared a National Monument through decree 1,584 of August 11, 1975.", "content": "The Church of Nuestra Señora de la Candelaria, often called theIglesia de la Candelaria, is a Catholic parish church in Bogotá, Colombia. It is dedicated to the Virgin Mary under the patronage of Virgin of la Candelaria and is located on Calle 11 with Carrera 4, in La Candelaria neighborhood, this Clergy house is located near the Primatial Cathedral of Bogotá in the historic sector of Bogotá. It is administered by the Archdiocese of Bogotá.\nOf colonial origin, it was part of the old Convent of San Nicolás de los Agustinos Recoletos, where the Colegio Agustiniano de San Nicolás operated for many years. The building is made up of three naves, the main or central one and two side ones, and has two towers on the front façade. Its construction began in 1686 and was completed in 1703. The church houses important works of religious art of colonial origin.\nDue to its historical significance, architectural and cultural value, the church and the old convent were declared a National Monument through decree 1,584 of August 11, 1975.\n\n\n== History ==\n\nAfter 1631, the religious of the Order of Augustinian Recollects or Discalced, decided to found a convent in the city of Santa Fe, for this purpose they authorized \"Priest Francisco de la Resurrection, to acquire a house on behalf of the Province\". Said acquisition was made a short time later, in 1635, but only to establish a hospice there, but not a convent, which was placed under the invocation or name of Saint Nicholas of Tolentino or Saint Nicholas of la Candelaria. But, not having had the royal confirmation or permission of the local authorizations, it resulted in the issuance of the Real cédula of September 18, 1653, by means of which the demolition of the hospice established without its authorization was ordered, the September 28, 1654. To repeal the previous measure, all possible resources and pleas were filed; it was finally ratified by means of a Real cédula dated March 15, 1679 and completely closed on the eve of Corpus Christi in 1680 and demolished in 1681. A few years later, a new Real cédula dated April 2, 1684 was finally obtained, by means of which it is authorized to rehabilitate the closed hospice.On June 27, 1686, after the legal-religious problem was overcome, the construction of the current church began, by laying the first stone by Archbishop Antonio Sanz Lozano, event that was attended by all the civil and ecclesiastical authorities of the city. Both the plan of the temple and the convent were designed by the City master builder, Diego Sánchez de Montemayor (17th century). By the month of October of that same year, work was being done on the foundations. Later, in 1700, the main chapel had been covered and the walls had the entrance arches built to the chapels of the lateral naves. By 1702 the main arch was raised and \"the main chapel was vaulted\". The religious house was still standing and was part of the corner then called de Galeano.\nIn 1703 the church was inaugurated, which was consecrated to Virgin of la Candelaria, initially it was conceived without towers, only with a bell-gable on its western side. During the period between 1703 and 1736 (date on which Archbishop Antonio Claudio Álvarez de Quiñones died, who donated $7,000 to the convent, money that was used to finish the temple), the work continued focused on the construction of the hospice, since he had to demolish the old dwelling houses, and then proceed to the construction of the choir, the façade and the atrium.\nLater, in 1804, a careful inventory was made of the interior of the church and of the two sacristies that were available at that time. Altarpieces, paintings and imageries are carefully listed, as well as mirrors and other adornments, without allusion to the choir and its objects, but with a detailed enumeration of religious ornaments.\nAfter the process of Independence of Colombia, some improvements were made in the buildings, especially in the temple, which on May 10, 1822, the Consultation authorized the Rector to contract with a Master Potter the manufacture of \"slabs for brickwork\". the church”, work that is called “first need”. The earthquake of June 17, 1826 affected the entire colegio building and particularly the Chapel of la Concepción. The arrangements were ordered immediately after the Consultation of June 26 of that same year.\n\n\n== Description ==\n\nTemple of colonial origin, located in the La Candelaria neighborhood, on the corner of the current Calle Once with Carrera Cuarta, in a north-south direction, with the main access on Calle Once. Functionally it is integrated into the cloister or Convent of los Agustinos Recoletos, which develops on the eastern side and is today occupied by the Colegio Agustiniano de San Nicolás.\nThe church has a rectangular floor plan, with three naves (the main or central one and two lateral ones), separated by semicircular arches on pillars. The central nave is higher and lit up by windows, which are aligned with the semicircular arches and between the windows there are some old paintings. The ceiling of the central nave contains several paintings of religious scenes, the work of the painter Pedro Alcántara Quijano. Above the ceiling, the artesonado is still preserved, which the art historian Santiago Sebastián considered at the time as “the most advanced baroque ceiling in Bogotá”.\nIn the presbytery, the main altarpiece dating from the 18th century, by an unknown author, made of carved and gilded wood stands out. Its dimensions are: 11.82 m high; 10.13m wide; and 1.71 m deep. It is made up of 3 bodies and 5 streets, the latter being delimited by double columns. Luckily it has not had any reform, only in 1928 in the niche that is above the tabernacle, the exhibitor with four columns was installed, placed inside the same niche without modifying anything of said altarpiece.\nOn the expository, there is the image of Virgin of la Candelaria; to the right of that image are in their order: Saint Joaquín, Saint Juan de Sahagún, to the left Saint Anne and Saint Tomás de Villanueva. On the right side of the exhibition, there are the images of Saint Augustine and Saint Juliana de Cornelión. On the left side of the exhibit are the images of Saint Joseph and Saint Nicholas of Tolentino.\nIn the presbytery was the painting of the \"Immaculate\" by the painter Gregorio Vásquez de Arce y Ceballos made in 1710, which according to tradition was his last work. This painting was removed in the 1990s for security reasons and is preserved by the community.\nThe temple still preserves the old brick plank, a kind of baked clay tile that was used in ancient times to pave the buildings. In the side naves, the artistic altarpieces stand out, dating from the 18th, 19th, and 20th centuries; made of carved, gilt, polychrome wood and with appliqués. Also noteworthy are the 19th century confessionals in carved monochrome and gilt wood.\nThe main façade is made up of two towers (topped by domes), joined by a body that frames the central nave. Each nave has access through the main façade, in addition, the right lateral nave has an access that communicates with the convent.\n\n\n== See also ==\nList of colonial buildings in Bogotá\n\n\n== References ==", "links": ["Altarpiece", "Antonio Claudio Álvarez de Quiñones", "Antonio Sanz Lozano", "Archive of Bogotá", "Artesonado", "Atrium (architecture)", "Bell-gable", "Bogotá", "Catholic Church", "Choir", "Clergy house", "Colombia", "Colombian Declaration of Independence", "Diego Sánchez de Montemayor", "Dome", "Façade", "Feast of Corpus Christi", "Foundation (engineering)", "Geographic coordinate system", "Gregorio Vásquez de Arce y Ceballos", "ISBN (identifier)", "La Candelaria", "List of colonial buildings in Bogotá", "Marian church", "National heritage site", "Nave", "Nicholas of Tolentino", "Order of Augustinian Recollects", "Painting", "Parish church", "Pedro Alcántara Quijano", "Pillar", "Primatial Cathedral of Bogotá", "Real cédula", "Roman Catholic Archdiocese of Bogotá", "Virgin of la Candelaria", "Visual arts", "Window"]}