{
    "url": "https://en.wikipedia.org/wiki/Claire_Messud",
    "title": "Claire Messud",
    "summary": "Claire Messud (born 1966) is an American novelist and literature and creative writing professor. She is best known as the author of the novel The Emperor's Children (2006).",
    "content": "Claire Messud (born 1966) is an American novelist and literature and creative writing professor. She is best known as the author of the novel The Emperor's Children (2006).\n\n\n== Early life ==\nBorn in Greenwich, Connecticut, Messud grew up in the United States, Australia, and Canada, returning to the United States as a teenager. Messud's mother is Canadian, and her father is a Pied-noir from French Algeria. She was educated at the University of Toronto Schools and Milton Academy. She did undergraduate and graduate studies at Yale University and Cambridge University, where she met her spouse James Wood. Messud also briefly attended the MFA program at Syracuse University.\n\n\n== Career ==\nMessud's debut novel, When The World Was Steady (1995), was nominated for the PEN/Faulkner Award. In 1999, she published her second book, The Last Life, about three generations of a French-Algerian family. Her 2001 work, The Hunters, consists of two novellas. The Emperor's Children, which Messud wrote while a fellow at the Radcliffe Institute for Advanced Study in 2004–2005, was critically praised and became a New York Times bestseller, as well as being longlisted for the 2006 Man Booker Prize. In April 2013, Messud published her sixth novel, The Woman Upstairs. Her 2017 novel, The Burning Girl, was named one of the best books of the year by the Los Angeles Times, San Francisco Chronicle, Financial Times and others.\nMessud has taught creative writing at Amherst College, Kenyon College, University of Maryland, Yale University, in the Warren Wilson College MFA Program for Writers in North Carolina, in the Graduate Writing program at The Johns Hopkins University, and at Harvard University.  Messud also taught at Sewanee: The University of the South in Sewanee, Tennessee. She is on the editorial board of the literary magazine The Common, based at Amherst College.  She has contributed articles to publications such as The New York Review of Books.Each spring semester, beginning 2009, Messud teaches a literary traditions course as a part of CUNY Hunter College's MFA Program in Creative Writing.\nShe has two children, Livia and Lucian.\n\n\n== Awards ==\nThe American Academy of Arts and Letters has recognized Messud's talent with both an Addison Metcalf Award and a Strauss Living Award.  She was considered for the 2003 Granta Best of Young British Novelists list, although none of the three passports she holds is British. As of 2010–2011, she is a fellow at the Wissenschaftskolleg zu Berlin / Institute of Advanced Study.\n\n\n== Bibliography ==\nWhen the World Was Steady. Knopf Doubleday Publishing Group. 1995. ISBN 978-0-393-35509-3.\nThe Last Life: A Novel. Houghton Mifflin Harcourt. 1999. ISBN 978-0-547-56385-5.\nThe Hunters. Houghton Mifflin Harcourt. 2001. pp. 200–. ISBN 978-0-547-56387-9.\nThe Professor's History, Picador, 2006, ISBN 9780330445771\nThe Emperor's Children. Knopf Doubleday Publishing Group. 29 August 2006. ISBN 978-0-307-26601-9.\nThe Woman Upstairs. Knopf Canada. 30 April 2013. ISBN 978-0-307-40118-2.(longlisted for the 2013 Scotiabank Giller Prize)\nThe Burning Girl. W. W. Norton & Company. 2017. ISBN 978-0-393-63502-7.\nKant's Little Prussian Head and Other Reasons Why I Write. An Autobiography in Essays. W. W. Norton & Company. 2020. ISBN 978-1324006756.\n\n\n== References ==\n\n\n== Further reading ==\nFranklin, Ruth (August 10, 2017). \"Who's Afraid of Claire Messud?\". The New York Times Magazine.\nWood, Gaby (August 20, 2006). \"Here's another fine Messud\". The Guardian.\n\n\n== External links ==\n Media related to Claire Messud at Wikimedia Commons\nOfficial website",
    "links": [
        "Algeria",
        "American Academy of Arts and Letters",
        "Amherst College",
        "Brooklyn Book Festival",
        "CUNY",
        "Cambridge University",
        "French Algeria",
        "Granta",
        "Greenwich, Connecticut",
        "Harvard University",
        "Hunter College",
        "ISBN (identifier)",
        "ISNI (identifier)",
        "James Wood (critic)",
        "Kenyon College",
        "Man Booker Prize",
        "Master of Fine Arts",
        "Milton Academy",
        "North Carolina",
        "Novelist",
        "PEN/Faulkner Award for Fiction",
        "Pied-noir",
        "RERO (identifier)",
        "Radcliffe Institute for Advanced Study",
        "SUDOC (identifier)",
        "Scotiabank Giller Prize",
        "Sewanee, Tennessee",
        "Sewanee: The University of the South",
        "Syracuse University",
        "The Common (magazine)",
        "The Emperor's Children",
        "The Guardian",
        "The Hunters (2001 book)",
        "The Johns Hopkins University",
        "The New York Review of Books",
        "The New York Times",
        "The New York Times Magazine",
        "The Woman Upstairs (novel)",
        "Trove (identifier)",
        "University of Maryland",
        "University of Toronto Schools",
        "VIAF (identifier)",
        "Warren Wilson College MFA Program for Writers",
        "When The World Was Steady",
        "Wissenschaftskolleg zu Berlin",
        "Yale University"
    ]
}