{
    "url": "https://en.wikipedia.org/wiki/Concert_Properties",
    "title": "Concert Properties",
    "summary": "Concert Properties (“Concert”) is a Canadian real estate company headquartered in Vancouver, British Columbia. It is owned by 19 union and management pension funds with assets valued at $8 billion.\nConcert currently operates five lines of business in five provinces and one territory across Canada. The company develops and manages rental apartments and seniors’ active aging communities; develops condominium homes; develops, acquires and manages commercial properties; and invests in, develops and manages public infrastructure projects across Canada.\nConcert’s portfolio includes over 12,000 residential homes, over 12 million square feet of commercial space, and the direct investment and management of 10 public-private partnership projects (through a separate company, Concert Infrastructure Fund). Concert also has 10 mixed-use master-planned communities built or under development across Canada.\nThe current Chair, President & Chief Executive Officer of Concert is David R. Podmore, OBC.",
    "content": "Concert Properties (“Concert”) is a Canadian real estate company headquartered in Vancouver, British Columbia. It is owned by 19 union and management pension funds with assets valued at $8 billion.\nConcert currently operates five lines of business in five provinces and one territory across Canada. The company develops and manages rental apartments and seniors’ active aging communities; develops condominium homes; develops, acquires and manages commercial properties; and invests in, develops and manages public infrastructure projects across Canada.\nConcert’s portfolio includes over 12,000 residential homes, over 12 million square feet of commercial space, and the direct investment and management of 10 public-private partnership projects (through a separate company, Concert Infrastructure Fund). Concert also has 10 mixed-use master-planned communities built or under development across Canada.\nThe current Chair, President & Chief Executive Officer of Concert is David R. Podmore, OBC.\n\n\n== History ==\nThe Vancouver Land Corporation was co-founded in 1989 by Jack W. Poole and David R. Podmore to develop assured rental housing in British Columbia. The company was created jointly by the Province of British Columbia, the City of Vancouver, union and management pension funds and 26 private investors. In 1992 the company became 100% owned by union and management pension funds.\nThe company's name was changed to Greystone Properties, and then in 1999 changed to Concert Properties Ltd. (Concert).\n\n\n== References ==",
    "links": [
        "British Columbia",
        "Canada",
        "Chief executive officer",
        "Chief financial officer",
        "President (corporate title)",
        "Vancouver"
    ]
}