{
    "url": "https://en.wikipedia.org/wiki/Crinigera",
    "title": "Crinigera",
    "summary": "Crinigera is a genus of fungi in the division Ascomycota. The relationship of this taxon to other taxa within the phylum is unknown (incertae sedis), and it has not yet been placed with certainty into any class, order, or family. This is a monotypic genus, containing the single species Crinigera maritima. Crinigera maritima is a marine ascomycota fungus species with characteristic appendaged cleistothecia and ascospores that cling onto substrates of wood, algae, or sand. It is found in the mesohaline zone of many different coastal countries. It has been mistaken for a new fungal species Dryosphaera navigans and has yet to be assigned to a class, order, or family.",
    "content": "Crinigera is a genus of fungi in the division Ascomycota. The relationship of this taxon to other taxa within the phylum is unknown (incertae sedis), and it has not yet been placed with certainty into any class, order, or family. This is a monotypic genus, containing the single species Crinigera maritima. Crinigera maritima is a marine ascomycota fungus species with characteristic appendaged cleistothecia and ascospores that cling onto substrates of wood, algae, or sand. It is found in the mesohaline zone of many different coastal countries. It has been mistaken for a new fungal species Dryosphaera navigans and has yet to be assigned to a class, order, or family.\n\n\n== Taxonomy ==\nCrinigera maritima was first described by I. Schmidt in 1969, who suspected the species belongs to either the Plectascales or Erysiphales families. There is ongoing debate of the classification beyond the subphylum level. After re-examination Crinigera maritima type material, Koch and Jones concluded that Schmidt described two different species to be Crinigera maritima. They renamed Crinigera maritima Schmidt-paratype 214 to Dryosphaera navigans.\n\n\n== Description ==\nThe globose, light brown cleistothecial ascocarp is 310-324 μm with a 30-36 μm subiculum that attaches to the substrate. The cleistothecia have branched short appendages, a defining characteristic. Thick walled asci and paraphyses (1) make up the hymenium. The two-celled, cylindrical ascospores have appendages that have been described as hair-like.\n\n\n== Habitat and distribution ==\nThis species was initially found growing on Fucus vesiculosus (commonly known as bladder wrack algae) in the Baltic Sea. Ascocarps have been observed growing on driftwood, sand, and algae. Crinigera maritima has also been found in Japan, Denmark, Sri Lanka, Seychelles, Brunei, Brazil, and on the west coast of India. It is an obligate marine fungus.\n\n\n== Ecology ==\nA study in India about fungi that grow on driftwood observed Crinigera maritima as the highest frequency of occurrence (61.4%) compared to other common marine fungi in that region. Another study in India looked at 3327 wood samples and discovered Crinigera maritima in the top five most frequent fungi (10% appearance). The appendages of the ascospores and cleistothecia allow for strong attachment to the substrate.\n\n\n== See also ==\nList of Ascomycota genera incertae sedis\n\n\n== References ==\n\n\n== External links ==\nIndex Fungorum",
    "links": [
        "Ascocarp",
        "Ascomycota",
        "Cleistothecia",
        "Doi (identifier)",
        "Dryosphaera",
        "Encyclopedia of Life",
        "Erysiphales",
        "Fucus vesiculosus",
        "Fungi",
        "Genus",
        "Global Biodiversity Information Facility",
        "Hymenium",
        "ISSN (identifier)",
        "Incertae sedis",
        "Integrated Taxonomic Information System",
        "Interim Register of Marine and Nonmarine Genera",
        "List of Ascomycota genera incertae sedis",
        "Mesohaline",
        "Monotypic",
        "MycoBank",
        "National Biodiversity Network",
        "PMC (identifier)",
        "PMID (identifier)",
        "Paraphyses",
        "Pezizomycotina incertae sedis",
        "Synonym (taxonomy)",
        "Taxon",
        "Taxonomy (biology)",
        "Type material",
        "Type species",
        "Wikidata",
        "World Register of Marine Species"
    ]
}