{
    "url": "https://en.wikipedia.org/wiki/Crossfire_(Homeland)",
    "title": "Crossfire (Homeland)",
    "summary": "\"Crossfire\" is the ninth episode of the first season of the psychological thriller TV series Homeland.  It originally aired on Showtime on November 27, 2011.\nBrody is personally contacted by Abu Nazir.   Carrie continues to pursue Walker while dealing with the fallout from the killings at the mosque.",
    "content": "\"Crossfire\" is the ninth episode of the first season of the psychological thriller TV series Homeland.  It originally aired on Showtime on November 27, 2011.\nBrody is personally contacted by Abu Nazir.   Carrie continues to pursue Walker while dealing with the fallout from the killings at the mosque.\n\n\n== Plot ==\nThe episode recounts events in Brody's captivity, interwoven with events of the present day.\n\n\n=== Three years ago ===\nFor the first time in five years of captivity, Brody (Damian Lewis) is given suitable living quarters. Abu Nazir (Navid Negahban) puts him into a fully furnished bedroom and bathroom and gets him a shave and haircut. Nazir has a young son named Issa (Rohan Chand), whom he introduces to Brody. He asks Brody to live with Issa, and teach him to speak English. As they spend time together, Brody teaches Issa to speak English and takes on a fatherly role, and the two form a close relationship. As the first source of meaningful human contact in many years for Brody, he grows quite attached to the boy.\nOne day, the school Issa attends is destroyed by a drone strike.   Issa and 82 other children are killed. Brody is devastated by the loss. Later on, Abu Nazir and Brody watch a speech made by Vice President Walden (Jamey Sheridan) addressing the strike. Walden claims that a missile struck Abu Nazir's compound and that any images of dead children are merely images fabricated by the terrorists for propaganda purposes. The flashbacks end with Brody and Abu Nazir praying together as they prepare Issa's body for burial.\n\n\n=== Present day ===\nCarrie (Claire Danes) meets with Special Agent Hall (Billy Smith) from the FBI at the mosque. They review the SWAT Team's actions and how Walker (Chris Chalk) improbably escaped. They conclude that Walker must have had prior knowledge of the interior of the mosque. The imam (Sammy Sheik) of the mosque is outraged that two innocent worshipers were gunned down and is publicly disputing the FBI's claims that their agents did not shoot first but were merely returning fire. Carrie believes the imam may have information on Tom Walker and his presence at the mosque, but that the only chance he might cooperate is if the FBI admits the truth about the mosque shooting. Carrie meets with Agent Hall again trying to convince him that the FBI should come clean. She has no luck, but she was also secretly recording the conversation, in which Hall admitted that his agents shot first. She wants to use the tape as leverage to force the FBI's hand, but Estes (David Harewood) does not allow it.\nAfter doing some shopping, Brody is attacked in the parking lot by two men who beat him, knock him unconscious, and take him away in their car. When Brody wakes up, he is alone in a room with a computer monitor with a webcam. Abu Nazir appears on the screen in a video chat session. Brody confronts him with the knowledge that Tom Walker is alive, and that Nazir has been deceiving him for the past eight years. Nazir reminds Brody of the events that led them to this point, and that it was Brody's own decision to embark on this mission. Nazir attempts to reaffirm Brody's faith, and his commitment to the mission.\nTom Walker is in a forest calibrating his rifle and taking practice shots. A hunter named Dan happens by and they talk briefly. The hunter is unnerved and goes back to his truck where he has a newspaper and finds Walker's photo on the front page. He goes to make a phone call but is shot dead by Walker. Walker then drives off in the hunter's truck with the body in the back.\nCarrie visits the imam at his home. She warns the imam about the potential backlash facing him, and the mosque, if he was harboring and protecting a man who ultimately committed a terrorist act. The imam still offers nothing but, later on, the imam's wife calls Carrie. She reveals that at the mosque, Walker was regularly talking to a man with diplomat license plates on his car, and that the number on the plate indicated he was from Saudi Arabia. It does not take long for the CIA to use this information to identify Saudi diplomat Mansour Al-Zahrani (Ramsey Faragallah) as Walker's handler. Saul and Carrie begin watching him, but are limited in what they can do, as Al-Zahrani has diplomatic immunity.\nNazir ends the conversation with Brody. Al-Zahrani walks into the room and tells Brody that Vice President Walden is going to ask him to run for office. Brody is to accept the offer as a sign of his commitment to the cause. Brody goes home and explains his absence by telling Jessica he was mugged. Jessica tells him that there is a message for him on the voice mail from the Vice President.\n\n\n== Production ==\nThe episode was written by co-executive producer Alexander Cary, his third writing credit for the series. It was directed by Jeffrey Nachmanoff, his second directing credit for the series.\n\n\n== Reception ==\n\n\n=== Ratings ===\nThe original broadcast had 1.35 million viewers, which made it the third highest rated episode of the season.\n\n\n=== Reviews ===\nAlan Sepinwall of HitFix said of the Brody storyline \"Last week raised a bunch of questions, and this week gave what I found to be a satisfying, dramatically compelling answer\".  The A.V. Club's Emily VanDerWerff gave \"Crossfire\" a \"B\" grade, and felt that the editing was lacking in an otherwise good episode.    Cinema Blend's Jesse Carp was disappointed with the episode, finding Brody's motivations to be unconvincing and the CIA's storyline to be inconsequential.\n\n\n== References ==\n\n\n== External links ==\n\"Crossfire\" at Showtime\n\"Crossfire\" at IMDb",
    "links": [
        "13 Hours in Islamabad",
        "A False Glimmer",
        "A Flash of Light (Homeland)",
        "A Gettysburg Address",
        "A Red Wheelbarrow",
        "About a Boy (Homeland)",
        "Achilles Heel (Homeland)",
        "Active Measures (Homeland)",
        "Alan Sepinwall",
        "Alexander Cary, Master of Falkland",
        "All About Allison",
        "All In (Homeland)",
        "Alt.truth",
        "America First (Homeland)",
        "Andante (Homeland)",
        "Beirut Is Back",
        "Better Call Saul (Homeland)",
        "Big Man in Tehran",
        "Blind Spot (Homeland)",
        "Broken Hearts (Homeland)",
        "Calibrating",
        "Carrie Mathison",
        "Casus Belli (Homeland)",
        "Catch and Release (Homeland)",
        "Chalk One Up",
        "Chalk Two Down",
        "Chris Chalk",
        "Claire Danes",
        "Clarity (Homeland)",
        "Clean Skin",
        "Damian Lewis",
        "David Harewood",
        "Deception Indicated",
        "Designated Driver (Homeland)",
        "Diplomat",
        "Diplomatic immunity",
        "Enemy of the State (Homeland)",
        "Fair Game (Homeland)",
        "False Friends (Homeland)",
        "From A to B and Back Again",
        "Fucker Shot Me",
        "Game On (Homeland)",
        "Gerontion (Homeland)",
        "Good Night (Homeland)",
        "Grace (Homeland)",
        "Halfway to a Donut",
        "HitFix",
        "Homeland (TV series)",
        "Homeland (season 1)",
        "Homeland (season 2)",
        "Homeland (season 3)",
        "Homeland (season 4)",
        "Homeland (season 5)",
        "Homeland (season 6)",
        "Homeland (season 7)",
        "Homeland (season 8)",
        "Homerland",
        "I'll Fly Away (Homeland)",
        "IMDb",
        "Imam",
        "Imminent Risk",
        "In Full Flight (Homeland)",
        "In Memoriam (Homeland)",
        "Iron in the Fire (Homeland)",
        "Jamey Sheridan",
        "Jeffrey Nachmanoff",
        "Krieg Nicht Lieb",
        "Lies, Amplifiers, Fucking Twitter",
        "Like Bad at Things",
        "List of Homeland characters",
        "List of Homeland episodes",
        "List of awards and nominations received by Homeland",
        "Long Time Coming (Homeland)",
        "Marine One (Homeland)",
        "Mosque",
        "Navid Negahban",
        "New Car Smell (Homeland)",
        "New Normal (Homeland)",
        "Nicholas Brody",
        "One Last Thing",
        "Oriole (Homeland)",
        "Our Man in Damascus",
        "P.O.W. - Bandi Yuddh Ke",
        "Paean to the People",
        "Parabiosis (Homeland)",
        "Pilot (Homeland)",
        "Prisoners of War (Homeland)",
        "Prisoners of War (TV series)",
        "Psychological thriller",
        "Q&A (Homeland)",
        "R Is for Romeo",
        "Rebel Rebel (Homeland)",
        "Redux (Homeland)",
        "Representative Brody",
        "Rodina (TV series)",
        "Rohan Chand",
        "Sammy Sheik",
        "Saudi Arabia",
        "Semper I",
        "Separation Anxiety (Homeland)",
        "Shalwar Kameez (Homeland)",
        "Showtime (TV network)",
        "Sock Puppets (Homeland)",
        "Species Jump",
        "Standoff (Homeland)",
        "State of Independence (Homeland)",
        "Still Positive",
        "Super Powers (Homeland)",
        "Tasneem Qureishi",
        "Terrorist",
        "The A.V. Club",
        "The Choice (Homeland)",
        "The Clearing (Homeland)",
        "The Covenant (Homeland)",
        "The Drone Queen",
        "The English Teacher (Homeland)",
        "The Flag House",
        "The Good Soldier (Homeland)",
        "The Litvinov Ruse",
        "The Man in the Basement",
        "The Return (Homeland)",
        "The Smile (Homeland)",
        "The Star (Homeland)",
        "The Tradition of Hospitality",
        "The Vest",
        "The Weekend (Homeland)",
        "The Yoga Play",
        "There's Something Else Going On",
        "Threnody(s)",
        "Tin Man Is Down",
        "Tower of David (Homeland)",
        "Trylon and Perisphere (Homeland)",
        "Two Hats",
        "Two Minutes",
        "Uh... Oh... Ah...",
        "Unmanned aerial vehicle",
        "Useful Idiot (Homeland)",
        "Vice President of the United States",
        "Voice mail",
        "Why Is This Night Different?"
    ]
}