{
    "url": "https://en.wikipedia.org/wiki/Democratic_media",
    "title": "Democratic media",
    "summary": "Democratic media is a form of media organization that strives to have the principles of democracy underlying not only the production of content, but also the organization of the entire project.",
    "content": "Democratic media is a form of media organization that strives to have the principles of democracy underlying not only the production of content, but also the organization of the entire project.\n\n\n== Definition of the term ==\nDemocratic Media is  idea that the media should be organised along democratic lines rather that strictly commercial lines. A functioning democratic media would aim for transparency, inclusiveness, one-person-one-vote and other key concepts of democracy as principals of operation: \"This is a media whose primary objectives are to inform, be open, independent and be accountable.\" This is in contrast to the belief that media should be run by commercial operations and with the objective of making a profit and the assumption that the media invariably reflects the opinions and values of the owner and advertisers. Advocates contrast it to state-run operations where the media reflects the value system of the state itself. Edward S Herman suggested the form that democratic media would take:\n\nA democratic media can be identified by its structure and functions. In terms of structure, it would be organized and controlled by ordinary citizens or their grass roots organisations....As regards function, a democratic media will aim first and foremost at serving the informational, cultural and other communications needs of members of the public which the media institutions comprise or represent.\n\n\n== Background of the term ==\nThe idea of democratic media stems from the belief that media is a vital part of a democratic society. Robert W. McChesney, writing for the Boston Review in 2008, commented:\n\nFirst, media perform essential political, social, economic, and cultural functions in modern democracies. In such societies, media are the principal source of political information and access to public debate, and the key to an informed, participating, self-governing citizenry. Democracy requires a media system that provides people with a wide range of opinion and analysis and debate on important issues, reflects the diversity of citizens, and promotes public accountability of the powers-that-be and the powers-that-want-to-be.\nTo therefore, if media is vital for democracy, democratic media argues that media itself needs to be organized along different lines to the existing forms. McChesney again:\n\nThe evidence is clear: if we want a media system that produces fundamentally different results, we need solutions that address the causes of the problems; have to address issues of media ownership, management, regulation, and subsidy. Our goal should be to craft a media system that reduces the power of a handful of enormous corporations and advertisers to dominate the media culture.\nThe idea of democratic media is still in its infancy, according to Carroll & Hackett (2006 where they term it \"democratic media activism\" however the idea does have older roots; In Triumph of the Market: Essays on Economics, Politics, and the Media Edward S Herman asserted that democratic media was a condition of democracy:\n\nA democratic media is a primary condition of popular rule, hence of a genuine political democracy.  Where the media are controlled by a powerful and privileged elite, whether of government leaders and bureaucrats or those of the private sector, democratic political forms and some kind of limited political democracy may exist, but not genuine democracy.\nThe term has been used to describe a number of new media projects from Wikipedia to the Indymedia movement to describe how it saw itself;\nIndymedia is a democratic media outlet for the creation of radical, accurate, and passionate tellings of truth.\nDemocratic media differs from similar (and related) concepts such as citizen media, media democracy and independent media (aka alternative media) in that it puts as much emphasis on the organization of the media project as it does on the content.  (Note; this definition means that an independent media or citizen media project can also be a democratic media project, but being an independent media or citizen media project does not mean it is automatically a form of democratic media.  It also means there could be a project that promotes the concepts of media democracy without it itself explicitly claiming to be a form of democratic media.)  For a media project to be considered democratic media it must have (or strive towards) the following characteristics:\n\nOpen publishing\nTransparency (humanities)\nAccountability\nOpen access (publishing)\nNon-commercial\n\n\n== See also ==\nCitizen media\nIndependent media\nIndymedia\nMedia democracy\nPropaganda model\n\n\n== References ==",
    "links": [
        "Accountability",
        "Boston Review",
        "Citizen media",
        "Democracy",
        "Edward S Herman",
        "Independent media",
        "Indymedia",
        "Media democracy",
        "New media",
        "Non-commercial",
        "Open access (publishing)",
        "Open publishing",
        "Propaganda model",
        "Robert W. McChesney",
        "Transparency (humanities)"
    ]
}