{"url": "https://en.wikipedia.org/wiki/Diane_E._Meier", "title": "Diane E. Meier", "summary": "Diane E. Meier (born April 15, 1952), an American geriatrician and palliative care specialist. In 1999, Dr. Meier founded the Center to Advance Palliative Care, a national organization devoted to increasing access to quality health care in the United States for people living with serious illness. She continues to serve as CAPC's Director Emerita and Strategic Medical Advisor. Meier is also Vice-Chair for Public Policy, Professor of Geriatrics and Palliative Medicine and Catherine Gaisman Professor of Medical Ethics at the Icahn School of Medicine at Mount Sinai Hospital in New York City. Meier was founder and Director of the Hertzberg Palliative Care Institute at the Icahn School of Medicine in New York City from 1997 to 2011.\nAn expert on palliative medicine, Meier has appeared in media including, CBS Evening News with Scott Pelley, PBS NewsHour, Boston Globe, NewsHour,  ABC World News Tonight, The Open Mind with Richard Heffner, The New York Times, the Los Angeles Times, USA Today, the New York Daily News, Newsday, The New Yorker and Newsweek. In 2002, she was featured in the Bill Moyers series On Our Own Terms: Dying in America, a four-part PBS documentary.Meier has published more than 200 peer-reviewed papers, several books, over twenty-nine book chapters and has been principal investigator on numerous grants. She edited the first textbook on geriatric palliative care, as well as four editions of Geriatric Medicine. Her book, Meeting the Needs of Older Adults with Serious Illness, was published by Springer Publishing in 2014. Palliative Care: Transforming the Care of Serious Illness, was published in 2010.", "content": "Diane E. Meier (born April 15, 1952), an American geriatrician and palliative care specialist. In 1999, Dr. Meier founded the Center to Advance Palliative Care, a national organization devoted to increasing access to quality health care in the United States for people living with serious illness. She continues to serve as CAPC's Director Emerita and Strategic Medical Advisor. Meier is also Vice-Chair for Public Policy, Professor of Geriatrics and Palliative Medicine and Catherine Gaisman Professor of Medical Ethics at the Icahn School of Medicine at Mount Sinai Hospital in New York City. Meier was founder and Director of the Hertzberg Palliative Care Institute at the Icahn School of Medicine in New York City from 1997 to 2011.\nAn expert on palliative medicine, Meier has appeared in media including, CBS Evening News with Scott Pelley, PBS NewsHour, Boston Globe, NewsHour,  ABC World News Tonight, The Open Mind with Richard Heffner, The New York Times, the Los Angeles Times, USA Today, the New York Daily News, Newsday, The New Yorker and Newsweek. In 2002, she was featured in the Bill Moyers series On Our Own Terms: Dying in America, a four-part PBS documentary.Meier has published more than 200 peer-reviewed papers, several books, over twenty-nine book chapters and has been principal investigator on numerous grants. She edited the first textbook on geriatric palliative care, as well as four editions of Geriatric Medicine. Her book, Meeting the Needs of Older Adults with Serious Illness, was published by Springer Publishing in 2014. Palliative Care: Transforming the Care of Serious Illness, was published in 2010.\n\n\n== Biography ==\nMeier was born in Princeton, New Jersey in 1952. She earned a BA in psychology from Oberlin College in 1973 and earned her MD at Northwestern University School of Medicine in Chicago in 1977. She completed both an internship and a residency at Oregon Health Sciences from 1977 to 1981 and completed a fellowship in geriatric medicine at the VA Medical Center in Portland, Oregon.\nIn 1983, Meier joined the Mount Sinai School of Medicine as an instructor in the Department of Geriatrics and Adult Development. She was named associate professor in 1990 and professor of geriatrics and medicine as well as professor of medical ethics in 1998. From 1995 until 2003 she served as chief of the Division of Geriatrics in Mount Sinai's Department of Medicine, and from 1995 to the present she has directed Mount Sinai's Palliative Care Program. In 1999 she was named director of both the Hertzberg Palliative Care Institute and the Center to Advance Palliative Care.\nSince 2000, Meier has sat on the board of the Visiting Nurse Service of New York Hospice Care. She serves or has served on national committees including the National Palliative Care Research Center (Chair, Scientific Advisory Committee) and the U.S. Senate’s Health Care Services Task Force.  She sits on the editorial boards of the journals Drugs & Aging, Interdisciplinary Topics in Gerontology, Journal of Palliative Medicine, Journal of Pain and Symptom Management and Internal Medicine News.\n\n\n== Honors and awards ==\nMeier is the recipient of the 2008 MacArthur Fellowship. She received the 2015 Academy Distinguished Award from the New York Academy of Medicine and was listed among New York Magazine's Best Doctors of 2009.\nAlexander Richman Commemorative Award for Humanism in Medicine, Mount Sinai School of Medicine, 1998\nFounders Award of the National Hospice and Palliative Care Organization, April 2007\nMacArthur Fellowship, September 2008 \nGold Humanism Honor Society National Honoree, November 2008\nAARP 50th Anniversary Social Impact Award, November 2008\nAmerican Academy of Hospice and Palliative Medicine Lifetime Achievement Award, March 2009\n\n\n== Grants ==\nMeier's work has been supported by numerous large grants, including:\n\nArchstone Foundation; Donaghue Foundation; John A. Hartford Foundation; Brookdale Foundation; Milbank Foundation for Rehabilitation; Mill Park Foundation; New York Community Trust; New York State Health Foundation; Olive Branch Fund; Partnership for Palliative Care; Robert Wood Johnson Foundation; The Atlantic Philanthropies; The Fan Fox and Leslie R. Samuels Foundation, Inc. United Hospital Fund; U.S. Department of Veteran Affairs; Y.C. Ho/Helen and Michael Chiang Foundation. December 1999- November 2011; Total direct costs: $36.5 million\nPalliative care for hospitalized cancer patients: National Cancer Institute NCI-NIH (R01 CA116227-01); August 2006 – August 2011; Direct costs: $5.2 million\n\n\n== Books ==\nMeier, DE, Kelley, Amy S, (eds). Meeting the Needs of Older Adults with Serious Illness: Challenges and Opportunities in the Age of Health Care Reform. Springer: 2014\nHughes RG, Isaacs SL, Meier DE, (eds). Palliative Care: Transforming the Care of Serious Illness. Wiley/Jossey-Bass: March 2010. ISBN 978-0-470-52717-7\nCassel CK, Leipzig RM, Cohen HJ, Larson EB, Meier DE, (eds). Geriatric Medicine. 4th ed. New York: Oxford University Press, 2003. ISBN 0-387-95514-3\nCassel CK, Leipzig RM, Cohen HJ, Larson EB, Meier DE, eds. Geriatric Medicine: An Evidence-Based Approach. 4th ed. New York: Springer-Verlag, 2003. ISBN 0-387-95514-3\nMorrison RS, Meier DE (eds). Geriatric Palliative Care. New York: Oxford University Press, 2003. ISBN 0-19-514191-1\n\n\n== Publications ==\nPartial list:\n\nMeier DE, Lim B, Carlson MD. Raising the standard: palliative care in nursing homes. Health Affairs (Millwood). 2010 Jan-Feb;29(1):136-40. PMID 20048372\nMeier DE, Casarett DJ, von Gunten CF, Smith WJ, Storey CP. Palliative Medicine: Politics and Policy. Journal of Palliative Medicine. 31 December 2009. PMID 20043709\nAdler ED, Goldfinger JZ, Kalman J, Park ME, Meier DE. Palliative care in the treatment of advanced heart failure. Circulation. 22 December 2009;120(25):2597-606. Review. PMID 20026792\nWeissman D, Morrison RS, Meier DE. Center to Advance Palliative Care Palliative Care Clinical Care and Customer Satisfaction Metrics Consensus Recommendations. Journal of Palliative Medicine. 18 November 2009. PMID 19922199\nMeier DE, Beresford L. Palliative care seeks its home in national health care  reform. Journal of Palliative Medicine. 2009 Jul;12(7):593-7. PMID 19594342\nMeier DE. Finding my place. Journal of Palliative Medicine. 2009 Apr;12(4):331-5. PMID 19327069\nHorton JD, Lee S, Brown SR, Bader J, Meier DE. Survival trends in children with hepatoblastoma. Pediatric Surgery International. 2009 May;25(5):407-12. Epub 24 March 2009. PMID 19308432\nWeissman DE, Meier DE. Center to advance palliative care inpatient unit operational metrics: consensus recommendations. Journal of Palliative Medicine. 2009 Jan;12(1):21-5. PMID 19284258\nMeier DE, Beresford L. Palliative care cost research can help other palliative care programs make their case. Journal of Palliative Medicine. 2009 Jan;12(1):15-20. PMID 19284257\nWeissman DE, Meier DE, Spragens LH. Center to Advance Palliative Care palliative care consultation service metrics: consensus recommendations. Journal of Palliative Medicine. 2008 Dec;11(10):1294-8. PMID 19115885\nMeier DE. Voices. Why palliative care matters to patients and to your bottom line. Interview by Bill Santamour. Hospitals & Health Networks. 2008 Nov;82(11):16, 19. PMID 19093402\nWeissman DE, Meier DE. Operational features for hospital palliative care programs: consensus recommendations. Journal of Palliative Medicine. 2008 Nov;11(9):1189-94. PMID 19021479\nMeier DE, Beresford L. Palliative care professionals contribute to state legislative and policy initiatives. Journal of Palliative Medicine. 2008 Oct;11(8):1070-3. PMID 18980444\nFerrell B, Connor SR, Cordes A, Dahlin CM, Fine PG, Hutton N, Leenay M, Lentz J,        Lund-Person J, Meier DE, Zuroski K.  The national agenda for quality palliative care: The National Consensus Project and the National Quality Forum. Journal of Pain and Symptom Management. 2007;33:737-744. PMID 17531914\nMorrison RS, Meier DE, Fischberg D, Moore C, Degenholtz H, Litke A, Maroney-Galin C, Siu AL. Improving the management of pain in hospitalized adults. Archives of Internal Medicine. 2006;166:1033-1039. PMID 16682579\nMeier DE. Palliative care as a quality improvement strategy for advanced, chronic illness. Journal for Healthcare Quality. 2005;27: 33-39. PMID 16416890\nNelson JE, Meier DE, Litke A, Natale DA, Siegel RE, Morrison RS. The symptom burden of chronic critical illness. Critical Care Medicine. 2004;32:1527-1534. PMID 15241097\nMorrison RS, Meier DE. Clinical Practice. Palliative care. The New England Journal of Medicine. 2004;350(25):2582-90. PMID 15201415\nMeier, DE.  United States: Overview of cancer pain and palliative care. Journal of Pain and Symptom Management. 2002;24:265-269. PMID 12231160\nMeier DE, Back A, Morrison RS. The inner life of physicians and the care of the seriously ill. JAMA. 2001; 286:3007-3014. PMID 11743845\n\n\n== References ==\n\n\n== External links ==\nThe Center to Advance Palliative Care\nThe Mount Sinai Hospital homepage\nIcahn School of Medicine at Mount Sinai School homepage\nMedscape video editorial. Meier DE. \"Palliative care is the job of every hospital\". July 6, 2007\n\"Palliative Care Pioneer Dr. Diane Meier on How People Struggle with Serious, Sometimes Terminal, Illness\", Democracy Now, March 24, 2010\nDiane E. Meier Twitter", "links": ["AARP", "ABC World News", "Americans", "Archives of Internal Medicine", "Bill Moyers", "Boston Globe", "CBS Evening News with Scott Pelley", "Chicago", "Circulation (journal)", "Critical Care Medicine", "Daily News (New York)", "Drugs & Aging", "Feinberg School of Medicine", "Geriatrics", "Gold Humanism Honor Society", "Health Affairs", "Hospitals & Health Networks", "ISBN (identifier)", "ISNI (identifier)", "Icahn School of Medicine", "Icahn School of Medicine at Mount Sinai", "JAMA (journal)", "Journal for Healthcare Quality", "Journal of Pain and Symptom Management", "Journal of Palliative Medicine", "Los Angeles Times", "MacArthur Fellows Program", "National Cancer Institute", "New York (magazine)", "Newsday", "Newsweek", "Oberlin College", "PBS NewsHour", "PMID (identifier)", "Palliative care", "Portland, Oregon", "Princeton, New Jersey", "Principal investigator", "Public Broadcasting System", "Richard Heffner", "SUDOC (identifier)", "Springer Publishing", "The New England Journal of Medicine", "The New York Academy of Medicine 2015 Academy Distinguished Awards", "The New York Times", "The New Yorker", "The Open Mind (TV series)", "USA Today", "United Hospital Fund", "VIAF (identifier)", "Veterans Health Administration", "Visiting Nurse Service of New York"]}