{"url": "https://en.wikipedia.org/wiki/Doctrinal_background_of_Zen", "title": "Doctrinal background of Zen", "summary": "Zen has a rich doctrinal background, despite the traditional Zen narrative which states that it is a \"special transmission outside scriptures\" which \"did not stand upon words.\"", "content": "Zen has a rich doctrinal background, despite the traditional Zen narrative which states that it is a \"special transmission outside scriptures\" which \"did not stand upon words.\"\n\n\n== Polarities ==\nClassical Chinese Chán is characterised by a set of polarities: absolute-relative, Buddha-nature - sunyata, sudden and gradual enlightenment, esoteric and exoteric transmission.\n\n\n=== Absolute-relative ===\nThe Prajnaparamita-sutras  and Madhyamaka emphasized the non-duality of form and emptiness: \"form is emptiness, emptiness is form\", as the Heart Sutra says. \nThis was understood to mean that ultimate reality is not a transcendental realm, but equal to the daily world of relative reality. This idea fitted into the Chinese culture, which emphasized the mundane world and society. But this does not tell how the absolute is present in the relative world:\n\nTo deny the duality of samsara and nirvana, as the Perfection of Wisdom does, or to demonstrate logically the error of dichotomizing conceptualization, as Nagarjuna does, is not to address the question of the relationship between samsara and nirvana -or, in more philosophical terms, between phenomenal and ultimate reality [...] What, then, is the relationship between these two realms?\nThis question is answered in such schemata as the Five Ranks of Tozan, the Oxherding Pictures, and Hakuin's Four ways of knowing.The Madhyamaka-scheme of the Two Truths doctrine, and the Yogacara-schemes of the Three Natures and the Trikaya-doctrine, also give depictions of the interplay between the absolute and the relative.\n\n\n=== Buddha-nature and sunyata ===\nWhen Buddhism was introduced in China it was understood in terms of its own culture. Various sects struggled to attain an understanding of the Indian texts. The Tathāgatagarbha Sutras and the idea of the Buddha-nature were endorsed, because of the perceived similarities with the Tao, which was understood as a transcendental reality underlying the world of appearances. Sunyata at first was understood as pointing to the Taoist \"wu\", nothingness.The doctrine of the Buddha-nature asserts that all sentient beings have Buddha-nature (Skt. Buddhadhātu, \"Buddha Element\", \"Buddha-Principle\"), the element from which awakening springs. The Tathāgatagarbha Sutras (literally: the womb of the thus-gone) state that every living being has the potential to realize awakening. Hence Buddhism offers salvation to every-one, not only to monks or those who have freed themselves almost completely from karma in previous lives. The  Yogacara theory of the Eight Consciousnesses explains how sensory input and the mind create the world we experience, and obscure the alaya-vijnana, which is equated to the Buddha-nature.When this potential is realized, and the defilements have been eliminated, the tathagatagarbha manifests as the Dharmakaya, the absolute reality which pervades everything in the world. In this way, it is also the primordial reality from which phenomenal reality springs. When this understanding is idealized, it becomes a transcendental reality beneath the world of appearances.Sunyata points to the \"emptiness\" or no-\"thing\"-ness of all \"things\". Though we perceive a world of concrete and discrete objects, designated by names, on close analysis the \"thingness\" dissolves, leaving them \"empty\" of inherent existence. The Heart sutra, a text from the prajnaparamita-sutras, articulates this in the following saying in which the five skandhas are said to be \"empty\":\n\n\"Oh, Sariputra, Form Does not Differ From the Void,And the Void Does Not Differ From Form.\nForm is Void and Void is Form;\nThe Same is True For Feelings,\nPerceptions, Volitions and Consciousness\".\nThe teachings on the five skandhas belong to the central teachings in the Tripitaka. They form a subdivision of the Samyutta Nikaya. The five skandhas are also mentioned in the Lankavatara-sutra:\n\nThe Citta dances like a dancer; the Manas resembles a jester; the [Mano-]vijnana together with the five [Vijnanas] creates an objective world which is like a stage.\nThe Yogacara explains this \"emptiness\" in an analysis of the way we perceive \"things\". Everything we conceive of is the result of the working of the five skandhas—results of perception, feeling, volition, and discrimination. The five skandhas together compose consciousness. The \"things\" we are conscious of are \"mere concepts\", not Ding an sich.It took Chinese Buddhism several centuries to recognize that sunyata does not refer to \"wu\", nothingness, nor does Buddhism postulate an undying soul. The influence of those various doctrinal and textual backgrounds is still discernible in Zen. Zen teachers still refer to Buddha-nature, but the Zen tradition also emphasizes that Buddha-nature is sunyata, the absence of an independent and substantial self.\n\n\n=== Sudden and gradual enlightenment ===\n\nIn Zen Buddhism two main views on the way to enlightenment are discernible, namely sudden and gradual enlightenment.\nEarly Chán recognized the \"transcendence of the body and mind\", followed by \"non-defilement [of] knowledge and perception\", meaning sudden insight into the true nature followed by gradual purification of intentions.In the 8th-century the Ch'an-history was effectively re-fashioned by Shenhui, who created a dichotomy between the so-called \"Northern School\", led by Yuquan Shenxiu, and his own line of teaching, which he called the \"Southern school\". Shenhui placed Hui-neng into prominence as the sixth Chán-patriarch, and emphasized sudden enlightenment, as opposed to the concurrent Northern School's alleged gradual enlightenment. According to the sudden enlightenment propagated by Shenhui insight into true nature is sudden; thereafter there can be no misunderstanding anymore about this true nature.\nIn the Platform Sutra the dichotomy between sudden and gradual is reconciled. Guifeng Zongmi, fifth-generation successor to Shenhui, also softened the edge between sudden and gradual. In his analysis, sudden awakening points to seeing into one's true nature, but is to be followed by a gradual cultivation to attain Buddhahood.Chinul, a 12th-century Korean Seon master, followed Zongmi, and also emphasized that insight into our true nature is sudden, but is to be followed by practice to ripen the insight and attain full Buddhahood. This is also the standpoint of the contemporary Sanbo Kyodan, according to whom kensho is at the start of the path to full  enlightenment.This gradual cultivation is also recognized by Tozan, who described the Five ranks of enlightenment. Other example of depiction of stages on the path are the Ten Ox-Herding Pictures which detail the steps on the Path, The Three mysterious Gates of Linji, and the Four Ways of Knowing of Hakuin. This gradual cultivation is described by Chan Master Sheng Yen as follows:\n\nCh'an expressions refer to enlightenment as \"seeing your self-nature\". But even this is not enough. After seeing your self-nature, you need to deepen your experience even further and bring it into maturation. You should have enlightenment experience again and again and support them with continuous practice. Even though Ch'an says that at the time of enlightenment, your outlook is the same as of the Buddha, you are not yet a full Buddha.\nThe emphasis which Shenhui placed on sudden enlightenment, also reflected a growing appreciation of the Diamond Sutra in 8th-century Chinese Buddhism. The Lankavatara-sutra, which endorses the Buddha-nature, emphasized purity of mind, which can be attained in gradations. The Diamond-sutra emphasizes sunyata, which \"must be realized  totally or not at all\".Once the dichotomy between sudden and gradual was in place, it defined its own logic and rhetorics, which are also recognizable in the distinction between Caodong (Soto) and Lin-ji (Rinzai) chán. But it also leads to a \"sometimes bitter and always prolix sectarian controversy between later Chán and Hua-yen exegetes\". In the Huayan classification of teachings, the sudden approach was regarded inferior to the Perfect Teaching of Hua-yen. Guifeng Zongmi, fifth patriarch of Hua-yen ànd Chán-master, devised his own classification to counter this subordination. To establish the superiority of the Chán-teachings, Chinul explained the sudden approach as not pointing to mere emptiness, but to suchness or the dharmadhatu.\n\n\n=== Esoteric and exoteric transmission ===\nAccording to Borup the emphasis on 'mind to mind transmission' is a form of esoteric transmission, in which \"the tradition and the enlightened mind is transmitted face to face\". Metaphorically this can be described as the transmission from a flame from one candle to another candle, or the transmission from one vein to another. In exoteric transmission requires \"direct access to the teaching through a personal discovery of one's self. This type of transmission and identification is symbolized by the discovery of a shining lantern, or a mirror.\"This polarity is recognizable in the emphasis that the Zen-tradition puts on maintaining the correct Dharma transmission, while simultaneously stressing seeing into one's nature. According to Rinzai master Tōrei Enji:\n\nThe matter of learning from a teacher is most essential. People of old who arrived at the source of seeing nature, passed through many barriers clearly and completely without a dot of doubt, and traveled freely through the world opening big mouths in discussion, only came to know the transcendental message of Zen after they finally ran into Zen masters of great vision. Then they sincerely sought certainty and wound up with the duty of the teacher's succession, bearing the debt of Dharma, never to forget it for a moment. This is called dharma succession. Since ancient times the designated succession of the ancestral teachers has always been like this.\nNevertheless, while the Zen tradition has always stressed the importance of formal Dharma transmission, there are well known examples of Mushi dokugo, such as Nōnin, Jinul and Suzuki Shōsan who attained awakening on their own, though all of them were familiair with the Zen-teachings.\n\n\n== The Bodhisattva ideal ==\n\nAn important, though easily overlooked aspect of Zen is the bodhisattva ideal. It supplements kensho and insight into the absolute with Karuṇā, compassion with all sentient beings. This ideal is reflected in the Bodhisattva vow and the Bodhisattva Precepts or jukai.Part of this Bodhisattva-ideal are the pāramitās, which are also being mentioned in the Diamond Sutra: \n\nDāna (generosity, giving of oneself),\nŚīla (virtue, morality, proper conduct),\nKṣānti (patience, tolerance, forbearance, acceptance, endurance),\nVīrya (energy, diligence, vigour, effort),\nDhyāna (meditation, tranquility), and\nPrajñā (wisdom, insight).The Bodhisattva-ideal is a central theme in the prajnaparamita-sutras.Dogen mentions the Bodhisattva-ideal throughout his works.Hakuin saw \"deep compassion and commitment to help all sentient beings everywhere\" as an indispensable part of the Buddhist path to awakening. Hakuin emphasized the need of \"post-satori training\", purifying the mind of karmic tendencies and \n\n[W]hipping forward the wheel of the Four Universal Vows, pledging yourself to benefit and save all sentient beings while striving every minute of your life to practice the great Dharma giving.\nThe insight in the need of arousing bodhicitta formed Hakuin's final awakening:\n\nWasn't a shaven head and monk's robe the Mind of Enlightenment? Wasn't reciting sutras, mantras, and dharanis the Mind of Enlightenment? [...] [At] my forty-first year, [...] I at long last penetrated into the heart of this great matter. Suddenly, unexpectedly, I saw it — it was as clear as if it were right there in the hollow of my hand. What is the Mind of Enlightenment? It is, I realized, a matter of doing good — benefiting others by giving them the gift of the Dharma teaching.\nBuddhas and bodhisattvas such as Amitābha, Avalokiteśvara, Mañjuśrī, Samantabhadra, and Kṣitigarbha are venerated alongside Gautama Buddha.By repeatedly chanting the Avalokiteshvara sutra (観世音菩薩普門品, Kanzeon Bosatsu Fumonbon) (chapter 25 of the Lotus Sutra), for example, one instills the Bodhisattva's ideals into one's mind. The ultimate goal is given in the end of the sutra, which states, \"In the morning, be one with Avalokiteshvara; in the evening, be one with Avalokiteshvara\". Through the realization of emptiness and the Mahayana notion that all things have Buddha-nature, one understands that there is no difference between the cosmic bodhisattva and oneself. The wisdom and compassion of the Bodhisattva one is chanting to is seen to equal the inner wisdom and compassion of the practitioner. Thus, the duality between subject and object, practitioner and Bodhisattva, chanter and sutra is ended.\n\n\n== See also ==\nBuddhism\nOutline of Buddhism\nTimeline of Buddhism\nList of Buddhists\nChinese Buddhism\nJapanese Zen\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== Written references ===\n\n\n=== Web references ===\n\n\n== Sources ==\n\n\n== Further reading ==\nModern classics\n\nPaul Reps & Nyogen Senzaki, Zen Flesh, Zen Bones\nPhilip Kapleau, The Three Pillars of Zen\nShunryu Suzuki, Zen Mind, Beginner's MindClassic history\n\nDumoulin, Heinrich (2005), Zen Buddhism: A History. Volume 1: India and China. World Wisdom Books. ISBN 978-0-941532-89-1\nDumoulin, Heinrich (2005), Zen Buddhism: A History. Volume 2: Japan. World Wisdom Books. ISBN 978-0-941532-90-7Critical Zen-studies\n\nMcrae, John (2003), Seeing through Zen. Encounter, Transformation, and Genealogy in Chinese Chan Buddhism. The University Press Group Ltd. ISBN 978-0-520-23798-8\n\n\n== External links ==\nOversight\n\nZen Buddhism WWW Virtual Library\nThe Zen SiteTexts\n\nSacred-text.com's collection of Zen texts\nBuddhanet's collection of Zen texts\nShambhala Sun Zen Articles\nBooklets from Fo Guang ShanHistory\n\nBuddhism and Confucianism in Chan Sudden Approach: A Cunning Cultural Paradigm\nHistory of Zen Buddhism\nZen history\nZen Quick FactsCritical Chán Research\n\nSteven Heine (2007), A Critical Survey of Works on Zen since Yampolsky\nHomepage of Robert H. Sharf", "links": ["Amitabha", "Ango", "Antai-ji", "Avalokiteshvara", "Avalokitesvara", "Avalokiteśvara", "Avatamsaka Sutra", "Baizhang Huaihai", "Benhuan", "Bernie Glassman", "Bodhicitta", "Bodhidharma", "Bodhisattva", "Bodhisattva Precepts", "Bodhisattva vow", "Brad Warner", "Buddha's Light International Association", "Buddha-nature", "Buddhahood", "Buddhism", "Buddhist chant", "Buddhist initiation ritual", "Caodong school", "Chan Buddhism", "Cheng Yen", "Chinese Buddhism", "Chuanyin", "Chung Tai Shan", "Citta", "City of Ten Thousand Buddhas", "D. T. Suzuki", "Daewon", "Dahui Zonggao", "Dai Bosatsu Zendo Kongo-ji", "Dainin Katagiri", "Daisetz Teitaro Suzuki", "Daitoku-ji", "Daman Hongren", "Danxia Zichun", "Dayang Jingxuan", "Dayi Daoxin", "Dazu Huike", "Denkoroku", "Dennis Merzel", "Dharma Drum Mountain", "Dharma Realm Buddhist Association", "Dharma Realm Buddhist University", "Dharma combat", "Dharma transmission", "Dharmadhatu", "Dharmakaya", "Dhyāna in Buddhism", "Diamond Sutra", "Doi (identifier)", "Dongchu", "Dongshan Liangjie", "Dongshan Shouchu", "Dāna", "Dōgen", "East Asian Mādhyamaka", "East Asian Yogācāra", "East Mountain Teaching", "Eido Tai Shimano", "Eight Consciousnesses", "Eihei-ji", "Eisai", "Ensō", "Fayan school", "Five Houses of Chán", "Five Ranks", "Fo Guang Shan", "Four Heavenly Kings (Taiwan)", "Fuke-shū", "Furong Daokai", "Geoffrey Shugen Arnold", "Gudō Wafu Nishijima", "Guifeng Zongmi", "Guiyang school", "Gyokuko Carlson", "Hakuin", "Hakuin Ekaku", "Hakuun Yasutani", "Hanshan Deqing", "Heart Sutra", "Heart sutra", "Heinrich Dumoulin", "Heze school", "Hongzhi Zhengjue", "Hongzhou school", "Houn Jiyu-Kennett", "Hsing Yun", "Hsuan Hua", "Hua Tou", "Huangbo Xiyun", "Huayan", "Huayan school", "Hugo Enomiya-Lassalle", "Hui-neng", "Huineng", "ISBN (identifier)", "Imakita Kosen", "JSTOR (identifier)", "Japanese Zen", "Jianzhi Sengcan", "Jikijitsu", "Jinul", "Jisha", "Jogye Order", "John Daido Loori", "Joko Beck", "Jukai", "Kaishin Inshu", "Kanzeon Zen Center", "Karlfried Graf Dürckheim", "Karuṇā", "Keido Fukushima", "Kensho", "Kenshō", "Koan", "Korean Seon", "Ksitigarbha", "Kwan Um School of Zen", "Kyoto School", "Kyozan Joshu Sasaki", "Kōbun Chino Otogawa", "Kōdō Sawaki", "Kōshō Uchiyama", "Kṣānti", "Laṅkāvatāra Sūtra", "Liangshan Yuanguan", "Linji Yixuan", "Linji school", "List of Buddhists", "Long Scroll of the Treatise on the Two Entrances and Four Practices", "Madhyamaka", "Manas-vijnana", "Manas (early Buddhism)", "Manjusri", "Masao Abe", "Mazu Daoyi", "Mel Weitsman", "Mu (negative)", "Muhō Noelke", "Mushi dokugo", "Myōshin-ji", "Nan Huai-Chin", "Nanpo Shōmyō", "Nanyang Huizhong", "Nanyue Huairang", "Nine mountain schools", "Norwich Zen Buddhist Priory", "Noumenon", "Nōnin", "Omori Sogen", "Order of Interbeing", "Ordinary Mind Zen School", "Oshō", "Outline of Buddhism", "Oxhead school", "Pacific Zen Institute", "Philip Kapleau", "Pháp Hiền", "Pháp Loa", "Platform Sutra", "Plum Village Tradition", "Prajnaparamita", "Prostration (Buddhism)", "Pure Land Buddhism", "Pāramitā", "Qingyuan Xingsi", "Rinzai school", "Robert Baker Aitken", "Rochester Zen Center", "Ryomo Kyokai", "Rōshi", "Samantabhadra (Bodhisattva)", "Samu (Zen)", "Samyutta Nikaya", "San Francisco Zen Center", "Sanbo Kyodan", "Sandokai", "Sanjiejiao", "Satori", "Sensei", "Sentient beings (Buddhism)", "Seongcheol", "Sesshin", "Seungsahn", "Shakyamuni Buddha", "Sheng-yen", "Shenhui", "Shi Yinshun", "Shikantaza", "Shingon Buddhism", "Shinzan Miyamae Roshi", "Shitou Xiqian", "Shodo Harada", "Shuho Myocho", "Shunryū Suzuki", "Shunyata", "Shōbōgenzō", "Shōhaku Okumura", "Skandha", "Soen Nakagawa", "Sokei-an", "Soto Zen Buddhist Association", "Soyen Shaku", "Steven Heine", "Subitism", "Sunyata", "Suzuki Shōsan", "Sōji-ji", "Sōtō", "Sōyū Matsuoka", "Taego Bou", "Taego Order", "Taisen Deshimaru", "Taixu", "Taizan Maezumi", "Tao", "Tassajara Zen Mountain Center", "Tathāgatagarbha Sutras", "Ten Bulls", "Tendai", "The Gateless Barrier", "The Way of Zen", "Three natures", "Throssel Hole Buddhist Abbey", "Thích Nhất Hạnh", "Thích Thanh Từ", "Thích Thiên-Ân", "Tiantai", "Tiantong Rujing", "Tiantong Zongjue", "Timeline of Buddhism", "Tongan Daopi", "Tongan Guanzhi", "Toni Packer", "Touzi Yiqing", "Tozan", "Trikaya", "Tripitaka", "Trúc Lâm", "Trúc Lâm Temple", "Trần Nhân Tông", "Trần Thái Tông", "Two Truths doctrine", "Tzu Chi Foundation", "Tōfuku-ji", "Tōrei Enji", "University of Massachusetts Press", "Unsui", "Vietnamese Thiền", "Vijñāna", "Vimalakirti Sutra", "Vīrya", "Vạn Hạnh", "Vạn Hạnh Zen Temple", "Walking meditation", "Wansong Xingxiu", "Wei Chueh", "White Plum Asanga", "William Bodiford", "Wisdom in Buddhism", "Wu Yantong", "Xinxin Ming", "Xu Yun", "Xuedou Zhijian", "Xuefeng Yicun", "Xueting Fuyu", "Xuyun", "Yaoshan Weiyan", "Yicheng (monk)", "Yogacara", "Yogācāra", "Yongming Yanshou", "Yuanwu Keqin", "Yuanying", "Yunju Daoying", "Yunmen Wenyan", "Yunmen school", "Yunyan Tansheng", "Yuquan Shenxiu", "Zazen", "Zazenkai", "Zen", "Zen Center of Los Angeles", "Zen Mind, Beginner's Mind", "Zen Narratives", "Zen Peacemakers", "Zen Studies Society", "Zen and Sutras", "Zen and the Art of Motorcycle Maintenance", "Zen at War", "Zen in the United States", "Zen lineage charts", "Zen master", "Zen organisation and institutions", "Zen ranks and hierarchy", "Zen scriptures", "Zentatsu Richard Baker", "Zhenxie Qingliao", "Zhongfeng Mingben", "Ōbaku", "Ōryōki", "Śīla", "Śūnyatā", "Śūraṅgama Sūtra"]}