{"url": "https://en.wikipedia.org/wiki/Dolmen_City", "title": "Dolmen City", "summary": "Dolmen City (ڈولمین سٹی) is a mixed-use complex, situated on the waterfront of Clifton, in Karachi, Pakistan. It is made up of four towers: Tower A, Tower B, Harbour Front, and Executive Tower. At the base of the complex is the Dolmen Mall, a three-level shopping mall built in 2011 with an area of 600,000 sq ft (56,000 m2), and 130 stores - including several international brands. The total area of the entire Dolmen City complex is 3,441,340 sq ft (319,711 m2).", "content": "Dolmen City (ڈولمین سٹی) is a mixed-use complex, situated on the waterfront of Clifton, in Karachi, Pakistan. It is made up of four towers: Tower A, Tower B, Harbour Front, and Executive Tower. At the base of the complex is the Dolmen Mall, a three-level shopping mall built in 2011 with an area of 600,000 sq ft (56,000 m2), and 130 stores - including several international brands. The total area of the entire Dolmen City complex is 3,441,340 sq ft (319,711 m2).\n\n\n== History ==\nDolmen City's site was originally the site of a casino, which was closed in 1978 during the dictatorship of General Zia-ul-Haq before it was formally opened. The site was purchased for 100 million rupees, but was valued at 50 billion rupees by 2019. The complex was owned by the International Complex Project - a venture which was 20% owned by the Arif Habib Group, and 80% by the Dolmen Group. Since June 2015, the companies have listed some of their shares as part of the Dolmen City REIT on the Pakistan Stock Exchange.Construction of the Dolmen City complex began in 2005, and was completed in phases. The site's branch of Dolmen Mall was completed in 2011, while the Harbour Front Tower and Executive Towers were completed in 2019. Towers A and B were topped out in 2019, but have not yet been inaugurated.\n\n\n== Office towers ==\nTowers A and B are 150 m (490 ft) in height, 40 floors each, made of concrete. They were designed by architect Arshad Shahid Abdulla. Both house corporate offices, while Tower B will also host a hotel on its ten top floors.Executive Tower is a 17-floor corporate office building, and is home to co-working space company Regus. Harbour Front is an office building with 19 floors, and houses some multinational corporations such as Mitsubishi and Procter & Gamble. The occupancy rate in Harbour Front is 92% as of Q1 2020.\n\n\n== Dolmen Mall ==\n\nDolmen Mall, a 3-level shopping mall built in 2011 with an area of 600,000 sq ft (56,000 m2), of which 547,924 sq ft (50,903.8 m2) are leasable. It has 130 stores, including several international brands. There are several Pakistani chains as well, including Khaadi. & Converse. The occupancy rate of the mall is 98.3% as of Q1 2020.\n\n\n== Dolmen City REIT ==\nThe occupancy rate for Dolmen Mall stood at 98.3 percent in 2020, while those of the Harbour Front Building stood at 92 percent in 2020.\n\n\n== Gallery ==\n\n\t\t\n\t\t\n\t\t\n\n\n== See also ==\nList of tallest buildings in Pakistan\nList of tallest buildings in Karachi\n\n\n== References ==\n\n\n== External links ==\nOfficial website", "links": ["Arfa Software Technology Park", "Arif Habib Group", "Bagh Ibne Qasim", "Bahria Icon Tower", "Bahria Town Tower", "Centre Point Tower (Karachi)", "Clifton, Karachi", "Dolmen Group", "Dolmen Mall", "Dolmen Malls", "Geographic coordinate system", "Karachi", "Karachi, Pakistan", "Khaadi", "List of tallest buildings in Karachi", "List of tallest buildings in Pakistan", "MCB Tower", "Mitsubishi Corporation", "Muhammad Zia-ul-Haq", "Ocean Towers", "One Constitution Avenue", "Pakistan Stock Exchange", "Pakistani rupee", "Procter & Gamble", "Real estate investment trust", "Regus", "Telecom Tower", "The Centaurus"]}