{"url": "https://en.wikipedia.org/wiki/Doris_Gordon", "title": "Doris Gordon", "summary": "Doris Clifton Gordon  (10 July 1890 – 9 July 1956) was a New Zealand doctor, university lecturer, obstetrician and women's health reformer. She was known as 'Dr Doris', famous for her work in rural general practice, for raising the status of obstetrics, improving obstetrics education of medical students and doctors, and working for the welfare of mothers and children.", "content": "Doris Clifton Gordon  (10 July 1890 – 9 July 1956) was a New Zealand doctor, university lecturer, obstetrician and women's health reformer. She was known as 'Dr Doris', famous for her work in rural general practice, for raising the status of obstetrics, improving obstetrics education of medical students and doctors, and working for the welfare of mothers and children.\n\n\n== Early life ==\nDoris Clifton Jolly was born in Melbourne, Victoria, Australia on 10 July 1890 emigrating with her family to New Zealand in 1894. She received little primary school education and completed her secondary education in just over one year after deciding to become a medical missionary. She entered medical school at the University of Otago in 1911, graduating in 1916.\n\n\n== Career ==\nOn graduation Gordon became a house surgeon at Dunedin Hospital. In 1917 she lectured at the University of Otago, qualified with a Diploma in Public Health and married fellow medical graduate William (Bill) Patteson Pollock Gordon. She decided early in her career to devote herself to country practice. After doing locum work, she and Bill settled in Stratford, Taranaki in 1919 where they ran a general practice and a small private hospital Marire. She became known as 'Dr Doris', synonymous with 'back blocks' (i.e. rural) practice, later publishing two volumes of her autobiography, Backblocks baby-doctor and Doctor down under.Gordon was devoted to midwifery care, in particular safe, pain free childbirth. She pioneered anaesthesia in childbirth or 'twilight sleep' using morphine and scolapine, as well as Caesarian sections.During the 1920s and 1930s Gordon led the medical profession's struggle with the Department of Health for control of obstetrics. She believed all births should take place in hospital and that mothers should be supervised by medical practitioners during pregnancy and postnatally. While she had been opposed to state control in medicine she applauded the Labour government's midwifery service introduced in 1938. The service included free hospital deliveries and 14 days' rest in hospital after the birth.Her commitment to the care of women and children extended to raising the status of obstetrics and improving education of medical students and young specialists. In 1927 she founded the New Zealand Obstetrical Society becoming its secretary. The Society promoted its aims through meetings, lecture tours, scholarships and liaison with the Department of Health. It also protested at midwifery coming under state control. In 1930–31 she raised money for an endowment to establish a chair in obstetrics at Otago Medical School. In 1938 the Queen Mary Hospital in Dunedin opened providing obstetrical training for medical students.She also saw the need for effective postgraduate training in obstetrics, lobbying for this from 1939. A Postgraduate School of Obstetrics and Gynaecology was set up at Auckland University College in 1947, becoming based at National Women's Hospital in 1964.From 1946–1948 Gordon became Director of Maternal and Infant Welfare in the Health Department.Doris and Bill Gordon had one daughter and three sons. Her daughter trained as a nurse, two sons Ross Gordon and Graham Gordon became doctors, and their other son Peter Gordon was a politician and cabinet minister.\n\n\n== Awards ==\nIn 1925 she became the first woman in Australasia to gain a fellowship of the Royal College of Surgeons of Edinburgh (FRCSE). She was elected to the Royal College of Obstetricians and Gynaecologists (FRCOG) in 1936, becoming an honorary fellow of the college in 1954. She was the only woman to receive this honour and the only recipient in the Southern Hemisphere. In the 1935 King's Birthday Honours, she was appointed a Member of the Order of the British Empire.\n\n\n== Legacy ==\nGordon campaigned throughout her career for the welfare of mothers and children. She firmly believed in motherhood as women's destiny and the need for women to be content with their maternal lot by making them happy in pregnancy and easing the pain of childbirth. She wished to “reconsecrate” motherhood and campaigned against abortion.  Her views on contraception and abortion have been criticised by Margaret Sparrow, a New Zealand reproductive rights advocate and doctor. Sparrow wrote that Gordon's upbringing and personal beliefs meant that she did not challenge the medical profession's negative views of contraception and abortion. She did not accept the advantages of preventing unplanned pregnancies and how birth control could improve the lives of ordinary women. She approved of contraception only if medically necessary. Her attitudes were pronatalist, racist and eugenicist and disapproving of the emancipation of women. Gordon co-authored a book, with Francis Bennett, Gentlemen of the Jury opposing indiscriminate contraception and abortion, though Bennett later distanced himself from the publication.In June 1961 the Obstetrical and Gynaecological Society (O&G Society) and the National Council of Women (NCW) established the Doris Gordon Memorial Trust and Fund to commemorate Gordon's work and to further the study and teaching and practice of obstetrics and gynaecology. During the 1990s, when maternity care was transferred from general practitioners to midwives, the O&G Society and Doris Gordon Memorial Trust became inactive but the Trust Fund remained.\nIn 2015 the Royal Australian and New Zealand College of Obstetricians and Gynaecologists and NCW formed a new Doris Gordon Memorial Trust to use the funds for an annual Doris Gordon Memorial Lecture. The inaugural lecture was a eulogy to Gordon, delivered by Ron Jones. Margaret Sparrow expressed the view that while Gordon had achieved much for the advancement of maternity services her legacy is flawed and that by opposing contraception and safe legal abortion she had held back advances made to women in England, Europe and America.\n\n\n== References ==\n\n\n== Further reading ==\nGordon, Doris. 1926. 'Further problems of obstetrics.' New Zealand Medical Journal, Vol. 25, p. 267-287.", "links": ["1935 Birthday Honours (New Zealand)", "Academic", "Auckland University College", "Australia", "Caesarean section", "Dunedin Public Hospital", "Fellow of the Royal College of Obstetricians and Gynaecologists", "Fellow of the Royal College of Surgeons of Edinburgh", "Graham Gordon", "ISBN (identifier)", "ISNI (identifier)", "Margaret Sparrow", "Melbourne", "Member of the Order of the British Empire", "Morphine", "National Council of Women of New Zealand", "National Women's Hospital", "New Zealand", "OCLC (identifier)", "Obstetrician", "Order of the British Empire", "Peter Gordon (politician)", "Royal Australian and New Zealand College of Obstetricians and Gynaecologists", "Royal College of Obstetricians and Gynaecologists", "Royal College of Surgeons of Edinburgh", "Stratford, New Zealand", "The London Gazette", "Trove (identifier)", "Twilight sleep", "University of Otago", "VIAF (identifier)", "Victoria (Australia)"]}