{"url": "https://en.wikipedia.org/wiki/Estadio_George_Capwell", "title": "Estadio George Capwell", "summary": "Estadio Banco del Pacífico Capwell is a multi-purpose stadium in Guayaquil, Ecuador. It is currently used mostly for football matches and is the home stadium of Emelec. It was announced right after Emelec won the 2013 Ecuador Serie A title that Stadium George Capwell would be completely remodeled to hold a capacity of 40,000 fans. The remodeling began in June 2014 and ended in December 2016.\nIn their first league season (Primera Etapa 2017) season at the expanded stadium, Emelec drew an average home attendance of 22,407. It became the highest in the league, followed by Barcelona SC with 10,572.", "content": "Estadio Banco del Pacífico Capwell is a multi-purpose stadium in Guayaquil, Ecuador. It is currently used mostly for football matches and is the home stadium of Emelec. It was announced right after Emelec won the 2013 Ecuador Serie A title that Stadium George Capwell would be completely remodeled to hold a capacity of 40,000 fans. The remodeling began in June 2014 and ended in December 2016.\nIn their first league season (Primera Etapa 2017) season at the expanded stadium, Emelec drew an average home attendance of 22,407. It became the highest in the league, followed by Barcelona SC with 10,572.\n\n\n== Overview ==\nFounder George Lewis Capwell was born in the United States, he traveled to Ecuador to supervise his electric company “Empresa Eléctrica del Ecuador” which can be translated into English as the Ecuadorian Electric Company. While supervising the company Capwell saw that his workers were interested in soccer, therefore he decided to create a soccer team that bear the company's name, hence the name C.S. EMELEC. \nThe colleagues funded the soccer club on April 28, 1929, Emelec was registered to the Serie C or C league in Ecuador in 1929. In 1940 a stadium was built to honor him.\n\n\n== The stadium and its beginnings ==\nGeorge Capwell Stadium is located to the north of General Gomez street, to the south of San Martin, to the west of Quito avenue and to the east of Montufar street. It was baptized with the name George Capwell in honor if the soccer club's president and because he also motorized the construction of the stadium and because he was the founder of the soccer club. George's idea was for the site not to be a soccer field but a baseball diamond. When popularity grew with soccer in the company and in Guayaquil, in little time the baseball field was converted into a soccer stadium, which it is to this day.\n\n\n=== Construction ===\nThe process of constructing the stadium started September 1940 when the council of Guayaquil approved the loaning of 4 square street blocks for the construction of Emelec's new stadium. On September 8, 1942, the municipality donated the square blocks instead of having them loaned. On October 15, 1942, the Ecuadorian Republic approved the city blocks for the stadium's construction.\nOn June 24, 1943 the first stone was placed. The construction was completed, and the George Capwell Stadium was inaugurated with a baseball game between Emelec and Oriente, October 21, 1945 with 11,000 fans in attendance. Nonetheless, the doors opened to soccer on December 2, 1945 to inaugurate it as a soccer field, a match was held between Emelec and Manta-Bahia; Emelec won 5-4\nThe Ecuadorian local tournament was won by Emelec because they had won their local title for the first time. A year later, November 30, 1947 the stadium opened its doors to international soccer when Guayaquil, Ecuador hosted the Copa America, Estadio Capwell was the stadium host.\nOnce El Estadio Modelo [Model Stadium] opened its doors in 1959, Estadio Capwell lost its shine and began to deteriorate and was not maintained...\n\n\n== External links ==\nStadiumDB page\n\n\n== References ==\n\n1. http://www.emelec.com.ec/institucion/estadio/ (Spanish)", "links": ["Club Sport Emelec", "Ecuador", "Football (soccer)", "Geographic coordinate system", "George Capwell", "Guayaquil", "Guayaquil, Ecuador", "Multi-purpose stadium", "Seating capacity"]}