{
    "url": "https://en.wikipedia.org/wiki/Everything_Happens_to_Me_(1980_film)",
    "title": "Everything Happens to Me (1980 film)",
    "summary": "Everything Happens to Me (Italian: Chissà perché... capitano tutte a me) is a 1980 children's comedy movie starring Bud Spencer and child actor Cary Guffey. It is a direct sequel of the 1979 movie The Sheriff and the Satellite Kid and is also known under the title Why Did You Pick on Me?",
    "content": "Everything Happens to Me (Italian: Chissà perché... capitano tutte a me) is a 1980 children's comedy movie starring Bud Spencer and child actor Cary Guffey. It is a direct sequel of the 1979 movie The Sheriff and the Satellite Kid and is also known under the title Why Did You Pick on Me?\n\n\n== Plot ==\nFollowing the events of The Sheriff and the Satellite Kid, Sheriff Hall and H7-25 (using the official identity of Charlie Warren) still get no rest from the military: because the little alien has not yet grasped the meaning of keeping a low profile, they are constantly on the move, and H7-25's father has had to pick them out of a tight spot too many times already.\nHall and Charlie eventually arrive at the city of Munroe, where petty crime, from vandalism to armed robberies, is running rampant, more so because the town currently has no sheriff. Charlie pushes Hall into staying in this place, and somewhat reluctantly Hall takes up the job in this chaotic place, with the help of the local radio jock and City Mayor Howard (Ferruccio Amendola). Soon the riff-raff in town learns not to underestimate the new sheriff as he metes out hard-hitting advice to stay out of trouble.\nHowever, the local thugs turn out to be the smallest of Hall's problems. A task force of hostile alien invaders are preparing to enslave mankind with the use of hypno-wave devices and advanced androids; already they control the local authorities and military installations. Charlie immediately senses the true nature of these individuals, however, and after much persuasion convinces his big friend to look into the matter. But this arouses the suspicion of the alien leader (Claudio Undali); he has Hall arrested for snooping into matters of national security and Charlie kidnapped.\nHall manages to sneak out of prison, and after Howard has told him what happened to Charlie, the sheriff decides to take up the fight. Through the public announcement system Howard appeals to the citizens of Munroe for help, and the thugs and hooligans whom Hall has previously thrashed join forces with the sheriff, just as the alien leader executes the final stage of his plan to take over Munroe by sending the local state police force to a festival and round up the townspeople. Hall and his helpers engage the officers in a massive fist-fight and begin to win the upper hand until the alien chief decides to use his hypno-wave machine. The rioters are quickly subjugated, except for the sheriff, who wanders as if in trance to the military base which serves as the alien's headquarters.\nAs Hall arrives there, the alien leader and his androids discover that their hypno-waves have no effect on the sheriff (due to an earlier treatment by Charlie's wonder device). The androids are sent against Hall, but the sheriff's fists prove to be tougher than they are, and the androids' neural nets quickly end up thoroughly scrambled. The alien leader tries to activate a self-destruct device, but the sheriff takes a swing at him and he shatters like glass. Charlie is released from captivity and happily rejoins the sheriff.\nHowever, as the town celebrates their rescuers, the military arrives to try and apprehend Charlie once more. Fed up with the constant pestering, Hall and Charlie take off into space with the old-timer automobile they were riding at the parade to join Charlie's family. But as soon as they have left the atmosphere, a small inconvenience makes Hall grumble once more: \"Why does everything happen to me!\"\n\n\n== Cast ==\nBud Spencer as Sheriff Scott Hall.\nCary Guffey as H7-25 (Charlie Warren).\nFerruccio Amendola as Phil Howard.\nRobert Hundar as Aliens Boss.\nJohn Bartha as Police Chief.\nCarlo Reali as Lt. Turner.\nGiovanni Cianfriglia as Alien.\n\n\n== Production ==\nThe primary filming location for the town scenes was Monroe, Georgia. The showdown scenes at the amusement park took place in Six Flags Over Georgia, which was also used in the film's predecessor for the scene of the first meeting between the Sheriff and H7-25.\n\n\n=== Deleted scenes ===\nThe original Italian version of the film includes about 16 minutes of additional scenes which were deleted from its international release copies:\n\nAn extended version of the introduction scene at an Air Force base, where several high-ranking officers arrive to be briefed about the search for H7-25.\nFollowing the intro scene, a title sequence follows in which H7-25, as an acolyte at a school Christmas festival, becomes jealous when the Sheriff (as Santa Claus) gives gifts to the other schoolchildren (and not him, since he is an alien), and starts a minor chaos by animating the presents and Christmas decorations.\nAn extended version of a school basketball tournament in which H7-25 participates.\nAfter H7-25 steals the Sheriff's car outside the hamburger restaurant, there is an extended sequence where the Sheriff pulls over a woman in her car so he can go after H7-25.\nAn additional scene of H7-25 arriving at the alien headquarters in the Sheriff's car and him then infiltrating the exterior fencing with his photonic ray.\nWhen the Sheriff goes undercover in a restaurant to catch the Dynamite Brothers, H7-25 drops by and tries to show him X-ray photos he has taken of the alien robots, which the Sheriff dismisses, and the distracted Sheriff ends up mixing an unappetizing cocktail for a drunken guest.\nAfter the apprehension of the Dynamite Brothers, Hall goes looking for H7-25 the next morning, finding him unconscious in the woods.\nThe victory parade at the end of the film has an extended introduction sequence.\n\n\n== External links ==\nEverything Happens to Me at IMDb\nBud Spencer and Terence Hill movie",
    "links": [
        "Acolyte",
        "Android (robot)",
        "Bud Spencer",
        "Carlo Reali",
        "Cary Guffey",
        "Claudio Undari",
        "Comedy movie",
        "Elio Scardamaglia",
        "Ferruccio Amendola",
        "Francesco Scardamaglia",
        "Franco Di Giacomo",
        "Giovanni Cianfriglia",
        "Hypnosis",
        "IMDb",
        "Italian language",
        "John Bartha",
        "Marcello Fondato",
        "Michele Lupo",
        "Monroe, Georgia",
        "Neural nets",
        "Renato Casaro",
        "Robert Hundar",
        "Six Flags Over Georgia",
        "State police",
        "The Sheriff and the Satellite Kid",
        "Vintage car"
    ]
}