{"url": "https://en.wikipedia.org/wiki/February_1936", "title": "February 1936", "summary": "The following events occurred in February 1936:", "content": "The following events occurred in February 1936:\n\n\n== February 1, 1936 (Saturday) ==\nAn appeal from Benito Mussolini to \"the students of Europe\" was published in Il Popolo d'Italia, claiming that Italy wanted peace in Europe but sanctions against the country would lead to a war for which Italy would not be responsible.\nDied: Georgios Kondylis, 57, Greek general and two-time Prime Minister of Greece\n\n\n== February 2, 1936 (Sunday) ==\nFuji-Hakone-Izu National Park was established in Japan.\n\n\n== February 3, 1936 (Monday) ==\nThe Soviet Union issued a statement accusing troops from Japan and Manchukuo of making \"provocatory raids\" into Soviet territory.\nBorn: Jim Marshall, photographer, in Chicago, Illinois (d. 2010)\nDied: Charles E. Cox, 75, American lawyer and judge; Princess Sophie of Schönburg-Waldenburg, 50, consort of William, Prince of Wied\n\n\n== February 4, 1936 (Tuesday) ==\nIdaho Senator William E. Borah formally announced his candidacy for President of the United States.\nThe General Theory of Employment, Interest and Money by the English economist John Maynard Keynes was published.\nThe George Bernard Shaw play The Millionairess premiered at the Vienna Akademie Theatre.\nBorn: David Brenner, comedian and actor, in Philadelphia, Pennsylvania (d. 2014); Gary Conway, actor and screenwriter, in Boston, Massachusetts\nDied: Wilhelm Gustloff, 41, leader of the Swiss NSDAP/AO was assassinated  by David Frankfurter, a Croatian Jew.\n\n\n== February 5, 1936 (Wednesday) ==\nThe University of Birmingham student newspaper Redbrick was first published, as Guild News.\nThe Charlie Chaplin silent comedy film Modern Times premiered at the  Rivoli Theatre on Broadway. Police were on hand to push back the thousands of moviegoers who turned out to get a glimpse of the gala premiere.\nThe Japan Occupational Baseball League was established.\n\n\n== February 6, 1936 (Thursday) ==\nThe IV Olympic Winter Games opened in Garmisch-Partenkirchen, Germany. As each delegation of the 28 participating countries marched past Adolf Hitler in the opening ceremony he gave the Nazi salute. Most athletes appeared to return the gesture, although the Nazi salute was confusingly similar to the traditional Olympic salute. The Americans were among those who did not salute.\nThe Maxwell Anderson play The Masque of Kings premiered at the Shubert Theatre in New York City.\nBorn: Kent Douglas, ice hockey player and coach, in Cobalt, Ontario, Canada (d. 2009)\n\n\n== February 7, 1936 (Friday) ==\nThe last inmates in Welfare Island, widely considered the worst prison in the United States, were transferred to Rikers Island so the old prison could be razed and replaced with a park and hospital.\n\n\n== February 8, 1936 (Saturday) ==\nJawaharlal Nehru was elected president of the Indian National Congress.\nThe original Teatro Regio in Turin was destroyed by fire.\nThe first-ever NFL draft was held. Jay Berwanger was the first pick, selected by the Philadelphia Eagles. However, he would never play in the NFL.\nBorn: Larry Verne, novelty song singer, in Minneapolis, Minnesota (d. 2013)\nDied: Charles Curtis, 76, 31st Vice President of the United States\n\n\n== February 9, 1936 (Sunday) ==\nEgypt reduced the age of conscription from 19 to 18 years of age.\nBorn: Stompin' Tom Connors, country and folk musician, in Saint John, New Brunswick, Canada (d. 2013); Clive Swift, actor and songwriter, in Liverpool, England (d. 2019)\nDied: Jacques Bainville, 57, French historian and journalist\n\n\n== February 10, 1936 (Monday) ==\nThe Battle of Amba Aradam began on the northern front in Ethiopia.\nThe U.S. Supreme Court decided Grosjean v. American Press Co..\nRicoh, Japan based office machine and digital camera brand, founded in Tokyo.\nRose McConnell Long, widow of Huey Long, was sworn in as a U.S. Senator to serve the remainder of her late husband's term.\n\n\n== February 11, 1936 (Tuesday) ==\nFrench police fought 200 pro-Italian students at the University of Paris calling for the dismissal of Gaston Jèze, who served as legal counsel to Ethiopia.\nDame Laura Knight became the first woman appointed to the Royal Academy.\nGreat Britain pulled off a major upset in the Olympic ice hockey semifinal with a 2–1 victory over Canada.\nBorn: Burt Reynolds, actor, in Lansing, Michigan (d. 2018)\n\n\n== February 12, 1936 (Wednesday) ==\nA severe cold wave swept across North America, breaking numerous records and crippling transportation services.\nA committee of experts reported to the League of Nations that an oil embargo against Italy would take three and a half months to become effective, and even that would only be if the United States agreed to curtail its booming oil business with Italy.\nA short-circuit started a fire in a Manhattan café that killed 5 people and injured 37. The incident would have been minor were it not for the panic causing a crowded dash down the stairways.\n\n\n== February 13, 1936 (Thursday) ==\nCharles Maurras published a column in Action Française calling for \"the knife\" to be used against politicians who supported sanctions against Italy. That same day, French politician Léon Blum was attacked and cut about the head by student followers of Maurras. That night, the French government banned the Action Française, Camelots du Roi and Royalist Students' Association under the law passed in December prohibiting extremist political leagues.\n\n\n== February 14, 1936 (Friday) ==\nAt least 5 were killed in Caracas, Venezuela during protests against a government decree establishing censorship of the press.\nKarl Schäfer of Austria won gold in men's figure skating at the Winter Olympics.\nBorn: Andrew Prine, actor, in Jennings, Florida\n\n\n== February 15, 1936 (Saturday) ==\nRabbis in Poland threatened to organize a strike of the meat industry if the government went through with its plan to abolish the kosher slaughter of animals.\nGreat Britain won gold in the Olympic ice hockey tournament by playing the United States to a scoreless tie to finish atop the standings.\nSonja Henie of Norway won gold in ladies' figure skating in the Winter Olympics.\nDied: Jack McGurn, 33, Italian-American mobster (assassinated)\n\n\n== February 16, 1936 (Sunday) ==\nLegislative elections were held in Spain. A left-wing coalition known as the Popular Front defeated its main opponent, the Spanish Confederation of Autonomous Right-wing Groups.\nThe Winter Olympics ended in Germany. Norway dominated the medal count with 7 gold medals and 15 medals in total.\n\n\n== February 17, 1936 (Monday) ==\nParaguayan President Eusebio Ayala was overthrown in a coup led by Rafael Franco.\nIn Geneva, the League of Nations moved to its new headquarters, the Palace of Nations.\nAfter several years of a trade war, the British and Irish government signed a pact reducing tariffs between the two countries.\nThe U.S. Supreme Court decided Ashwander v. Tennessee Valley Authority and Brown v. Mississippi.\nThe comic strip The Phantom made its first appearance. Although the Phantom character did not have any superpowers, he was the first to wear a skintight unitard-style costume, the hallmark of many comic book superheroes to come.\nBorn: Jim Brown, American football player and actor, in St. Simons, Georgia\nDied: Alexander Pantages, 68 or 69, Greek-born American impresario\n\n\n== February 18, 1936 (Tuesday) ==\nSwitzerland banned the NSDAP/AO.\nBorn: Dick Duff, ice hockey player, in Kirkland Lake, Ontario, Canada\n\n\n== February 19, 1936 (Wednesday) ==\nThe Battle of Amba Aradam ended in an Italian victory.\nThe Spanish Republic announced an amnesty for the rebels in the 1934 Asturian revolt.\nBorn: Sam Myers, blues musician, in Laurel, Mississippi (d. 2006)\nDied: Billy Mitchell, 56, U.S. Army general\n\n\n== February 20, 1936 (Thursday) ==\nPolice in Spain fired on crowds of leftists attempting to burn churches and convents. 8 deaths were reported around the country.\nThe science fiction film Things to Come, written by H. G. Wells, premiered in Britain.\nThe musical comedy film Follow the Fleet starring Fred Astaire and Ginger Rogers with music by Irving Berlin was released.\nBorn: Larry Hovis, singer and actor, in Wapato, Washington (d. 2003); Shigeo Nagashima, baseball player and manager, in Sakura, Chiba, Japan\nDied: Kip Rhinelander, 32, American socialite (lobar pneumonia)\n\n\n== February 21, 1936 (Friday) ==\nThe new Spanish government freed 34,000 political prisoners.\n\n\n== February 22, 1936 (Saturday) ==\nOn George Washington's 204th birthday, retired baseball legend Walter Johnson replicated a feat attributed to Washington by throwing a silver dollar across the Rappahannock River. Though it remained in dispute whether Washington ever did such a thing, Johnson did prove that it could be done.\nNazi Germany established quotas for Jewish doctors. The decree by Gerhard Wagner stated that the proportion of Jewish doctors in Germany could not exceed the proportion of Jews in the country's general population.\nBorn: Elizabeth MacRae, actress, in Columbia, North Carolina\n\n\n== February 23, 1936 (Sunday) ==\nPuerto Rico's Chief of Police E. Francis Riggs was shot and killed by two young Nationalists. The two assailants were captured and executed immediately without trial.\n\n\n== February 24, 1936 (Monday) ==\nAnthony Eden addressed the House of Commons for the first time as Foreign Secretary. He responded to criticism of the League of Nations failing to impose oil sanctions on Italy by explaining that oil was \"a sanction like any other and must be judged by the same criterion, whether its imposition will help stop the war.\"\nBorn: Lance Reventlow, entrepreneur and racing driver, in London, England (d. 1972)\nDied: Albert Ritchie, 59, American lawyer and politician\n\n\n== February 25, 1936 (Tuesday) ==\nArtists from Tin Pan Alley such as Rudy Vallée, George Gershwin and Irving Berlin came to Washington to fight a bill affecting the copyrighting of popular songs.\n\n\n== February 26, 1936 (Wednesday) ==\nThe attempted coup known as the February 26 Incident began in Japan.\nIn Saxony, Hitler opened the first Volkswagen production plant.\nDied: Takahashi Korekiyo, 81, 20th Prime Minister of Japan (assassinated); Saitō Makoto, 77, Japanese admiral and politician (assassinated); Antonio Scotti, 70, Italian baritone; Jōtarō Watanabe, 61, Japanese general (assassinated)\n\n\n== February 27, 1936 (Thursday) ==\nThe Second Battle of Tembien began on Ethiopia's northern front.\nThe French Chamber of Deputies ratified the Franco-Soviet Treaty of Mutual Assistance, 353 to 164.\nBorn: Roger Mahony, Archbishop of Los Angeles, in Hollywood, California\nDied: Ivan Pavlov, 86, Russian physiologist and Nobel laureate; Mulugeta Yeggazu, Ethiopian government official and military leader\n\n\n== February 28, 1936 (Friday) ==\nThe Interstate Commerce Commission ordered a reduction in basic rail passenger fares from 3.6 to 2 cents per mile everywhere in the United States.\nDied: Charles Nicolle, 69, French bacteriologist and Nobel laureate\n\n\n== February 29, 1936 (Saturday) ==\nThe Second Battle of Tembien ended in an Italian victory.\nThe Japanese coup attempt was put down.\nPresident Roosevelt extended the 1935 Neutrality Act through May 1, 1937.\nBorn: Henri Richard, ice hockey player, in Montreal, Quebec, Canada (d. 2020); Alex Rocco, actor, in Cambridge, Massachusetts (d. 2015)\nDied: Shirō Nonaka, 32, central conspirator in the February 26 Incident (suicide)\n\n\n== References ==", "links": ["1931", "1932", "1933", "1934", "1935", "1936", "1936 NFL draft", "1936 North American cold wave", "1936 Winter Olympics", "1936 Winter Olympics medal table", "1937", "1938", "1939", "1940", "Action Française", "Adolf Hitler", "Albert Ritchie", "Alex Rocco", "Alexander Pantages", "Andrew Prine", "Anglo-Irish Trade War", "Anthony Eden", "Antonio Scotti", "April 1931", "April 1932", "April 1933", "April 1934", "April 1935", "April 1936", "April 1937", "April 1938", "April 1939", "April 1940", "Ashwander v. Tennessee Valley Authority", "Asturian miners' strike of 1934", "August 1931", "August 1932", "August 1933", "August 1934", "August 1935", "August 1936", "August 1937", "August 1938", "August 1939", "August 1940", "Battle of Amba Aradam", "Benito Mussolini", "Billy Mitchell", "Boston", "Brand", "Brooklyn Daily Eagle", "Brown v. Mississippi", "Burt Reynolds", "California", "Cambridge, Massachusetts", "Camelots du Roi", "Canada men's national ice hockey team", "Caracas", "Chamber of Deputies (France)", "Charles Curtis", "Charles E. Cox", "Charles Maurras", "Charles Nicolle", "Charlie Chaplin", "Chicago", "Chicago Daily Tribune", "Clive Swift", "Cobalt, Ontario", "Columbia, North Carolina", "David Brenner", "David Frankfurter", "December 1931", "December 1932", "December 1933", "December 1934", "December 1935", "December 1936", "December 1937", "December 1938", "December 1939", "December 1940", "Dick Duff", "Digital camera", "Egypt", "Elizabeth MacRae", "Eusebio Ayala", "February 1", "February 10", "February 11", "February 12", "February 13", "February 14", "February 15", "February 16", "February 17", "February 18", "February 19", "February 1931", "February 1932", "February 1933", "February 1934", "February 1935", "February 1936", "February 1937", "February 1938", "February 1939", "February 1940", "February 2", "February 20", "February 21", "February 22", "February 23", "February 24", "February 25", "February 26", "February 26 Incident", "February 27", "February 28", "February 29", "February 3", "February 4", "February 5", "February 6", "February 7", "February 8", "February 9", "Figure skating at the 1936 Winter Olympics – Ladies' singles", "Figure skating at the 1936 Winter Olympics – Men's singles", "Follow the Fleet", "Franco-Soviet Treaty of Mutual Assistance", "Fred Astaire", "Fuji-Hakone-Izu National Park", "Garmisch-Partenkirchen", "Gary Conway", "Gaston Jèze", "Geneva", "George Bernard Shaw", "George Gershwin", "George Washington", "Georgios Kondylis", "Gerhard Wagner (physician)", "Ginger Rogers", "Great Britain men's national ice hockey team", "Grosjean v. American Press Co.", "H. G. Wells", "Henri Richard", "Hollywood, Los Angeles", "Huey Long", "ISBN (identifier)", "Ice hockey at the 1936 Winter Olympics", "Il Popolo d'Italia", "Illinois", "Indian National Congress", "Interstate Commerce Commission", "Irving Berlin", "Ivan Pavlov", "Jack McGurn", "Jacques Bainville", "January 1931", "January 1932", "January 1933", "January 1934", "January 1935", "January 1936", "January 1937", "January 1938", "January 1939", "January 1940", "Japan", "Japanese Baseball League", "Jawaharlal Nehru", "Jay Berwanger", "Jennings, Florida", "Jim Brown", "Jim Marshall (photographer)", "John Maynard Keynes", "July 1931", "July 1932", "July 1933", "July 1934", "July 1935", "July 1936", "July 1937", "July 1938", "July 1939", "July 1940", "June 1931", "June 1932", "June 1933", "June 1934", "June 1935", "June 1936", "June 1937", "June 1938", "June 1939", "June 1940", "Jōtarō Watanabe", "Karl Schäfer (figure skater)", "Kent Douglas", "Kip Rhinelander", "Kirkland Lake", "Kosher foods", "Lance Reventlow", "Lansing, Michigan", "Larry Hovis", "Larry Verne", "Laura Knight", "Laurel, Mississippi", "League of Nations", "Liverpool", "Léon Blum", "Manchukuo", "March 1931", "March 1932", "March 1933", "March 1934", "March 1935", "March 1936", "March 1937", "March 1938", "March 1939", "March 1940", "Massachusetts", "Maxwell Anderson", "May 1931", "May 1932", "May 1933", "May 1934", "May 1935", "May 1936", "May 1937", "May 1938", "May 1939", "May 1940", "Minneapolis", "Minnesota", "Modern Times (film)", "Montreal", "Mulugeta Yeggazu", "NSDAP/AO", "Nazi salute", "Neutrality Acts of 1930s", "November 1931", "November 1932", "November 1933", "November 1934", "November 1935", "November 1936", "November 1937", "November 1938", "November 1939", "November 1940", "October 1931", "October 1932", "October 1933", "October 1934", "October 1935", "October 1936", "October 1937", "October 1938", "October 1939", "October 1940", "Olympic symbols", "Ontario", "Palace of Nations, Geneva", "Pennsylvania", "Philadelphia", "Philadelphia Eagles", "Popular Front (Spain)", "President of Paraguay", "Princess Sophie of Schönburg-Waldenburg", "Puerto Rican Nationalist Party", "Puerto Rico", "Rafael Franco", "Rappahannock River", "Redbrick (newspaper)", "Ricoh", "Rikers Island", "Roger Mahony", "Roosevelt Island", "Rose McConnell Long", "Royal Academy", "Rudy Vallée", "Saint John, New Brunswick", "Saitō Makoto", "Sakura, Chiba", "Sam Myers", "Saxony", "Second Battle of Tembien", "September 1931", "September 1932", "September 1933", "September 1934", "September 1935", "September 1936", "September 1937", "September 1938", "September 1939", "September 1940", "Shigeo Nagashima", "Shirō Nonaka", "Shubert Theatre (New York City)", "Sonja Henie", "Spanish Confederation of Autonomous Right-wing Groups", "Spanish general election, 1936", "St. Simons, Georgia", "Stompin' Tom Connors", "Superhero", "Takahashi Korekiyo", "Tariff", "Teatro Regio (Turin)", "The Advertiser (Adelaide)", "The Argus (Melbourne)", "The General Theory of Employment, Interest and Money", "The Globe and Mail", "The Masque of Kings (play)", "The Millionairess (play)", "The Phantom", "Things to Come", "Tin Pan Alley", "Tokyo", "Turin", "Unitard", "United States Supreme Court", "United States men's national ice hockey team", "University of Birmingham", "University of Paris", "Venezuela", "Volkswagen", "Walter Johnson", "Wapato, Washington", "Wilhelm Gustloff", "William, Prince of Albania", "William E. Borah"]}