{"url": "https://en.wikipedia.org/wiki/Federal_Ministry_of_Health_(Germany)", "title": "Federal Ministry of Health (Germany)", "summary": "The Federal Ministry of Health (German: Bundesministerium für Gesundheit), abbreviated BMG, is a cabinet-level ministry of the Federal Republic of Germany. It is the highest German federal government department responsible for health. The ministry is officially located in Bonn and with a second office, which houses the ministry's management, location in Berlin.", "content": "The Federal Ministry of Health (German: Bundesministerium für Gesundheit), abbreviated BMG, is a cabinet-level ministry of the Federal Republic of Germany. It is the highest German federal government department responsible for health. The ministry is officially located in Bonn and with a second office, which houses the ministry's management, location in Berlin.\n\n\n== History ==\nThe Federal Ministry of Health was founded in 1961; in 1969 it was merged with the Federal Ministry for Family and Youth to create the new Federal Ministry for Youth, Family and Health.\nIn 1991, the Federal Ministry of Health was restored. In 2002, it was expanded to include social affairs and renamed \"Federal Ministry of Health and Social Security\" (Bundesministerium für Gesundheit und Soziale Sicherung). It was headed by the Federal Minister for Health and Social Security. Its portfolio included one part of the former Federal Ministry of Labour and the Social Order. The other part of the latter was added to the portfolio of the newly created Federal Ministry for Economics and Labour. Under the grand coalition headed by Angela Merkel in 2005, the portfolio reshuffle was reversed and responsibility for social affairs was moved back to the Federal Ministry of Labour and Social affairs (Bundesministerium für Arbeit und Soziales).\n\n\n== Ministers ==\nPolitical Party:\n  CDU\n  CSU\n  SPD\n  Green\n  FDP\n\n\n== Responsibilities of the Federal Ministry of Health ==\n\nThe Federal Ministry of Health is responsible for:\n\nmaintaining the effectiveness and efficiency of the statutory health insurance and long-term care insurance systems\nmaintaining and enhancing the quality of the health care system\nstrengthening the interests of patients\nmaintaining economic viability and stabilization of contribution levels\npreventive and prophylactic healthcare\nthe Protection against Infection Act (Infektionsschutzgesetz, or IfSG)\nestablishing guidelines for the manufacture, clinical trial, approval, distribution channels and monitoring of medicines and medical devices. The objectives are:\nquality, medical efficacy and safety\nsafety of biological medical products such as blood products\nnarcotics and addiction risk prevention\nprevention, rehabilitation and disability policy\nmedical and occupational rehabilitation\ndisability law\nproviding assistance to the disabled and promoting their interests\nEuropean and international health policy, including the work of the Federal Government Narcotics Officer and the patients' ombudsman.\n\n\n== Supervisory role ==\nThe Federal Ministry of Health is responsible for the comprehensive (disciplinary) supervision of the following governmental institutions:\n\nFederal Institute for Drugs and Medical Devices (German: Bundesinstitut für Arzneimittel und Medizinprodukte, abbreviated BfArM) in Bonn\nFederal Centre for Health Education (German: Bundeszentrale für gesundheitliche Aufklärung, abbreviated BZgA) in Cologne\nGerman Institute of Medical Documentation and Information (German: Deutsches Institut für medizinische Dokumentation und Information, abbreviated DIMDI) in Cologne\nPaul-Ehrlich-Institut (PEI), the Federal Institute for Vaccines and Biomedicines in Langen, Hesse\nRobert Koch Institute (RKI) in BerlinThe Federal Ministry of Health is also responsible for the non-disciplinary supervision of\n\nthe German Federal (Social) Insurance Authority (Bundesversicherungsamt).and the legal supervision of the umbrella organizations of the statutory health insurance schemes.\n\n\n== See also ==\nEuropean Commission's Directorate General for Health and Consumer Protection (SANCO)\nFederal Ministry of Health and Social Affairs (2002-2005)\n\n\n== References ==\n\n\n== External links ==\nFederal Ministry of Health official web site (in German)\nFederal Ministry of Health official web site (in English)\nEuropean Observatory on Health Systems and Policies > Country information Germany", "links": ["Alliance 90/The Greens", "Andrea Fischer", "Angela Merkel", "Anke Fuchs", "Antje Draheim", "Antje Huber", "Berlin", "Biomedicines", "Bonn", "Cabinet Brandt I", "Cabinet Brandt II", "Cabinet Kiesinger", "Cabinet Kohl I", "Cabinet Kohl II", "Cabinet Kohl III", "Cabinet Kohl IV", "Cabinet Kohl V", "Cabinet Merkel I", "Cabinet Merkel II", "Cabinet Schmidt I", "Cabinet Schröder I", "Cabinet of Germany", "Chancellor of Germany", "Christian Democratic Union (Germany)", "Christian Social Union of Bavaria", "Cologne", "Daniel Bahr", "Edgar Franke", "Elisabeth Schwarzhaupt", "European Commission", "Federal Centre for Health Education (Germany)", "Federal Foreign Office", "Federal Institute for Drugs and Medical Devices (Germany)", "Federal Minister for Health and Social Security (Germany)", "Federal Ministry for Digital and Transport", "Federal Ministry for Economic Affairs and Climate Action", "Federal Ministry for Economic Cooperation and Development", "Federal Ministry for Economics and Labour (Germany)", "Federal Ministry for Housing, Urban Development and Building", "Federal Ministry for the Environment, Nature Conservation, Nuclear Safety and Consumer Protection", "Federal Ministry of Defence (Germany)", "Federal Ministry of Education and Research (Germany)", "Federal Ministry of Family Affairs, Senior Citizens, Women and Youth", "Federal Ministry of Finance (Germany)", "Federal Ministry of Food and Agriculture (Germany)", "Federal Ministry of Health and Social Affairs (Germany)", "Federal Ministry of Justice (Germany)", "Federal Ministry of Labour and Social Affairs", "Federal Ministry of Labour and Social Affairs (Germany)", "Federal Ministry of the Interior and Community", "Federal Republic of Germany", "Fourth Merkel cabinet", "Free Democratic Party (Germany)", "Friedrichstraße", "Gerda Hasselfeldt", "Gerhard Schröder", "German Cabinet", "German Federal (Social) Insurance Authority", "German Institute of Medical Documentation and Information", "German language", "Government of Germany", "Grand coalition", "Health", "Health in Germany", "Heiner Geißler", "Helmut Kohl", "Helmut Schmidt", "Hermann Gröhe", "Horst Seehofer", "ISNI (identifier)", "Jens Spahn", "Karl Lauterbach", "Katharina Focke", "Konrad Adenauer", "Kurt Georg Kiesinger", "Käte Strobel", "Langen, Hesse", "Ludwig Erhard", "Olaf Scholz", "Paul-Ehrlich-Institut (Germany)", "Philipp Rösler", "Rita Süssmuth", "Robert Koch Institute", "Sabine Dittmar", "Scholz cabinet", "Second Schröder cabinet", "Social Democratic Party of Germany", "Third Merkel cabinet", "Thomas Steffen", "Ulla Schmidt", "Ursula Lehr", "VIAF (identifier)", "Vaccines", "Willy Brandt", "€"]}