{"url": "https://en.wikipedia.org/wiki/Ferris_de_Joux", "title": "Ferris de Joux", "summary": "Ferris de Joux (1935–2009) was a designer, engineer and constructor of sports cars. He was born on 24 August 1935. de Joux was said to have been one of New Zealand's most talented automotive designers. He appeared regularly in motoring magazines such as Motorman and Sports Car World from the 1970s.", "content": "Ferris de Joux (1935–2009) was a designer, engineer and constructor of sports cars. He was born on 24 August 1935. de Joux was said to have been one of New Zealand's most talented automotive designers. He appeared regularly in motoring magazines such as Motorman and Sports Car World from the 1970s.\n\n\n== Early cars ==\nDe Joux's first car was a 1936 Austin Seven Ruby. He removed the body, designed and built a fibreglass body for it. Possibly New Zealand's first. Internationally de Joux is perhaps best known as the designer and manufacturer of a series of fibreglass bodies for Buckler sports cars. One of the first Buckler's to his design was Ivy Stephenson's.\nFrom there he created a Holden Special followed by a Ferrari Special. Jack Brabham commented that the Ferrari was the best non factory built car he had seen and offered him a job. De Joux declined.\nDe Joux bought the Ferrari 375 that José Froilán González drove and won the 1951 British Grand Prix at Silverstone from New Zealand racing driver Ron Roycroft. He converted it into a Gran Turismo that looked like a genuine factory built Ferrari road car. It was an exquisitely proportioned car used by de Joux daily for the next four and a half years until he sold it. The car was restored back to a single seater by a Christchurch classic car enthusiast and is now owned by Bernie Ecclestone.\nIn 1962 de Joux and Auckland mechanic Kevin Lamb made two de Joux Gran Turismo cars. The GT's look like a cross between a Maserati A6G and an AC Bristol Zagato with 1950's and 1960s styling. Also around this time De Joux has designed the Orchid, a 1960s period racer, molded by The Australasian Motor Works. Keith Yeats of Panmure gained several 1st and 2nd places during the period of 1962-1966 in New Zealand with it. The Orchid is powered by a 1500ccm MK1 Precrossflow and now located in Europe. Among several sports racers de Joux built was a Ferrari-Jaguar combination – called the Ferraguar.\n\n\n== Mini GT ==\n\nIn New Zealand de Joux is best known for his Mini derivative, the de Joux Mini GT. In 1965 he began the design of his GT, a car he described as \"a Mini in a Bermuda jacket\". Due to other projects the prototype was not finished until 1971. The Mini GT was a fibreglass sports GT body bonded onto a Mini floorpan that had had extra box-sectioning added on top of both sills and across the back where the rear seat had previously been on the standard Mini. Whilst the standard Mini bulkhead was retained it was also braced to a new bulkhead off of which the doors were hung. This arrangement proved to be very stiff and did not require any stiffness to be added by the body. De Joux personally made the first six cars along with his team; after this his interest was on other things and he subsequently only sold bodies with plans for the chassis. The car was about nine inches lower than the standard Mini, two inches wider, and, thanks to the extended front radiator, three inches longer. Frontal area was reduced by 22%, giving better top end performance. Engines of course could be any A-series. The prototype was fitted with a 997cc Cooper engine, but the potential for a full-race spec 1380cc was enormous. The bonnet was fitted with a power bulge, which provided enough space for fitting twin carburettors. The original door windows were Perspex pull-up arrangement. The door locks from a Mini were mounted on an angle which caused some problems as the Mini locks were mounted vertical.\nLess than 30 bodies were made in total including a few illegitimate copies moulded from an existing car – these can normally be identified by not having the proper de Joux GT dashboard. Issues with customers not building their cars properly were among the reasons that Ferris eventually decided to move away from the GT completely. Many owners took shortcuts when having their chassis made – not understanding that they had been very carefully designed. Twenty-two of the original cars remained on the de Joux register in 2006, one of which was in Australia.Only a few Mini GTs are still on the road, including the original prototype, extensively restored by de Joux in the early 90s and subsequently sold to Japan. John Rush from New Zealand races his car, having had it from new. De Joux was 90% through finishing a new GT for his personal use when he died. That car is now in the possession of his long-time friend and driver Peter Benbrook who intends finishing and racing it to honour his friend.\n\n\n== Later cars ==\nIn 1985 de Joux bought the remains of a 1964 Formula One BRP chassis and damaged V8 BRM engine, and over the phone to England, a BRM transaxle. He obtained the missing parts on a journey to England. On completing the BRP he sold it to English collector Anthony Mayman.\nIn 1999 de Joux made a one-off Maserati Special. Auckland Ferrari enthusiast Allan Cattle had a 3.5-litre, six-cylinder Maserati engine sitting under a bench in his workshop, after he found it in England beneath another car restorer's workshop bench and brought it home. Ferris saw the engine and decided to build a car in the style of a 1937-39 Maserati. The car was pieced together with assorted spare parts over a three years period and completed in 2002.An intervening project involved an enthusiastic retired Whangarei farmer named Hamilton Walker who in 1969 appeared to be on the verge of producing an ambitious fibre-glass bodied twin-rotor two-door four-seater sedan. Because the car would contain 90% local content, it was argued that the car could be retailed in the (tariff protected) New Zealand market for approximately £750 less than a BMC Mini imported fully assembled from England. De Joux was the designer of the car's body, working in collaboration with project engineer Dennis Smith. The project never made it to the production stage.\nDuring his later years de Joux made fibreglass kayaks and raced a Brabham powered by a SCAT 2.0l engine. He died on 30 May 2009 aged 73.\n\n\n== References ==\n\n\n== External links ==\nDe Joux pictures", "links": ["1951 British Grand Prix", "Auckland", "Austin 7", "Bernie Ecclestone", "Brabham", "British Racing Motors", "British Racing Partnership", "Buckler Cars", "Ferrari", "Ferrari 375", "Hamilton Walker (New Zealand)", "Holden", "ISBN (identifier)", "Jack Brabham", "José Froilán González", "Mini", "Ron Roycroft", "Silverstone Circuit", "Wankel engine", "Whangarei"]}