{"url": "https://en.wikipedia.org/wiki/Fianna_%C3%89ireann", "title": "Fianna Éireann", "summary": "Na Fianna Éireann (The Fianna of Ireland), known as the Fianna, is an Irish nationalist youth organisation founded by Bulmer Hobson and Constance Markievicz in 1909. Fianna members were involved in the setting up of the armed nationalist body the Irish Volunteers, and had their own circle of the Irish Republican Brotherhood (IRB). They took part in the 1914 Howth gun-running and (as Volunteer members) in the 1916 Easter Rising. They were active in the War of Independence and took the anti-Treaty side in the Civil War.\nThe Fianna were declared an illegal organisation by the government of the Irish Free State in 1931. This was reversed when Fianna Fáil came to power in 1932, but re-introduced in 1938. During the splits in the Republican movement of the later part of the 20th century, the Fianna and Cumann na mBan supported Provisional Sinn Féin in 1969 and Republican Sinn Féin in 1986. The Fianna have been a proscribed organisation in Northern Ireland since 1920.", "content": "Na Fianna Éireann (The Fianna of Ireland), known as the Fianna, is an Irish nationalist youth organisation founded by Bulmer Hobson and Constance Markievicz in 1909. Fianna members were involved in the setting up of the armed nationalist body the Irish Volunteers, and had their own circle of the Irish Republican Brotherhood (IRB). They took part in the 1914 Howth gun-running and (as Volunteer members) in the 1916 Easter Rising. They were active in the War of Independence and took the anti-Treaty side in the Civil War.\nThe Fianna were declared an illegal organisation by the government of the Irish Free State in 1931. This was reversed when Fianna Fáil came to power in 1932, but re-introduced in 1938. During the splits in the Republican movement of the later part of the 20th century, the Fianna and Cumann na mBan supported Provisional Sinn Féin in 1969 and Republican Sinn Féin in 1986. The Fianna have been a proscribed organisation in Northern Ireland since 1920.\n\n\n== Origins ==\nAn earlier \"Fianna\" was organised \"to serve as a Junior Hurling League to promote the study of the Irish Language\" on 26 June 1902 at the Catholic Boys’ Hall, Falls Road, in West Belfast, the brainchild of Bulmer Hobson. Hobson, a Quaker influenced by suffragism and nationalism, joined the Irish Republican Brotherhood in 1904 and was an early member of Sinn Féin during its monarchist-nationalist period, alongside Arthur Griffith and Constance Markievicz. Hobson later relocated to Dublin and the Fianna organisation collapsed in Belfast.\nMarkievicz, inspired by the rapid growth of Baden-Powell's Boy Scouts, formed sometime before July 1909 the Red Branch Knights, a Dublin branch of Irish National Boy Scouts. After discussions involving Hobson, Markievicz, suffragist and labour activist Helena Molony and Seán McGarry, the Irish National Boy Scouts changed their name to Na Fianna Éireann at a meeting in 34 Lower Camden Street, Dublin, on 16 August 1909 (the building today marked with a commemorative plaque), at which Hobson was elected as president (thus ensuring a strong IRB influence), Markievicz as vice-president and Pádraig Ó Riain as secretary. Seán Heuston was the leader of the Fianna on Dublin's north side, while Cornelius \"Con\" Colbert was the leader on the south side.\n\n\n== Early years ==\n\nAs with all Scouting organisations, an instructional handbook was a necessity. The job of producing this Fianna handbook fell to Pádraig Ó Riain. With articles from Patrick Pearse and Roger Casement, and advertisements from suppliers of uniforms and equipment, the first Fianna handbook appeared in 1913. It came at a time when the Irish Volunteers was being established and the book was widely used by this group also. Countess Markievicz bought a large rambling house at Ranelagh, Surrey House. It became the unofficial headquarters of the Fianna for some time. The older boys would gather and train here, and a mini firing range was set up in the basement. The boys also had a radio set in operation and this led to a raid from the DMP. A proper HQ was later set up in D'Olier Street.Members who reached seventeen years of age were recruited into the Irish Republican Brotherhood (IRB), and in 1912 Hobson started an IRB circle within the Fianna, named the John Mitchel Literary and Debating Society, whose members included Colbert, Ó Riain, Heuston, Garry Holohan, Desmond Ryan, Liam Mellows and Barney Mellows.\n\n\n== Irish Volunteers ==\n\nThe Fianna played an active part during the 1913 Dublin Lock-out. A Fianna, Patsy O'Connor, died after being struck on the head by a Dublin Metropolitan Police baton while giving first aid to an injured man.As the Fianna had been organised four years earlier than the Irish Volunteers, and as many of its members were now young adults, fully trained in many aspects of military discipline, many young members transferred over to the Volunteers in November 1913. The original committee which set up the new volunteer movement had three Fianna members on it. Con Colbert, Michael Lonergan, Éamon Martin and Padraig Ó'Riain were prominent in training Irish Volunteers. Seamus Pounch was instrumental in the training of the newly formed Cumann na mBan women's organisation in 1914.\n\n\n=== 1914 gun running ===\n\nThe Fianna played a part in gun-running in Kilcoole and Howth, under Hobson's direction. Fianna members brought their treck-cart to Howth Pier to meet the Asgard. The treck-cart was full of home-made batons, and these were distributed to the Volunteers on the pier. The cart was then used to carry the surplus rifles back to the city. At Clontarf, the DMP and British military were awaiting the return of the volunteers and a confrontation ensued.Fianna officers made a decision and detoured with their gun-laden cart up the Howth Road, arriving eventually at Kilmore Road, Artane, where the arms were stored for future recovery. Hobson reluctantly allowed John Redmond to gain influence over the Volunteers, leading to a split at the outbreak of World War I. This and his subsequent opposition to the Easter Rising (he was kept under armed guard that Easter Monday by Seán Mac Diarmada until the rising was well underway) led to Hobson's being sidelined by the republican movement and removed from any leadership role for the rest of his life.\n\n\n=== Easter Rising (1916) ===\n\nThe Fianna was represented at all the garrisons that were involved in the fighting of the 1916 Easter Rising. Even though they were then more heavily involved with the Irish Volunteers, Seán Heuston and Con Colbert were still regarded as Fianna members. Heuston was given the task of commanding the Mendicity Institution, while Colbert was under the command of Éamonn Ceannt at Watkins Brewery. Heuston and Colbert both were executed for their part in the Rising. In Galway, Liam Mellows was in command of activities, but escaped capture and got safely to the United States. (Mellows later returned to Ireland and was executed during the Irish Civil War.)\nMarkievicz and Molony both actively fought as members of the Irish Citizen Army (the Irish Volunteers was an exclusively male force); Markievicz, operating under Michael Mallin at the College of Surgeons, was sentenced to death but eventually reprieved due to her gender. After the provisional government abandoned the GPO, and set up HQ at Moore Street, James Connolly gave command of the GPO to Seán McLoughlin, a Fianna officer. His orders were to oversee the safe retreat of the rest of the occupants.Among the first shots fired during the Rising were by Fianna members who attacked and captured the Magazine Fort in the Phoenix Park. A son of the Magazine Fort's commander was shot dead by an IRA volunteer, Garry Holohan, as he [the son] ran to raise the alarm at Islandbridge.Several of the Fianna were killed during the Rising. Seán Healy was shot dead at Phibsboro while delivering despatches. Seán Howard and Seán Ryan died in similar fashion. Volunteers under the command of Fianna officer Paddy Holahan captured and burned down the Linenhall Barracks. Eamon Martin, a future Chief of Staff, was seriously wounded at the Broadstone Railway Station. At least fifteen Fianna officers from the Dublin Brigade were later interned at Frongoch internment camp, North Wales after the Rising was put down. Seán Heuston and Con Colbert were executed for their role in the Rising.\n\n\n== Post 1916 reorganisation ==\nThe Fianna was first to re-organise after the Easter Rising of 1916. A provisional governing committee was set up in Dublin in May 1916, including Eamon Martin, Seamus Pounch, Theo Fitzgerald, Liam Staines, and Joe Reynolds. All had evaded the round-up after the Rising. This committee functioned until January 1917, when it handed over command to the newly released senior officers. In February 1917, a section of the Fianna marched in full uniform to mass at Blanchardstown, County Dublin for Michael Mallin, who had been executed following the Easter Rising. Garry Holohan reported that \"As the police did not interfere, we got courage and got bolder and bolder. On one route march, the police at James Street stopped us and an Inspector of the DMP grabbed me. However, as the Fianna Scouts became so threatening, I was released.\"\nOne year after the Rising, a large demonstration was held outside the burnt-out shell of Liberty Hall. A large contingent of Dublin Metropolitan Police (DMP), including an Inspector John Mills, arrived and the Riot Act was read to the crowd. The police waded into the crowd with batons to arrest those addressing the crowd, including Cathal Brugha and George Noble (Count) Plunkett. While escorting the prisoners, Inspector Mills was struck a mortal blow to the head with a hurling stick. Later Fianna witness statements indicated that the blow was struck by Eamon Murray, a young Fianna officer, who was O/C of a Sluagh (branch) on Parnell Square. He made off from the scene along Abbey Street, pursued by a DMP man. He was cornered at Marlborough Street, but he or another Fianna member drew a pistol and the policeman backed off. The youth who struck the blow was secreted away to the United States, where he remained until the Truce of 1921, and later fought with the anti-Treaty IRA during the Civil War.An intensive recruiting campaign had been set in motion throughout the city and county after the earlier reorganisation of January 1917, and it proved to be a tremendous success. Recruits came in large numbers and new companies were formed. In June, the Dublin Battalion had become so large and unwieldy, that it was decided to set up a Brigade structure of two battalions. The county was simply split in two, with the Liffey as the divide. South of the Liffey became the 1st Battalion and north of the Liffey became the 2nd Battalion. The Dublin Brigade Staff in June 1917 comprised Garry Holohan (Commandant), P.J. Stephenson (Adjutant) and Joe Reynolds (QM).The Fianna continued to defy the British ban on marching and parading, and drilled openly with hurleys in open defiance. This inevitably led to clashes with the DMP and the RIC in outlying areas. The most notable clash occurred in July 1917, when the whole Dublin Battalion went on a route march through the South City and County. Efforts were made by the DMP to stop the march and break it up at Terenure and Rathmines DMP stations, but the paraders broke through the cordons at both points. The march continued to the GPO, where the parade was dismissed. Seán Saunders recalled being arrested at Milltown with Roddy Connolly (son of James Connolly), Hugo MacNeill, Theo Fitzgerald, Seán McLoughlin and Garry Holohan.\n\n\n=== Army Agreement ===\nIt came to the attention of GHQ Staff c1918 that in many areas around the country the Fianna was being controlled by the local units of the Irish Volunteers. A meeting of Fianna GHQ representatives and Volunteer representatives was held in Dublin to discuss the problem. What emerged from this meeting was known as the Army Agreement. From that point on, the Volunteers would not seek to control Fianna in their areas. Those who reached the age of seventeen had transferred to the Volunteers ranks; this would now cease and any transfer would be voluntary. The volunteer O/C was to liaise with the Fianna O/C on all local matters, and due consideration was to be extended to Fianna.\n\n\n== War of Independence ==\n\nDuring the \"Tan War\", Fianna members featured prominently in every brigade area. Some lost their lives or were imprisoned. In the picture taken of the West Mayo Brigade Active Service Unit in 1921, ten of the thirty in the photograph had been members of the Westport Fianna Sluagh, as had Tom Derrig, who rose to the rank of Adjutant General during the Civil War.During the Truce, the Fianna devoted a great amount of time to training. At least three full-time training camps were set up to train potential officers. Each prospective officer had to attend the camp for one weeks training. One of these camps was held at Kilmore Road, Artane and another at Kilmashogue Mountain. At the 1921 Ard Fheis held in Dublin some interesting figures were given about the strength of the organisation:- Munster had 84 Fianna sluaithe (branches), Ulster 20, Connaught 10 and Leinster 41. Kerry had 37 Sluaithe, Cork 24, and Dublin 16. The Fianna held discussions all over the country where they debated the terms of the Anglo-Irish Treaty. At an Ard Fheis, Fianna rejected the Treaty and called for all to still work for a Republic. In support of this, the Dublin Brigade's Fianna marched to The Smithfield where they were reviewed by senior Republican leaders.\n\n\n== Civil War ==\n\nFianna Éireann played a major part in the civil war fighting, especially in Dublin. When the Four Courts Garrison was attacked in July 1922, a second front was created to relieve the Four Courts. The Dublin Brigade of the Fianna provided many leaders in this period. All along the eastern side of O'Connell Street buildings were taken over and barricaded. Parnell Square and Parnell Street were similarly barricaded. Fianna, under their new Brigadier, Seán Harling, took over 35 North Great Georges Street as a barracks.\nIn August 1922 (the same month that saw the deaths of Michael Collins and Arthur Griffith), the Fianna sustained a heavy blow when two of their senior officers in Dublin, Seán Cole and Alf Colley, were shot dead by Free State Army Intelligence members at The Thatch, Whitehall. 400 officers and boys of the Fianna had taken part in the Dublin fighting of 1922. By October of that year, the only active members were in an ASU of eight members led by Frank Sherwin.The bullet-riddled corpses of three teenaged Fianna Scouts, Edwin Hughes (17), Joseph Rogers (16) and Brendan Holohan (16), were found at The Quarries, Naas Road, Clondalkin, on 28 November 1922. They were all from the Drumcondra area and had been putting up republican posters in the Clonliffe Road district. They were arrested by high-ranking Free State officer, Charlie Dalton (younger brother of Emmet Dalton). The Scouts were brought for interrogation to Wellington Barracks, where Free State Army Intelligence had their HQ. That was the last time that they were seen alive.When the Free State started to execute Republican prisoners, the first to be shot were four young men who had left the Fianna to join the Irish Republican Army. The executions of Rory O'Connor, Joe McKelvey, Liam Mellows and Dick Barrett became a symbol for the Fianna. They became known as \"The Four Martyrs\". A prominent ex-Fianna officer, Aodh MacNeill (son of Eoin MacNeill), officiated at the executions. Eamon Martin related that he was a cellmate of Mellows in Mountjoy Prison. Until 1964, an annual concert was held by the Fianna to commemorate their executions. They were followed by another group of three, who had similarly graduated from the ranks of the Dublin Brigade of the Fianna.The Fianna ceased to function as an open organisation by Christmas. All senior Fianna members were being rounded up by the Free State military and CID, and at the internment camp, Tintown 3, at the Curragh there was one hut dedicated to Fianna members, some as young as fourteen years.\n\n\n== 1925 Ard Fhéis ==\nFianna Chief: Countess Markievicz\nAdjutant General: Barney Mellows\nA/Adjutant General: Alfie White\nDirector of Organisation: Liam Langley\nA/Director of Organisation: Frank Sherwin\nQMG: Joe Reynolds\nA/QMG: Sean HarlingSean Harling had been an outstanding Fianna officer for years. After internment he got married and eventually fell on hard times. In his own words, he was compromised by the Free State Special Branch and agreed to become an agent for them within the republican movement. He was eventually exposed by the Fianna Intelligence Officer, Frank Sherwin in 1926. Two former Fianna members made an attempt on his life in 1928, but Harling escaped and actually shot dead one of his attackers, Tim Coghlan of Inchicore. Harling was secreted out of the country by the Special Branch and ended up in the US until his return in 1933 to Ireland.\n\n\n== Fianna proscribed ==\nFianna Éireann survived the Civil war period intact, they had sided with the Republic. The organisation was decimated then, and further disintegration occurred in 1926 when Fianna Fáil was founded. Markievicz was a founding member of that party but she died in 1927. In 1930 Fianna got the use of the Hardwicke Hall in Dublin as a headquarters as George Plunkett was nominated by the IRA as Chief Scout. This was a nominal position and the organisation was run by the HQ staff. At this time, Fianna expanded in proportion to the rest of the Republican Movement. In 1933 Frank Ryan became Adjutant General for a period of eight months. The 1934 HQ report said that there were 104 sluaithe in operation. 800 paraded under the Fianna flag at Bodenstown that year, and Diarmuid MacGiolla Phadraig became Adjutant General.\nThe Free State government brought in new legislation in 1931 to counter the popularity of resurgent republicanism. Now the Fianna, the IRA and Cumann na mBan were all classified as illegal organisations. Many arrests followed and these organisations had to once again go underground. However, when the Fianna Fáil government was elected to power in March 1932, this legislation was revoked, most of the prisoners were freed and many young republicans switched allegiance to Fianna Fáil. In 1934, the Fianna Fáil government expanded the Free State CID, the new ranks were filled largely by enticing members of the IRA's Dublin Brigade to join the Special Branch of the Garda Síochána. Former volunteers were sworn in as Gardaí detective officers and issued handguns, ammunition, badges and whistles. They were under the control of Ned Broy of the CID and became known as the \"Broy Harriers\". The term \"Broy Harrier\" was first used in the Seanad by Senator O'Rourke during the discussion on the Garda Síochána estimates on 13 August 1933.The 1936 Fianna Convention reported that there were 18 sluaithe in the organisation. The IRA, Cumann na mBan and the Fianna were once again outlawed in June of that year. In 1938 an advisory body of prominent republicans was set up to help re-organize the fledgling organization; included were George Plunkett, Brian O'Higgins, Mary MacSwiney and Madge Daly. The following year, Joe Atkinson of Belfast was appointed as a national organiser and travelled about the country on a bicycle, contacting failed Fianna sluaithe and creating new ones. Later that year he was appointed Adjutant General and Liam Nolan of Kerry became National Organiser. George Plunkett resigned as Chief Scout for health reasons. In 1940, 150 Fianna marched in Dublin on the eve of the executions of two republicans responsible for a fatal bombing in Coventry, Barnes and McCormack in Britain. Fianna in Dublin were under the control of Jack Rowan, Kevin Hudson and Mattie O'Neill. Four sluaithe were reported active in Dublin and although the use of Hardwicke Hall was lost, newly released internees helped in the re-organization, including Wattie Bell, Noel and Des Goulding, Paddy Dillon and Mattie Carey.\nBy 1943, owing to arrests, internment and emigration, Fianna in Dublin was reduced to one sluagh, run by Peadar Timmins. Dick Bell was released from internment in 1945 and led Fianna in Dublin, with Con Dillon as his adjutant and Mattie O'Neill as QM, they set up a Fianna GHQ. By 1947 Dublin had a new O/C, Des Carron, with Wattie Bell as his adjutant. The first Annual camp was held in 1947 and later that year Carron and Bell cycled to Munster, organising Fianna sluaithe at Clonmel and Tralee. The following year the first Ard Fheis since 1940 was held in Dublin. Dublin reported having but one sluagh, which met at 9 Parnell Square.\n\n\n== Fianna organisation after 1950 ==\nIn 1951 the Ard Fheis in Dublin reported that 9 sluaithe were in existence. 500 Fianna were present at the Bodenstown commemoration and Dick Bell was re-elected as Chief Scout. He did not seek re-election at the 1952 Ard Fheis and Tomas MacCurtain was nominated as a nominal Chief Scout, succeeded by Ned Kelly of Long Lane, Dorset Street, Dublin in 1953. Ned Kelly soon he gathered around him a cadre of young leaders and had four sluaithe running in the Dublin area. These were at North City, Drimnagh/Crumlin, Dundrum and Finglas. He had as his adjutant Brian McConnell from Swilly Road in Cabra. His QM was Annrai MacGloin, from Bohernabreena.\nWhen World War II broke out, the old IRA and old Fianna organisations marched as a body to Griffith Barracks in Dublin and they joined the Irish Army there as a separate battalion (the 26th Battalion). When on parade, this battalion was allowed to fly the Fianna and Óglaigh na h-Éireann flags. When the war was over these bodies stayed intact and had premises at Parnell Square. They marched in Bodenstown with Fianna Fáil and attended all the usual commemorations organised by the government. In 1953, the Old Fianna organisation issued an invitation to Ned Kelly (Chief Scout) to meet with them. The Old Fianna reportedly offered their Fianna flag to the then-current Fianna. However, when Kelly heard that the flag would be handed over in a military barracks in an official ceremony, that was unacceptable, and the parley proved fruitless. The old Fianna petered out in the late 1950s.In 1954/55 a serious split occurred in the republican Movement. Activists, led by Joe Christle, became disenchanted with the leadership. They were looking for armed action in Northern Ireland, but were being restrained by the Army Council. This breakaway group aligned with Saor Uladh. They set up a youth group who also called themselves Fianna Éireann. They had a 'Chief Scout' named Gearoid O'Kelly, who previously had a Fianna sluagh in Newbridge, but was now living in Ballyboden. This 'Fianna' had one sluagh at Inchicore, with members mainly from the Drimnagh/Crumlin area. They were unrecognisable from members of the Fianna. One serious clash occurred between these groups later in 1959, over the illegal sale of the Easter Lily.\nNed Kelly was dismissed from the republican movement in 1955 and replaced as Chief Scout by George Darle from Drumcondra. Darle was a nominee of the IRA and had some CBSI experience behind him and he brought some new blood into the organisation, including Frank Lee and Terry Kiely. They set about reorganising the Fianna and soon new sluaithe were being formed in Navan, Dundalk, Drogheda and Sligo. A new modern uniform was also mooted at this time.The Border Campaign by the IRA began in December 1956 and it led to the Fianna losing many of its members, especially in Dublin. In January 1957, 38 IRA recruits were surrounded in a house, used as a training camp, in Glencree, Co. Wicklow. At least 12 of these had been members of the Dublin Battalion of the Fianna. This was a great set-back at the time, and responsibility now fell on the younger members to carry on with the organising. Finglas, for instance, had lost its O/C, and its QM.\n\n\n=== Uniform changes ca. 1958 ===\n\nThe uniform in 1958 was basically the same as when Fianna was founded in 1909 and some members were advocating change. Scouts wore a green blouse with two rows of brass buttons, an orange neckerchief, slouch hat, blacks shorts and a white lanyard that was attached to his Scout whistle. Officers were still wearing riding breeches and a military type jacket, slouch hat and a Sam Brown belt. As slouch hats were hard to find, berets became the headdress for officers. Different type uniforms were mooted and an American Boy Scout pattern was decided on. Scouts would now wear a green shirt with two pockets and a military-style side hat. The uniforms eventually arrived and were first seen at the annual Dick McKee Commemoration in Finglas Village in November 1958. Eventually, the side hats were replaced by a green beret, and the long trousers for officers were replaced by black shorts or breeches again. Frank Lee and Terry Kiely left the Fianna after a falling-out.\n\n\n=== Jubilee Camp 1959 ===\n\nA committee was sent up by GHQ in 1958 to commemorate the 50th anniversary of the Fianna's founding. Chief Scout Jimmy Cruise headed this body and it was decided to hold a camp in central Ireland for all Fianna sluaithe. Permission was given by the Patrician Brothers, Ballyfin, County Laois, to use their extensive grounds for this purpose in August 1959. These were years when money was scarce and travelling made difficult. Consequently, only about 100 Fianna members attended the camp. Each sluagh catered for itself and there were joint activities organised. The Special Branch of the Garda Síochána was busy while the camp was in progress, visiting the homes of Fianna members, especially the young Scouts, telling the parents that the boys were on an IRA training camp. Quite a few members were lost this way. In 1959, Fianna was given the privilege of having its colour party lead the annual pilgrimage to the grave of Wolfe Tone at Bodenstown. A report to the Ard Fheis in 1963 showed that, as well as the sluaithe mentioned above, there were now new units in Roscrea, Nenagh, and Ballyfermot/Chapelizod. A new department had been set up which catered for friends of the Fianna who were either too old to join, or were not in a position to do so. This was known as the dept. of Associated Members. This new section was run by the Adjutant General.\n\n\n=== Junior members ===\nFianna had always catered for boys between the ages of eleven years and sixteen years. About 1959, a new idea was put in place to cater to younger boys. With the assistance of some Cumann na mBan members, boys as young as eight years were allowed into the ranks of the Fianna. They wore a plain green sweater and yellow neckerchief. This venture was a success and most sluaithe (branches) followed suit.\n\n\n=== New Fianna handbook ===\nA committee was set up circa 1963 to gather funds to produce a new Fianna handbook. All of the committee were members of the GHQ, and included Liam MacAnUltaigh, Deasún Ó Briain, Brian Mulvanney, Uinsionn O'Cathain and Tony Shannon. Funds and advertisers were procured and a new handbook appeared ca. 1965. This was the third edition of the handbook, the others having been printed in 1913 and 1924.\n\n\n=== Arrest of Fianna officers ===\nAround November 1963 action was taken against Gearóid O'Kelly who was posing as \"Chief Scout\" of the Fianna. He was constantly seen about Dublin on weekends, collecting money in pubs for \"Republican Prisoners Dependents\". He was warned several times to desist, but continued to carry on. On a Saturday night in November 1963 he was stopped near his home at Ballyboden Road, Rathfarnham, by a party of armed men. They bundled him into a field and \"tarred and feathered\" him. The consequence of this action was that about eleven senior officers were arrested by the Special Branch the following Monday morning and brought to the Bridewell.\nAfter a few hours, O'Kelly was brought in to try to identify those who may have assaulted him. The officers were all brought into one room and O'Kelly viewed them through a glass panel from an adjoining room. No one was detained, and most had alibis, as they were at an Ard Coiste meeting at Gardiner Place at the time of the assault and had been seen entering and leaving the building by the Special Branch men who constantly watched that premises. O'Kelly had also fallen out with his 'Fianna' and two of his associates (Weldon and Phelan), spent six months in prison for assaulting him. He gave up his activities at this stage.\n\n\n=== Activities ===\n\nThe 1950s and 1960s were very active years for Fianna members. A Sluagh usually held one meeting per week, where all met on parade in full uniform. All the usual Scouting test work was undertaken, games played and instructions given regarding hikes or camps on the following weekend. Weather never held the Scouts back from the 'great outdoors', and Fianna members could be encountered in all weathers, especially in the Dublin/Wicklow mountains. This was a time when much military surplus clothing and camping equipment was coming onto the market following the end of the Korean War. One Sluagh, Finglas, had snow tents previously used by the British Army, suitable for camping out in all types of weather.\nAnother favourite weekend pastime was 'shacking'. Throughout the mountains were numerous old deserted houses (shacks), and at weekends the Fianna would use them for shelter. One favourite one was called 'Thunders' in Glencree. Another was in the Glen of the Downs, near the village of Delgany, where there was a Fianna Sluagh. All-night hikes were a favourite with the officers. The last bus out of town to Rathfarnham, Enniskerry or Bohernabreena would be taken, and then the group would march all night across the hills, to where they would pick up the first bus back to the city again. Youth-hosteling was also undertaken, popular with the younger Scouts. Hostels such as Glencree, Baltyboys and Knockree were all within striking distance of the buses from Dublin. Many Dublin Sluagh organised Whit weekend camps and annual week long camps. During the early 1960s national camps were held at Castledermot (County Carlow) and another at Glencolumbkille (County Donegal).\n\nRepublican commemorations were constantly being held and the Fianna was obliged to turn out in full to them. And during this time high ranking Inchicore republican John McGrath brought in several new members to the Fianna. The annual Easter Commemoration was usually the first on the calendar. The parade would line up at St. Stephens Green and march all the way to Glasnevin Cemetery. On the same day, a parade was usually held in Blackrock or Deans Grange Cemetery as well. The Wolf Tone Commemoration was next in line, usually on the last Sunday in June. This was usually a great day out. Trains would come from Dublin, Cork and Kerry for the occasion, and buses from all parts of the country: it was a festive occasion. In November there was held the Manchester Martyrs parade and concert, and in December the Fianna always hosted the Four Martyrs Concert in Dublin. In between all of these occasions, there were many times when the Fianna was invited to provide colour-parties and contingents in various parts of the country to commemorate fallen republican soldiers.\nMany republican demonstrations were held in these years to protest against internment and coercion. The Fianna always played its part on these occasions and was highly visible on the streets when needed. A major source of income always came from the sale of the Easter Lily at Eastertime. Many times the boxes and contents were confiscated by the Garda, as the Fianna never applied for permits.\n\n\n=== After 1969 ===\n\nIn common with the wider republican movement, the Fianna experienced a number of bitter splits after the outbreak of the Troubles. In 1969 two rival groups claimed the title of the Fianna Éireann; one composed of members under the control and influence of the Official movement who wanted to end the Sinn Féin abstentionist policy, and the other aligned to the re-organized Provisional Sinn Féin and IRA movement who supported a continuation of the traditional policy.\nThe Fianna group aligned with the Officials was dissolved in 1976 by the Official Army Council and replaced by the Irish Democratic Youth Movement after a significant number of Fianna volunteers left, taking with them a significant quantity of arms, in the 1974 OIRA-INLA split.In 1986 there was a further split within (Provisional) Sinn Féin and the IRA due to the dropping of Sinn Féin's abstentionist policy. After this split the Fianna withdrew its support from the Provisional movement, citing republican principles. It now supports Republican Sinn Féin and the Continuity IRA. Vice News reported that in early 2015 the group had about 30 members.According to a 2020 study, four factors are associated with Fianna membership: \"First, working-class background, with its related deprivation and social problems (such as criminality and drug addiction); second, the importance of family links and social networks; third, social media as an introduction to republicanism; and, fourth, fascination with Irish history.\"\n\n\n== Leaders ==\nEamon Martin (ca. 1917–1922)\nPádraig Ó Riain, July 1915 (Ó Riain fell out of favour after the Rising; Bureau of Military History Statement from Ó Riain's sister, ca. 1953)\nConstance Markievicz (ca. 1923)\nLiam Langley (Langlaoich) (ca. 1929)\nFrank Ryan (ca. 1932)\nGeorge Plunkett (ca. 1933)\nTomás Óg Mac Curtain, Cork. (c.1948–50)\nDick Bell, Dublin. (ca. 1950–52)\nNed Kelly, Dublin (1952–55)\nGeorge Darle, Dublin (1955–57)\nPat Madden, Cork (1958)\nJimmy Cruise, Dublin (1958–60)\nBrian Murphy, Dublin (1960–62)\nUinsionn Ó Cathain (1962–1964)\nSeán Ó Cionnaith (temporary Chief Scout in late 1964)\nLiam Mac an Ultaigh (1965–19??)\n\n\n== See also ==\nÓgra Shinn Féin\nUrz Skaouted Bleimor\nUrdd Gobaith Cymru\n\n\n== References ==\n\n\n=== Bibliography ===\n\n\n== External links ==\nNa Fianna Éireann", "links": ["1916–1921 Club", "1918 Irish general election", "1932 Irish general election", "1970 Crossmaglen bombing", "1971 Balmoral Furniture Company bombing", "1971 Scottish soldiers' killings", "1973 Coleraine bombings", "1973 Old Bailey bombing", "1973 Westminster bombing", "1974 Bristol bombing", "1974 British Airways bombing attempt", "1974 Houses of Parliament bombing", "1974 London pillar box bombings", "1974 Oxford Street bombing", "1974 Tower of London bombing", "1975 Piccadilly bombing", "1976 Olympia bombing", "1978 British Army Gazelle downing", "1978 Crossmaglen ambush", "1979 Brussels bombing", "1981 Irish hunger strike", "1983 Royal Artillery Barracks bombing", "1985 Newry mortar attack", "1987 Rheindahlen bombing", "1988 British Army Lynx shootdown", "1988 IRA attacks in the Netherlands", "1989 Jonesborough ambush", "1990 British Army Gazelle shootdown", "1990 Downpatrick roadside bomb", "1990 Eltham bombing", "1990 Wembley bombing", "1992 Coalisland riots", "1992 London Bridge bombing", "1992 Manchester bombing", "1992 Staples Corner bombing", "1993 Bishopsgate bombing", "1993 Camden Town bombing", "1993 Finchley Road bombings", "1993 Fivemiletown ambush", "1993 Harrods bombing", "1994 British Army Lynx shootdown", "1996 Docklands bombing", "1996 Hammersmith Bridge bombing", "1996 Manchester bombing", "1997 Coalisland attack", "1997 Northern Ireland riots", "32 County Sovereignty Movement", "Abercorn Restaurant bombing", "Abstentionism", "Active service unit", "Acts of Union 1800", "Aldwych bus bombing", "Alex Maskey", "All Ireland Anti-Partition League", "An Phoblacht", "Andrew Cooney (Irish republican)", "Angelo Fusco", "Anglo-Irish Treaty", "Anthony Berry", "Anti-imperialism", "Anti H-Block", "Antoine Mac Giolla Bhrighde", "Aontacht Éireann", "Aontú", "Armalite and ballot box strategy", "Arms Crisis", "Artane, Dublin", "Arthur Griffith", "Arthur Morgan (Irish politician)", "Asgard (yacht)", "Attack on Ballygawley barracks", "Attack on Cloghoge checkpoint", "Attack on Derryard checkpoint", "Attack on RUC Birches barracks", "Attack on UDR Clogher barracks", "Attacks on shipping in Lough Foyle (1981–82)", "Balcombe Street Gang", "Balcombe Street siege", "Ballygawley bus bombing", "Ballygawley land mine attack", "Baltic Exchange bombing", "Barney Mellows", "Barrack buster", "Battle at Springmartin", "Battle of Ballinalee", "Battle of Dublin", "Battle of Kilmallock", "Battle of Lenadoon", "Battle of Newry Road", "Battle of St Matthew's", "Bayardo Bar attack", "Belfast", "Bernadette Devlin McAliskey", "Bernard Fox (Irish republican)", "Bessbrook landmine attack", "Billy Fox (politician)", "Billy McKee", "Billy Reid (Irish republican)", "Birmingham pub bombings", "Blanchardstown", "Blanket protest", "Bloody Friday (1972)", "Bloody Sunday (1920)", "Bloody Sunday (1921)", "Bobby Sands", "Bobby Storey", "Bodenstown", "Bombings of King's Cross and Euston stations", "Bombings of Paddington and Victoria stations", "Border campaign (Irish Republican Army)", "Breandán Mac Cionnaith", "Brendan Behan", "Brendan Hughes", "Brendan McFarlane", "Brian O'Higgins", "Brighton hotel bombing", "Brooks's Club bombing", "Bulmer Hobson", "Burgery ambush", "Burning of the Custom House", "Cabhair", "Cannon Street train bombing", "Carlton Club bombing", "Carlton Tower and Portman Hotel shootings", "Carrowkennedy ambush", "Carál Ní Chuilín", "Caterham Arms pub bombing", "Cathal Brugha", "Cathal Goulding", "Charles Breslin", "Charlie Dalton", "Charlie Hurley (Irish republican)", "Charlie Kerins", "Chelsea Barracks bombing", "Chief of Staff of the Irish Republican Army", "Christmas Raid", "Christopher Ewart-Biggs", "Chronology of Continuity Irish Republican Army actions", "Chronology of Provisional Irish Republican Army actions (1970–1979)", "Chronology of Provisional Irish Republican Army actions (1980–1989)", "Chronology of Provisional Irish Republican Army actions (1990–1991)", "Chronology of Provisional Irish Republican Army actions (1992–1999)", "Chronology of Provisional Irish Republican Army actions in the 21st century", "Clan na Gael", "Clann na Poblachta", "Clann na hÉireann", "Clann Éireann", "Claudy bombing", "Clive Barracks bombing", "Clonbanin ambush", "Clonfin Ambush", "Clonmult ambush", "Clonoe ambush", "Clontarf, Dublin", "Coagh ambush", "Colin Duffy", "Columba McVeigh", "Comhairle na Poblachta", "Comhairle na dTeachtaí", "Communist Party of Great Britain", "Communist Party of Ireland (Marxist–Leninist)", "Con Colbert", "Connolly Association", "Connolly Column", "Connolly Youth Movement", "Conor Murphy", "Constance Markievicz", "Continuity IRA", "Continuity Irish Republican Army", "Coolavokig ambush", "Cornelius Colbert", "Corporals killings", "County Laois", "County Waterford", "Coventry", "Crossbarry ambush", "Crumlin Road Prison bombing", "Cumann Poblachta na hÉireann", "Cumann na Poblachta", "Cumann na mBan", "Córas na Poblachta", "Dan Breen", "Dan Keating", "Daniel McCann", "Danny Morrison (Irish republican)", "Deal barracks bombing", "Declan Arthurs (Irish republican)", "Denis Donaldson", "Des Dalton", "Desmond Ryan", "Dessie Ellis", "Dessie Grew", "Dessie O'Hare", "Diarmuid O'Neill", "Dick McKee", "Direct Action Against Drugs", "Dirty protest", "Disappeared (Northern Ireland)", "Dissident Irish republican campaign", "Dissident republican", "Doi (identifier)", "Dolours Price", "Dominic Behan", "Donald Kaberry, Baron Kaberry of Adel", "Donegall Street bombing", "Donna Maguire", "Doreen Knatchbull, Baroness Brabourne", "Downing Street mortar attack", "Dromkeen ambush", "Drumcree conflict", "Drummuckavall ambush", "Dublin Lock-out", "Dungannon land mine attack", "Dunmurry train bombing", "Dáil Éireann (Irish Republic)", "Dáithí Ó Conaill", "Eamon Collins", "Eamon De Valera", "Eamon Martin (Irish Republican)", "Easter Rising", "Eddie Copeland", "Edward O'Brien (Irish republican)", "Emmet Dalton", "Eoin MacNeill", "Eoin McNamee (Irish republican)", "Eoin O'Duffy", "Ernie O'Malley", "Erskine Childers (author)", "Executions during the Irish Civil War", "Falls Curfew", "Fenian Brotherhood", "Fenian Rising", "Fenian dynamite campaign", "Fenian raids", "Fergal Caraher", "Fergal O'Hanlon", "Fianna", "Fianna Fáil", "Fianna Uladh", "Finglas", "First Dáil", "Flying column", "Forensic Science Laboratory bombing", "Forkhill land mine attack", "Fra McCann", "Francis Hughes", "Frank Aiken", "Frank Ryan (Irish republican)", "Frank Stagg (Irish republican)", "Freddie Scappaticci", "Free State Army", "Friends of Irish Freedom", "Frongoch internment camp", "Gabriel Cleary", "Galway", "Garda Síochána", "Garry Holohan", "Garryhinch ambush", "Gearóid O'Sullivan", "Genealogy of the Irish Republican Army", "George Harrison (Irish republican)", "George Lennon", "George Noble Plunkett", "George Oliver Plunkett", "Gerard Casey (Irish republican)", "Gerard Davison", "Gerard Evans", "Gerard Tuite", "Gerry Adams", "Gerry Kelly", "Gerry McGeough", "Glamorgan barracks bombing", "Glasdrumman ambush", "Glenanne barracks bombing", "Good Friday Agreement", "Government of Ireland Act 1920", "Griffith Barracks", "Guerrilla phase of the Irish Civil War", "Guildford pub bombings", "HM Prison Maze", "Harrods bombing", "Harrow School bombing", "Harry White (Irish republican)", "Hdl (identifier)", "Headford Ambush", "Heathrow mortar attacks", "Helena Molony", "Honourable Artillery Company bombing", "Howth gun-running", "Hugh Corvin", "Hugh Doherty (Irish republican)", "Hugh McAteer", "Hyde Park and Regent's Park bombings", "IRA Army Council", "IRA Northern Command", "IRA Southern Command", "IRPWA", "ISSN (identifier)", "Ian Gow", "Ian Milne", "Improvised tactical vehicles of the Provisional IRA", "Independent.ie", "Independent Fianna Fáil", "Inglis Barracks bombing", "Internal Security Unit", "Ireland", "Irish Anti-Partition League", "Irish Brigade (World War I)", "Irish Bulletin", "Irish Citizen Army", "Irish Civil War", "Irish Declaration of Independence", "Irish Free State", "Irish Independence Party", "Irish National Invincibles", "Irish National Liberation Army", "Irish People's Liberation Organisation", "Irish Rebellion of 1798", "Irish Republic", "Irish Republican Army", "Irish Republican Army (1919–1922)", "Irish Republican Army (1922–1969)", "Irish Republican Army and the Anglo-Irish Treaty", "Irish Republican Army–Abwehr collaboration", "Irish Republican Brotherhood", "Irish Republican Liberation Army", "Irish Republican Movement", "Irish Republican Police", "Irish Republican Socialist Committees of North America", "Irish Republican Socialist Party", "Irish Republican Voice", "Irish Revolutionary Forces", "Irish Self-Determination League", "Irish Socialist Federation", "Irish Socialist Republican Party", "Irish Volunteers", "Irish War of Independence", "Irish nationalism", "Irish nationalist", "Irish rebellion of 1803", "Irish republican legitimatism", "Irish republican legitimism", "Irish republicanism", "Irish revolutionary period", "Ivor Bell", "J. J. \"Ginger\" O'Connell", "Jackie McMullan", "James Connolly", "James Stephens (Fenian)", "James Stronge (Mid-Armagh MP)", "Jeffery Agate", "Jennifer McCann", "Jim Lynagh", "Jimmy Steele (republican)", "Joe Bratty", "Joe Cahill", "Joe Doherty", "Joe McCann", "Joe McDonnell (hunger striker)", "Joe McKelvey", "Joe Stynes", "John Francis Green", "John Joe McGirl", "John Kelly (Sinn Féin politician)", "John O'Mahony", "John Redmond", "Joseph Fenton", "Joseph MacManus", "Joseph McGrath (Irish politician)", "Josephine Hayden", "Kevin Coen", "Kevin Fulton", "Kevin McKenna (Irish republican)", "Kevin Myers", "Kieran Doherty (hunger striker)", "Kieran Fleming", "Kieran Nugent", "Kilcoole", "Killing of Heidi Hazell", "Killing of Jerry McCabe", "Killings at Coolacrease", "Killings of Nick Spanos and Stephen Melrose", "Kilmeena ambush", "Kilmichael Ambush", "Kingsmill massacre", "Korean War", "La Mon restaurant bombing", "Larry Marley", "Laurence McKeown", "Lenny Murphy", "Leo Martin (Irish republican)", "Liam Campbell", "Liam Deasy", "Liam Kelly (Irish republican)", "Liam Lynch (Irish republican)", "Liam Mellows", "Liam Quinn", "Liam Tobin", "Lichfield gun attack", "Linenhall Barracks", "Lisburn van bombing", "List of brigades of the Irish Republican Army", "List of chronologies of Provisional Irish Republican Army actions", "List of members of the Irish Republican Army", "List of weapons used by the Provisional Irish Republican Army", "Listowel mutiny", "London Hilton bombing", "Loughgall ambush", "Louis Darcy", "Louis Mountbatten, 1st Earl Mountbatten of Burma", "M62 coach bombing", "Magazine Fort", "Mairéad Farrell", "Malachy Carey", "Manchester Martyrs", "Manus Canning", "Marian Price", "Marion Coyle", "Martin Cahill", "Martin Corey", "Martin Doherty (Irish republican)", "Martin Hurson", "Martin McBirney", "Martin McCaughey", "Martin McGartland", "Martin McGuinness", "Martin Meehan (Irish republican)", "Martina Anderson", "Mary MacSwiney", "Matt Devlin", "Maurice Gibson", "Mayobridge landmine attack", "Maze Prison escape", "Mendicity Institution", "Michael Carolan", "Michael Collins (Irish leader)", "Michael Gaughan (Irish republican)", "Michael Kilroy", "Michael Mallin", "Michael McKevitt", "Michael Willetts", "Mick Fitzpatrick", "Mortar attack on Enniskillen barracks", "Moss Twomey", "Mountainview Tavern attack", "Mountjoy Prison helicopter escape", "Mullacreevie ambush", "Munster Republic", "Murder of Andrew Kearney", "Murder of Jean McConville", "Murder of Joseph Rafferty", "Murder of Matthew Burns", "Murder of Paul Quinn", "Murder of Robert McCartney", "Murder of Stephen Tibble", "Murder of Thomas Oliver", "Musgrave Park Hospital bombing", "Máirtín Ó Cadhain", "NORAID", "National Army (Ireland)", "National Association of Old IRA", "National Commemoration Committee", "National Corporate Party", "National Graves Association", "National Irish Freedom Committee", "National Volunteers", "Ned Broy", "Neil Blaney", "New Departure (Ireland)", "New Irish Republican Army", "Newry customs bombing", "Night of the Long Knives (1992)", "Norman Stronge", "Northern Council for Unity", "Northern Ireland", "Northern Ireland peace process", "Northern Resistance Movement", "Northern campaign (Irish Republican Army)", "Occupation of Cullaville", "Official Irish Republican Army", "Operation Conservation", "Operation Flavius", "Osnabrück mortar attack", "Owen Carron", "Paddy Agnew (Irish republican)", "Paddy Daly", "Paddy McLogan", "Paddy Quinn (Irish republican)", "Paramilitary punishment attacks in Northern Ireland", "Partition of Ireland", "Pat Doherty (politician)", "Pat McGeown", "Pat Sheehan (Irish republican)", "Patricia Black", "Patrician Brothers", "Patrick Fleming (Irish republican)", "Patrick Joseph Kelly", "Patrick Magee (Irish republican)", "Patrick McGrath (Irish republican)", "Patrick Pearse", "Paul Butler (politician)", "Paul Magee", "Paul Marlowe (Irish Republican)", "Peadar O'Donnell", "Pearse Jordan", "Pearse Kelly", "Pearse McAuley", "People's Democracy (Ireland)", "Peter Cleary", "Phibsboro", "Phoenix National and Literary Society", "Phoenix Park", "Piaras Béaslaí", "Plan Kathleen", "Political colour", "Proinsias Mac Airt", "Provisional IRA Belfast Brigade", "Provisional IRA Derry Brigade", "Provisional IRA East Tyrone Brigade", "Provisional IRA Honey Trap killings", "Provisional IRA South Armagh Brigade", "Provisional Irish Republican Army", "Provisional Irish Republican Army arms importation", "Provisional Irish Republican Army campaign", "Provisional Sinn Féin", "Proxy bomb", "Pádraig McKearney", "Quaker", "RFA Fort Victoria bombing", "Ranelagh", "Rathfarnham", "Ray Smallwoods", "Raymond Elder", "Raymond Gilmour", "Raymond McCartney", "Raymond McCreesh", "Real Irish Republican Army", "Red Lion Pub bombing", "Republic of Ireland", "Republican Action Against Drugs", "Republican Congress", "Republican Labour Party", "Republican Network for Unity", "Republican News", "Republican Sinn Féin", "Republican Socialist Collective", "Republicanism", "Rescue at Knocklong", "Richard Barrett (Irish republican)", "Richard Burke (Irish republican)", "Richard Mulcahy", "Richard Sykes (diplomat)", "Rineen ambush", "Rita O'Hare", "Robert Bradford (Northern Irish politician)", "Robert Emmet", "Robert Nairac", "Robert Seymour (loyalist)", "Roddy Connolly", "Roger Casement", "Rory O'Connor (Irish republican)", "Rose Dugdale", "Ross McWhirter", "Roy Walsh", "Ruairí Ó Brádaigh", "S-Plan", "S2CID (identifier)", "Sammy Smyth (loyalist)", "Sammy Ward", "Saoirse Irish Freedom", "Saor Uladh", "Saor Éire", "Saor Éire (1967–1975)", "Saoradh", "Scott's Oyster Bar bombing", "Scouting", "Scramoge ambush", "Seamus Costello", "Seamus O'Donovan", "Seamus Twomey", "Sean Hales", "Sean Kelly (Irish republican)", "Sean O'Callaghan", "Second Dáil", "Selton Hill ambush", "Seosamh Ó Mhaoileoin", "Seán Cronin", "Seán Cunningham", "Seán Harrington (Chief of Staff)", "Seán Heuston", "Seán Hogan", "Seán Keenan", "Seán Lemass", "Seán MacBride", "Seán Mac Diarmada", "Seán Mac Eoin", "Seán Mac Mahon", "Seán Mac Stíofáin", "Seán McCool", "Seán Moylan", "Seán O'Hegarty", "Seán Russell", "Seán Savage", "Seán South", "Seán Treacy", "Seán Ó Brádaigh", "Seán Ó Cionnaith", "Shankill Road bombing", "Sheemore ambush", "Sinn Féin", "Sinn Féin (newspaper)", "Siobhán O'Hanlon", "Sligo/Leitrim Independent Socialist Organisation", "Smithwick Tribunal", "Socialist Republican Party (Ireland)", "Society of United Irishmen", "Soloheadbeg ambush", "South Armagh Republican Action Force", "South Armagh Sniper (1990–1997)", "Southern Ireland (1921–1922)", "Special Detective Unit", "Stakeknife", "Stephen Behan", "Stephen Hayes (Irish republican)", "Stoke Newington Road lorry bomb", "Supergrass (informant)", "Sussex Arms pub bombing", "Séamus McElwaine", "Séanna Walsh", "Séumas Robinson (Irish republican)", "Talbot Arms pub bombing", "Tarlach Ó hUid", "Teebane bombing", "Telephone exchange bombings", "Terence MacSwiney", "Terrorism Act 2000", "The Emergency (Ireland)", "The Gaelic American", "The Green Book (IRA)", "The Irish Felon", "The Irish People (1863 newspaper)", "The Irish Press", "The Nation (Irish newspaper)", "The Phoenix (magazine)", "The Squad (Irish Republican Army unit)", "The Store Bar shooting", "The Tim Parry Johnathan Ball Foundation for Peace", "The Troubles", "Thiepval barracks bombing", "Thomas Begley", "Thomas J. Kelly (Irish nationalist)", "Thomas McElwee", "Thomas McMahon (Irish republican)", "Thomas Murphy (Irish republican)", "Timeline of the Irish Civil War", "Timeline of the Irish War of Independence", "Timeline of the Troubles", "Tom Barry (Irish republican)", "Tom Clarke (Irish republican)", "Tom Hales (Irish republican)", "Tom Maguire", "Tom McEllistrim (1894–1973)", "Tommy McKearney", "Tomás Mac Curtain", "Tomás Ó Dubhghaill", "Tony Magan", "Tooreen ambush", "Trattoria Fiore bombing", "Troops Out Movement", "Tullyvallen massacre", "United Ireland", "United Irishman (1848 newspaper)", "Upton train ambush", "Urdd Gobaith Cymru", "Urz Skaouted Bleimor", "VIAF (identifier)", "Vice News", "Volunteer (Irish republican)", "W.J. Brennan-Whitmore", "Walton's Restaurant bombing", "Warrenpoint ambush", "Warrington bombings", "Wayback Machine", "Wellington Barracks", "West Ham station attack", "William Fleming (Irish republican)", "William Marchant (loyalist)", "Willie McGuinness", "Wolfe Tone", "Wolfe Tone Societies", "Woolwich pub bombing", "Workers Power (Ireland)", "World War I", "Young Ireland", "Young Ireland rebellion", "Éamonn Ceannt", "Éamonn O'Doherty (republican)", "Éire Nua", "Éirígí", "Óglaigh na hÉireann (Real IRA splinter group)", "Ógra Shinn Féin"]}