{"url": "https://en.wikipedia.org/wiki/Fibonacci_number", "title": "Fibonacci number", "summary": "In mathematics, the Fibonacci numbers, commonly denoted Fn , form a sequence, the Fibonacci sequence, in which each number is the sum of the two preceding ones. The sequence commonly starts from 0 and 1, although some authors omit the initial terms and start the sequence from 1 and 1 or from 1 and 2.\nStarting from 0 and 1, the next few values in the sequence are:\n0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, ...The Fibonacci numbers were first described in Indian mathematics, as early as 200 BC in work by Pingala on enumerating possible patterns of Sanskrit poetry formed from syllables of two lengths. They are named after the Italian mathematician Leonardo of Pisa, later known as Fibonacci, who introduced the sequence to Western European mathematics in his 1202 book Liber Abaci.Fibonacci numbers appear unexpectedly often in mathematics, so much so that there is an entire journal dedicated to their study, the Fibonacci Quarterly. Applications of Fibonacci numbers include computer algorithms such as the Fibonacci search technique and the Fibonacci heap data structure, and graphs called Fibonacci cubes used for interconnecting parallel and distributed systems. They also appear in biological settings, such as branching in trees, the arrangement of leaves on a stem, the fruit sprouts of a pineapple, the flowering of an artichoke, an uncurling fern, and the arrangement of a pine cone's bracts.\nFibonacci numbers are strongly related to the golden ratio: Binet's formula expresses the nth Fibonacci number in terms of n and the golden ratio, and implies that the ratio of two consecutive Fibonacci numbers tends to the golden ratio as n increases. Fibonacci numbers are also closely related to Lucas numbers, which obey the same recurrence relation and with the Fibonacci numbers form a complementary pair of Lucas sequences.", "content": "In mathematics, the Fibonacci numbers, commonly denoted Fn , form a sequence, the Fibonacci sequence, in which each number is the sum of the two preceding ones. The sequence commonly starts from 0 and 1, although some authors omit the initial terms and start the sequence from 1 and 1 or from 1 and 2.\nStarting from 0 and 1, the next few values in the sequence are:\n0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, ...The Fibonacci numbers were first described in Indian mathematics, as early as 200 BC in work by Pingala on enumerating possible patterns of Sanskrit poetry formed from syllables of two lengths. They are named after the Italian mathematician Leonardo of Pisa, later known as Fibonacci, who introduced the sequence to Western European mathematics in his 1202 book Liber Abaci.Fibonacci numbers appear unexpectedly often in mathematics, so much so that there is an entire journal dedicated to their study, the Fibonacci Quarterly. Applications of Fibonacci numbers include computer algorithms such as the Fibonacci search technique and the Fibonacci heap data structure, and graphs called Fibonacci cubes used for interconnecting parallel and distributed systems. They also appear in biological settings, such as branching in trees, the arrangement of leaves on a stem, the fruit sprouts of a pineapple, the flowering of an artichoke, an uncurling fern, and the arrangement of a pine cone's bracts.\nFibonacci numbers are strongly related to the golden ratio: Binet's formula expresses the nth Fibonacci number in terms of n and the golden ratio, and implies that the ratio of two consecutive Fibonacci numbers tends to the golden ratio as n increases. Fibonacci numbers are also closely related to Lucas numbers, which obey the same recurrence relation and with the Fibonacci numbers form a complementary pair of Lucas sequences.\n\n\n== Definition ==\n\nThe Fibonacci numbers may be defined by the recurrence relation\nand\n\nfor n > 1.\nUnder some older definitions, the value \n  \n    \n      \n        \n          F\n          \n            0\n          \n        \n        =\n        0\n      \n    \n    {\\displaystyle F_{0}=0}\n   is omitted, so that the sequence starts with \n  \n    \n      \n        \n          F\n          \n            1\n          \n        \n        =\n        \n          F\n          \n            2\n          \n        \n        =\n        1\n        ,\n      \n    \n    {\\displaystyle F_{1}=F_{2}=1,}\n   and the recurrence \n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n        =\n        \n          F\n          \n            n\n            −\n            1\n          \n        \n        +\n        \n          F\n          \n            n\n            −\n            2\n          \n        \n      \n    \n    {\\displaystyle F_{n}=F_{n-1}+F_{n-2}}\n   is valid for n > 2. Fibonacci started the sequence with \n  \n    \n      \n        \n          F\n          \n            1\n          \n        \n        =\n        1\n        ,\n        \n          F\n          \n            2\n          \n        \n        =\n        2\n      \n    \n    {\\displaystyle F_{1}=1,F_{2}=2}\n  .The first 21 Fibonacci numbers Fn are:\n\n\n== History ==\n\nThe Fibonacci sequence appears in Indian mathematics in connection with Sanskrit prosody, as pointed out by Parmanand Singh in 1986. In the Sanskrit poetic tradition, there was interest in enumerating all patterns of long (L) syllables of 2 units duration, juxtaposed with short (S) syllables of 1 unit duration. Counting the different patterns of successive L and S with a given total duration results in the Fibonacci numbers: the number of patterns of duration m units is Fm + 1.Knowledge of the Fibonacci sequence was expressed as early as Pingala (c. 450 BC–200 BC). Singh cites Pingala's cryptic formula misrau cha (\"the two are mixed\") and scholars who interpret it in context as saying that the number of patterns for m beats (Fm+1) is obtained by adding one [S] to the Fm cases and one [L] to the Fm−1 cases. Bharata Muni also expresses knowledge of the sequence in the Natya Shastra (c. 100 BC–c. 350 AD).\nHowever, the clearest exposition of the sequence arises in the work of Virahanka (c. 700 AD), whose own work is lost, but is available in a quotation by Gopala (c. 1135):\nVariations of two earlier meters [is the variation]...  For example, for [a meter of length] four, variations of meters of two [and] three being mixed, five happens. [works out examples 8, 13, 21]... In this way, the process should be followed in all mātrā-vṛttas [prosodic combinations].\nHemachandra (c. 1150) is credited with knowledge of the sequence as well, writing that \"the sum of the last and the one before the last is the number ... of the next mātrā-vṛtta.\"Outside India, the Fibonacci sequence first appears in the book Liber Abaci (The Book of Calculation, 1202) by Fibonacci where it is used to calculate the growth of rabbit populations. Fibonacci considers the growth of an idealized (biologically unrealistic) rabbit population, assuming that: a newly born breeding pair of rabbits are put in a field; each breeding pair mates at the age of one month, and at the end of their second month they always produce another pair of rabbits; and rabbits never die, but continue breeding forever. Fibonacci posed the puzzle: how many pairs will there be in one year?\n\nAt the end of the first month, they mate, but there is still only 1 pair.\nAt the end of the second month they produce a new pair, so there are 2 pairs in the field.\nAt the end of the third month, the original pair produce a second pair, but the second pair only mate to gestate for a month, so there are 3 pairs in all.\nAt the end of the fourth month, the original pair has produced yet another new pair, and the pair born two months ago also produces their first pair, making 5 pairs.At the end of the nth month, the number of pairs of rabbits is equal to the number of mature pairs (that is, the number of pairs in month n – 2) plus the number of pairs alive last month (month n – 1).  The number in the nth month is the nth Fibonacci number.\n\nThe name \"Fibonacci sequence\" was first used by the 19th-century number theorist Édouard Lucas.\n\n\n== Relation to the golden ratio ==\n\n\n=== Closed-form expression ===\nLike every sequence defined by a linear recurrence with constant coefficients, the Fibonacci numbers have a closed-form expression. It has become known as Binet's formula, named after French mathematician Jacques Philippe Marie Binet, though it was already known by Abraham de Moivre and Daniel Bernoulli:\nwhere\n\nis the golden ratio, and ψ is its conjugate:\nSince \n  \n    \n      \n        ψ\n        =\n        −\n        \n          φ\n          \n            −\n            1\n          \n        \n      \n    \n    {\\displaystyle \\psi =-\\varphi ^{-1}}\n  , this formula can also be written as\n\nTo see the relation between the sequence and these constants, note that φ and ψ are both solutions of the equation\n\nso the powers of φ and ψ satisfy the Fibonacci recursion. In other words,\n\nand\n\nIt follows that for any values a and b, the sequence defined by\n\nsatisfies the same recurrence.\n\nIf a and b are chosen so that U0 = 0 and U1 = 1 then the resulting sequence Un must be the Fibonacci sequence. This is the same as requiring a and b satisfy the system of equations:\n\nwhich has solution\n\nproducing the required formula.\nTaking the starting values U0 and U1 to be arbitrary constants, a more general solution is:\n\nwhere\n\n\n=== Computation by rounding ===\nSince\n\nfor all n ≥ 0, the number Fn is the closest integer to \n  \n    \n      \n        \n          \n            \n              φ\n              \n                n\n              \n            \n            \n              5\n            \n          \n        \n      \n    \n    {\\displaystyle {\\frac {\\varphi ^{n}}{\\sqrt {5}}}}\n  . Therefore, it can be found by rounding, using the nearest integer function:\n\nIn fact, the rounding error is very small, being less than 0.1 for n ≥ 4, and less than 0.01 for n ≥ 8.\nFibonacci numbers can also be computed by truncation, in terms of the floor function:\n\nAs the floor function is monotonic, the latter formula can be inverted for finding the index n(F)  of the smallest Fibonacci number that is not less than a positive integer F:\n\nwhere \n  \n    \n      \n        \n          log\n          \n            φ\n          \n        \n        ⁡\n        (\n        x\n        )\n        =\n        ln\n        ⁡\n        (\n        x\n        )\n        \n          /\n        \n        ln\n        ⁡\n        (\n        φ\n        )\n        =\n        \n          log\n          \n            10\n          \n        \n        ⁡\n        (\n        x\n        )\n        \n          /\n        \n        \n          log\n          \n            10\n          \n        \n        ⁡\n        (\n        φ\n        )\n      \n    \n    {\\displaystyle \\log _{\\varphi }(x)=\\ln(x)/\\ln(\\varphi )=\\log _{10}(x)/\\log _{10}(\\varphi )}\n  , \n  \n    \n      \n        ln\n        ⁡\n        (\n        φ\n        )\n        =\n        0.481211\n        …\n      \n    \n    {\\displaystyle \\ln(\\varphi )=0.481211\\ldots }\n  , and \n  \n    \n      \n        \n          log\n          \n            10\n          \n        \n        ⁡\n        (\n        φ\n        )\n        =\n        0.208987\n        …\n      \n    \n    {\\displaystyle \\log _{10}(\\varphi )=0.208987\\ldots }\n  \n\n\n=== Magnitude ===\nSince Fn is asymptotic to \n  \n    \n      \n        \n          φ\n          \n            n\n          \n        \n        \n          /\n        \n        \n          \n            5\n          \n        \n      \n    \n    {\\displaystyle \\varphi ^{n}/{\\sqrt {5}}}\n  , the number of digits in Fn is asymptotic to \n  \n    \n      \n        n\n        \n          log\n          \n            10\n          \n        \n        ⁡\n        φ\n        ≈\n        0.2090\n        \n        n\n      \n    \n    {\\displaystyle n\\log _{10}\\varphi \\approx 0.2090\\,n}\n  . As a consequence, for every integer d > 1 there are either 4 or 5 Fibonacci numbers with d decimal digits.\nMore generally, in the base b representation, the number of digits in Fn is asymptotic to \n  \n    \n      \n        n\n        \n          log\n          \n            b\n          \n        \n        ⁡\n        φ\n        .\n      \n    \n    {\\displaystyle n\\log _{b}\\varphi .}\n  \n\n\n=== Limit of consecutive quotients ===\nJohannes Kepler observed that the ratio of consecutive Fibonacci numbers converges. He wrote that \"as 5 is to 8 so is 8 to 13, practically, and as 8 is to 13, so is 13 to 21 almost\", and concluded that these ratios approach the golden ratio \n  \n    \n      \n        φ\n        :\n      \n    \n    {\\displaystyle \\varphi \\colon }\n   \nThis convergence holds regardless of the starting values \n  \n    \n      \n        \n          U\n          \n            0\n          \n        \n      \n    \n    {\\displaystyle U_{0}}\n   and \n  \n    \n      \n        \n          U\n          \n            1\n          \n        \n      \n    \n    {\\displaystyle U_{1}}\n  , unless \n  \n    \n      \n        \n          U\n          \n            1\n          \n        \n        =\n        −\n        \n          U\n          \n            0\n          \n        \n        \n          /\n        \n        φ\n      \n    \n    {\\displaystyle U_{1}=-U_{0}/\\varphi }\n  . This can be verified using Binet's formula. For example, the initial values 3 and 2 generate the sequence 3, 2, 5, 7, 12, 19, 31, 50, 81, 131, 212, 343, 555, ... The ratio of consecutive terms in this sequence shows the same convergence towards the golden ratio. \nIn general, \n  \n    \n      \n        \n          lim\n          \n            n\n            →\n            ∞\n          \n        \n        \n          \n            \n              F\n              \n                n\n                +\n                m\n              \n            \n            \n              F\n              \n                n\n              \n            \n          \n        \n        =\n        \n          φ\n          \n            m\n          \n        \n      \n    \n    {\\displaystyle \\lim _{n\\to \\infty }{\\frac {F_{n+m}}{F_{n}}}=\\varphi ^{m}}\n  , because the ratios between consecutive Fibonacci numbers approaches \n  \n    \n      \n        φ\n      \n    \n    {\\displaystyle \\varphi }\n  . \n\n\n=== Decomposition of powers ===\nSince the golden ratio satisfies the equation\n\nthis expression can be used to decompose higher powers \n  \n    \n      \n        \n          φ\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle \\varphi ^{n}}\n   as a linear function of lower powers, which in turn can be decomposed all the way down to a linear combination of \n  \n    \n      \n        φ\n      \n    \n    {\\displaystyle \\varphi }\n   and 1. The resulting recurrence relationships yield Fibonacci numbers as the linear coefficients:\n\nThis equation can be proved by induction on n ≥ 1:\n\nFor \n  \n    \n      \n        ψ\n        =\n        −\n        1\n        \n          /\n        \n        φ\n      \n    \n    {\\displaystyle \\psi =-1/\\varphi }\n  , it is also the case that \n  \n    \n      \n        \n          ψ\n          \n            2\n          \n        \n        =\n        ψ\n        +\n        1\n      \n    \n    {\\displaystyle \\psi ^{2}=\\psi +1}\n   and it is also the case that\n\nThese expressions are also true for n < 1 if the Fibonacci sequence Fn is extended to negative integers using the Fibonacci rule \n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n        =\n        \n          F\n          \n            n\n            +\n            2\n          \n        \n        −\n        \n          F\n          \n            n\n            +\n            1\n          \n        \n        .\n      \n    \n    {\\displaystyle F_{n}=F_{n+2}-F_{n+1}.}\n  \n\n\n=== Identification ===\nBinet's formula provides a proof that a positive integer x is a Fibonacci number if and only if at least one of \n  \n    \n      \n        5\n        \n          x\n          \n            2\n          \n        \n        +\n        4\n      \n    \n    {\\displaystyle 5x^{2}+4}\n   or \n  \n    \n      \n        5\n        \n          x\n          \n            2\n          \n        \n        −\n        4\n      \n    \n    {\\displaystyle 5x^{2}-4}\n   is a perfect square. This is because Binet's formula, which can be written as \n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n        =\n        (\n        \n          φ\n          \n            n\n          \n        \n        −\n        (\n        −\n        1\n        \n          )\n          \n            n\n          \n        \n        \n          φ\n          \n            −\n            n\n          \n        \n        )\n        \n          /\n        \n        \n          \n            5\n          \n        \n      \n    \n    {\\displaystyle F_{n}=(\\varphi ^{n}-(-1)^{n}\\varphi ^{-n})/{\\sqrt {5}}}\n  , can be multiplied by \n  \n    \n      \n        \n          \n            5\n          \n        \n        \n          φ\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle {\\sqrt {5}}\\varphi ^{n}}\n   and solved as a quadratic equation in \n  \n    \n      \n        \n          φ\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle \\varphi ^{n}}\n   via the quadratic formula:\n\nComparing this to \n  \n    \n      \n        \n          φ\n          \n            n\n          \n        \n        =\n        \n          F\n          \n            n\n          \n        \n        φ\n        +\n        \n          F\n          \n            n\n            −\n            1\n          \n        \n        =\n        (\n        \n          F\n          \n            n\n          \n        \n        \n          \n            5\n          \n        \n        +\n        \n          F\n          \n            n\n          \n        \n        +\n        2\n        \n          F\n          \n            n\n            −\n            1\n          \n        \n        )\n        \n          /\n        \n        2\n      \n    \n    {\\displaystyle \\varphi ^{n}=F_{n}\\varphi +F_{n-1}=(F_{n}{\\sqrt {5}}+F_{n}+2F_{n-1})/2}\n  , it follows that\n\nIn particular, the left-hand side is a perfect square.\n\n\n== Matrix form ==\nA 2-dimensional system of linear difference equations that describes the Fibonacci sequence is\n\nalternatively denoted\n\nwhich yields \n  \n    \n      \n        \n          \n            \n              \n                F\n                →\n              \n            \n          \n          \n            n\n          \n        \n        =\n        \n          \n            A\n          \n          \n            n\n          \n        \n        \n          \n            \n              \n                F\n                →\n              \n            \n          \n          \n            0\n          \n        \n      \n    \n    {\\displaystyle {\\vec {F}}_{n}=\\mathbf {A} ^{n}{\\vec {F}}_{0}}\n  .  The eigenvalues of the matrix A are \n  \n    \n      \n        φ\n        =\n        \n          \n            1\n            2\n          \n        \n        (\n        1\n        +\n        \n          \n            5\n          \n        \n        )\n      \n    \n    {\\displaystyle \\varphi ={\\frac {1}{2}}(1+{\\sqrt {5}})}\n   and \n  \n    \n      \n        ψ\n        =\n        −\n        \n          φ\n          \n            −\n            1\n          \n        \n        =\n        \n          \n            1\n            2\n          \n        \n        (\n        1\n        −\n        \n          \n            5\n          \n        \n        )\n      \n    \n    {\\displaystyle \\psi =-\\varphi ^{-1}={\\frac {1}{2}}(1-{\\sqrt {5}})}\n   corresponding to the respective eigenvectors \n \nand\n\nAs the initial value is\n \nit follows that the nth term is\n\nFrom this, the nth element in the Fibonacci series\nmay be read off directly as a closed-form expression:\n\nEquivalently, the same computation may performed by diagonalization of A through use of its eigendecomposition:\n\nwhere \n  \n    \n      \n        Λ\n        =\n        \n          \n            (\n            \n              \n                \n                  φ\n                \n                \n                  0\n                \n              \n              \n                \n                  0\n                \n                \n                  −\n                  \n                    φ\n                    \n                      −\n                      1\n                    \n                  \n                \n              \n            \n            )\n          \n        \n      \n    \n    {\\displaystyle \\Lambda ={\\begin{pmatrix}\\varphi &0\\\\0&-\\varphi ^{-1}\\end{pmatrix}}}\n   and \n  \n    \n      \n        S\n        =\n        \n          \n            (\n            \n              \n                \n                  φ\n                \n                \n                  −\n                  \n                    φ\n                    \n                      −\n                      1\n                    \n                  \n                \n              \n              \n                \n                  1\n                \n                \n                  1\n                \n              \n            \n            )\n          \n        \n        .\n      \n    \n    {\\displaystyle S={\\begin{pmatrix}\\varphi &-\\varphi ^{-1}\\\\1&1\\end{pmatrix}}.}\n  \nThe closed-form expression for the nth element in the Fibonacci series is therefore given by\n\nwhich again yields\n\nThe matrix A has a determinant of −1, and thus it is a 2×2 unimodular matrix.\nThis property can be understood in terms of the continued fraction representation for the golden ratio:\n\nThe Fibonacci numbers occur as the ratio of successive convergents of the continued fraction for φ, and the matrix formed from successive convergents of any continued fraction has a determinant of +1 or −1.  The matrix representation gives the following closed-form expression for the Fibonacci numbers:\n\nFor a given n, this matrix can be computed in O(log(n)) arithmetic operations, using the exponentiation by squaring method.\nTaking the determinant of both sides of this equation yields Cassini's identity,\n\nMoreover, since  An  Am = An+m for any square matrix A, the following identities can be derived (they are obtained from two different coefficients of the matrix product, and one may easily deduce the second one from the first one by changing n into n + 1),\n\nIn particular, with m = n,\n\nThese last two identities provide a way to compute Fibonacci numbers recursively in O(log(n)) arithmetic operations and in time O(M(n) log(n)), where M(n) is the time for the multiplication of two numbers of n digits. This matches the time for computing the nth Fibonacci number from the closed-form matrix formula, but with fewer redundant steps if one avoids recomputing an already computed Fibonacci number (recursion with memoization).\n\n\n== Combinatorial identities ==\n\n\n=== Combinatorial proofs ===\nMost identities involving Fibonacci numbers can be proved using combinatorial arguments using the fact that \n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle F_{n}}\n   can be interpreted as the number of [possibly empty] sequences of 1s and 2s whose sum is \n  \n    \n      \n        n\n        −\n        1\n      \n    \n    {\\displaystyle n-1}\n  . This can be taken as the definition of \n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle F_{n}}\n   with the conventions \n  \n    \n      \n        \n          F\n          \n            0\n          \n        \n        =\n        0\n      \n    \n    {\\displaystyle F_{0}=0}\n  , meaning no such sequence exists whose sum is −1, and \n  \n    \n      \n        \n          F\n          \n            1\n          \n        \n        =\n        1\n      \n    \n    {\\displaystyle F_{1}=1}\n  , meaning the empty sequence \"adds up\" to 0. In the following, \n  \n    \n      \n        \n          |\n        \n        \n          .\n          .\n          .\n        \n        \n          |\n        \n      \n    \n    {\\displaystyle |{...}|}\n   is the cardinality of a set:\n\n  \n    \n      \n        \n          F\n          \n            0\n          \n        \n        =\n        0\n        =\n        \n          |\n        \n        {\n        }\n        \n          |\n        \n      \n    \n    {\\displaystyle F_{0}=0=|\\{\\}|}\n  \n\n  \n    \n      \n        \n          F\n          \n            1\n          \n        \n        =\n        1\n        =\n        \n          |\n        \n        {\n        {\n        }\n        }\n        \n          |\n        \n      \n    \n    {\\displaystyle F_{1}=1=|\\{\\{\\}\\}|}\n  \n\n  \n    \n      \n        \n          F\n          \n            2\n          \n        \n        =\n        1\n        =\n        \n          |\n        \n        {\n        {\n        1\n        }\n        }\n        \n          |\n        \n      \n    \n    {\\displaystyle F_{2}=1=|\\{\\{1\\}\\}|}\n  \n\n  \n    \n      \n        \n          F\n          \n            3\n          \n        \n        =\n        2\n        =\n        \n          |\n        \n        {\n        {\n        1\n        ,\n        1\n        }\n        ,\n        {\n        2\n        }\n        }\n        \n          |\n        \n      \n    \n    {\\displaystyle F_{3}=2=|\\{\\{1,1\\},\\{2\\}\\}|}\n  \n\n  \n    \n      \n        \n          F\n          \n            4\n          \n        \n        =\n        3\n        =\n        \n          |\n        \n        {\n        {\n        1\n        ,\n        1\n        ,\n        1\n        }\n        ,\n        {\n        1\n        ,\n        2\n        }\n        ,\n        {\n        2\n        ,\n        1\n        }\n        }\n        \n          |\n        \n      \n    \n    {\\displaystyle F_{4}=3=|\\{\\{1,1,1\\},\\{1,2\\},\\{2,1\\}\\}|}\n  \n\n  \n    \n      \n        \n          F\n          \n            5\n          \n        \n        =\n        5\n        =\n        \n          |\n        \n        {\n        {\n        1\n        ,\n        1\n        ,\n        1\n        ,\n        1\n        }\n        ,\n        {\n        1\n        ,\n        1\n        ,\n        2\n        }\n        ,\n        {\n        1\n        ,\n        2\n        ,\n        1\n        }\n        ,\n        {\n        2\n        ,\n        1\n        ,\n        1\n        }\n        ,\n        {\n        2\n        ,\n        2\n        }\n        }\n        \n          |\n        \n      \n    \n    {\\displaystyle F_{5}=5=|\\{\\{1,1,1,1\\},\\{1,1,2\\},\\{1,2,1\\},\\{2,1,1\\},\\{2,2\\}\\}|}\n  In this manner the recurrence relation\n\nmay be understood by dividing the \n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle F_{n}}\n   sequences into two non-overlapping sets where all sequences either begin with 1 or 2:\n\nExcluding the first element, the remaining terms in each sequence sum to \n  \n    \n      \n        n\n        −\n        2\n      \n    \n    {\\displaystyle n-2}\n   or \n  \n    \n      \n        n\n        −\n        3\n      \n    \n    {\\displaystyle n-3}\n   and the cardinality of each set is \n  \n    \n      \n        \n          F\n          \n            n\n            −\n            1\n          \n        \n      \n    \n    {\\displaystyle F_{n-1}}\n   or \n  \n    \n      \n        \n          F\n          \n            n\n            −\n            2\n          \n        \n      \n    \n    {\\displaystyle F_{n-2}}\n   giving a total of \n  \n    \n      \n        \n          F\n          \n            n\n            −\n            1\n          \n        \n        +\n        \n          F\n          \n            n\n            −\n            2\n          \n        \n      \n    \n    {\\displaystyle F_{n-1}+F_{n-2}}\n   sequences, showing this is equal to \n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle F_{n}}\n  .\n\nIn a similar manner it may be shown that the sum of the first Fibonacci numbers up to the nth is equal to the (n + 2)-nd Fibonacci number minus 1.  In symbols:\n\nThis may be seen by dividing all sequences summing to \n  \n    \n      \n        n\n        +\n        1\n      \n    \n    {\\displaystyle n+1}\n   based on the location of the first 2. Specifically, each set consists of those sequences that start \n  \n    \n      \n        {\n        2\n        ,\n        .\n        .\n        .\n        }\n        ,\n        {\n        1\n        ,\n        2\n        ,\n        .\n        .\n        .\n        }\n        ,\n        .\n        .\n        .\n        ,\n      \n    \n    {\\displaystyle \\{2,...\\},\\{1,2,...\\},...,}\n   until the last two sets \n  \n    \n      \n        {\n        {\n        1\n        ,\n        1\n        ,\n        .\n        .\n        .\n        ,\n        1\n        ,\n        2\n        }\n        }\n        ,\n        {\n        {\n        1\n        ,\n        1\n        ,\n        .\n        .\n        .\n        ,\n        1\n        }\n        }\n      \n    \n    {\\displaystyle \\{\\{1,1,...,1,2\\}\\},\\{\\{1,1,...,1\\}\\}}\n   each with cardinality 1.\n\nFollowing the same logic as before, by summing the cardinality of each set we see that\n\n  \n    \n      \n        \n          F\n          \n            n\n            +\n            2\n          \n        \n        =\n        \n          F\n          \n            n\n          \n        \n        +\n        \n          F\n          \n            n\n            −\n            1\n          \n        \n        +\n        .\n        .\n        .\n        +\n        \n          |\n        \n        {\n        {\n        1\n        ,\n        1\n        ,\n        .\n        .\n        .\n        ,\n        1\n        ,\n        2\n        }\n        }\n        \n          |\n        \n        +\n        \n          |\n        \n        {\n        {\n        1\n        ,\n        1\n        ,\n        .\n        .\n        .\n        ,\n        1\n        }\n        }\n        \n          |\n        \n      \n    \n    {\\displaystyle F_{n+2}=F_{n}+F_{n-1}+...+|\\{\\{1,1,...,1,2\\}\\}|+|\\{\\{1,1,...,1\\}\\}|}\n  ... where the last two terms have the value \n  \n    \n      \n        \n          F\n          \n            1\n          \n        \n        =\n        1\n      \n    \n    {\\displaystyle F_{1}=1}\n  .  From this it follows that \n  \n    \n      \n        \n          ∑\n          \n            i\n            =\n            1\n          \n          \n            n\n          \n        \n        \n          F\n          \n            i\n          \n        \n        =\n        \n          F\n          \n            n\n            +\n            2\n          \n        \n        −\n        1\n      \n    \n    {\\displaystyle \\sum _{i=1}^{n}F_{i}=F_{n+2}-1}\n  .\nA similar argument, grouping the sums by the position of the first 1 rather than the first 2 gives two more identities:\n\nand\n\nIn words, the sum of the first Fibonacci numbers with odd index up to \n  \n    \n      \n        \n          F\n          \n            2\n            n\n            −\n            1\n          \n        \n      \n    \n    {\\displaystyle F_{2n-1}}\n   is the (2n)th Fibonacci number, and the sum of the first Fibonacci numbers with even index up to \n  \n    \n      \n        \n          F\n          \n            2\n            n\n          \n        \n      \n    \n    {\\displaystyle F_{2n}}\n   is the (2n + 1)th Fibonacci number minus 1.\nA different trick may be used to prove\n\nor in words, the sum of the squares of the first Fibonacci numbers up to \n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle F_{n}}\n   is the product of the nth and (n + 1)th Fibonacci numbers. To see this, begin with a Fibonacci rectangle of size \n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n        ×\n        \n          F\n          \n            n\n            +\n            1\n          \n        \n      \n    \n    {\\displaystyle F_{n}\\times F_{n+1}}\n   and decompose it into squares of size \n  \n    \n      \n        \n          F\n          \n            n\n          \n        \n        ,\n        \n          F\n          \n            n\n            −\n            1\n          \n        \n        ,\n        .\n        .\n        .\n        ,\n        \n          F\n          \n            1\n          \n        \n      \n    \n    {\\displaystyle F_{n},F_{n-1},...,F_{1}}\n  ; from this the identity follows by comparing areas:\n\n\n=== Symbolic method ===\nThe sequence \n  \n    \n      \n        (\n        \n          F\n          \n            n\n          \n        \n        \n          )\n          \n            n\n            ∈\n            \n              N\n            \n          \n        \n      \n    \n    {\\displaystyle (F_{n})_{n\\in \\mathbb {N} }}\n   is also considered using the symbolic method. More precisely, this sequence corresponds to a specifiable combinatorial class. The specification of this sequence is \n  \n    \n      \n        Seq\n        ⁡\n        (\n        \n          \n            Z\n            +\n            \n              Z\n              \n                2\n              \n            \n          \n        \n        )\n      \n    \n    {\\displaystyle \\operatorname {Seq} ({\\mathcal {Z+Z^{2}}})}\n  . Indeed, as stated above, the \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  -th Fibonacci number equals the number of combinatorial compositions (ordered partitions) of \n  \n    \n      \n        n\n        −\n        1\n      \n    \n    {\\displaystyle n-1}\n   using terms 1 and 2.\nIt follows that the ordinary generating function of the Fibonacci sequence, i.e. \n  \n    \n      \n        \n          ∑\n          \n            i\n            =\n            0\n          \n          \n            ∞\n          \n        \n        \n          F\n          \n            i\n          \n        \n        \n          z\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle \\sum _{i=0}^{\\infty }F_{i}z^{i}}\n  , is the complex function \n  \n    \n      \n        \n          \n            z\n            \n              1\n              −\n              z\n              −\n              \n                z\n                \n                  2\n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\frac {z}{1-z-z^{2}}}}\n  .\n\n\n=== Induction proofs ===\nFibonacci identities often can be easily proved used mathematical induction.\nFor example, reconsider\n\nAdding \n  \n    \n      \n        \n          F\n          \n            n\n            +\n            1\n          \n        \n      \n    \n    {\\displaystyle F_{n+1}}\n   to both sides gives\n\n  \n    \n      \n        \n          ∑\n          \n            i\n            =\n            1\n          \n          \n            n\n          \n        \n        \n          F\n          \n            i\n          \n        \n        +\n        \n          F\n          \n            n\n            +\n            1\n          \n        \n        =\n        \n          F\n          \n            n\n            +\n            1\n          \n        \n        +\n        \n          F\n          \n            n\n            +\n            2\n          \n        \n        −\n        1\n      \n    \n    {\\displaystyle \\sum _{i=1}^{n}F_{i}+F_{n+1}=F_{n+1}+F_{n+2}-1}\n  and so we have the formula for \n  \n    \n      \n        n\n        +\n        1\n      \n    \n    {\\displaystyle n+1}\n  \n\nSimilarly, add \n  \n    \n      \n        \n          \n            \n              F\n              \n                n\n                +\n                1\n              \n            \n          \n          \n            2\n          \n        \n      \n    \n    {\\displaystyle {F_{n+1}}^{2}}\n   to both sides of\n\nto give\n\n\n=== Binet formula proofs ===\nThe Binet formula is\n\nThis can be used to prove Fibonacci identities.\nFor example, to prove that \n  \n    \n      \n        \n          ∑\n          \n            i\n            =\n            1\n          \n          \n            n\n          \n        \n        \n          F\n          \n            i\n          \n        \n        =\n        \n          F\n          \n            n\n            +\n            2\n          \n        \n        −\n        1\n      \n    \n    {\\textstyle \\sum _{i=1}^{n}F_{i}=F_{n+2}-1}\n  \nnote that the left hand side multiplied by \n  \n    \n      \n        \n          \n            5\n          \n        \n      \n    \n    {\\displaystyle {\\sqrt {5}}}\n   becomes\n\nas required, using the facts \n  \n    \n      \n        φ\n        ψ\n        =\n        −\n        1\n      \n    \n    {\\textstyle \\varphi \\psi =-1}\n   and \n  \n    \n      \n        φ\n        −\n        ψ\n        =\n        \n          \n            5\n          \n        \n      \n    \n    {\\textstyle \\varphi -\\psi ={\\sqrt {5}}}\n   to simplify the equations.\n\n\n== Other identities ==\nNumerous other identities can be derived using various methods. Here are some of them:\n\n\n=== Cassini's and Catalan's identities ===\n\nCassini's identity states that\n\nCatalan's identity is a generalization:\n\n\n=== d'Ocagne's identity ===\n\nwhere Ln is the n'th Lucas number. The last is an identity for doubling n; other identities of this type are\n\nby Cassini's identity.\n\nThese can be found experimentally using lattice reduction, and are useful in setting up the special number field sieve to factorize a Fibonacci number.\nMore generally,\nor alternatively\n\nPutting k = 2 in this formula, one gets again the formulas of the end of above section Matrix form.\n\n\n== Generating function ==\nThe generating function of the Fibonacci sequence is the power series\n\nThis series is convergent for \n  \n    \n      \n        \n          |\n        \n        x\n        \n          |\n        \n        <\n        \n          \n            1\n            φ\n          \n        \n        ,\n      \n    \n    {\\displaystyle |x|<{\\frac {1}{\\varphi }},}\n   and its sum has a simple closed-form:\nThis can be proved by using the Fibonacci recurrence to expand each coefficient in the infinite sum:\n\nSolving the equation\n\nfor s(x) results in the closed form.\nThe partial fraction decomposition is given by\n\nwhere \n  \n    \n      \n        φ\n        =\n        \n          \n            \n              1\n              +\n              \n                \n                  5\n                \n              \n            \n            2\n          \n        \n      \n    \n    {\\displaystyle \\varphi ={\\frac {1+{\\sqrt {5}}}{2}}}\n   is the golden ratio and \n  \n    \n      \n        ψ\n        =\n        \n          \n            \n              1\n              −\n              \n                \n                  5\n                \n              \n            \n            2\n          \n        \n      \n    \n    {\\displaystyle \\psi ={\\frac {1-{\\sqrt {5}}}{2}}}\n   is its conjugate.\n\n  \n    \n      \n        −\n        s\n        \n          (\n          \n            −\n            \n              \n                1\n                x\n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle -s\\left(-{\\frac {1}{x}}\\right)}\n   gives the generating function for the negafibonacci numbers, and \n  \n    \n      \n        s\n        (\n        x\n        )\n      \n    \n    {\\displaystyle s(x)}\n   satisfies the functional equation\n\n\n== Reciprocal sums ==\nInfinite sums over reciprocal Fibonacci numbers can sometimes be evaluated in terms of theta functions. For example, the sum of every odd-indexed reciprocal Fibonacci number can be written as \n\nand the sum of squared reciprocal Fibonacci numbers as\n\nIf we add 1 to each Fibonacci number in the first sum, there is also the closed form\n\nand there is a nested sum of squared Fibonacci numbers giving the reciprocal of the golden ratio,\n\nThe sum of all even-indexed reciprocal Fibonacci numbers is\nwith the Lambert series   \n  \n    \n      \n        \n          L\n          (\n          q\n          )\n          :=\n          \n            ∑\n            \n              k\n              =\n              1\n            \n            \n              ∞\n            \n          \n          \n            \n              \n                q\n                \n                  k\n                \n              \n              \n                1\n                −\n                \n                  q\n                  \n                    k\n                  \n                \n              \n            \n          \n          ,\n        \n      \n    \n    {\\displaystyle \\textstyle L(q):=\\sum _{k=1}^{\\infty }{\\frac {q^{k}}{1-q^{k}}},}\n     since   \n  \n    \n      \n        \n          \n            \n              1\n              \n                F\n                \n                  2\n                  k\n                \n              \n            \n          \n          =\n          \n            \n              5\n            \n          \n          \n            (\n            \n              \n                \n                  \n                    ψ\n                    \n                      2\n                      k\n                    \n                  \n                  \n                    1\n                    −\n                    \n                      ψ\n                      \n                        2\n                        k\n                      \n                    \n                  \n                \n              \n              −\n              \n                \n                  \n                    ψ\n                    \n                      4\n                      k\n                    \n                  \n                  \n                    1\n                    −\n                    \n                      ψ\n                      \n                        4\n                        k\n                      \n                    \n                  \n                \n              \n            \n            )\n          \n          .\n        \n      \n    \n    {\\displaystyle \\textstyle {\\frac {1}{F_{2k}}}={\\sqrt {5}}\\left({\\frac {\\psi ^{2k}}{1-\\psi ^{2k}}}-{\\frac {\\psi ^{4k}}{1-\\psi ^{4k}}}\\right).}\n  \nSo the reciprocal Fibonacci constant is\n\nMoreover, this number has been proved irrational by Richard André-Jeannin.The Millin series gives the identity\nwhich follows from the closed form for its partial sums as N tends to infinity:\n\n\n== Primes and divisibility ==\n\n\n=== Divisibility properties ===\nEvery third number of the sequence is even and more generally, every kth number of the sequence is a multiple of Fk. Thus the Fibonacci sequence is an example of a divisibility sequence. In fact, the Fibonacci sequence satisfies the stronger divisibility property\nwhere gcd is the greatest common divisor function.\nIn particular, any three consecutive Fibonacci numbers are pairwise coprime because both \n  \n    \n      \n        \n          F\n          \n            1\n          \n        \n        =\n        1\n      \n    \n    {\\displaystyle F_{1}=1}\n   and \n  \n    \n      \n        \n          F\n          \n            2\n          \n        \n        =\n        1\n      \n    \n    {\\displaystyle F_{2}=1}\n  .  That is, \n\n  \n    \n      \n        gcd\n        (\n        \n          F\n          \n            n\n          \n        \n        ,\n        \n          F\n          \n            n\n            +\n            1\n          \n        \n        )\n        =\n        gcd\n        (\n        \n          F\n          \n            n\n          \n        \n        ,\n        \n          F\n          \n            n\n            +\n            2\n          \n        \n        )\n        =\n        gcd\n        (\n        \n          F\n          \n            n\n            +\n            1\n          \n        \n        ,\n        \n          F\n          \n            n\n            +\n            2\n          \n        \n        )\n        =\n        1\n      \n    \n    {\\displaystyle \\gcd(F_{n},F_{n+1})=\\gcd(F_{n},F_{n+2})=\\gcd(F_{n+1},F_{n+2})=1}\n  for every n.\nEvery prime number p divides a Fibonacci number that can be determined by the value of p modulo 5. If p is congruent to 1 or 4 (mod 5), then p divides Fp − 1, and if p is congruent to 2 or 3 (mod 5), then, p divides Fp + 1. The remaining case is that p = 5, and in this case p divides Fp.\n\nThese cases can be combined into a single, non-piecewise formula, using the Legendre symbol:\n\n\n=== Primality testing ===\nThe above formula can be used as a primality test in the sense that if\n\nwhere the Legendre symbol has been replaced by the Jacobi symbol, then this is evidence that n is a prime, and if it fails to hold, then n is definitely not a prime. If n is composite and satisfies the formula, then n is a Fibonacci pseudoprime.  When m is large – say a 500-bit number – then we can calculate Fm (mod n) efficiently using the matrix form.  Thus\n\nHere the matrix power Am is calculated using modular exponentiation, which can be adapted to matrices.\n\n\n=== Fibonacci primes ===\n\nA Fibonacci prime is a Fibonacci number that is prime. The first few are:\n\n2, 3, 5, 13, 89, 233, 1597, 28657, 514229, ... OEIS: A005478.Fibonacci primes with thousands of digits have been found, but it is not known whether there are infinitely many.Fkn is divisible by Fn, so, apart from F4 = 3, any Fibonacci prime must have a prime index. As there are arbitrarily long runs of composite numbers, there are therefore also arbitrarily long runs of composite Fibonacci numbers.\nNo Fibonacci number greater than F6 = 8 is one greater or one less than a prime number.The only nontrivial square Fibonacci number is 144.  Attila Pethő proved in 2001 that there is only a finite number of perfect power Fibonacci numbers. In 2006, Y. Bugeaud, M. Mignotte, and S. Siksek proved that 8 and 144 are the only such non-trivial perfect powers.1, 3, 21, and 55 are the only triangular Fibonacci numbers, which was conjectured by Vern Hoggatt and proved by Luo Ming.No Fibonacci number can be a perfect number. More generally, no Fibonacci number other than 1 can be multiply perfect, and no ratio of two Fibonacci numbers can be perfect.\n\n\n=== Prime divisors ===\nWith the exceptions of 1, 8 and 144 (F1 = F2, F6 and F12) every Fibonacci number has a prime factor that is not a factor of any smaller Fibonacci number (Carmichael's theorem). As a result, 8 and 144 (F6 and F12) are the only Fibonacci numbers that are the product of other Fibonacci numbers OEIS: A235383.\nThe divisibility of Fibonacci numbers by a prime p is related to the Legendre symbol \n  \n    \n      \n        \n          (\n          \n            \n              \n                p\n                5\n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle \\left({\\tfrac {p}{5}}\\right)}\n   which is evaluated as follows:\n\nIf p is a prime number then\nFor example,\n\nIt is not known whether there exists a prime p such that\n\nSuch primes (if there are any) would be called Wall–Sun–Sun primes.\nAlso, if p ≠  5 is an odd prime number then:\nExample 1. p = 7, in this case p ≡ 3 (mod 4) and we have:\n\nExample 2. p = 11, in this case p ≡ 3 (mod 4) and we have:\n\nExample 3. p = 13, in this case p ≡ 1 (mod 4) and we have:\n\nExample 4. p = 29, in this case p ≡ 1 (mod 4) and we have:\n\nFor odd n, all odd prime divisors of Fn are congruent to 1 modulo 4, implying that all odd divisors of Fn (as the products of odd prime divisors) are congruent to 1 modulo 4.For example,\n\nAll known factors of Fibonacci numbers F(i) for all i < 50000 are collected at the relevant repositories.\n\n\n=== Periodicity modulo n ===\n\nIf the members of the Fibonacci sequence are taken mod n, the resulting sequence is periodic with period at most 6n. The lengths of the periods for various n form the so-called Pisano periods OEIS: A001175. Determining a general formula for the Pisano periods is an open problem, which includes as a subproblem a special instance of the problem of finding the multiplicative order of a modular integer or of an element in a finite field. However, for any particular n, the Pisano period may be found as an instance of cycle detection.\n\n\n== Generalizations ==\n\nThe Fibonacci sequence is one of the simplest and earliest known sequences defined by a recurrence relation, and specifically by a linear difference equation. All these sequences may be viewed as generalizations of the Fibonacci sequence. In particular, Binet's formula may be generalized to any sequence that is a solution of a homogeneous linear difference equation with constant coefficients.\nSome specific examples that are close, in some sense, from Fibonacci sequence include:\n\nGeneralizing the index to negative integers to produce the negafibonacci numbers.\nGeneralizing the index to real numbers using a modification of Binet's formula.\nStarting with other integers. Lucas numbers have L1 = 1, L2 = 3, and Ln = Ln−1 + Ln−2. Primefree sequences use the Fibonacci recursion with other starting points to generate sequences in which all numbers are composite.\nLetting a number be a linear function (other than the sum) of the 2 preceding numbers. The Pell numbers have Pn = 2Pn − 1 + Pn − 2.  If the coefficient of the preceding value is assigned a variable value x, the result is the sequence of Fibonacci polynomials.\nNot adding the immediately preceding numbers. The Padovan sequence and Perrin numbers have P(n) = P(n − 2) + P(n − 3).\nGenerating the next number by adding 3 numbers (tribonacci numbers), 4 numbers (tetranacci numbers), or more. The resulting sequences are known as n-Step Fibonacci numbers.\n\n\n== Applications ==\n\n\n=== Mathematics ===\n\nThe Fibonacci numbers occur in the sums of \"shallow\" diagonals in Pascal's triangle (see binomial coefficient):The generating function can be expanded into\n\nand collecting like terms of \n  \n    \n      \n        \n          x\n          \n            n\n          \n        \n      \n    \n    {\\displaystyle x^{n}}\n  , we have the identity\n\nTo see how the formula is used, we can arrange the sums by the number of terms present:\n\nwhich is \n  \n    \n      \n        \n          \n            \n              (\n            \n            \n              5\n              0\n            \n            \n              )\n            \n          \n        \n        +\n        \n          \n            \n              (\n            \n            \n              4\n              1\n            \n            \n              )\n            \n          \n        \n        +\n        \n          \n            \n              (\n            \n            \n              3\n              2\n            \n            \n              )\n            \n          \n        \n      \n    \n    {\\displaystyle {\\binom {5}{0}}+{\\binom {4}{1}}+{\\binom {3}{2}}}\n  , where we are choosing the positions of k twos from n-k-1 terms.\n\nThese numbers also give the solution to certain enumerative problems, the most common of which is that of counting the number of ways of writing a given number n as an ordered sum of 1s and 2s (called compositions); there are Fn+1 ways to do this (equivalently, it's also the number of domino tilings of the \n  \n    \n      \n        2\n        ×\n        n\n      \n    \n    {\\displaystyle 2\\times n}\n   rectangle). For example, there are F5+1 = F6 = 8 ways one can climb a staircase of 5 steps, taking one or two steps at a time:\n\nThe figure shows that 8 can be decomposed into 5 (the number of ways to climb 4 steps, followed by a single-step) plus 3 (the number of ways to climb 3 steps, followed by a double-step). The same reasoning is applied recursively until a single step, of which there is only one way to climb.\nThe Fibonacci numbers can be found in different ways among the set of binary strings, or equivalently, among the subsets of a given set.\n\nThe number of binary strings of length n without consecutive 1s is the Fibonacci number Fn+2. For example, out of the 16 binary strings of length 4, there are F6 = 8 without consecutive 1s – they are 0000, 0001,  0010, 0100, 0101, 1000, 1001, and 1010.  Equivalently, Fn+2 is the number of subsets S of {1, ..., n} without consecutive integers, that is, those S for which {i, i + 1} ⊈ S for every i. A bijection with the sums to n+1 is to replace 1 with 0 and 2 with 10, and drop the last zero.\nThe number of binary strings of length n without an odd number of consecutive 1s is the Fibonacci number Fn+1. For example, out of the 16 binary strings of length 4, there are F5 = 5 without an odd number of consecutive 1s – they are 0000, 0011, 0110, 1100, 1111. Equivalently, the number of subsets S of {1, ..., n} without an odd number of consecutive integers is Fn+1. A bijection with the sums to n is to replace 1 with 0 and 2 with 11.\nThe number of binary strings of length n without an even number of consecutive 0s or 1s is 2Fn. For example, out of the 16 binary strings of length 4, there are 2F4 = 6 without an even number of consecutive 0s or 1s – they are 0001, 0111, 0101, 1000, 1010, 1110. There is an equivalent statement about subsets.\nYuri Matiyasevich was able to show that the Fibonacci numbers can be defined by a Diophantine equation, which led to his solving Hilbert's tenth problem.\nThe Fibonacci numbers are also an example of a complete sequence. This means that every positive integer can be written as a sum of Fibonacci numbers, where any one number is used once at most.\nMoreover, every positive integer can be written in a unique way as the sum of one or more distinct Fibonacci numbers in such a way that the sum does not include any two consecutive Fibonacci numbers. This is known as Zeckendorf's theorem, and a sum of Fibonacci numbers that satisfies these conditions is called a Zeckendorf representation. The Zeckendorf representation of a number can be used to derive its Fibonacci coding.\nStarting with 5, every second Fibonacci number is the length of the hypotenuse of a right triangle with integer sides, or in other words, the largest number in a Pythagorean triple, obtained from the formula  The sequence of Pythagorean triangles obtained from this formula has sides of lengths (3,4,5), (5,12,13), (16,30,34), (39,80,89), ... The middle side of each of these triangles is the sum of the three sides of the preceding triangle.\nThe Fibonacci cube is an undirected graph with a Fibonacci number of nodes that has been proposed as a network topology for parallel computing.\nFibonacci numbers appear in the ring lemma, used to prove connections between the circle packing theorem and conformal maps.\n\n\n=== Computer science ===\n\nThe Fibonacci numbers are important in computational run-time analysis of Euclid's algorithm to determine the greatest common divisor of two integers: the worst case input for this algorithm is a pair of consecutive Fibonacci numbers.\nFibonacci numbers are used in a polyphase version of the merge sort algorithm in which an unsorted list is divided into two lists whose lengths correspond to sequential Fibonacci numbers – by dividing the list so that the two parts have lengths in the approximate proportion φ. A tape-drive implementation of the polyphase merge sort was described in The Art of Computer Programming.\nA Fibonacci tree is a binary tree whose child trees (recursively) differ in height by exactly 1. So it is an AVL tree, and one with the fewest nodes for a given height — the \"thinnest\" AVL tree. These trees have a number of vertices that is a Fibonacci number minus one, an important fact in the analysis of AVL trees.\nFibonacci numbers are used by some pseudorandom number generators.\nFibonacci numbers arise in the analysis of the Fibonacci heap data structure.\nA one-dimensional optimization method, called the Fibonacci search technique, uses Fibonacci numbers.\nThe Fibonacci number series is used for optional lossy compression in the IFF 8SVX audio file format used on Amiga computers. The number series compands the original audio wave similar to logarithmic methods such as μ-law.\nThey are also used in planning poker, which is a step in estimating in software development projects that use the Scrum methodology.\n\n\n=== Nature ===\n\nFibonacci sequences appear in biological settings, such as branching in trees, arrangement of leaves on a stem, the fruitlets of a pineapple, the flowering of artichoke, an uncurling fern and the arrangement of a pine cone, and the family tree of honeybees. Kepler pointed out the presence of the Fibonacci sequence in nature, using it to explain the (golden ratio-related) pentagonal form of some flowers. Field daisies most often have petals in counts of Fibonacci numbers. In 1754, Charles Bonnet discovered that the spiral phyllotaxis of plants were frequently expressed in Fibonacci number series.Przemysław Prusinkiewicz advanced the idea that real instances can in part be understood as the expression of certain algebraic constraints on free groups, specifically as certain Lindenmayer grammars.\n\nA model for the pattern of florets in the head of a sunflower was proposed by Helmut Vogel in 1979.  This has the form\n\nwhere n is the index number of the floret and c is a constant scaling factor; the florets thus lie on Fermat's spiral. The divergence angle, approximately 137.51°, is the golden angle, dividing the circle in the golden ratio.  Because this ratio is irrational, no floret has a neighbor at exactly the same angle from the center, so the florets pack efficiently.  Because the rational approximations to the golden ratio are of the form F(j):F(j + 1), the nearest neighbors of floret number n are those at n ± F(j) for some index j, which depends on r, the distance from the center.  Sunflowers and similar flowers most commonly have spirals of florets in clockwise and counter-clockwise directions in the amount of adjacent Fibonacci numbers, typically counted by the outermost range of radii.Fibonacci numbers also appear in the pedigrees of idealized honeybees, according to the following rules:\n\nIf an egg is laid by an unmated female, it hatches a male or drone bee.\nIf, however, an egg was fertilized by a male, it hatches a female.Thus, a male bee always has one parent, and a female bee has two. If one traces the pedigree of any male bee (1 bee), he has 1 parent (1 bee), 2 grandparents, 3 great-grandparents, 5 great-great-grandparents, and so on. This sequence of numbers of parents is the Fibonacci sequence. The number of ancestors at each level, Fn, is the number of female ancestors, which is Fn−1, plus the number of male ancestors, which is Fn−2.  This is under the unrealistic assumption that the ancestors at each level are otherwise unrelated.\n\nIt has been noticed that the number of possible ancestors on the human X chromosome inheritance line at a given ancestral generation also follows the Fibonacci sequence. A male individual has an X chromosome, which he received from his mother, and a Y chromosome, which he received from his father. The male counts as the \"origin\" of his own X chromosome (\n  \n    \n      \n        \n          F\n          \n            1\n          \n        \n        =\n        1\n      \n    \n    {\\displaystyle F_{1}=1}\n  ), and at his parents' generation, his X chromosome came from a single parent (\n  \n    \n      \n        \n          F\n          \n            2\n          \n        \n        =\n        1\n      \n    \n    {\\displaystyle F_{2}=1}\n  ). The male's mother received one X chromosome from her mother (the son's maternal grandmother), and one from her father (the son's maternal grandfather), so two grandparents contributed to the male descendant's X chromosome (\n  \n    \n      \n        \n          F\n          \n            3\n          \n        \n        =\n        2\n      \n    \n    {\\displaystyle F_{3}=2}\n  ). The maternal grandfather received his X chromosome from his mother, and the maternal grandmother received X chromosomes from both of her parents, so three great-grandparents contributed to the male descendant's X chromosome (\n  \n    \n      \n        \n          F\n          \n            4\n          \n        \n        =\n        3\n      \n    \n    {\\displaystyle F_{4}=3}\n  ). Five great-great-grandparents contributed to the male descendant's X chromosome (\n  \n    \n      \n        \n          F\n          \n            5\n          \n        \n        =\n        5\n      \n    \n    {\\displaystyle F_{5}=5}\n  ), etc. (This assumes that all ancestors of a given descendant are independent, but if any genealogy is traced far enough back in time, ancestors begin to appear on multiple lines of the genealogy, until eventually a population founder appears on all lines of the genealogy.)\nThe pathways of tubulins on intracellular microtubules arrange in patterns of 3, 5, 8 and 13.\n\n\n=== Other ===\nIn optics, when a beam of light shines at an angle through two stacked transparent plates of different materials of different refractive indexes, it may reflect off three surfaces: the top, middle, and bottom surfaces of the two plates. The number of different beam paths that have k reflections, for k > 1, is the \n  \n    \n      \n        k\n      \n    \n    {\\displaystyle k}\n  th Fibonacci number. (However, when k = 1, there are three reflection paths, not two, one for each of the three surfaces.)\nFibonacci retracement levels are widely used in technical analysis for financial market trading.\nSince the conversion factor 1.609344 for miles to kilometers is close to the golden ratio, the decomposition of distance in miles into a sum of Fibonacci numbers becomes nearly the kilometer sum when the Fibonacci numbers are replaced by their successors. This method amounts to a radix 2 number register in golden ratio base φ being shifted. To convert from kilometers to miles, shift the register down the Fibonacci sequence instead.\nThe measured values of voltages and currents in the infinite resistor chain circuit (also called the resistor ladder or infinite series-parallel circuit) follow the Fibonacci sequence. The intermediate results of adding the alternating series and parallel resistances yields fractions composed of consecutive Fibonacci numbers. The equivalent resistance of the entire circuit equals the golden ratio.\nBrasch et al. 2012 show how a generalised Fibonacci sequence also can be connected to the field of economics.  In particular, it is shown how a generalised Fibonacci sequence enters the control function of finite-horizon dynamic optimisation problems with one state and one control variable. The procedure is illustrated in an example often referred to as the Brock–Mirman economic growth model.\nMario Merz included the Fibonacci sequence in some of his artworks beginning in 1970.\nJoseph Schillinger (1895–1943) developed a system of composition which uses Fibonacci intervals in some of its melodies; he viewed these as the musical counterpart to the elaborate harmony evident within nature. See also Golden ratio § Music.\n\n\n== See also ==\nThe Fibonacci Association – Organization for research on Fibonacci numbers\nFibonacci numbers in popular culture – Wikipedia list article\nFibonacci word – Binary sequence from Fibonacci recurrence\nRandom Fibonacci sequence – Randomized mathematical sequence based upon the Fibonacci sequence\nWythoff array – Infinite matrix of integers derived from the Fibonacci sequence\n\n\n== References ==\nFootnotes\n\nCitations\n\n\n=== Works cited ===\nBall, Keith M (2003), \"8: Fibonacci's Rabbits Revisited\", Strange Curves, Counting Rabbits, and Other Mathematical Explorations, Princeton, NJ: Princeton University Press, ISBN 978-0-691-11321-0.\nBeck, Matthias; Geoghegan, Ross (2010), The Art of Proof: Basic Training for Deeper Mathematics, New York: Springer, ISBN 978-1-4419-7022-0.\nBóna, Miklós (2011), A Walk Through Combinatorics (3rd ed.), New Jersey: World Scientific, ISBN 978-981-4335-23-2.\nBorwein, Jonathan M.; Borwein, Peter B. (July 1998), Pi and the AGM: A Study in Analytic Number Theory and Computational Complexity, Wiley, pp. 91–101, ISBN 978-0-471-31515-5\nLemmermeyer, Franz (2000), Reciprocity Laws: From Euler to Eisenstein, Springer Monographs in Mathematics, New York: Springer, ISBN 978-3-540-66957-9.\nLivio, Mario (2003) [2002], The Golden Ratio: The Story of Phi, the World's Most Astonishing Number (First trade paperback ed.), New York City: Broadway Books, ISBN 0-7679-0816-3\nLucas, Édouard (1891), Théorie des nombres (in French), vol. 1, Paris: Gauthier-Villars.\nSigler, L. E. (2002), Fibonacci's Liber Abaci: A Translation into Modern English of Leonardo Pisano's Book of Calculation, Sources and Studies in the History of Mathematics and Physical Sciences, Springer, ISBN 978-0-387-95419-6\n\n\n== External links ==\nPeriods of Fibonacci Sequences Mod m at MathPages\nScientists find clues to the formation of Fibonacci spirals in nature\nFibonacci Sequence on In Our Time at the BBC\n\"Fibonacci numbers\", Encyclopedia of Mathematics, EMS Press, 2001 [1994]\nOEIS sequence A000045 (Fibonacci numbers)", "links": ["1/2 + 1/4 + 1/8 + 1/16 + ⋯", "1/2 − 1/4 + 1/8 − 1/16 + ⋯", "1/4 + 1/16 + 1/64 + 1/256 + ⋯", "1 + 1 + 1 + 1 + ⋯", "1 + 2 + 3 + 4 + ⋯", "1 + 2 + 4 + 8 + ⋯", "1 − 1 + 2 − 6 + 24 − 120 + ...", "1 − 2 + 3 − 4 + ⋯", "1 − 2 + 4 − 8 + ⋯", "8SVX", "AVL tree", "Abraham de Moivre", "Absolute convergence", "Abundant number", "Academic Press", "Achilles number", "Additive persistence", "Aliquot sequence", "Almost perfect number", "Almost prime", "Alternating series", "American Museum of Natural History", "Amicable numbers", "Amiga", "Analysis of algorithms", "Analytic Combinatorics", "ArXiv (identifier)", "Arbitrarily large", "Aristid Lindenmayer", "Arithmetic dynamics", "Arithmetic function", "Arithmetic number", "Arithmetic progression", "Aronson's sequence", "Artichoke", "Asymptotic analysis", "Automorphic number", "BBC", "Ban number", "Bell number", "Betrothed numbers", "Bharata Muni", "Bibcode (identifier)", "Bijection", "Binary number", "Binary numeral system", "Binary tree", "Binomial coefficient", "Blum integer", "Cake number", "Canadian Mathematical Bulletin", "Cardinality", "Carmichael's theorem", "Carmichael number", "Cassini's identity", "Cassini and Catalan identities", "Catalan number", "Catalan pseudoprime", "Cauchy sequence", "Centered cube number", "Centered decagonal number", "Centered dodecahedral number", "Centered heptagonal number", "Centered hexagonal number", "Centered icosahedral number", "Centered nonagonal number", "Centered octagonal number", "Centered octahedral number", "Centered pentagonal number", "Centered polygonal number", "Centered polyhedral number", "Centered square number", "Centered tetrahedral number", "Centered triangular number", "Charles Bonnet", "Circle packing theorem", "Circular arc", "Closed-form expression", "Colossally abundant number", "Combinatorial proof", "Companding", "Complete sequence", "Composite number", "Composition (combinatorics)", "Comptes Rendus de l'Académie des Sciences, Série I", "Conditional convergence", "Conformal map", "Congruent number", "Conjugate (square roots)", "Constant-recursive sequence", "Continued fraction", "Convergent series", "Conversion of units", "Coprime integers", "Cube (algebra)", "Cullen number", "Cycle detection", "Cyclic number", "Cyclic number (group theory)", "Daniel Bernoulli", "Decagonal number", "Dedekind number", "Deficient number", "Delannoy number", "Descartes number", "Determinant", "Diagonalizable matrix", "Difference equation", "Digit-reassembly number", "Digit sum", "Digital root", "Diophantine equation", "Dirichlet series", "Divergence of the sum of the reciprocals of the primes", "Divergent series", "Divisibility sequence", "Divisor", "Divisor function", "Dodecagonal number", "Dodecahedral number", "Doi (identifier)", "Domino tiling", "Donald Knuth", "Double Mersenne number", "Drone (bee)", "Dudeney number", "Edmund Landau", "Edsger W. Dijkstra", "Eigendecomposition", "Eigenvalue", "Eigenvector", "Eighth power", "Elliptic pseudoprime", "Encyclopedia of Mathematics", "Equidigital number", "Erdős–Nicolas number", "Erdős–Woods number", "Eric W. Weisstein", "Euclid number", "Euclidean algorithm", "Euler's totient function", "Euler number", "Euler pseudoprime", "Eulerian number", "Euler–Jacobi pseudoprime", "European Mathematical Society", "Evil number", "Exponentiation", "Exponentiation by squaring", "Extravagant number", "Factorial", "Factorion", "Factorization", "Fermat's spiral", "Fermat number", "Fermat pseudoprime", "Fern", "Fibonacci", "Fibonacci Quarterly", "Fibonacci Sequence", "Fibonacci Sequence (ensemble)", "Fibonacci coding", "Fibonacci cube", "Fibonacci heap", "Fibonacci number", "Fibonacci numbers in popular culture", "Fibonacci polynomials", "Fibonacci prime", "Fibonacci retracement", "Fibonacci search technique", "Fibonacci word", "Fifth power (algebra)", "Figurate number", "Finite field", "Floor function", "Floret", "Formal power series", "Fortunate number", "Founder effect", "Four-dimensional space", "Fourier series", "Fourth power", "Free group", "Friedman number", "Friendly number", "Frobenius pseudoprime", "Frugal number", "Functional equation", "Fuss–Catalan number", "Generalizations of Fibonacci numbers", "Generalized hypergeometric series", "Generating function", "Generating series", "Generation of primes", "Geometric progression", "Giuga number", "Golden-section search", "Golden angle", "Golden ratio", "Golden ratio base", "Golden rectangle", "Golden rhombus", "Golden spiral", "Golden triangle (mathematics)", "Grandi's series", "Graphemics", "Greatest common divisor", "Greedy algorithm for Egyptian fractions", "Happy number", "Harmonic divisor number", "Harmonic progression (mathematics)", "Harmonic series (mathematics)", "Harshad number", "Hdl (identifier)", "Hemachandra", "Hemiperfect number", "Heptagonal number", "Hexagonal number", "Highly abundant number", "Highly composite number", "Highly cototient number", "Highly totient number", "Hilbert's tenth problem", "Hilbert number", "Historia Mathematica", "Hypergeometric function", "Hypergeometric function of a matrix argument", "Hyperperfect number", "ISBN (identifier)", "ISSN (identifier)", "Icosahedral number", "Idoneal number", "In Our Time (radio series)", "Indian mathematics", "Infinite arithmetic series", "Integer sequence", "Interchange File Format", "Introduction to Circle Packing", "Irrational number", "JSTOR (identifier)", "Jacobi symbol", "Jacobsthal number", "Jacques Philippe Marie Binet", "Johannes Kepler", "Jonathan Borwein", "Joseph Schillinger", "Kaprekar's routine", "Kaprekar number", "Keith number", "Kepler", "Kepler triangle", "Knödel number", "L-system", "Lah number", "Lambert series", "Lattice reduction", "Laurent series", "Lauricella hypergeometric series", "Lazy caterer's sequence", "Legendre symbol", "Leonardo number", "Leucanthemum vulgare", "Leyland number", "Liber Abaci", "Linear difference equation", "List of OEIS sequences", "List of things named after Fibonacci", "Lobb number", "Loeschian number", "Lossy compression", "Lucas number", "Lucas pseudoprime", "Lucas sequence", "Lucas–Carmichael number", "Lucky number", "Lucky numbers of Euler", "Lychrel number", "MR (identifier)", "MacTutor History of Mathematics archive", "Mario Livio", "Mario Merz", "Martin Gardner", "MathWorld", "Mathematical induction", "Matiyasevich's theorem", "Meertens number", "Memoization", "Merge sort", "Mersenne prime", "Metallic mean", "Microtubule", "Miklós Bóna", "Modular arithmetic", "Modular exponentiation", "Modular hypergeometric series", "Monotone sequence", "Monotonic", "Mora (linguistics)", "Motzkin number", "Multiplicative digital root", "Multiplicative order", "Multiplicative persistence", "Multiply perfect number", "Narayana number", "Narcissistic number", "National Central Library (Florence)", "Natural language", "Natural number", "Natya Shastra", "Neil Sloane", "Network topology", "Nonagonal number", "Noncototient", "Nonhypotenuse number", "Nontotient", "Northeastern University", "Numeral system", "Numerical digit", "Octagonal number", "Octahedral number", "Odious number", "On-Line Encyclopedia of Integer Sequences", "Optics", "Ordered Bell number", "Ordinary generating function", "P-adic numbers", "PMID (identifier)", "Padovan sequence", "Palindromic number", "Pancake sorting", "Pandigital number", "Parallel computing", "Parasitic number", "Partial fraction decomposition", "Partition (number theory)", "Pascal's triangle", "Patterns in nature", "Paulo Ribenboim", "Pell number", "Pentagonal number", "Pentatope number", "Perfect digit-to-digit invariant", "Perfect digital invariant", "Perfect number", "Perfect power", "Perfect totient number", "Periodic sequence", "Permutation", "Pernicious number", "Perrin number", "Persistence of a number", "Peter Borwein", "Phyllotaxis", "Piecewise", "Pine cone", "Pineapple", "Pingala", "Pisano period", "Pisot–Vijayaraghavan number", "Planning poker", "Polite number", "Polydivisible number", "Polygonal number", "Polyhedral number", "Polyphase merge sort", "Power of 10", "Power of three", "Power of two", "Power series", "Powerful number", "Practical number", "Primary pseudoperfect number", "Prime factor", "Prime number", "Prime omega function", "Prime power", "Primefree sequence", "Primeval number", "Primitive abundant number", "Primorial", "Princeton University Press", "Proceedings of the USSR Academy of Sciences", "Processor register", "Pronic number", "Proth number", "Przemyslaw Prusinkiewicz", "Przemysław Prusinkiewicz", "Pseudoprime", "Pseudorandom number generators", "Puiseux series", "Pyramidal number", "Pythagorean triple", "Quadratic equation", "Quadratic formula", "Quasiperfect number", "Rabbit", "Radix", "Random Fibonacci sequence", "Random House", "Reciprocal Fibonacci constant", "Recurrence relation", "Recursion", "Recursion (computer science)", "Refactorable number", "Refractive index", "Regular number", "Repdigit", "Repunit", "Resistor ladder", "Richard André-Jeannin", "Riemann's differential equation", "Riemann zeta function", "Riesel number", "Right triangle", "Ring lemma", "Rough number", "Rounding", "S2CID (identifier)", "Sanskrit prosody", "Schillinger System", "Schröder number", "Schröder–Hipparchus number", "Scrum (software development)", "Self-descriptive number", "Self number", "Semiperfect number", "Semiprime", "Sequence", "Series (mathematics)", "Seventh power", "Sierpiński number", "Sieve theory", "Silver ratio", "Sixth power", "Smarandache–Wellin number", "Smith number", "Smooth number", "Sociable numbers", "Somer–Lucas pseudoprime", "Sorting algorithm", "Sorting number", "Sparsely totient number", "Special number field sieve", "Specifiable combinatorial class", "Sphenic number", "Springer Science+Business Media", "Square number", "Square pyramidal number", "Square triangular number", "Squared triangular number", "Star number", "Stella octangula number", "Stirling numbers of the first kind", "Stirling numbers of the second kind", "Strictly non-palindromic number", "String (computer science)", "Strobogrammatic number", "Strong pseudoprime", "Størmer number", "Sublime number", "Subset", "Sum-product number", "Sunflower", "Super-Poulet number", "Superabundant number", "Superior highly composite number", "Superperfect number", "Symbolic method (combinatorics)", "Taylor series", "Technical analysis", "Telescoping series", "Tetrahedral number", "Thabit number", "The Art of Computer Programming", "The Book of Squares", "The Fibonacci Association", "The Fibonacci Quarterly", "The University of Utah", "Theta function", "Theta hypergeometric series", "Three-dimensional space", "Transposable integer", "Tree height", "Triangular number", "Trigonometric series", "Trimorphic number", "Truncation", "Tubulin", "Two-dimensional space", "Ulam number", "Undirected graph", "Undulating number", "Uniform convergence", "Unimodular matrix", "University of Surrey", "Untouchable number", "Vampire number", "Verner Emil Hoggatt Jr.", "Virahanka", "Wall–Sun–Sun prime", "Wieferich prime", "Wilson prime", "Wolstenholme number", "Wolstenholme prime", "Woodall number", "Wythoff array", "X chromosome", "Y chromosome", "Yellow chamomile", "Yuri Matiyasevich", "Zeckendorf's theorem", "Zeisel number", "Édouard Lucas", "Μ-law"]}