{"url": "https://en.wikipedia.org/wiki/Fibre_cement", "title": "Fibre cement", "summary": "Fibre cement is a composite building and construction material, used mainly in roofing and facade products because of its strength and durability. One common use is in fiber cement siding on buildings.\n\n", "content": "Fibre cement is a composite building and construction material, used mainly in roofing and facade products because of its strength and durability. One common use is in fiber cement siding on buildings.\n\n\n== Material description ==\nThe term \"cement\" originates from the Latin word \"Caementum\", which signifies chopped stone. Cement describes a substance which will react chemically with water and develop into a material hard as stone.\nIn fibre cement there is a fibre reinforcement, which contributes to making the fibre-cement material even stronger. Together with a carefully planned production process, fibre cement makes it possible to develop strong and long lasting construction materials. Today fibre cement is considered as a material physically suited for construction products such as cladding and roofing. It is primarily due to its function, performance and commercial value.Fibre cement flat sheet classified, by accredited laboratories, as Category A according to BS EN 12467: 2004 Fibre-cement flat sheets – Product specification and test methods are sheets which are intended for applications where they may be subject to heat, high moisture and severe frost. While the best possible Reaction to Fire Classifications are A1 (construction applications) and A1Fl (flooring applications) respectively, both of which mean \"non-combustible\" according to EN 13501-1: 2007, as classified by a notified laboratory in Europe, some fibre cement boards only come with Fire Classification of A2 (limited combustibility) or even lower classifications, if they are tested at all.\n\n\n== Material history ==\nFibre-reinforced cement-products were invented in the late 19th century by the Austrian Ludwig Hatschek. He mixed 90% cement and 10% asbestos fibres with water and ran it through a cardboard machine, forming strong thin sheets. Originally, the reinforcing fibres were of asbestos and the material was commonly used as siding in house buildings due to its low cost, fire-resistance, water tightness, light weight, and other useful properties.\nIn the 1970s it became widely acknowledged that exposure to asbestos is harmful to health, being directly related to a number of life-threatening diseases including, asbestosis, pleural mesothelioma (lung) and peritoneal mesothelioma (abdomen). Consequently, asbestos use was progressively prohibited and safer fibre alternatives were developed, principally cellulose, to allow continued exploitation of the widely acknowledged advantages of fibre cement.\nFibre cement products were amongst the last materials available to have contained large quantities of asbestos. The asbestos fibres are intimately bound to the cement matrix and were considered to be immobilized in the cement and therefore less prone to be released in the environment, suspended in the air, and inhaled in the lung than in other materials or applications, such as thermal insulation or flocking, in which loose asbestos fibres were used. However, asbestos fibres are inevitably released during machining of the fibre-cement products, and by long-term erosion of the material after it has been exposed to atmospheric weathering and wind, which causes the cement to degrade. Occupational health concerns and the protection of workers in the fibre-cement factories have finally led to the progressive elimination of asbestos from these products.Users of fibre cement boards who seek high performance and reliable green building materials should source products that have been tested by accredited laboratories and proven to be 100% free from asbestos or other harmful materials such as sepiolite, inorganic fibre or formaldehyde.\n\n\n== Material usage ==\nFibre cement is a main component of long-lasting building materials. The main application areas are roofing and cladding. The list below gives some common applications.\nInternal cladding:\n\nWet room applications – tile backer boards\nFire protection\nPartition walls\nWindow sills\nCeilings and floorsExternal cladding:\n\nFlat sheets as base and/or architectural facing\nFlat sheets for e.g. wind shields, wall copings, and soffits\nCorrugated sheets\nSlates as architectural full and partial facing\nUnderroof\nPlanksRoofing:\n\nSlates\nCorrugated sheetsAlong with the above applications, fibre cement boards can be used for a Mezzanine floor, Facade, External fins, Deck covering, Roof Underlay, Acoustix etc.\nFibre-cement products have found wide usage in various sectors of construction: industrial, agricultural, domestic and residential buildings, mainly in roofing and cladding applications, for new constructions and refurbishment projects.\n\n\n== References ==\n\n\n== External links ==\nFibre Cement Guide", "links": ["Aerosol", "Antiques restoration", "Asbestos", "Asbestosis", "Building material", "Cardboard (paper product)", "Ceiling", "Cellulose fiber", "Cement", "Cement board", "Chemical reaction", "Cladding (construction)", "Concrete degradation", "Construction materials", "Facade", "Factory", "Fiber cement siding", "Fibre", "Fire protection", "Fireproofing", "Flocking (texture)", "Floor", "Formaldehyde", "Health", "Inhalation", "Latin", "Ludwig Hatschek", "Lung", "Machining", "Occupational health", "Partition wall", "Peritoneal mesothelioma", "Plank (wood)", "Pleural", "Roofing material", "Sepiolite", "Siding (construction)", "Slate", "Strength of materials", "Thermal insulation", "Tile", "Weathering", "Wind", "Window sill"]}