{"url": "https://en.wikipedia.org/wiki/Florence_Frances_Huberwald", "title": "Florence Frances Huberwald", "summary": "Florence Frances Huberwald was an American singer, teacher, suffragist, and national leader of the women's movement. She was a charter member of the Woman Suffrage Party; and the co-founder and associate president of the New Orleans College of Music.", "content": "Florence Frances Huberwald was an American singer, teacher, suffragist, and national leader of the women's movement. She was a charter member of the Woman Suffrage Party; and the co-founder and associate president of the New Orleans College of Music.\n\n\n== Early life and education ==\nFlorence Frances Huberwald was born in New Orleans. Her maternal grandfather was from Connecticut and her grandmother was a Spanish native of St. Augustine, Florida. Her father's family were of German descent. Her family was connected with the history of New Orleans for many years. Her aunt, Caroline Hubbard, was the most notable and progressive principal of the New Orleans High School, of her time.\nHuberwald was educated at the Sylvester-Larned Institute for Young Ladies. She studied vocal music in New York City; in Paris, under Anna La Grange, the vocalist; and in London.\n\n\n== Career ==\n\nHuberwald's first employment was that of teacher in a public school. She made a success of this, and in 1894, went to the legislature to push the measure for the back pay of teachers.One of the social successes of her life was upon the occasion of her singing in a drawing room in Paris. The Louisiana State concert was said to be the grandest concert given at the Cotton States and International Exposition (1895). Huberwald had entire charge of the vocal part of the program that reflected so much credit upon Louisiana. Her speech at the 1895 General Federation of Women's Clubs convention was notable. She was the only singer who represented New Orleans at the Cotton States and International Exposition, and received a perfect ovation. Her contralto voice had a range of over two octaves, her enunciation was clear, and her method good. The volume of her voice was so great that it filled the largest hall or theatre. It was particularly fitted for star parts in grand opera, a heritage from her mother, a notable church singer of New Orleans. Besides being associate president of the New Orleans College of Music, founded by Mrs. Samuel and herself, she was vocal instructor at Sophie Wright's Institute. She believed in the Italian method of vocal culture, and was accounted the best ballad singer of New Orleans.Huberwald served as president of the Teachers' Benevolent Association; Portia (suffrage) Club; and Equal Rights Party, Louisiana. She was a prominent member of the Woman's Club, did active work for the furtherance of women's progress, and was a charter member of the Woman Suffrage Party. An activist, she was the head of the local dress-reform movement in New Orleans.\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Attribution ===\n This article incorporates text from this source, which is in the public domain:  Brown, James Duff (1886). Biographical Dictionary of Musicians: With a Bibliography of English Writings on Music (Public domain ed.). A. Gardner. p. 371.\n This article incorporates text from this source, which is in the public domain:  The Bureau (1917). Social Service Review. Vol. 5–6. The Bureau.\n This article incorporates text from this source, which is in the public domain:  Mount, May W. (1896). Some Notables of New Orleans: Biographical and Descriptive Sketches of the Artists of New Orleans, and Their Work (Public domain ed.). May W. Mount.\n This article incorporates text from this source, which is in the public domain:  The Music Magazine-musical Courier (1916). The Music Magazine-musical Courier. Vol. 72 (Public domain ed.). The Music Magazine-musical Courier.\n\n\n=== Bibliography ===\nAddams, Jane; Stanton, Elizabeth Cady; Harper, Ida Husted (21 March 2018). The Women of the Suffrage Movement: Autobiographies & Biographies of the Most Influential Suffragettes. Musaicum Books. ISBN 978-80-272-4281-8.\nBaron, John H. (9 December 2013). Concert Life in Nineteenth-Century New Orleans: A Comprehensive Reference. Louisiana State Press. ISBN 978-0-8071-5083-2.", "links": ["Anna La Grange", "Connecticut", "Contralto", "Cotton States and International Exposition", "Drawing room", "Elocution", "General Federation of Women's Clubs", "ISBN (identifier)", "London", "Louisiana", "New Orleans", "New York City", "Octave", "Opera", "Paris", "Public domain", "Singing", "St. Augustine, Florida", "Sylvester-Larned Institute for Young Ladies", "Woman Suffrage Party", "Women's suffrage in the United States"]}