{"url": "https://en.wikipedia.org/wiki/Flowers_of_Evil_(Police_Woman)", "title": "Flowers of Evil (Police Woman)", "summary": "\"Flowers of Evil\" is a 1974 episode of the American police procedural television series Police Woman. The episode features Sgt. Suzanne \"Pepper\" Anderson (Angie Dickinson) going undercover at a nursing home to investigate a murder. She uncovers a trio of lesbians who are robbing and murdering their elderly residents. The episode, the eighth of the first season, originally aired on November 8, 1974.\nGay and lesbian organizations protested \"Flowers of Evil\", which producers said was based on a real case, for its portrayal of the killers as lesbians and for the stereotypical presentation of lesbianism. The episode aired a month after a similarly controversial episode of Marcus Welby, M.D. on ABC garnered national protests. Mindful of that recent controversy, NBC delayed the episode and ordered some changes, but they were not enough to allay gay and lesbian concern over network television's negative portrayal of homosexuality. After negotiations, NBC agreed not to rerun the episode.", "content": "\"Flowers of Evil\" is a 1974 episode of the American police procedural television series Police Woman. The episode features Sgt. Suzanne \"Pepper\" Anderson (Angie Dickinson) going undercover at a nursing home to investigate a murder. She uncovers a trio of lesbians who are robbing and murdering their elderly residents. The episode, the eighth of the first season, originally aired on November 8, 1974.\nGay and lesbian organizations protested \"Flowers of Evil\", which producers said was based on a real case, for its portrayal of the killers as lesbians and for the stereotypical presentation of lesbianism. The episode aired a month after a similarly controversial episode of Marcus Welby, M.D. on ABC garnered national protests. Mindful of that recent controversy, NBC delayed the episode and ordered some changes, but they were not enough to allay gay and lesbian concern over network television's negative portrayal of homosexuality. After negotiations, NBC agreed not to rerun the episode.\n\n\n== Plot ==\nAn elderly woman is found strangled to death. The investigation leads police to the Golden Years Retirement Home. The home is owned and operated by three lesbians, the butch Mame Dorn, Gladys Conway, and Gladys's femme lover, Janet Richards. Police Sergeant \"Pepper\" Anderson goes undercover in the home as a nurse and discovers that the women are robbing their elderly residents and one of them murdered the woman, Kathleen O'Shaunessy.  Under Pepper's questioning, Janet confesses to the murder, but when Pepper reveals that her college roommate was in love with her so Pepper understands \"what a love like yours can do to a person\", Janet admits that she confessed to protect Gladys, who actually committed the murder.\n\n\n== Cast ==\nAngie Dickinson as Sgt. Suzanne \"Pepper\" Anderson\nEarl Holliman as Sgt. Bill Crowley\nCharles Dierkop as Royster\nEd Bernard as Styles\nLaraine Stephens as Gladys Conway\nFay Spain as Mame Dorn\nLynn Loring as Janet Richards\nMeg Wyllie as Kathleen O'Shaunessy\n\n\n== Production and controversy ==\nAccording to executive producer David Gerber, \"Flowers of Evil\" was based on a real case in which three lesbians ran a nursing home and stole from their residents. \"The characters just happen to be lesbians. It has nothing to do with the crime, it's simply what was true in the factual case.\" The intention was to focus on the issue of elder abuse. Fay Spain, who played  Mame, reported that producers advised her to cut her hair very short, bind her breasts, speak with a harsh, raspy voice, and change her walk and mannerisms to appear masculine.\n\nThe episode was originally scheduled to air on October 22. On October 8, ABC aired \"The Outrage\", an episode of Marcus Welby, M.D. in which a male teacher sexually assaults a male student. Gay and lesbian activists, coordinated by the National Gay Task Force, staged nationwide protests, persuading several advertisers to pull their commercials, and convincing 17 affiliates not to air it. NBC removed \"Flowers of Evil\" from the schedule and had it re-edited. Although the network denied that the Welby protests were a factor in its decision, NGTF spokesperson Ronald Gold said \"It's our view that because we showed a little muscle with ABC, NBC took it off the air.\" Series producer Douglas Benton described the editing as \"mostly cosmetic cutting\" which according to Gerber included removing \"brief scenes of overt touching, stares, and verbal references to the relationship of the three women\". NBC ordered further changes, including the removal of any mention of the word \"lesbian\" (although a character's describing Mame as looking like \"she should be driving a diesel truck\" was left in).\n\nGay and lesbian activists were slow to react to \"Flowers of Evil\", because unlike the Welby episode they had not read the script in advance. Whereas with Welby activists were able to mobilize a grassroots national campaign, for this episode activists were only able to alert key cities. There were some protests the day the episode aired. Activists criticized the episode for being another in a series of portrayals of lesbians as villains in the absence of positive portrayals and derided Mame, Gladys and Janet as \"The Butch, the Bitch and the Femme\".Eleven days after \"Flowers of Evil\" aired, lesbian activists operating under the name Lesbian Feminist Liberation staged a zap at NBC's New York City headquarters. Ten women entered the building in pairs at 15-minute intervals, traveling by elevator to different floors before converging on the Standards and Practices offices. Advised that vice president Herminio Traviesas would not return to the office until the following week, demonstrators announced their intention to wait until he returned. Around 75 women demonstrated in front of the building. The following morning, half of the women left, along with the children of the lead protester. The remaining protesters unfurled a 20-foot-long banner from the balcony of Traviesas's office reading \"LESBIANS PROTEST NBC\". Street-level picketers and they chanted slogans such as \"NBC works against lesbians\" and \"Lesbians are sitting in\". The demonstrators hoped to attract both network news coverage and arrests. When they realized neither was forthcoming, they left the building. While the networks ignored the story, it was picked up by local media and the wire services.\n\n\n== Critical response ==\nTV Guide called \"Flowers of Evil\" \"the single most homophobic show to date\". Writing for United Press International, critic Frank Swertlow focused less on the episode and more on the protesters. While recognizing the validity of complaints about how minority groups are portrayed on television, Swertlow concludes that by \"cav[ing] in\" to demands of \"pressure groups\", network television \"could take a step backward. There would never be any gutsy documentaries or dramas, just mush. The TV industry, which has ducked issues before, would have the backbone of a wet noodle.\"Activists continued negotiating with the networks about LGBT portrayals on television. In 1975, NBC agreed not to rebroadcast the episode. \"Flowers of Evil\" was withheld from syndication for at least 10 years, but it is available on the season 1 DVD box set.\n\n\n== See also ==\nList of 1970s American television episodes with LGBT themes\n\"The Other Martin Loring\" - another Marcus Welby episode that faced protests for its negative gay portrayal\n\n\n== References ==\n\n\n== References ==\nAlwood, Edward (1996). Straight News. New York, Columbia University Press. ISBN 0-231-08437-4.\nCapsuto, Steven (2000). Alternate Channels: The Uncensored Story of Gay and Lesbian Images on Radio and Television. Ballantine Books. ISBN 0-345-41243-5.\nTropiano, Stephen (2002). The Prime Time Closet: A History of Gays and Lesbians on TV. Hal Leonard Corporation. ISBN 1-55783-557-8.\n\n\n== External links ==\n\"Flowers of Evil\" at the Internet Movie Database\n\"Flowers of Evil\" \"minisode\" at Metacafé", "links": ["Alexander Singer", "American Broadcasting Company", "Angie Dickinson", "Broadcast syndication", "Butch and femme", "Charles Dierkop", "David Gerber", "Earl Holliman", "Ed Bernard", "Elder abuse", "Fay Spain", "Frank Swertlow", "Gay", "Grassroots", "Herminio Traviesas", "Homosexuality", "ISBN (identifier)", "Internet Movie Database", "John W. Bloch", "Joshua Hanke", "Laraine Stephens", "Lesbian", "Lesbian Feminist Liberation", "List of 1970s American television episodes with LGBT themes", "List of Police Woman episodes", "Lynn Loring", "Marcus Welby, M.D.", "Meg Wyllie", "NBC", "National Gay and Lesbian Task Force", "New York City", "News agency", "Police Woman (TV series)", "Police procedural", "Ronald Gold", "Sexual assault", "Standards and Practices", "TV Guide", "The Other Martin Loring", "The Outrage (Marcus Welby)", "United Press International", "Zap (action)"]}