{"url": "https://en.wikipedia.org/wiki/Fujiko_Nakaya", "title": "Fujiko Nakaya", "summary": "Fujiko Nakaya (中谷 芙二子, Nakaya Fujiko, born 15 May 1933) is a Japanese artist, a member of Experiments in Art and Technology, and a promoter, supporter, and practitioner of Japanese video art. She is best known for her fog sculptures.", "content": "Fujiko Nakaya (中谷 芙二子, Nakaya Fujiko, born 15 May 1933) is a Japanese artist, a member of Experiments in Art and Technology, and a promoter, supporter, and practitioner of Japanese video art. She is best known for her fog sculptures.\n\n\n== Early life and education ==\nNakaya was born in Sapporo in 1933, where her father Ukichirō Nakaya, who is credited with making the first artificial snowflakes, was at the time an assistant professor at Hokkaido University. Her father later produced a number of documentary films and radio programs and founded Iwanami Productions, a producer of documentary and educational films. Ukichirō Nakaya was also an accomplished sumi-e artist, and in 1960 his ink paintings were shown alongside Fujiko Nakaya's oil paintings in an exhibition at Sherman Gallery in Chicago. In recent years exhibitions at Oslo Kunstforening and Le Forum at Ginza Maison Hermès have illustrated the influence of Ukichiro Nakaya's ideas and scientific practice on Fujiko Nakaya's artmaking.\nFujiko Nakaya went to high school in Tokyo, graduating from Japan Women's University High School. After high school, she came to the United States to pursue a degree at Northwestern University in Evanston, Illinois, USA. She graduated from Northwestern with a Bachelor of Arts in 1957 and went on to study painting in Paris and Madrid up until 1959.\n\n\n== Career ==\nAfter spending some time in Europe where she briefly studied with Leonard Foujita (aka Fūjita Tsuguharu), Nakaya returned to Japan in 1960. She exhibited her oil paintings in the two-person show with her father at the Sherman Art Gallery in Chicago (1960) followed by her first solo exhibition, featuring twelve paintings, at Tokyo Gallery (1962).\n\n\n=== Experiments in Art and Technology ===\nNakaya first gained prominence through her participation in the American art collective Experiments in Art and Technology (E.A.T.), founded in 1967. Nakaya had first performed with E.A.T. as a remote-control operator for Deborah Hay's performance work Solo for 9 Evenings: Theatre and Engineering in 1966, but did not officially join the group until she became the Tokyo representative for E.A.T. in 1969. She was invited by Billy Klüver, at the suggestion of Robert Rauschenberg (for whom she had translated during his 1964 performance at the Sōgetsu Art Center) to create a fog sculpture for the Pepsi Pavilion at Expo '70 in Osaka. While the invitation did not require a specific kind of fog, Nakaya was concerned a chemical fog would limit who could participate in the work, so she took the opportunity to design the world's first water-based atmospheric fog sculpture with the help of engineer Thomas Mee. Nakaya considered nature to be a collaborator in this project, so she and Mee conducted a number of tests to see how the natural conditions of the site might shape the fog. They conducted tests of the output of various atomizing devices, wind tunnel tests of models of the pavilion, and studies of the wind patterns at the Pepsi Pavilion site in Osaka. The fog sculpture became recognized as one of the signature projects of the Pepsi Pavilion, and the fog system was patented by both Mee (hardware) and Nakaya (airflow) after Expo '70. Nakaya has since established many other fog installations at galleries worldwide, including the Australian National Gallery, Canberra and the Guggenheim Museum Bilbao.After Expo '70, Nakaya continued working as a part of Experiments in Art and Technology by establishing the Tokyo branch of E.A.T. with Kobayashi Hakudō and Morioka Yūji. Their first project was the Tokyo node of the project Utopia Q&A, 1981 that ran from July 30 to September 30, 1971 at the Fuji Xerox showroom in the Sony Building, Ginza. The Tokyo terminal was connected to terminals in New York, Stockholm, and Ahmedabad by telex, and over the course of August, 1971, the four terminals traded messages predicting what the world might be like ten years into the future, in 1981. This telex network was organized on the occasion of the exhibition Utopias & Visions 1871-1981 at the Moderna Museet in Stockholm, curated by Pontus Hultén for the hundredth anniversary of the Paris Commune. However, the Tokyo terminal of this project had the most developed administrative structure of all the nodes, both because it required a translation team to translate incoming messages into Japanese and outgoing ones into English, and because E.A.T. Tokyo had organized the participation of a number of well known media and cultural figures including manga artist and animator Tezuka Osamu, scientist Oda Minoru, and composer Ichiyanagi Toshi.\n\n\n=== Video Hiroba, Video Art, and Video Gallery SCAN ===\nSince the 1970s, Nakaya has been a key figure of the video art scene in Japan, often serving as a conduit between North American and Japanese art practitioners. She first embarked on video at the invitation of Canadian video artist Michael Goldberg, and she worked with Katsuhiro Yamaguchi to organize the first exhibition of video art in Japan, Video Communication: Do-It-Yourself-Kit at the Sony Building, Ginza, in 1972. She was a central member of the video collective Video Hiroba that formed on the occasion of this show, and worked on both community collaborative projects and individual video sculptures from the 1970s through the 1990s. Her works have often been cited as examples of Video Hiroba's oeuvre, including her 1972 piece Friends of Minamata Victims—Video Diary and her 1973 interactive installation Old People's Wisdom — Cultural DNA. Yet beyond making video works, she also translated texts on video and promoted Japanese artists abroad. In 1974 she published a Japanese translation of Michael Shamberg's Guerilla Television, through Bijutsu Shuppansha, and  translated other texts for the magazine Bijutsu Techō. Nakaya also represented Video Hiroba for the Matrix Festival, Vancouver, in 1973 and assisted Barbara London with organizing the Museum of Modern Art's 1979 exhibition of Japanese video art, Video from Tokyo to Fukui and Kyoto.In 1980 Nakaya opened Japan's first video art gallery in Harajuku. The gallery was named Video Gallery SCAN by her friend and collaborator, video artist Bill Viola. The gallery sponsored semiannual competitions for new works by artists, thus becoming a platform for promising new video artists to display their work. It also presented solo exhibitions through a series called SCAN FOCUS. Notable FOCUS exhibitions featured Bill Viola, DCTV, Nam June Paik, Norio Imai, and Mako Idemitsu. Video Gallery SCAN also organized the Japan International Video Television Festival at Spiral in Tokyo in 1987, 1989, and 1993. The festivals featured both new and established artists, including work by General Idea, Shigeko Kubota, Dara Birnbaum, Peter Callas, Gary Hill, Dumb Type, and Marina Abromavic, among others. It also experimented with live satellite broadcasting, presented video sculptures, and introduced new works from artists in the Philippines, Thailand, and China.\n\n\n=== Fog Sculptures ===\nNakaya's fog works have dominated her practice since the closing of Video Gallery SCAN in 1992. In an interview on April 27, 2014 with Irene Shum Allen, Nakaya explained that she doesn't directly create images with her fog sculptures, instead the fog is a kind of transducer that reacts to the local meteorological conditions. She commented that the landscape can appear to be largely static until fog is introduced. With the introduction of fog, nature's stories and information are made more accessible to the observer. Artist and art critic Kenjirō Okazaki has written extensively on Nakaya's work, and ties her fog works to the work of her father, scientist Ukichirō Nakaya. Okazaki likens Fujiko Nakaya's interest in video and fog to her father's use of photography and film to record snow and atmospheric conditions, and relates Ukichirō Nakaya's ethics of documenting nature in its imperfection—even photographing the \"ugly\" snow crystals left out of Wilson Bentley's collections—to Fujiko Nakaya's interest in contingent processes rather than completed objects in both her video and fog practices. Okazaki links the indeterminacy of Nakaya's fog and video works through the idea of medium:The notion of “freedom” is conditioned by such behavior of medium. Therefore, the devotion to medium found in Fujiko Nakaya’s works fundamentally contradicts with artworks posited as forms of expression (these are bound to be regulated as deterministic tautology, stuck in the repetition of the same). What her works instead reveal is the force that transcends and overflows all forms of regulation: the behavior of medium, which is the absolute condition for “freedom” in this world (along with our “free will”).When working in fog, Nakaya often collaborates with other creators, including video artist Bill Viola, light artist Shiro Takatani, dancers Trisha Brown and Min Tanaka, and musician Ryūichi Sakamoto. In 1992 Nakaya collaborated with Atsushi Kitagawara Architects to create a playground in which dense fog envelops visitors twice each hour at Showa Kinen Park in Tokyo. Visitors experience the sense of being lost as the fog develops and being found again as the fog dissipates. The work is intended to evoke a reverence for nature and a reminder of the cycle of life and death. In 2002 Nakaya acted as a consultant to architects Diller + Scofidio on Blur Building, created for the Swiss Expo 2002 on Lake Neuchâtel in Yverdon-les-Bains. According to the pair, Nakaya thought their original idea unachievable, but \"it was her idea about irregular nozzle concentrations that saved the day.\"Nakaya has received numerous awards including the Australian Cultural Award, the Laser d’Or at the Locarno International Video Festival, the Yoshida Isoya Special Award, the Minister for Posts and Telecommunications Award for artistic contribution to HDTV programming and the Special Achievement Prize at the 2008 Japan Media Arts Festival  Nakaya was awarded the Praemium Imperiale award in sculpture from the Japan Art Association in 2018. The first large-scale retrospective of Nakaya's work was held at Art Tower Mito in Japan from October, 2018 through January 2019.\n\n\n== Works ==\n1970 : Fog Sculpture \"PEPSI PAVILION,\" Expo '70, Osaka\n1972 : Friends of Minamata Victims—Video Diary\n1973 : Old People's Wisdom—Cultural DNA, installation at Computer Art '73, Sony Building, Ginza, Tokyo\n1974 : Standing an Egg, interactive video installation at the Eleventh Japan International Contemporary Art Exhibition, Tokyo Metropolitan Art Museum, Tokyo\n1974 : Fog Environment for David Tudor Concert \"ISLAND EYE ISLAND EAR\" (Collaboration with David Tudor, Jacqueline Monnier), Knavelskar Island, Sweden (Produced by E.A.T.)\n1976 : Fog Sculpture #94768: Earth Talk, The 2nd Biennale of Sydney, (renamed Foggy Wake in a Desert in 1983 for National Gallery of Australia, Canberra)\n1980 : Opal Loop/Cloud Installation #72503, for Trisha Brown Dance Company, New York (recreated in 1981, 1996, and 2010)\n1980 :  Cloud Lake, The 11th International Sculpture Conference\n1980 : Fog Sculpture: Kawaji, Festival of Light, Sound and Fog, Tochigi (collaboration with Bill Viola)\n1981: Waterfall: An Integrated River, video installation at The Miyagi Museum of Art, Miyagi\n1983 : Fog Sculpture #94925: Foggy Wake in a Desert: An Ecosphere, National Gallery of Australia, Canberra (permanent installation)\n1983 :  Meltee-vee, video installation at Museum of Modern Art, Toyoma\n1988 : Fog Sculpture: Skyline, Jardin de l'eau, Parc de la Villette, Paris\n1990-1 : Four Wells, video installation, National Art Center, Tokyo\n1992 : Foggy Forest, Children's Park, Showa Memorial Park, Tachikawa (Tokyo)\n1994 : \"Greenland Glacial Moraine Garden\", Ukichiro Nakaya Museum of Snow and Ice, Kaga City, Japan (Architect : Arata Isozaki), Kaga\n1998 : Fog Sculpture #08025: F.O.G., Guggenheim Museum Bilbao, Spain (Permanent Collection)\n2001 : IRIS, Fog Sculpture in collaboration with Shiro Takatani in Valencia Harbour, The 1st Valencia Biennial, Spain\n2004 : Fog Sculpture #28634: \"Dialogue\", Technology for Living: Experiments in Art and Technology, Norrköpings konstmuseum, Norrköping\n2005 : Fog Chamber-Riga #26422, for Conversations with Snow and Ice, The Natural History Museum of Latvia, Riga\n2010 : Cloud Forest, fog installation, light and sound in collaboration with Shiro Takatani, commissioned by the Yamaguchi Center for Arts and Media [YCAM]\n2011 : fog installation in collaboration with Shiro Takatani, Ishibutai Tumulus, Asuka Historical Park, Nara\n2011 : Fog Garden #07172 - Moss Garden Nicey-sur-Aire, Vent des forêts, Arrondissement de Commercy\n2013 : Fog Bridge #72494, Exploratorium, San Francisco\n2014: Veil, The Glass House, New Canaan, Connecticut\n2015 : \"Fog Bridge\", fog installation and exhibition at the Arnolfini Centre of Contemporary Arts, commissioned for IBT15 Bristol International Festival, England\n2017 : Pathfinder #18700 Oslo, Ekebergparken, Oslo, Norway\n2018 : \"Fog x FLO\" includes five site-responsive installations along Fredrick Law Olmsted's Emerald Necklace in celebration of the 20th anniversary of the Emerald Necklace Conservancy\n\n\n== Awards ==\n1976 : Australian Cultural Award  -Fog Sculpture #94768 \"Earth Talk\"\n1983 : Finalist, The First International Water Sculpture Competition -Fog Performance \"Louisiana Dump\"\n1990 : Laser d'Or, Locarno Video Festival -Contribution of SCAN\n1992 : Minister of Construction Award -\"Foggy Forest\"\n1993 : Yoshida Isoya Special Award -\"Foggy Forest\"\n2001 : Minister of Communication Award -Artistic contribution to HDTV Programming\n2006 : Descartes Science Communication Prize, nominee, EU Commission -Curation of a science and art exhibition \"Conversations with snow and ice\" in Latvia\n2008 : Media Arts Festival, Special Achievement Prize -Contribution to Media Arts\n2017 : Commandeur, Ordre des Arts et des Lettres, France\n2018 : Praemium Imperial Award in Sculpture, Japan Art Association\n\n\n== Other notable achievements ==\n1979-1998 : lecturer at Nihon University for the Department of Cinema, College of Arts\n1989: \"System/apparatus for making a cloud sculpture from water-fog\" Patent #1502386\n2017: Author Dan Brown, in the novel Origin (Brown novel), refers to the work of Nakaya as his character Robert Langdon visits the Guggenheim in Bilbao, Spain in search of former student Edmond Kirsch. Noting that the fog sculpture constantly changes shape, Brown uses the setting to create an ethereal and dramatic scene as Langdon enters the Guggenheim museum.\n\n\n== References ==\n\n\n== External links ==\nLives and works, Fujiko Nakaya(PDFfile)\nThe lucid, unclouded fog―the movement of bright and swinging water particles.(by Kenjiro Okazaki)", "links": ["9 Evenings: Theatre and Engineering", "Ahmedabad", "Arnolfini", "Arrondissement of Commercy", "Art Tower Mito", "Asuka Historical National Government Park", "Atsushi Kitagawara", "Australian National Gallery", "Barbara London (curator)", "Biennale of Sydney", "Bill Viola", "Billy Klüver", "Canberra", "Chicago", "Connecticut", "Dara Birnbaum", "Deborah Hay", "Diller Scofidio + Renfro", "Doi (identifier)", "Downtown Community Television Center", "Dumb Type", "Ekebergparken Sculpture Park", "Emerald Necklace", "England", "Evanston, Illinois", "Experiments in Art and Technology", "Exploratorium", "Expo '70", "Frederick Law Olmsted", "Fuji Xerox", "Gary Hill", "Gas sculpture", "General Idea", "Guerrilla television", "Guggenheim Museum Bilbao", "Harajuku", "Hokkaido University", "ISBN (identifier)", "ISNI (identifier)", "ISSN (identifier)", "Iwanami Productions", "Japan", "Kaga, Ishikawa", "Kenjiro Okazaki", "Lake Neuchâtel", "Latvian Museum of Natural History", "Mako Idemitsu", "Marina Abramović", "Michael Shamberg", "Min Tanaka", "Moderna Museet", "Museum of Modern Art", "Museum of Modern Art, Toyama", "Nam June Paik", "Nara (city)", "National Gallery of Australia", "New Canaan, Connecticut", "New York City", "Nihon University", "Norrköping", "Northwestern University", "Norway", "OCLC (identifier)", "Origin (Brown novel)", "Osamu Tezuka", "Oslo", "Oslo Kunstforening", "PDF", "Parc de la Villette", "Paris", "Paris Commune", "Peter Callas", "Pontus Hultén", "ProQuest (identifier)", "Riga", "Robert Rauschenberg", "Ryuichi Sakamoto", "SUDOC (identifier)", "San Francisco", "Sapporo", "Shigeko Kubota", "Shiro Takatani", "Showa Memorial Park", "Sony Building (Tokyo)", "Spain", "Spiral (building)", "Stockholm", "Sumi-e", "Tachikawa", "Telex", "The Miyagi Museum of Art", "The National Art Center, Tokyo", "Tokyo Metropolitan Art Museum", "Toshi Ichiyanagi", "Trisha Brown", "Tsuguharu Foujita", "Ukichiro Nakaya", "VIAF (identifier)", "Valencia", "Video Gallery SCAN", "Video Hiroba", "Wilson Bentley", "Yamaguchi Katsuhiro", "Yverdon-les-Bains"]}