{"url": "https://en.wikipedia.org/wiki/Gabriel_Filippelli", "title": "Gabriel Filippelli", "summary": "Gabriel Filippelli is an American biogeochemist and professor of Earth sciences at Indiana University-Purdue University Indianapolis (IUPUI). His research interests include biogeochemical cycling in the environment, and the links between environmental processes and human health.", "content": "Gabriel Filippelli is an American biogeochemist and professor of Earth sciences at Indiana University-Purdue University Indianapolis (IUPUI). His research interests include biogeochemical cycling in the environment, and the links between environmental processes and human health.\n\n\n== Early life and education ==\nFilippelli was awarded a BS in Geology from the University of California, Davis in 1986, a PhD in 1994 from the University of California, Santa Cruz, and then began working as an assistant professor of geology in 1994.\n\n\n== Career ==\nFilippelli is a Chancellor's Professor of Earth Sciences, the Executive Director of the Indiana University Environmental Resilience Institute  and Director of the Center for Urban Health at IUPUI.Filippelli has been a member and Chair of the United States Advisory Committee for Scientific Ocean Drilling and of the Science Planning Committee for the International Ocean Discovery Program. He has also written for a variety of major journals, including Nature, Science, and Geology, among others.\n\n\n== Policy ==\nFilippelli was senior science advisor for the United States State Department from 2013–2014, working in the area of ocean and polar science policy. In this capacity, he wrote policy related to climate change in the Antarctic, and was involved in the international effort to improve scientific cooperation through the Arctic nations, eventually leading to an international agreement on this issueFilippelli is an Air Quality Fellow for the US State Department and consults with embassies and universities in Pakistan on air quality science.\n\n\n== Research ==\nHe is known for his work on various aspects of global nutrient cycling, including ocean response to nutrient inputs, terrestrial signals of nutrient and landscape development, and future projections of nutrient resources to feed humanity. His recent work has focused on environmental health, marked by contributions in multiple journals on environmental exposures to contaminants and climate change. Some controversy arose when then-Governor Mike Pence was selected as President Trump's running mate, as Pence has voiced doubts about the science of climate change and Filippelli led a group of Indiana scientists who publicly offered their assistance in developing climate change adaptation plans for Indiana but received no response from the Governor.\n\n\n== Academic roles ==\nFilippelli is a Fellow of the International Association of GeoChemistry, the winner of the Charles Bantz Fellowship for Community Engagement, the author of about 100 peer-reviewed publications, and a blogger and community activist in the areas of community-engaged research and environmental justice. In August 2017, Filippelli became the Editor in Chief of GeoHealth, an American Geophysical Union journal. The journal's founding editor was Rita R. Colwell.\n\n\n== Awards ==\nFulbright Distinguished Chair (2022), University of Newcastle, Australia\nF. Earl Ingerson Lecturer (2021), Geochemical SocietyJohn W. Ryan Award for Distinguished Contributions to International Programs and Studies, Indiana University (2020)Chancellor's Professor, IUPUI (2020)Prose Award for Excellence in Physical Science and Mathematics, Association of American Publishers (2019)Fellow, International Association of GeoChemistry (2015)\n\n\n== References ==", "links": ["American Geophysical Union", "Bibcode (identifier)", "Biogeochemical cycle", "Biogeochemistry", "Climate change adaptation", "Doctoral advisor", "Doi (identifier)", "Donald Trump", "ISNI (identifier)", "Indiana University – Purdue University Indianapolis", "International Association of GeoChemistry", "International Ocean Discovery Program", "Mike Pence", "Nutrient cycling", "PMC (identifier)", "PMID (identifier)", "Rita R. Colwell", "S2CID (identifier)", "Thesis", "United States Department of State", "University of California, Davis", "University of California, Santa Cruz", "VIAF (identifier)"]}