{"url": "https://en.wikipedia.org/wiki/Garrett_Richter", "title": "Garrett Richter", "summary": "Garrett Richter (born August 1, 1950) is a Republican politician from Florida. He served as a member of the Florida Senate from 2008 to 2016, representing parts of Collier and Lee Counties in Southwest Florida. Prior to being elected to the Senate, Richter served one term in the Florida House of Representatives, representing a Naples-based district from 2006 to 2008.", "content": "Garrett Richter (born August 1, 1950) is a Republican politician from Florida. He served as a member of the Florida Senate from 2008 to 2016, representing parts of Collier and Lee Counties in Southwest Florida. Prior to being elected to the Senate, Richter served one term in the Florida House of Representatives, representing a Naples-based district from 2006 to 2008.\n\n\n== History ==\nRichter was born in Pittsburgh, Pennsylvania, and served in the United States Army from 1969 to 1971, earning a Bronze Star Medal and a Combat Infantry Badge in the process. He then served in the United States Air Force Reserves from 1979 to 1981. Richter attended the University of Pittsburgh, graduating with his bachelor's degree in 1981, and then completed a graduate program at the Graduate School of Banking at the University of Wisconsin–Madison.\nIn 1987, Richter moved to Florida, where he served on the Greater Naples Chamber of Commerce, the Collier County Education Foundation, the Economic Development Council of Collier County, and Leadership Florida. He was a founding director of the First National Bank of Naples until 1997, when it was acquired by the FNB Corporation. Richter was a founder of and executive at the First National Bank of Florida prior to its acquisition by Fifth Third Bank in 2005. Since 2007, he has worked as the President  of the First Florida Integrity Bank.\n\n\n== Florida House of Representatives ==\nIncumbent State Representative J. Dudley Goodlette was unable to seek re-election in 2006 due to term limits. Richter ran to succeed him in the 76th District, which stretched from North Naples to Marco Island in western Collier County. Richter was unopposed in the Republican primary, and faced Ken McPherson, the Constitution Party nominee. He was endorsed by the Naples Daily News, which praised his focus on \"affordable housing and insurance as the big issues facing Florida and the Legislature,\" though they noted that \"[s]ome of his goals and positions on key issues could use a tuneup.\" Ultimately, Richter defeated MacPherson handily, winning 78% of the vote to MacPherson's 22%.Following Richter's election to the House, he initially started campaigning to be Speaker of the Florida House of Representatives for the 2012-2014 legislative term, but he withdrew as fellow State Representative Will Weatherford solidified support.During the 2008 legislative session, Richter sponsored legislation with State Senator Michael S. Bennett that would have allowed business owners to purchase commercial property insurance without the threat of assessments from the state.\n\n\n== Florida Senate ==\nIn 2008, incumbent State Senator Burt Saunders was unable to seek re-election due to term limits, instead opting to launch a congressional campaign against Congressman Connie Mack IV. Richter ran to succeed him in the 37th District, which included Cape Coral and Fort Myers in Collier and Lee Counties. He was unopposed in both the Republican primary and the general election, and won his first term entirely uncontested.When the state's legislative districts were redrawn in 2012, Richter opted to run for re-election in the 23rd District, which contained much of the territory that he had previously represented. As was the case in 2008, Richter did not face an opponent in the primary or general elections and was re-elected without opposition. Upon being re-elected, Richter noted, \"I'm looking forward to continuing my service to the Legislature by advancing sound fiscal policy and continuing to support Governor Scott's agenda for economic growth and private sector job growth.\"During the 2016 legislative session, Richter sponsored legislation that would create a regulatory mechanism for allowing hydraulic fracturing and that would pre-empt local county and municipality bans on fracking.\n\n\n== External links ==\nFlorida House of Representatives - Garrett Richter\nFirst Florida Integrity Bank, TGR Executives - Garrett Richter\n\n\n== References ==", "links": ["Alma mater", "Andy Gardiner", "Anitere Flores", "Bronze Star Medal", "Burt Saunders", "Cape Coral, Florida", "Collier County, Florida", "Combat Infantry Badge", "Connie Mack IV", "Constitution Party (United States)", "Don Gaetz", "FNB Corporation", "Fifth Third Bank", "First National Bank of Florida", "Florida", "Florida House of Representatives", "Florida Senate", "Fort Myers, Florida", "Greg Steube", "Hydraulic fracturing", "J. Dudley Goodlette", "Lee County, Florida", "Marco Island, Florida", "Michael S. Bennett", "Naples, Florida", "Naples Daily News", "North Naples, Florida", "Pittsburgh, Pennsylvania", "Republican Party (United States)", "Southwest Florida", "Speaker of the Florida House of Representatives", "Tallahassee Democrat", "Tampa Bay Times", "Tom Grady", "United States Air Force Reserves", "United States Army", "United States House of Representatives elections in Florida, 2008", "University of Pittsburgh", "University of Wisconsin–Madison", "Will Weatherford"]}