{"url": "https://en.wikipedia.org/wiki/Georg_Ernst_Stahl", "title": "Georg Ernst Stahl", "summary": "Georg Ernst Stahl (22 October 1659 – 24 May 1734) was a German chemist, physician and philosopher. He was a supporter of vitalism, and until the late 18th century his works on phlogiston were accepted as an explanation for chemical processes.", "content": "Georg Ernst Stahl (22 October 1659 – 24 May 1734) was a German chemist, physician and philosopher. He was a supporter of vitalism, and until the late 18th century his works on phlogiston were accepted as an explanation for chemical processes.\n\n\n== Biography ==\nGeorg Ernst Stahl was born on October 22, 1659, at Anspach in Bavaria. Raised as a son to a Lutheran Pastor, he was brought up in a very pious and religious household. From an early age he expressed profound interest toward chemistry, even by age 15 mastering a set of university lecture notes on chemistry and eventually a difficult treatise by Johann Kunckel.  He had two wives, who both died from puerperal fever in 1696 and 1706. He also had a son Johnathan and a daughter who died in 1708. He continued to work and publish following the death of both of his wives and eventually his children, but was often very cold to students and fell into deep depression until his death in 1734 at the age of 74.\n\n\n== Life and education ==\nHe was born in St. John's parish in Ansbach, Brandenburg on October 21, 1659. His father was Johann Lorentz Stahl. He was raised in Pietism, which influenced his viewpoints on the world. His interests in chemistry were due to the influence a professor of medicine, Jacob Barner, and a chemist, Johann Kunckel von Löwenstjern. In the late 1670s, Stahl moved to Saxe-Jena to study medicine at the University of Jena. Stahl’s success at Jena earned him a M.D. around 1683 and then he went on to teach at the same university.\nTeaching at the university gained him such a good reputation that in 1687 he was hired as the personal physician to Duke Johann Ernst of Sachsen-Weimar. In 1693, he joined his old college friend Friedrich Hoffmann at the University of Halle. In 1694, he held the chair of medicine at the University of Halle. From 1715 until his death, he was the physician and counselor to King Friedrich Wilhelm I of Prussia and in charge of Berlin's Medical Board.\n\n\n== Medicine ==\nStahl's focus was on the distinction between the living and nonliving. Although he did not support the views of iatro-mechanists, he believed that all non-living creatures are mechanical and so are living things to a certain degree. His views were that nonliving things are stable throughout time and did not rapidly change. On the other hand, living things are subject to change and have a tendency to decompose, which led Stahl to work with fermentation.\nStahl professed an animistic system, in opposition to the materialism of Hermann Boerhaave and Friedrich Hoffmann. His main argument on living things was that there is an agent responsible for delaying this decomposition of living things and that agent is the anima or soul of the living organism. The anima controls all of the physical processes that happen in the body. It not only just controls the mechanical aspects of it but the direction and goals of them too. How the anima controls these processes is through motion. He believed that the three important motions of the body are the circulation of blood, excretion and secretion.\nThese beliefs were reflected in his views on medicine. He thought that medicine should deal with the body as a whole and its anima, rather than the specific parts of a body. Having knowledge on the specific mechanical parts of the body is not very useful. His views had been criticized by Gottfried Leibniz, with whom he exchanged letters, later published in a book titled Negotium otiosum seu σκιαμαχία (1720). Also, during the first part of the 18th century, Stahl's ideas on the non-physical part of the body were disregarded while his mechanistic ideas on the body were accepted in the works of Boerhaave and Hoffmann.\n\n\n=== Tonic motion ===\nAs a physician, Stahl worked with patients and focused on the soul, or anima, as well as blood circulation and tonic motion. Anima was a vital force that when working properly would allow the subject to be healthy; however, when malfunction of the anima occurred, so did illness. Tonic motion, to Stahl, involved the contracting and relaxing movements of the body tissue in order to serve the three main purposes. Tonic motion helped explain how animals produce heat and how fevers were caused. In Stahl's 1692 dissertation, De motu tonico vitali, Stahl explains his theory of tonic motion and how it is connected to blood flow within a subject, without citing William Harvey's blood flow and circulation theories, which lacked an explanation of irregular blood flow. Also within the dissertation, 'practitioners' are mentioned as users of his theory of tonic motion.\nStahl's theory of tonic motion was about the muscle tone of the circulatory system. During his work at Halle, Stahl oversaw patients experiencing headaches and nosebleeds. Tonic motion explained these phenomena as blood needed a natural or artificial path to flow when a part of the body is obstructed, injured, or swollen. Stahl also experimented with menstruation, finding that bloodletting in an upper portion of the body would relieve bleeding during the period. During the next period, the wound would experience pain and swelling, which would only be relieved by an opening in the foot. He also followed this procedure as a treatment for amenorrhoea.\n\n\n== Chemistry ==\nThe best of Stahl’s work in chemistry was done while he was a professor at Halle. Just like medicine, he believed that chemistry could not be reduced to mechanistic views. Although he believed in atoms, he did not believe that atomic theories were enough to describe the chemical processes that go on. He believed that atoms could not be isolated individually and that they join together to form elements. He took an empirical approach when establishing his descriptions of chemistry.Stahl used the works of Johann Joachim Becher to help him come up with explanations of chemical phenomena. The main theory that Stahl got from J. J. Becher was the theory of phlogiston. This theory did not have any experimental basis before Stahl. Becher's theories attempted in explaining chemistry as comprehensively as seemingly possible through classifying different earths according to specific reactions. Terra pinguis was a substance that escaped during combustion reactions, according to Becher. Stahl, influenced by Becher's work, developed his theory of phlogiston. Phlogiston theory did not have any experimental basis before Stahl worked with metals and various other substances in order separate phlogiston from them. Stahl proposed that metals were made of calx, or ash, and phlogiston and that once a metal is heated, the phlogiston leaves only the calx within the substance. He was able to make the theory applicable to chemistry as it was one of the first unifying theories in the discipline. Phlogiston provided an explanation of various chemical phenomena and encouraged the chemists of the time to rationally work with the theory to explore more of the subject. This theory was later replaced by Antoine-Laurent Lavoisier’s theory of oxidation and caloric theory. He also propounded a view of fermentation, which in some respects resembles that supported by Justus von Liebig a century and half later. Although his theory was replaced, Stahl's theory of phlogiston is seen to be the transition between alchemy and chemistry.Stahl is credited for being among the first to describe carbon monoxide as noxious carbonarii halitus (carbonic vapors) in his 1697 publication Zymotechnia fundamentalis.\n\n\n== Works ==\n\nZymotechnia fundamentalis (1697)\nDe lumbricis terrestribus eorumque usu medico (in Latin). Halle: Christian Henckel. 1698.\nDisquisitio de mechanismi et organismi diversitate (1706)\nParaenesis, ad aliena a medica doctrine arcendum (1706)\nDe vera diversitate corporis mixti et vivi (1706)\nTheoria medica vera (1708)\nDe lapide manati (in Latin). Halle: Christian Henckel. 1710.\nGeorgii Ernesti Stahlii opusculum chymico-physico-medicum : seu schediasmatum, a pluribus annis variis occasionibus in publicum emissorum nunc quadantenus etiam auctorum et deficientibus passim exemplaribus in unum volumen iam collectorum, fasciculus publicae luci redditus / Praemißa praefationis loco authoris epistola ad Michaelem Alberti (1715) Digital edition by the University and State Library Düsseldorf\nSpecimen Beccherianum (1718)\nPhilosophical Principles of Universal Chemistry (1730), Peter Shaw, translator, from Open Library.\nExperimenta, observationes, animadversiones, 300. numero, chymicae et physicae (in Latin). Berlin: Ambrosius Haude. 1731.\nMateria medica : das ist: Zubereitung, Krafft und Würckung, derer sonderlich durch chymische Kunst erfundenen Artzneyen (1744), Vol. 1&2 Digital edition by the University and State Library Düsseldorf\nFundamenta chymiae (in Latin). Vol. 3. Nürnberg: Wolfgang Moritz Endter, Erben & Julius Arnold Engelbrecht, Witwe. 1747.\nFundamenta chymiae (in Latin). Vol. 2. Nürnberg: Wolfgang Moritz Endter, Erben & Julius Arnold Engelbrecht, Witwe. 1746.\nThe Leibniz-Stahl Controversy (2016), transl. and edited by F. Duchesneau and J. H. Smith, Yale UP (536 pp.)\n\n\n== References ==\n\nHélène Metzger (1926) \"La philosophie de la matière chez Stahl et ses disciples\", Isis 8: 427–464.\nHélène Metzger (1930) Newton, Stahl, Boerhaave et la Doctrine Chemique\nLawrence M. Principe (2007) Chymists and Chymistry.\n\n\n== External links ==\nWorks by or about Georg Ernst Stahl at Internet Archive\nGeorg Ernst Stahl at the Mathematics Genealogy Project", "links": ["Alchemy", "Amenorrhoea", "Animism", "Ansbach", "Bavaria", "Berlin", "Bloodletting", "Bulletin of the History of Medicine", "Caloric theory", "Carbon monoxide", "Cengage Learning", "Chemist", "Chemistry", "Circulation of blood", "Circulatory system", "Doi (identifier)", "Excretion", "Fermentation (biochemistry)", "Fever", "Friedrich Hoffmann", "Friedrich Wilhelm I of Prussia", "Georg August Stahl", "Germany", "Gottfried Leibniz", "Headache", "Heat", "Hermann Boerhaave", "Holy Roman Empire", "Hélène Metzger", "ISBN (identifier)", "ISNI (identifier)", "ISSN (identifier)", "Internet Archive", "Isis (journal)", "J. J. Becher", "Johann Joachim Becher", "Johann von Löwenstern-Kunckel", "Justus von Liebig", "MBA (identifier)", "Margraviate of Brandenburg", "Materialism", "Mathematics Genealogy Project", "Mechanistic", "Menstruation", "Muscle tone", "Nosebleed", "Open Library", "Oxidation", "PMID (identifier)", "Philosopher", "Phlogiston", "Phlogiston theory", "Physician", "Pietism", "Puerperal fever", "RERO (identifier)", "S2CID (identifier)", "SUDOC (identifier)", "Saxe-Jena", "Secretion", "Trove (identifier)", "University and State Library Düsseldorf", "University of Halle", "University of Jena", "VIAF (identifier)", "Vitalism", "Wayback Machine", "William Harvey"]}