{"url": "https://en.wikipedia.org/wiki/George_W._Wentworth_House", "title": "George W. Wentworth House", "summary": "The George W. Wentworth House is a large Queen Anne style home, that was built in 1887 in West Saint Paul in the U.S. state of Minnesota. Wentworth was an emigre from England who traded in horses; he was also involved in local politics, working to organize the city of South Saint Paul. In the late 1880s, a dispute arose between the farmers in the western portion of the city, whom Wentworth represented, and the people living around the stockyards in the eastern portion of the city. West Saint Paul disjoined from South Saint Paul in 1889 and Wentworth remained politically active in the new city. After his death in 1908, the house remained vacant for many years before being renovated by subsequent owners. The hard work of current owner Daniel W. Owned since 1987-current day.", "content": "The George W. Wentworth House is a large Queen Anne style home, that was built in 1887 in West Saint Paul in the U.S. state of Minnesota. Wentworth was an emigre from England who traded in horses; he was also involved in local politics, working to organize the city of South Saint Paul. In the late 1880s, a dispute arose between the farmers in the western portion of the city, whom Wentworth represented, and the people living around the stockyards in the eastern portion of the city. West Saint Paul disjoined from South Saint Paul in 1889 and Wentworth remained politically active in the new city. After his death in 1908, the house remained vacant for many years before being renovated by subsequent owners. The hard work of current owner Daniel W. Owned since 1987-current day.\n\n\n== References ==", "links": ["Alexander Ramsey", "Apple Valley, Minnesota", "Big Rivers Regional Trail", "Burnsville, Minnesota", "Byron Howes House", "Castle Rock, Minnesota", "Castle Rock Township, Dakota County, Minnesota", "Chimney Rock Scientific and Natural Area", "Church of Saint Mary's (New Trier, Minnesota)", "Church of the Advent (Farmington, Minnesota)", "City", "Civil township", "Coates, Minnesota", "Coleen Rowley", "Contributing property", "County seat", "Craig Kilborn", "Dakota County, Minnesota", "Dakota County Courthouse", "Daniel F. Akin House", "District No. 72 School", "Douglas Township, Dakota County, Minnesota", "Eagan, Minnesota", "East Second Street Commercial Historic District (Hastings, Minnesota)", "Emil J. Oberhoffer House", "Empire Township, Dakota County, Minnesota", "England", "Etter, Minnesota", "Eureka Center, Minnesota", "Eureka Township, Dakota County, Minnesota", "Exchange Bank Building (Farmington, Minnesota)", "Farmington, Minnesota", "Fasbender Clinic", "Federal Bureau of Investigation", "First Presbyterian Church (Hastings, Minnesota)", "Fort Snelling", "Fort Snelling State Park", "Geographic coordinate system", "Ghost town", "Good Templars Hall", "Greenvale Township, Dakota County, Minnesota", "Hampton, Minnesota", "Hampton Township, Dakota County, Minnesota", "Harold Stassen", "Hastings, Minnesota", "Hastings Foundry-Star Iron Works", "Hastings Methodist Episcopal Church", "Henry Hastings Sibley", "Historic districts in the United States", "History of the National Register of Historic Places", "Holz Family Farmstead", "ISBN (identifier)", "Ignatius Eckert House", "Ignatius L. Donnelly", "Indian reservation", "Inver Grove Heights, Minnesota", "Joan Kroc", "John Kline (politician)", "Keeper of the Register", "Lake Byllesby (Cannon River)", "Lakeville, Minnesota", "Laura Osnes", "Lebanon Hills Regional Park", "Lewiston, Dakota County, Minnesota", "Lilydale, Minnesota", "List of National Historic Landmarks in Minnesota", "List of bridges on the National Register of Historic Places in Minnesota", "MacDonald–Todd House", "Marshan Township, Dakota County, Minnesota", "Mendota, Minnesota", "Mendota Bridge", "Mendota Heights, Minnesota", "Miesville, Minnesota", "Miesville Ravine Park Reserve", "Minneapolis Saint Paul Rochester & Dubuque Electric Traction Company Depot", "Minnesota", "Minnesota's 2nd congressional district", "Minnesota Historical Society", "Minnesota River", "Mississippi River", "Natalie Darwitz", "National Football League", "National Park Service", "National Register of Historic Places", "National Register of Historic Places listings in Aitkin County, Minnesota", "National Register of Historic Places listings in Anoka County, Minnesota", "National Register of Historic Places listings in Becker County, Minnesota", "National Register of Historic Places listings in Beltrami County, Minnesota", "National Register of Historic Places listings in Big Stone County, Minnesota", "National Register of Historic Places listings in Blue Earth County, Minnesota", "National Register of Historic Places listings in Brown County, Minnesota", "National Register of Historic Places listings in Carlton County, Minnesota", "National Register of Historic Places listings in Carver County, Minnesota", "National Register of Historic Places listings in Cass County, Minnesota", "National Register of Historic Places listings in Chippewa County, Minnesota", "National Register of Historic Places listings in Chisago County, Minnesota", "National Register of Historic Places listings in Clay County, Minnesota", "National Register of Historic Places listings in Cook County, Minnesota", "National Register of Historic Places listings in Crow Wing County, Minnesota", "National Register of Historic Places listings in Dakota County, Minnesota", "National Register of Historic Places listings in Dodge County, Minnesota", "National Register of Historic Places listings in Douglas County, Minnesota", "National Register of Historic Places listings in Faribault County, Minnesota", "National Register of Historic Places listings in Fillmore County, Minnesota", "National Register of Historic Places listings in Goodhue County, Minnesota", "National Register of Historic Places listings in Hennepin County, Minnesota", "National Register of Historic Places listings in Houston County, Minnesota", "National Register of Historic Places listings in Isanti County, Minnesota", "National Register of Historic Places listings in Itasca County, Minnesota", "National Register of Historic Places listings in Kandiyohi County, Minnesota", "National Register of Historic Places listings in Koochiching County, Minnesota", "National Register of Historic Places listings in Lac qui Parle County, Minnesota", "National Register of Historic Places listings in Lake County, Minnesota", "National Register of Historic Places listings in Le Sueur County, Minnesota", "National Register of Historic Places listings in Lyon County, Minnesota", "National Register of Historic Places listings in Martin County, Minnesota", "National Register of Historic Places listings in Meeker County, Minnesota", "National Register of Historic Places listings in Mille Lacs County, Minnesota", "National Register of Historic Places listings in Minnesota", "National Register of Historic Places listings in Morrison County, Minnesota", "National Register of Historic Places listings in Mower County, Minnesota", "National Register of Historic Places listings in Murray County, Minnesota", "National Register of Historic Places listings in Nicollet County, Minnesota", "National Register of Historic Places listings in Nobles County, Minnesota", "National Register of Historic Places listings in Olmsted County, Minnesota", "National Register of Historic Places listings in Otter Tail County, Minnesota", "National Register of Historic Places listings in Pine County, Minnesota", "National Register of Historic Places listings in Pipestone County, Minnesota", "National Register of Historic Places listings in Pope County, Minnesota", "National Register of Historic Places listings in Ramsey County, Minnesota", "National Register of Historic Places listings in Redwood County, Minnesota", "National Register of Historic Places listings in Rice County, Minnesota", "National Register of Historic Places listings in Rock County, Minnesota", "National Register of Historic Places listings in Scott County, Minnesota", "National Register of Historic Places listings in St. Louis County, Minnesota", "National Register of Historic Places listings in Stearns County, Minnesota", "National Register of Historic Places listings in Steele County, Minnesota", "National Register of Historic Places listings in Swift County, Minnesota", "National Register of Historic Places listings in Todd County, Minnesota", "National Register of Historic Places listings in Voyageurs National Park", "National Register of Historic Places listings in Wabasha County, Minnesota", "National Register of Historic Places listings in Waseca County, Minnesota", "National Register of Historic Places listings in Washington County, Minnesota", "National Register of Historic Places listings in Winona County, Minnesota", "National Register of Historic Places listings in Wright County, Minnesota", "National Register of Historic Places property types", "New Trier, Minnesota", "Nininger, Minnesota", "Nininger Township, Dakota County, Minnesota", "Northfield, Minnesota", "Northwest Airlines", "Paul Krause", "Pierce Butler (justice)", "Pine Bend Refinery", "Prairie Island Indian Community", "Queen Anne style architecture in the United States", "Ramsey Mill and Old Mill Park", "Randolph, Minnesota", "Randolph Township, Dakota County, Minnesota", "Ravenna Township, Dakota County, Minnesota", "Reuben Freeman House", "Rosemount, Minnesota", "Rudolph Latto House", "Sciota Township, Dakota County, Minnesota", "Serbian Home", "Sibley Historic Site", "South St. Paul, Minnesota", "St. Stefan's Romanian Orthodox Church", "Stockyards Exchange", "Sunfish Lake, Minnesota", "Thompson–Fasbender House", "Tim Pawlenty", "Unincorporated area", "United States", "VanDyke–Libby House", "Vermillion, Minnesota", "Vermillion River (Minnesota)", "Vermillion Township, Dakota County, Minnesota", "Waterford, Minnesota", "Waterford Township, Dakota County, Minnesota", "West (publisher)", "West Second Street Residential Historic District", "West St. Paul, Minnesota", "William G. LeDuc House"]}