{
    "url": "https://en.wikipedia.org/wiki/Good_to_Go,_with_a_Tribute_to_Bu",
    "title": "Good to Go, with a Tribute to Bu",
    "summary": "Good to Go, with a Tribute to Bu is an album by drummer Andrew Cyrille. It was recorded in October 1995 at Mu Rec Studio, Milan, Italy, and was released by Soul Note in 1997. On the album, Cyrille is joined by flutist James Newton and bassist Lisle Atkinson. \"Bu\" was Art Blakey's nickname, and was derived from Abdullah Ibn Buhaina, the name he adopted after converting to Islam.",
    "content": "Good to Go, with a Tribute to Bu is an album by drummer Andrew Cyrille. It was recorded in October 1995 at Mu Rec Studio, Milan, Italy, and was released by Soul Note in 1997. On the album, Cyrille is joined by flutist James Newton and bassist Lisle Atkinson. \"Bu\" was Art Blakey's nickname, and was derived from Abdullah Ibn Buhaina, the name he adopted after converting to Islam.\n\n\n== Reception ==\nIn a review for AllMusic, Scott Yanow called the album \"an intriguing set,\" and wrote: \"Due to the variety of the material (mostly originals) and the consistent brilliance of Newton, this CD is recommended to fans of advanced jazz.\"The authors of The Penguin Guide to Jazz awarded the album 4 stars, and stated: \"The set is bracketed by two takes of Cyrille's brilliant impersonation of Art Blakey in excelsis. They and the other title-piece are essays in freedom and responsiveness.\"Amiri Baraka commented: \"With James Newton on flute and Lisle Atkinson on bass, one does get the expected subtlety, measured color, and intimacy that that orchestration would predict. Certainly, Newton's introspective 'Oblong' speaks from this context very movingly. A deep lingering touching piece. But that is not nearly the whole story. Lisle Atkinson's emphatic bass voice makes certain of this. Atkinson, a highly respected, widely sought-after, and constantly gigging yeoman at the other rhythm post, not only powerfully and dynamically paddles this furthership, but allows Cyrille to circle back and forth inside the main flow without the least loss of drive.\" He concluded: \"This album, with its modest construct yet powerful presence, is a gem! It will be a real find for the humble stumbler, but actually a confirmation of just how musically important and gratifying Andrew Cyrille is and has been, for a while now! And his friends, James Newton and Lisle Atkinson, don't leave them out. They contribute with equal persona to this wonderful effort. This is the kind of album you like to pull your friends' coats to, so they’ll know you know.\"\n\n\n== Track listing ==\n\"A Tribute to Bu (Take 1)\" (Cyrille) - 5:32\n\"Oblong\" (Newton) - 6:17\n\"Enter from the East\" (John Carter) - 8:34\n\"Inch Worm\" (Frank Loesser) - 7:25\n\"Nicodemus\" (Andrew Hill) - 4:01\n\"Aftermath\" (John B. Gordon) - 7:09\n\"Hit It\" (Atkinson) - 3:45\n\"Olmecas (Dedicated to Ivan Van Sertima)\" (Newton) - 7:43\n\"Good to Go\" (Cyrille) - 4:43\n\"Fate\" (Cyrille) - 6:42\n\"A Tribute to Bu (Take 2)\" (Cyrille) - 5:50\n\n\n== Personnel ==\nAndrew Cyrille – drums, percussion\nJames Newton – flute\nLisle Atkinson – bass\n\n\n== References ==",
    "links": [
        "Album",
        "AllMusic",
        "Amiri Baraka",
        "Andrew Cyrille",
        "Andrew Hill (jazz musician)",
        "Art Blakey",
        "Black Saint/Soul Note",
        "Double Clutch (album)",
        "Frank Loesser",
        "James Newton",
        "Jazz",
        "John Carter (jazz musician)",
        "John Gordon (trombonist)",
        "Lisle Atkinson",
        "Music genre",
        "Ode to the Living Tree",
        "Record label",
        "Record producer",
        "The Penguin Guide to Jazz",
        "Tom Hull – on the Web"
    ]
}