{"url": "https://en.wikipedia.org/wiki/Graham_Joyce", "title": "Graham Joyce", "summary": "Graham William Joyce (22 October 1954 – 9 September 2014) was a British writer of speculative fiction and the recipient of numerous awards, including the O. Henry Award and the World Fantasy Award, for both his novels and short stories.", "content": "Graham William Joyce (22 October 1954 – 9 September 2014) was a British writer of speculative fiction and the recipient of numerous awards, including the O. Henry Award and the World Fantasy Award, for both his novels and short stories.\n\n\n== Biography ==\nHe grew up in a small mining village just outside Coventry to a working-class family. After receiving a BEd degree from Bishop Lonsdale College in 1977 (now University of Derby) and an M.A. degree from the University of Leicester in 1980, Joyce worked as a youth officer for the National Association of Youth Clubs until 1988. He subsequently quit his position and moved to the Greek islands of Lesbos and Crete to write his first novel, Dreamside. After selling Dreamside to Pan Books in 1991, Joyce moved back to England to pursue a career as a full-time writer. He was awarded a PhD degree by publication at Nottingham Trent University, where he taught creative writing from 1996 until his death and was made a reader in creative writing.\nGraham Joyce resided in Leicester with his wife, Suzanne Johnsen, and their two children, Ella and Joseph.\nJoyce was the regular first-choice goalkeeper for the England Writers football team, appearing in international fixtures against Germany, Italy, Sweden, Norway, Israel, Hungary, Turkey and Austrian Writers teams.  He described his footballing experiences in his non-fiction book Simple Goalkeeping Made Spectacular.\nHe was a supporter of Coventry City FC and occasionally wrote pieces for fanzines.\nJoyce died on 9 September 2014. He had been diagnosed with lymphoma in 2013. Joyce's reaction to his cancer was to publish several essays on the \"shocking clarity\" the news had brought him on the subject of death. He said \"your life is suddenly propelled along a remorseless narrative that has the structure of all great mythical journeys\".\n\n\n== Style and themes ==\nPublishers and critics alike have found difficulty in classifying Joyce's writing. His novels have been categorized as fantasy, science fiction, horror, and mainstream literature—with some even overlapping genres. Joyce utilizes a wide variety of settings and character perspectives. Settings include Scotland, The English Midlands, Greece, the Middle East, and the jungles of Thailand. He has penned for both adult and juvenile protagonists, with an emphasis on strong female characters. The greater unity in Joyce's works, however, lies in their thematic and philosophical topics. Bill Sheehan, who wrote the introduction for Partial Eclipse, states:\n\n\"Among the issues Graham dramatizes are the inevitability of grief, loss, growth, and change, the primal importance of family bonds, the beauty of the feminine, the life altering effects of parenthood, the nature of the creative unconscious, the overwhelming power of the erotic, the corrupting effects of power, the importance of self-awareness, and the fundamental need for order, meaning, and coherence in the face of a chaotic, inimical universe\".\nAmerican  author, editor and literary critic Jeff VanderMeer said:\n\n\"Joyce's fiction has always displayed a certain generosity of spirit that lifts it above the ordinary. This generosity is not at all sentimental, but is alive with sentiment and an appreciation for the mysteries of life.\"\nThe mystical or supernatural often play a pivotal role in Joyce's works. For this, he taps the mythical or folkloric associations of his settings. Joyce's treatment of these experiences is what distinguishes his novels from genre fiction. The supernatural is not seen as a conflict or an obstacle to be overcome, but rather an integral part of a natural order that a character must accept and integrate. Running parallel to these phenomena is the possibility of a rational or psychological explanation. This literary approach is influenced in part by Joyce's experiences with his own family:\n\n\"My grandmother was one of these old women who used to have dreams and visions and messages arriving. She would fall asleep in a chair, there would be a knock on the door, she would go to the door, someone strange would come to the door and deliver a message. And then she would wake up again in her chair. Now my mother and my aunties told me these stories over and over again. But they just lived with it side by side. They didn't fight it as in a fantasy or horror film. They didn't have to overcome it. It didn't get worse and worse and worse. They just accepted this mystery and then they cooked the dinner.\"\nThis particular quality has prompted some critics to classify Joyce as a magic realist in the vein of such Latinamerican writers as Gabriel García Márquez or Julio Cortázar. Joyce disagrees with this, feeling that his lineage is tied more closely to writers of the English \"weird tale\" such as Arthur Machen or Algernon Blackwood. He calls his style of writing \"Old Peculiar.\"\n\n\n== Film ==\nThe short film Black Dust was released in 2012, produced by James Laws of Pretzel Films, scripted by Joyce and Laws. Currently, there are no feature-length films based on Joyce's novels or shorts. However, the film rights to Dreamside, The Tooth Fairy, and Dark Sister have all been optioned. As of October 2010 Dreamside, Do the Creepy Thing (Joyce scripting) The Silent Land and Some Kind of Fairy Tale are all in development.\n\n\n== Music ==\nJoyce co-wrote song lyrics for French songwriter and composer Emilie Simon on her albums The Big Machine (2009) and Franky Knight (2011).\n\n\n== Games ==\nOn 16 January 2009, the site Computer and Video Games reported that Graham Joyce had been hired by id Software to \"help develop the storyline potential\" of Doom 4; after Joyce died in 2014, Adam Gascoine was brought in as a replacement.\n\n\n== Critical reception ==\nAdam Roberts stated \"Graham Joyce's The Year of the Ladybird showed that he is one of the best writers of ghost stories we have.\"\n\n\n== Bibliography ==\nAccording to his official site and the Internet Database of Speculative Fiction, Graham Joyce published fourteen novels and twenty-six short stories.\n\n\n=== Novels and short story collections ===\n\n\n=== Short stories ===\n\"Monastic Lives\" (1992)\n\"The Careperson\" (1992)\n\"Last Rising Sun\" (1992)\n\"The Ventriloquial Art\" (1993)\n\"The Apprentice\" (1993)\n\"Under the Pylon\" (1993)\n\"Gap-Sickness\" (1993)\n\"Eat Reecebread\" (1994) with Peter F. Hamilton\n\"The Reckoning\" (1994)\n\"Black Ball Game\" (1995)\n\"A Tip from Bobby Moore\" (1996)\n\"The White Stuff\" (1997) with Peter F. Hamilton\n\"Pinkland\" (1997)\n\"The Mountain Eats People\" (1998)\n\"As Seen on Radio\" (1998)\n\"Leningrad Nights\" (1999)\n\"Candia\" (1999)\n\"Incident in Mombasa\" (1999)\n\"Horrograph\" (1999)\n\"Partial Eclipse\" (2000)\n\"Xenos Beach\" (2000)\n\"Coventry Boy\" (2001)\n\"Leningrad Nights\" (2002)\n\"The Coventry Boy\" (2002)\n\"First, Catch Your Demon\" (2002)\n\"Black Dust\" (2002)\n\"Tiger Moth\" (2003)\n\"The Oversoul\" (2008) – first published in Who Can Save Us Now? (2008), edited by Owen King and John McNally\n\"An Ordinary Soldier of the Queen\" (2009)\n\n\n=== Articles ===\n\"Working Class Monster\" (June 2000)\n\"Greek Virtues\"\n\"The Great God Pan\"\n\"Two weeks, three couples and six kids equals hell\"\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nGraham Joyce at the Internet Speculative Fiction Database\nProfile at Fantastic Fiction\nLiterature map of Joyce\nSimon & Schuster profile page\n\n\n=== Interviews ===\nInterview at Actusf\nAugust 2007 interview. Located under \"Fiction\"\nGraham Joyce at Worlds Without End", "links": ["A Stranger in Olondria", "Adam Roberts (British writer)", "Alaya Dawn Johnson", "Algernon Blackwood", "Alif the Unseen", "Anna Smaill", "Arthur Machen", "Bachelor of Education", "Barry Hughart", "Bid Time Return", "Boy's Life (novel)", "Bridge of Birds", "C. L. Polk", "Catherine Webb", "China Miéville", "Christopher Priest (novelist)", "Coventry City FC", "Crete", "Dan Simmons", "Dark Sister (novel)", "David Mitchell (author)", "Declare", "Doctor of Philosophy by publication", "Doom 4", "Dreamside", "Elizabeth A. Lynn", "Ellen Kushner", "Emilie Simon", "Fantasy", "Fonda Lee", "Franky Knight", "Fritz Leiber", "G. Willow Wilson", "Gabriel García Márquez", "Galveston (novel)", "Gene Wolfe", "Gloriana (novel)", "Godmother Night", "Guy Gavriel Kay", "Haruki Murakami", "Horror fiction", "How to Make Friends with Demons", "ISBN (identifier)", "ISNI (identifier)", "Internet Speculative Fiction Database", "Jack Vance", "Jade City (novel)", "James K. Morrow", "Jeff VanderMeer", "Jeffrey Ford", "Jo Walton", "John Crowley (author)", "John M. Ford", "Jonathan Strange & Mr Norrell", "Julio Cortázar", "Kacen Callender", "Kafka on the Shore", "Ken Grimwood", "Keresley, England", "Koko (novel)", "Last Call (novel)", "Lavie Tidhar", "Lesbos", "Lewis Shiner", "Little, Big", "Locus (magazine)", "Louise Erdrich", "Lymphoma", "Lyonesse Trilogy", "MBA (identifier)", "Magic realist", "Margo Lanagan", "Martin Millar", "Master of Arts", "Michael Moorcock", "Michael Shea (American author)", "Mythago Wood", "Nifft the Lean", "Nnedi Okorafor", "Nottingham Trent University", "O. Henry Award", "Ombria in Shadow", "Only Begotten Daughter", "Osama (novel)", "Our Lady of Darkness", "Owen King", "Patricia A. McKillip", "Patrick Süskind", "Perfume (novel)", "Peter Straub", "Polygon (website)", "Queen of the Conquered", "RERO (identifier)", "Rachel Pollack", "Replay (Grimwood novel)", "Richard Matheson", "Robert Holdstock", "Robert R. McCammon", "SUDOC (identifier)", "Science fiction", "Sean Stewart", "Sofia Samatar", "Soldier of Sidon", "Some Kind of Fairy Tale", "Song of Kali", "Speculative Fiction", "Speculative fiction", "Susanna Clarke", "Swecon", "Tender Morsels", "The Big Machine", "The Bone Clocks", "The Changeling (LaValle novel)", "The City & the City", "The Dragon Waiting", "The Exchange (novel)", "The Facts of Life (Joyce novel)", "The Forgotten Beasts of Eld", "The Ghost in the Electric Blue Suit", "The Guardian", "The Other Wind", "The Physiognomy", "The Prestige", "The Shadow Year", "The Shadow of the Torturer", "The Silent Land", "The Sudden Appearance of Hope", "The Tooth Fairy (novel)", "Thomas the Rhymer (novel)", "Thraxas", "Tim Powers", "Tooth and Claw (novel)", "Towing Jehovah", "Trouble the Saints", "Trove (identifier)", "United Kingdom", "University of Derby", "University of Leicester", "Ursula K. Le Guin", "VIAF (identifier)", "Victor LaValle", "Vox Media", "Watchtower (novel)", "Wayback Machine", "Who Fears Death", "William Kotzwinkle", "Witchmark", "World Fantasy Award", "World Fantasy Award—Novel", "Ysabel"]}