{"url": "https://en.wikipedia.org/wiki/Grand_Haven,_Michigan", "title": "Grand Haven, Michigan", "summary": "Grand Haven is a city in the U.S. state of Michigan and the county seat of Ottawa County. Grand Haven is located on the eastern shore of Lake Michigan at the mouth of the Grand River, for which it is named.  As of the 2010 census, Grand Haven had a population of 10,412. It is part of the Grand Rapids Metropolitan Area, which had a population of 1,027,703 in 2014. The city is home to the Grand Haven Memorial Airpark (3GM) and is located just north of Grand Haven Charter Township.", "content": "Grand Haven is a city in the U.S. state of Michigan and the county seat of Ottawa County. Grand Haven is located on the eastern shore of Lake Michigan at the mouth of the Grand River, for which it is named.  As of the 2010 census, Grand Haven had a population of 10,412. It is part of the Grand Rapids Metropolitan Area, which had a population of 1,027,703 in 2014. The city is home to the Grand Haven Memorial Airpark (3GM) and is located just north of Grand Haven Charter Township.\n\n\n== History ==\nThe Potawatomi and Ottawa Indians lived in the area for centuries and used the river as a trade route into the interior of Michigan. Some of the long culture of the Ottawa tribe is being revealed through the excavation of archeological artifacts.The city dates its European-American founding to French colonial settlers. A fur trading outpost called Gabagouache was first established by Madeline La Framboise and her husband Joseph.\n\nAfter the War of 1812, this area became more settled by Americans. The first permanent resident was a Presbyterian minister, William Montague Ferry, who founded in 1834 the first area church and neighboring town of Ferrysburg. Residents named the town as \"Grand Haven\" in 1835. Sheldon Tannery was founded in 1838, developing to process leathers from the fur trade and cattle. The second church was organized in 1850. Ferry founded the city's first bank in 1851 in the Ferry & Son building on Harbor Drive. He also started a school, Ferry Elementary, which continues to operate. The city was incorporated in 1867.In the mid-to-late 19th century, Grand Haven developed as a logging, lumber mill and shipping town, as well as a shipbuilding center.The city was served by the Grand Trunk Railway, which ran along the waterfront near the river. Its depot and offices have been adapted for use as a historical museum. The Story and Clark Piano Company built pianos in the city from 1900 to 1984. The smokestack at the piano factory collapsed during the Southern Great Lakes Derecho of 1998. In August 2006, Eagle-Ottawa Leather Co., which developed from the 1838 Sheldon Tannery, announced it would close its local operations that year.\nGiven the importance of shipping and water trade to the city, the Grand Haven Lighthouses were built in 1839 on the south pier, to mark the most navigable channel into the river. The current lighthouses, painted red, were built in 1875 (outer light) and 1905 (inner). They are connected by a lighted catwalk, which runs along the pier to the shore.George \"Baby Face\" Nelson and Homer Van Meter, who became notorious 1930s criminals, committed their first bank robbery at a Grand Haven bank.\n\n\n== Business and tourism ==\n\nThe Grand Haven port community is an active beach resort with boating, fishing, sailing, biking, skating etc. along with connecting campgrounds and recreational areas. The city has over 100 miles (160 km) of bike trails, a state beach, boardwalk, two lighthouses, a pier, wharf, large charter fishing fleet and a Great Lakes port, where it imports limestone, slag, cement and coal while exporting sand. Grand Haven is a destination point for residents of inland cities of West Michigan, as well as many from the other side of the state. Grand Rapidians regularly visit to take advantage of the close proximity to the Lake Michigan beaches, State campgrounds, restaurants, bars, attractions with many even owning cottages in the area as their home away from home.\nGrand Haven State Park contains beaches which, in summer, water temperatures reach the low 70s°F (2013 had 19 days in the 70s), bringing tens of thousands of visitors as a boon to the local economy.\nThe state park also includes a campground on Lake Michigan, near the pier and lighthouses. In addition, the city features a ski park (Mulligan's Hollow Ski Bowl) and a skate park. The waterfront locations bring tourists from all over the state and region for activities which include, boating, sailing, jet skiing, tubing, wind surfing, and an annual kite festival.\nGrand Haven is home to the United States Coast Guard's \"Sector Field Office Grand Haven.\" The first Coast Guard presence in the city was in 1924. The Coast Guard cutter Escanaba was based in the city until the Second World War. After it was sunk by a U-boat of Nazi Germany's Kriegsmarine, the citizens of Grand Haven raised more than $1,000,000 in bonds to build a replacement cutter bearing the same name; several pieces of wreckage remain displayed on the city's waterfront.[1] Grand Haven hosts the annual Coast Guard Festival, a celebration based on Coast Guard Day, which draws U.S. and Canadian vessels along with parades of bands and other activities, including a memorial to the 101 sailors lost in the Escanaba sinking. The yearly attendance for this event exceeds 300,000 people over the two-week period of the festival. Grand Haven is the first city officially designated as Coast Guard City, USA by an act of Congress signed by President Bill Clinton. The act was Public Law 105-383 enacted by the United States Congress and signed by the president on November 13, 1998.\n\nThe Grand Haven Musical Fountain was built on the opposite bank of the Grand River from the city center in 1962. It plays nightly during the tourist season. When it was built, it was the world's largest such fountain. Today, the overall largest fountain is in Las Vegas.\nThe City of Grand Haven has many parks. These include a large section of beach on Lake Michigan, a ski hill, and multiple boat launches. Duncan Woods (officially Duncan Memorial Park) is one of the largest sections of unspoiled virgin forest in the entire lower peninsula of Michigan. In these woods, visitors get to see what Michigan looked like before the deforestation of the lumber era.\n\n\n== Technology ==\nGrand Haven has been one of many technology leaders in West Michigan and throughout the country, having been featured in the national media, including on ABC, in PCWorld, ComputerWorld and Forbes magazine.  The city was the first municipality in the country to feature a citywide wireless internet service. The wireless service is designed to work throughout the city and up to 15 miles (24 km) offshore for boaters. In 2004, the city started offering wireless internet service for residents, businesses and visitors for payment on varying cost-time scales.\n\n\n== Geography ==\nAccording to the United States Census Bureau, the city has a total area of 7.36 square miles (19.06 km2), of which 5.77 square miles (14.94 km2) is land and 1.59 square miles (4.12 km2) is water.\n\n\n== Education ==\n\n\n=== Primary and secondary schools ===\nGrand Haven Area Public Schools\nGrand Haven High School\nCentral High School\nWhite Pines Intermediate School\nLakeshore Middle School\nVoyagers School\nRosy Mound Elementary\nRobinson Elementary\nPeach Plains Elementary\nMary A. White Elementary\nLake Hills Elementary\nGriffin Elementary\nFerry Elementary\nPrivate schools\nGrand Haven Christian School\nSt. John's Lutheran School\n\n\n== Major highways ==\n US 31 runs through the city along a boulevard and utilizes a drawbridge over the Grand River at the northern city limit.\n M-104 runs easterly from US 31 in Ferrysburg, through Spring Lake and toward I-96.\n\n\n== Demographics ==\n\n\n=== 2010 census ===\nAs of the census of 2010, there were 10,412 people, 4,769 households, and 2,721 families living in the city. The population density was 1,804.5 inhabitants per square mile (696.7/km2). There were 5,815 housing units at an average density of 1,007.8 per square mile (389.1/km2). The racial makeup of the city was 95.0% White, 0.7% African American, 0.9% Native American, 1.0% Asian, 0.4% from other races, and 1.9% from two or more races. Hispanic or Latino of any race were 2.4% of the population.\nThere were 4,769 households, of which 24.8% had children under the age of 18 living with them, 42.1% were married couples living together, 11.0% had a female householder with no husband present, 3.9% had a male householder with no wife present, and 42.9% were non-families. 37.2% of all households were made up of individuals, and 14.9% had someone living alone who was 65 years of age or older. The average household size was 2.15 and the average family size was 2.82.\nThe median age in the city was 42.9 years. 20.7% of residents were under the age of 18; 7.6% were between the ages of 18 and 24; 24.2% were from 25 to 44; 28.5% were from 45 to 64; and 19.1% were 65 years of age or older. The gender makeup of the city was 47.4% male and 52.6% female.\n\n\n=== 2000 census ===\nAs of the census of 2000, there were 11,168 people, 4,979 households, and 2,892 families living in the city. The population density was 1,923.5 per square mile (742.2/km2). There were 5,532 housing units at an average density of 952.8 per square mile (367.6/km2). The racial makeup of the city was 96.35% White, 0.45% African American, 0.56% Native American, 0.87% Asian, 0.02% Pacific Islander, 0.40% from other races, and 1.35% from two or more races. Hispanic or Latino of any race were 1.58% of the population.\nThere were 4,979 households, out of which 23.8% had children under the age of 18 living with them, 45.5% were married couples living together, 9.7% had a female householder with no husband present, and 41.9% were non-families. 34.8% of all households were made up of individuals, and 14.2% had someone living alone who was 65 years of age or older. The average household size was 2.17 and the average family size was 2.81.\nIn the city, the population was spread out, with 20.1% under the age of 18, 9.2% from 18 to 24, 27.6% from 25 to 44, 23.4% from 45 to 64, and 19.6% who were 65 years of age or older. The median age was 40 years. For every 100 females, there were 89.5 males. For every 100 females age 18 and over, there were 86.0 males.\n\n\n== Local media ==\nThe area is served by the daily newspaper Grand Haven Tribune, headquartered in Grand Haven. The Tribune has a circulation of 8,813.The city has several radio stations, including WGHN (AM), WGHN-FM, WMPA, Oldies 94.9, and WAWL.\n\n\n== Notable people ==\n\nHoward Bailey, Major League Baseball pitcher\nNeal Ball, first player in Major League Baseball to execute an unassisted triple play (accomplished in 1909)\nBØRNS, indie-pop singer-songwriter, EP \"Candy\"\nDan Bylsma, former NHL player, Stanley Cup winner (coaching), former head coach of Pittsburgh Penguins and Buffalo Sabres, former assistant coach of Detroit Red Wings\nDale Deppe, a horticulture industry innovator of proprietary woody plants and founder of Spring Meadow Nursery in Grand Haven\nThomas W. Ferry, U.S. Senator who served as President pro tempore of the United States Senate\nWilliam Montague Ferry  a Presbyterian minister, missionary, and community leader who founded several settlements in Ottawa County.\n\n\n== References ==\n\n\n== External links ==\nGrand Haven Area Convention and Visitors Bureau\nCity of Grand Haven\nGrand Haven Chamber of Commerce", "links": ["1870 United States census", "1880 United States census", "1890 United States census", "1900 United States census", "1910 United States census", "1920 United States census", "1930 United States census", "1940 United States census", "1950 United States census", "1960 United States census", "1970 United States census", "1980 United States census", "1990 United States census", "2000 United States census", "2010 United States Census", "2010 United States census", "2020 United States Census", "2020 United States census", "Adrian, Michigan", "African American (U.S. Census)", "Agnew, Michigan", "Allegan, Michigan", "Allendale, Michigan", "Allendale Charter Township, Michigan", "Alpena, Michigan", "Ann Arbor, Michigan", "Asian (U.S. Census)", "Atlanta, Michigan", "Bad Axe, Michigan", "Baldwin, Michigan", "Bay City, Michigan", "Beechwood, Michigan", "Bellaire, Michigan", "Bessemer, Michigan", "Beulah, Michigan", "Big Rapids, Michigan", "Bill Clinton", "Blendon Township, Michigan", "Boulevard", "Buffalo Sabres", "BØRNS", "Cadillac, Michigan", "Caro, Michigan", "Cassopolis, Michigan", "Census", "Census-designated place", "Centreville, Michigan", "Charlevoix, Michigan", "Charlotte, Michigan", "Charter township", "Cheboygan, Michigan", "Chester Township, Ottawa County, Michigan", "City", "City (Michigan)", "Civil township", "Coast Guard Day", "Coast Guard Festival", "Coast Guard Station Grand Haven", "Coldwater, Michigan", "Coopersville, Michigan", "Corunna, Michigan", "Council-manager", "County seat", "Crockery Township, Michigan", "Crystal Falls, Michigan", "Dale Deppe", "Dan Bylsma", "Daylight saving time", "Detroit, Michigan", "Detroit Red Wings", "Drawbridge", "Drenthe, Michigan", "Eagle River, Michigan", "Eastern Daylight Time", "Eastmanville, Michigan", "Escanaba, Michigan", "Federal Information Processing Standard", "Ferrysburg, Michigan", "Flint, Michigan", "Fur trading", "Gaylord, Michigan", "Geographic Names Information System", "Geographic coordinate system", "George \"Baby Face\" Nelson", "Georgetown Township, Michigan", "Gladwin, Michigan", "Grand Haven Charter Township, Michigan", "Grand Haven High School", "Grand Haven Musical Fountain", "Grand Haven South Pierhead Entrance Light", "Grand Haven South Pierhead Inner Light", "Grand Haven State Park", "Grand Haven Tribune", "Grand Rapids, Michigan", "Grand Rapids Metropolitan Area", "Grand River (Michigan)", "Grand Trunk Railway", "Grand Valley, Michigan", "Grayling, Michigan", "Harrison, Michigan", "Harrisville, Michigan", "Hart, Michigan", "Hastings, Michigan", "Hillsdale, Michigan", "Hispanic (U.S. Census)", "Holland, Michigan", "Holland Charter Township, Michigan", "Homer Van Meter", "Horticulture", "Houghton, Michigan", "Howard Bailey (baseball)", "Howell, Michigan", "Hudsonville, Michigan", "I-96", "ISBN (identifier)", "Ionia, Michigan", "Iron Mountain, Michigan", "Ithaca, Michigan", "Jackson, Michigan", "Jamestown Charter Township, Michigan", "Jenison, Michigan", "Kalamazoo, Michigan", "Kalkaska, Michigan", "Kriegsmarine", "L'Anse, Michigan", "Lake City, Michigan", "Lake Michigan", "Lamont, Michigan", "Lapeer, Michigan", "Las Vegas, Nevada", "Late-May 1998 tornado outbreak and derecho", "Latino (U.S. Census)", "List of counties in Michigan", "List of sovereign states", "Ludington, Michigan", "M-104 (Michigan highway)", "MBAREA (identifier)", "Madeline La Framboise", "Major League Baseball", "Manistee, Michigan", "Manistique, Michigan", "Marne, Michigan", "Marquette, Michigan", "Marriage", "Marshall, Michigan", "Mason, Michigan", "Mayor", "Menominee, Michigan", "Michigan", "Midland, Michigan", "Mio, Michigan", "Monroe, Michigan", "Mount Clemens, Michigan", "Mount Pleasant, Michigan", "Munising, Michigan", "Muskegon, Michigan", "Native American (U.S. Census)", "Neal Ball", "Newberry, Michigan", "North American Eastern Time Zone", "Nunica, Michigan", "Olive Township, Ottawa County, Michigan", "Ontonagon, Michigan", "Ottawa (tribe)", "Ottawa County, Michigan", "Pacific Islander (U.S. Census)", "Panoramic map", "Park Township, Ottawa County, Michigan", "Paw Paw, Michigan", "Petoskey, Michigan", "Piano", "Pittsburgh Penguins", "Polkton Township, Michigan", "Pontiac, Michigan", "Population density", "Port Huron, Michigan", "Port Sheldon Township, Michigan", "Potawatomi", "Presbyterian", "President pro tempore of the United States Senate", "Race (U.S. Census)", "Race (United States Census)", "Reed City, Michigan", "Robinson Township, Michigan", "Rogers City, Michigan", "Roscommon, Michigan", "Saginaw, Michigan", "Sandusky, Michigan", "Sault Ste. Marie, Michigan", "Second World War", "Spring Lake, Michigan", "Spring Lake Township, Michigan", "St. Ignace, Michigan", "St. Johns, Michigan", "St. Joseph, Michigan", "Standish, Michigan", "Stanley Cup", "Stanton, Michigan", "Story and Clark Piano Company", "Suttons Bay Township, Michigan", "Tallmadge Township, Michigan", "Tawas City, Michigan", "Telephone numbering plan", "Thomas W. Ferry", "Time zone", "Traverse City, Michigan", "U-boat", "U.S. Route 31 in Michigan", "U.S. state", "USCGC Escanaba (WHEC-64)", "USCGC Escanaba (WPG-77)", "UTC-4", "UTC-5", "Unassisted triple play", "Unincorporated area", "United States", "United States Census Bureau", "United States Coast Guard", "VIAF (identifier)", "Village (Michigan)", "WGHN-FM", "WGHN (AM)", "Wayne State University Press", "West Branch, Michigan", "West Olive, Michigan", "White (U.S. Census)", "White Cloud, Michigan", "William Montague Ferry", "Wright Township, Ottawa County, Michigan", "ZIP code", "Zeeland, Michigan", "Zeeland Charter Township, Michigan"]}