{"url": "https://en.wikipedia.org/wiki/Greater_Hartford_Academy_of_the_Arts", "title": "Greater Hartford Academy of the Arts", "summary": "The CREC Greater Hartford Academy of the Arts Half Day (known formerly as the Greater Hartford Academy of the Arts) is an integrated magnet arts high school serving students in Hartford, Connecticut and its surrounding towns. It is one of four schools located on the 16-acre (65,000 m2) campus of The Learning Corridor.  \nThe Capital Region Education Council (CREC) has managed the school since it was established in 1985. It is a half day program meaning that students attend their home district’s school for their academics and then attend the Academy in the afternoon for arts education.\n\n", "content": "The CREC Greater Hartford Academy of the Arts Half Day (known formerly as the Greater Hartford Academy of the Arts) is an integrated magnet arts high school serving students in Hartford, Connecticut and its surrounding towns. It is one of four schools located on the 16-acre (65,000 m2) campus of The Learning Corridor.  \nThe Capital Region Education Council (CREC) has managed the school since it was established in 1985. It is a half day program meaning that students attend their home district’s school for their academics and then attend the Academy in the afternoon for arts education.\n\n\n== History ==\nThe Academy was founded in 1985 by Dr. Janet Brown. The school was initially housed in a former funeral parlor in Hartford’s South End with an annex building next door.  In 2000, the school moved to the new Learning Corridor Campus. Part of this expansion included a recital hall, theater, black box theater, music rehearsal spaces, and visual arts studios/galleries.\nWith the addition of the theater space, the Academy started offering a full production season as part of its program.\nIn 2005 the Academy was selected by the Rodgers & Hammerstein Organization to be the first high school in the United States to perform the long-running Broadway Musical Cats.\nIn December 2011 the Academy became the first high school to perform Tony Kushner and Jeanine Tesori's Caroline, or Change. Other notable accomplishments includes performances at the 2012 Olympics, and a performance of David Brubeck’s “Real Ambassadors.” Additionally, the Academy has been the recipient of many awards including “Best Arts Magnet School” from the Magnet Schools of America and it was the recipient of the “Best of Hartford” for many years in a row\nIn 2008, as part of the expansions of magnet schools in Connecticut, the Academy started to additionally offer a full day program  integrated with the school’s original half day only model. As of 2019, this model of an integrated half/full day program changed and a separate “Greater Hartford Academy of the Arts Full Day” as a different school with different arts training model and course offerings but includes a traditional high school curriculum.\nThe Greater Hartford Academy of the Arts Half Day remained separately as a school focused strictly on arts.\n\n\n== School ==\nStudents chose a major from several arts departments which are Dance, Musical Theater, Music (vocal, instrumental, jazz, or classical), Theater, Visual Arts, and Theater Design and Production. Students study under the direction of professional artist instructors. In addition to daily arts training, students take master classes with accomplished visiting artists. Many of the artists instructors have resumes that range from Broadway, television, and have had plays and other works published.\nDuring the year, students have many opportunities at the Academy to audition to take part in its production season each year which include Choreographers’ Showcase ( a yearly showcasing of dance performances from accomplished choreographers), a spring musical, and other productions\n\n\n== Notable alumni ==\nThe school has a few notable alumni who have gone on to perform on Broadway and television, recorded albums or have become successful in their own right.\n\nAnita Antoinette\nZaccai Curtis\nChristopher Larkin (actor)\nJimmy Greene\n\n\n== References ==\n\n\n== External links ==\nThe Greater Hartford Academy of the Arts Half Day\nCoeyman, Marjorie.  Using the Arts to Attract a Diverse Student Body, The Christian Science Monitor, June 23, 1998.", "links": ["Anita Antoinette", "Broadway theatre", "Capitol Region Education Council", "Caroline, or Change", "Cats (musical)", "Christopher Larkin (actor)", "Connecticut", "Geographic coordinate system", "Hartford, Connecticut", "High school", "Jeanine Tesori", "Jimmy Greene", "Magnet school", "The Christian Science Monitor", "The Learning Corridor", "Tony Kushner", "United States", "Zaccai Curtis"]}