{"url": "https://en.wikipedia.org/wiki/HCS_Sylph_(1806)", "title": "HCS Sylph (1806)", "summary": "The H[onourable] C[ompany's] S[hip] Sylph was a schooner launched in 1806 at the Bombay Dockyard for the Bombay Marine, the naval arm of the British East India Company (EIC). The EIC sold her circa 1826 and she became a merchant brig. There is no mention of her in accessible online sources after 1828.", "content": "The H[onourable] C[ompany's] S[hip] Sylph was a schooner launched in 1806 at the Bombay Dockyard for the Bombay Marine, the naval arm of the British East India Company (EIC). The EIC sold her circa 1826 and she became a merchant brig. There is no mention of her in accessible online sources after 1828.\n\n\n== Career ==\nIn October 1808 Sylph, Lieutenant W.C. Graham, commanding, was part of a squadron that delivered  Sir Harford Jones from Bombay to Persia. While she was returning to Bombay she separated from the squadron and on the 20th encountered several dhows belonging to the Joasmi (Al Qasimi) tribe of the Arab coast of the Gulf. Lieutenant Graham was under strict orders not to fire until fired upon. The dhows came up to Sylph and without firing a shot the Arabs swarmed on to Sylph. They quickly slaughtered almost her entire crew. Lieutenant Graham was badly wounded and fell through a hatchway. Two men below decks dragged him into a storeroom and barred the door. The Arabs took possession of Sylph and started to sail away, not having searched her. Fortuitously HMS Nereide, which had been part of the British squadron, came on the scene. Captain Robert Corbett, of Nereide, seeing the schooner surrounded by dhows, came up. The dhows fled. Nereide was unable to catch any but did recapture Sylph and rescue the three British survivors.On 2 January 1811 HCS Ternate and Sylph (Lieutenant Hardy), sailed from Bombay to survey the coast of East Africa as far south as Zanzibar. On 12 January near Socotra, they parted from two merchant vessels bound for Mocha that they had convoyed, and turned south. They reached Zanzibar, from where on 9 April, Ternate sailed for Mocha. Sylph remained for a short time to protect the merchants of Surat from the extortionate demands of the Hakim (Viceroy) of the Sultan of Muscat. She then escorted the Surat merchants' vessels back to Bombay.In November 1811 the EIC sent a combined force to Kattywar consisting of an army contingent under the command of Colonel Lionel Smith of the 65th Regiment of Foot, and a naval squadron under the command of Captain Sealy, of HCS Benares. In addition to Benares, the naval squadron consisted of the HCS Prince of Wales, Sylph, and Zephyr, and four or five armed patamars. The naval squadron captured three baghalas anchored under the protection of Fort Nuranseer at Lakhpat (Lukput) on Kori (or Khori) Creek, some 40 miles or more up from the north side of the Gulf of Kutch. In February 1812 the army contingent, assisted by the naval squadron, captured the fort of Navanagar (or Nawangar, or Nowanuggur; now Jamnagar).In 1815–1816 the EIC sent another combined-arms force to the Gulf of Kutch. The naval squadron consisted of Sylph, under the command of Lieutenant James Arthur, and Vestal.During the Third Anglo-Maratha War (1817–1818), Sylph (Lieutenant Robson), Prince of Wales, and Thetis were stationed at Fort Victoria, near Severndroog. Officers and men from the crews of the vessels participated in the capture of several forts and in skirmishes on the Concan Coast.\n\n\n== Mercantile service ==\nAt some point between 1824 and 1827, the EIC sold Sylph. The East-India register and army list for 1824 listed Sylph among the Company's vessels, and there was no mercantile Sylph. The East-India register and army list for 1827 no longer listed Sylph among the company's vessels, but did list a Sylph, of 79 tons (bm), among the merchant vessels registered at Bombay.\n\nCushalchund Goulabchund owned Sylph from 1826 to 1828. In 1828 and 1829 Sylph was described as a brig.\n\n\n== Citations and references ==\nCitations\n\nReferences\n\nHackman, Rowan (2001). Ships of the East India Company. Gravesend, Kent: World Ship Society. ISBN 0-905617-96-7.\nLow, Charles Rathbone (1877). History of the Indian Navy: (1613-1863). R. Bentley and son.\nMerriman, Commaner R.D. (2005) \"The Indian Navy – A Review of its Activities in Sindh and on the Adjacent Coasts 1815–1863\", in Ali, Mubarak, ed., Sindh Observed – Selection from the Journal of the Historical Society. (Fiction House).\nWadia, R. A. (1986) [1957]. The Bombay Dockyard and the Wadia Master Builders. Bombay.", "links": ["65th (2nd Yorkshire, North Riding) Regiment of Foot", "Al Qasimi", "Baghala", "Bankot fort", "Bombay Dockyard", "Bombay Marine", "Builder's Old Measurement", "Dhow", "East India Company", "French frigate Néréide (1779)", "Gulf of Kutch", "HCS Benares (1807)", "HCS Prince of Wales (1805)", "HCS Ternate (1801)", "HCS Thetis (1810)", "HCS Vestal (1809)", "HMS Sylph", "Harford Jones-Brydges", "ISBN (identifier)", "Jamnagar", "Kathiawar", "Lakhpat", "Patamar", "Suvarnadurg", "Sylph (ship)", "Third Anglo-Maratha War"]}