{"url": "https://en.wikipedia.org/wiki/Herbert_E._Gaston", "title": "Herbert E. Gaston", "summary": "Herbert Earle Gaston (August 20, 1881 – December 7, 1956) was an American newspaper editor who served as Assistant Secretary of the Treasury under President Franklin D. Roosevelt and president of the Export-Import Bank of the United States from 1949 until his 1953.", "content": "Herbert Earle Gaston (August 20, 1881 – December 7, 1956) was an American newspaper editor who served as Assistant Secretary of the Treasury under President Franklin D. Roosevelt and president of the Export-Import Bank of the United States from 1949 until his 1953.\n\n\n== Early life ==\nGaston was born on August 20, 1881, in Halsey, Oregon. He was the son of Maria Glasgow (née Irvine) Gaston and William Hawks Gaston, a merchant and farmer. His maternal grandfather was the Presbyterian minister, the Rev. Samuel Glasgow Irvine, D.D.He attended schools in Tacoma, Washington before studying at the University of Washington from 1903 to 1904 and the University of Chicago from 1904 to 1906.\n\n\n== Career ==\n\nGaston began at working in newspapers in Tacoma, Seattle and Chicago as a reporter, printer and assistant city editor on the Tacoma Tribune. From 1898 to 1910, he worked for the West Coast Trade in Tacoma, the Seattle Times, the Tacoma Ledger and the Chicago Record-Herald. From 1910 to 1916, he was assistant editor of the Spokane Chronicle before becoming editor of the Nonpartisan Leader in Fargo, North Dakota. The next year he edited the Fargo Courier-News before resuming work with the Nonpartisan League from 1918 to 1920. In 1920, he helped establish the Minneapolis Star. After a rift with the other members of the Minneapolis Star over Gaston's expose on gambling interests in the Twin Cities, he moved to New York City where he worked for the New York World, serving as night editor until the paper closed in 1931.After the closure of the New York World, Gaston went to work for Henry Morgenthau Jr. as secretary of the New York State Conservation Department, becoming a deputy commissioner within a year. After leaving the State government, Gaston became secretary of the Federal Farm Board and deputy governor of the Farm Credit before being appointed special assistant to Morgenthau in November 1933, handling public relations.In 1939, Gaston became Assistant Secretary of the Treasury under then Secretary of the Treasury Morgenthau, with jurisdiction over the U.S. Coast Guard, the Secret Service, and the Bureau of Narcotics. Gaston left the treasury in 1945, to become vice-chairman and director of the Export-Import Bank. In 1949, he succeeded William McChesney Martin as bank president and chairman, holding both posts until his retirement in 1953.\n\n\n== Personal life ==\nOn October 16, 1907, he married Ethel Bell. Together, they were the parents of two children, including:\nMary Rainey Gaston (1912–1993), who married Robert Kramer in 1941; Kramer served as assistant attorney general during the Eisenhower administration and later became dean of George Washington Law School.Gaston died on December 7, 1956, at the University of California at Los Angeles Medical Center in California.\n\n\n== References ==\n\n\n== External links ==\nGaston, Herbert E. (Herbert Earle) (1881-1956) at the Franklin D. Roosevelt Presidential Library and Museum\nHerbert E. Gaston and his wife Ethel Gaston at a train station, Los Angeles (probably), 1935, University of California, Los Angeles Library", "links": ["Assistant Secretary of the Treasury", "Bureau of Narcotics", "Chicago Record-Herald", "Edward H. Foley", "Eisenhower administration", "Export-Import Bank of the United States", "Fargo, North Dakota", "Fargo Courier-News", "Farm Credit Administration", "Federal Farm Board", "Franklin D. Roosevelt", "Franklin D. Roosevelt Presidential Library and Museum", "George Washington Law School", "Glen E. Edgerton", "Halsey, Oregon", "Harry S. Truman", "Harvard University", "Henry Morgenthau Jr.", "ISBN (identifier)", "Los Angeles, California", "Minneapolis Star", "New York State Conservation Department", "New York World", "Nonpartisan Leader", "Nonpartisan League", "Née", "Princeton University Press", "Seattle Times", "Spokane Chronicle", "Tacoma, Washington", "Tacoma Ledger", "Tacoma Tribune", "The New York Times", "Twin Cities", "U.S. Coast Guard", "United States Secret Service", "University of California at Los Angeles Medical Center", "University of Chicago", "University of Washington", "Washington Post", "Wayne Chatfield-Taylor", "William McChesney Martin"]}