{"url": "https://en.wikipedia.org/wiki/Herbert_Schramm", "title": "Herbert Schramm", "summary": "Herbert Schramm (13 October 1913 – 1 December 1943) was a Luftwaffe ace and recipient of the Knight's Cross of the Iron Cross with Oak Leaves during World War II.", "content": "Herbert Schramm (13 October 1913 – 1 December 1943) was a Luftwaffe ace and recipient of the Knight's Cross of the Iron Cross with Oak Leaves during World War II.\n\n\n== Military career ==\nA keen pilot from an early age, in 1933 he became a civil aviation instructor. Then in 1938, as the new Luftwaffe emerged and expanded, he joined and started training as a fighter pilot. When war broke out in September 1939, he was a Feldwebel in 8./ JG53 based on the Western Front.With very little activity there, it was not until the French campaign that he scored his first victory: a Morane 406 over Sedan on 14 May 1940, although it was unconfirmed. His first verified victory was over another Morane on 27 May. This earned him the Iron Cross (2nd Class) and a promotion to Oberfeldwebel.\nIn the ensuing Battle of Britain, he would score consistently, and ended the campaign with 8 victories. Commissioned as a Leutnant, he was also awarded the Ehrenpokal (Trophy of Honour) on 23 February 1941.\nTransferred, along with the rest of JG53, to the East for Operation 'Barbarossa', to support Army Group Centre. On the opening day of the Russian invasion he shot down two bombers. Now a very experienced pilot, he scored quickly, including four DB-3 bombers on the 3rd day of the campaign and two more each on both the 3rd and 6 July. He was personally awarded the Ritterkreuz, along with his Gruppenkommandeur Wolf-Dietrich Wilcke on 9 August 1941 (both for 25 victories) by his Luftflotte' commander, Generalfeldmarschall Kesselring.\nBy the time his unit was rotated back to Germany in October, for rest and recuperation, Herbert had 37 victories. He did not follow his unit to the Mediterranean theatre though in early 1942. Instead his skills as an instructor, and now combat veteran, were needed for the training of the next generation of new pilots, and he would stay in the Training Schools for all of 1942 and into 1943.\nHowever, with the Allied bomber raids starting to get bigger and bigger he was recalled to combat. Oberleutnant Schramm took command of 5./JG 27 on 13 August 1943, recently returned from the Mediterranean to bolster the Reich Defence. This was a whole new type of aerial warfare - greatly outnumbered by the fighter escorts, and against the fearsome defensive firepower of the American bombers. Schramm shot down his first 4-engined bomber on 14 October, as his 40th victory, and two more at the end of the month.\nOn December 1, 1943, intercepting bombers en route to Cologne, Schramm was killed in action over Eupen, in Belgium, when he was shot down by an American P-47 Thunderbolt. He was posthumously awarded the Oak Leaves to his Knight's Cross on 11 February 1945 and promoted to Hauptmann. During his career he flew 480 combat missions and was credited with 42 aerial victories, 14 over the Western Front and 28 over the Eastern Front.\n\n\n== Awards ==\nFlugzeugführerabzeichen\nFront Flying Clasp of the Luftwaffe\nEhrenpokal der Luftwaffe (23 February 1941)\nIron Cross (1939)\n2nd Class (20 April 1940)\n1st Class (13 September 1940)\nKnight's Cross of the Iron Cross with Oak Leaves\nKnight's Cross on 6 August 1941 as Leutnant and  Flugzeugführer in the III./Jagdgeschwader 53\n736th Oak Leaves on 11 February 1945 as Oberleutnant and Staffelkapitän of the 5./Jagdgeschwader 27\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Bibliography ===", "links": ["Aviator badge", "Battle of Britain", "Battle of France", "Belgium", "Defence of the Reich", "Eastern Front (World War II)", "Ehrenpokal der Luftwaffe", "Eupen", "Fighter ace", "Front Flying Clasp of the Luftwaffe", "Hauptmann", "ISBN (identifier)", "Iron Cross", "Jagdgeschwader 27", "Jagdgeschwader 53", "Knight's Cross of the Iron Cross with Oak Leaves", "Leutnant", "Luftwaffe", "Nazi Germany", "Oberleutnant", "P-47 Thunderbolt", "Staffelkapitän", "Walther-Peer Fellgiebel", "Wetzlar", "Wolf-Dietrich Wilcke", "World War II"]}