{"url": "https://en.wikipedia.org/wiki/History_of_slavery_in_Maryland", "title": "History of slavery in Maryland", "summary": "Slavery in Maryland lasted over 200 years, from its beginnings in 1642 when the first Africans were brought as slaves to St. Mary's City, to its end after the Civil War. While Maryland developed similarly to neighboring Virginia, slavery declined here as an institution earlier, and it had the largest free black population by 1860 of any state. The early settlements and population centers of the province tended to cluster around the rivers and other waterways that empty into the Chesapeake Bay. Maryland planters cultivated tobacco as the chief commodity crop, as the market was strong in Europe. Tobacco was labor-intensive in both cultivation and processing, and planters struggled to manage workers as tobacco prices declined in the late 17th century, even as farms became larger and more efficient. At first, indentured servants from England supplied much of the necessary labor but, as their economy improved at home, fewer made passage to the colonies. Maryland colonists turned to importing indentured and enslaved Africans to satisfy the labor demand.\nBy the 18th century, Maryland had developed into a plantation colony and slave society, requiring extensive numbers of field hands for the labor-intensive commodity crop of tobacco. In 1700, the province had a population of about 25,000, and by 1750 that number had grown more than five times to 130,000. By 1755, about 40% of Maryland's population was black, with African Americans concentrated in the Tidewater counties where tobacco was grown.  Planters relied on the extensive system of rivers to transport their produce from inland plantations to the Atlantic coast for export. Baltimore was the second-most important port in the eighteenth-century South, after Charleston, South Carolina.\nIn the first two decades after the Revolutionary War, a number of slaveholders freed their slaves. In addition, numerous free families of color had started during the colonial era with mixed-race children born free as a result of unions between white women and African-descended men. Although the colonial and state legislatures passed restrictions against manumissions and free people of color, by the time of the Civil War, slightly more than 49% of the black people (including people of color) in Maryland were free and the total of slaves had steadily declined since 1810.During the American Civil War, fought over the issue of slavery, Maryland remained in the Union, though a minority of its citizens – and virtually all of its slaveholders – were sympathetic toward the rebel Confederate States. As a Union border state, Maryland was not included in President Lincoln's 1863 Emancipation Proclamation, which declared all slaves in Southern Confederate states to be free. The following year, Maryland held a constitutional convention. A new state constitution was passed on November 1, 1864, and Article 24 prohibited the practice of slavery. The right to vote was extended to non-white males in the Maryland Constitution of 1867, which remains in effect today. (The vote was extended to women of all races in 1920 by ratification of a national constitutional amendment.)", "content": "Slavery in Maryland lasted over 200 years, from its beginnings in 1642 when the first Africans were brought as slaves to St. Mary's City, to its end after the Civil War. While Maryland developed similarly to neighboring Virginia, slavery declined here as an institution earlier, and it had the largest free black population by 1860 of any state. The early settlements and population centers of the province tended to cluster around the rivers and other waterways that empty into the Chesapeake Bay. Maryland planters cultivated tobacco as the chief commodity crop, as the market was strong in Europe. Tobacco was labor-intensive in both cultivation and processing, and planters struggled to manage workers as tobacco prices declined in the late 17th century, even as farms became larger and more efficient. At first, indentured servants from England supplied much of the necessary labor but, as their economy improved at home, fewer made passage to the colonies. Maryland colonists turned to importing indentured and enslaved Africans to satisfy the labor demand.\nBy the 18th century, Maryland had developed into a plantation colony and slave society, requiring extensive numbers of field hands for the labor-intensive commodity crop of tobacco. In 1700, the province had a population of about 25,000, and by 1750 that number had grown more than five times to 130,000. By 1755, about 40% of Maryland's population was black, with African Americans concentrated in the Tidewater counties where tobacco was grown.  Planters relied on the extensive system of rivers to transport their produce from inland plantations to the Atlantic coast for export. Baltimore was the second-most important port in the eighteenth-century South, after Charleston, South Carolina.\nIn the first two decades after the Revolutionary War, a number of slaveholders freed their slaves. In addition, numerous free families of color had started during the colonial era with mixed-race children born free as a result of unions between white women and African-descended men. Although the colonial and state legislatures passed restrictions against manumissions and free people of color, by the time of the Civil War, slightly more than 49% of the black people (including people of color) in Maryland were free and the total of slaves had steadily declined since 1810.During the American Civil War, fought over the issue of slavery, Maryland remained in the Union, though a minority of its citizens – and virtually all of its slaveholders – were sympathetic toward the rebel Confederate States. As a Union border state, Maryland was not included in President Lincoln's 1863 Emancipation Proclamation, which declared all slaves in Southern Confederate states to be free. The following year, Maryland held a constitutional convention. A new state constitution was passed on November 1, 1864, and Article 24 prohibited the practice of slavery. The right to vote was extended to non-white males in the Maryland Constitution of 1867, which remains in effect today. (The vote was extended to women of all races in 1920 by ratification of a national constitutional amendment.)\n\n\n== Beginnings ==\n\n\n=== Tobacco ===\n\nFrom the beginning, tobacco was the dominant cash crop in Maryland. Such was the importance of tobacco that, in the absence of sufficient silver coins, it served as the chief medium of exchange. John Ogilby wrote in his 1670 book America: Being an Accurate Description of the New World: \"The general way of traffick and commerce there is chiefly by Barter, or exchange of one commodity for another\".Since land was plentiful, and the demand for tobacco was growing, labor tended to be in short supply, especially at harvest time. The first Africans to be brought to English North America landed in Virginia in 1619, rescued by the Dutch from a Portuguese slave ship. These individuals appear to have been treated as indentured servants. A significant number of Africans after them also gained freedom through fulfilling a work contract or for converting to Christianity.Some successful free people of color, such as Anthony Johnson, prospered enough to acquire slaves or indentured servants. This evidence suggests that racial attitudes were much more flexible in the colonies in the 17th century than they later became, when slavery was hardened as a racial caste.\n\n\n=== Import of enslaved Africans ===\n\nThe first documented Africans were brought to Maryland in 1642, as 13 slaves at St. Mary's City, the first English settlement in the Province. Earlier, in 1638, the Maryland General Assembly had considered, but not enacted, two bills referring to slaves and proposing excepting them from rights shared by Christian freemen and indentured servants: An Act for the Liberties of the People and An Act Limiting the Times of Servants. The legal status of Africans initially remained undefined; since they were not English subjects, they were considered foreigners. Colonial courts tended to rule that any person who accepted Christian baptism should be freed. In order to protect the property rights of slaveholders, the colony passed laws to clarify the legal position.\nIn 1661 the Maryland Assembly passed a law explicitly forbidding \"miscegenation\"—marriage between different races. It never controlled the abuse by white men of enslaved African women.\n\n\n=== State establishes perpetual slavery ===\nIn 1664, under the governorship of Charles Calvert, 3rd Baron Baltimore, the Assembly ruled that all enslaved people should be held in slavery for life, and that children of enslaved mothers should also be held in slavery for life. The 1664 Act read as follows:\n\nBe it enacted by the Right Honorable, the Lord Proprietary, by the advice and consent of the Upper and Lower House of this present General Assembly, that all negroes or other slaves already within the Province, and all negroes and other slaves to be hereafter imported into the Province shall serve durante vita. And all children born of any negro or other slave shall be slaves as their fathers were for the term of their lives.\nIn this way the institution of slavery in Maryland was made self-perpetuating, as the slaves had good enough health to reproduce. The numbers of slaves in Maryland was increased even more by continued imports up until 1808. By making slave status dependent on the mother, according to the principle of partus sequitur ventrem, Maryland, like Virginia, abandoned the common law approach of England, in which the social status of children of English subjects depended on their father. In the colonies, children would take the status of their mothers and thus be born into slavery if their mothers were enslaved, regardless if their fathers were white, English and Christian, as many were.\nThe wording of the 1664 Act suggests that Africans may not have been the only slaves in Maryland. Although there is no direct evidence of the enslavement of Native Americans, the reference to \"negroes and other slaves\" may imply that, as in Massachusetts, Virginia and the Carolinas, the colonists may have enslaved local Indians. Alternatively, the wording in the Act may have been intended to apply to slaves of African origin but of mixed-race ancestry. The early years included slaves who were African Creoles, descendants of African women and Portuguese men who worked at the slave ports. In addition, mixed-race children were born to slave women and white fathers. Numerous free families of color were formed during the colonial years by formal and informal unions between free white women and African-descended men, whether free, indentured or enslaved. Although born free to white women, the mixed-race children were considered illegitimate and were apprenticed for lengthy periods into adulthood.\nIn an unusual case, Nell Butler was an Irish-born indentured servant of Lord Calvert. After she married an enslaved African, her indenture was converted to slavery for life under the 1664 Act.\nFurther legislation would follow, entrenching and deepening the institution of slavery. Following the lead of Virginia, in 1671 the Assembly passed an Act stating expressly that baptism of a slave would not lead to freedom. Prior to this some slaves had sued for freedom based on having been baptized. The Act was apparently intended to save the souls of the enslaved; the legislature did not want to discourage slaveholders from baptizing his human property for fear of losing it. In practice, such laws permitted both Christianity and slavery to develop hand in hand.\nAt this early stage in Maryland history, slaves were not especially numerous in the Province, being greatly outnumbered by indentured servants from England. The full effect of such harsh slave laws did not become evident until after large-scale importation of Africans began in earnest in the 1690s. During the second half of the 17th century, the British economy gradually improved and the supply of British indentured servants declined, as poor Britons had better economic opportunities at home.  At the same time, Bacon's Rebellion of 1676 led planters to worry about the prospective dangers of creating a large class of restless, landless, and relatively poor white men (most of them former indentured servants).  Wealthy Virginia and Maryland planters began to buy slaves in preference to indentured servants during the 1660s and 1670s, and poorer planters followed suit by c.1700. Enslaved Africans cost more than servants, so initially only the wealthy could invest in slavery. By the end of the seventeenth century, planters shifted away from indentured servants, and in favor of the importation and enslavement of African people.\n\n\n== Eighteenth century ==\n\nDuring the eighteenth century the number of enslaved Africans imported into Maryland greatly increased, as the labor-intensive tobacco economy became dominant, and the colony developed into a slave society. In 1700 there were about 25,000 people in Maryland and by 1750 that had grown more than 5 times to 130,000. A great proportion of the population was enslaved. By 1755, about 40% of Maryland's population was black and these persons were overwhelmingly enslaved. The southern plantation counties had majority-slave populations by the end of the century.\nIn 1753 the Maryland assembly took further harsh steps to institutionalize slavery, passing a law that prohibited any slaveholder from independently manumitting his slaves. A slaveholder seeking manumission had to gain legislative approval for each act, meaning that few did so.\nAt this stage there were few voices of dissent among whites in Maryland. Although only the wealthy could afford slaves, poor whites who did not own slaves may have aspired to own them someday. The identity of many whites in Maryland, and the South in general, was tied up in the idea of white supremacy. As the French political philosopher Montesquieu noted in 1748: \"It is impossible for us to suppose these creatures [enslaved Africans] to be men; because allowing them to be men, a suspicion would follow that we ourselves are not Christians.\"\n\n\n== Revolutionary War ==\n\n \nThe principal cause of the American Revolution was liberty, but only on behalf of white men, and certainly not slaves, Indians or women. The British, desperately short of manpower, sought to enlist African Americans as soldiers to fight on behalf of the Crown, promising them liberty in exchange. As a result of the looming crisis in 1775 the Royal Governor of Virginia, Lord Dunmore, issued a proclamation that promised freedom to servants and slaves who were able to bear arms and join his Loyalist Ethiopian Regiment:\n\n... I do require every Person capable of bearing Arms, to resort to His MAJESTY'S STANDARD, or be looked upon as Traitors to His MAJESTY'S Crown and Government, and thereby become liable to the Penalty the Law inflicts upon such Offenses; such as forfeiture of Life, confiscation of Lands, &. &. And I do hereby further declare all indented Servants, Negroes, or others, (appertaining to Rebels,) free that are able and willing to bear Arms, they joining His MAJESTY'S Troops as soon as may be, for the more speedily reducing this Colony to a proper Sense of their Duty, to His MAJESTY'S Crown and Dignity.\nAbout 800 men joined up; some helped rout the Virginia militia at the Battle of Kemp's Landing and fought in the Battle of Great Bridge on the Elizabeth River, wearing the motto \"Liberty to Slaves\", but this time they were defeated. The remains of their regiment were involved in the evacuation of Norfolk, after which they served in the Chesapeake area. Their camp suffered an outbreak of smallpox and other infectious diseases. This took a heavy toll, putting many of them out of action for some time. The survivors joined other British units and continued to serve throughout the war. Blacks were often the first to come forward to volunteer, and a total of 12,000 blacks served with the British from 1775 to 1783. This factor had the effect of forcing the rebels to also offer freedom to those who would serve in the Continental army. Such promises were often reneged upon by both sides. Thousands of slaves in the South left their plantations to join the British. Keeping their promise, the British transported about 3,000 freed slaves to Nova Scotia, where they granted them land. Others were taken to the Caribbean colonies, or to London.\nIn general, the war left the institution of slavery largely unaffected, and the prosperous life of successful Maryland planters was revived. The writer Abbe Robin, who travelled through Maryland during the American Revolutionary War, described the lifestyle enjoyed by families of wealth and status in the Province:\n\n[Maryland houses] are large and spacious habitations, widely separated, composed of a number of buildings and surrounded by plantations extending farther than the eye can reach, cultivated ... by unhappy black men whom European avarice brings hither ... Their furniture is of the most costly wood, and rarest marbles, enriched by skilful and artistic work. Their elegant and light carriages are drawn by finely bred horses, and driven by richly apparelled slaves.\nSlave labor made possible the export-driven plantation economy. The English observer William Strickland wrote of agriculture in Virginia and Maryland in the 1790s:\n\nNothing can be conceived more inert than a slave; his unwilling labour is discovered in every step he takes; he moves not if he can avoid it; if the eyes of the overseer be off him, he sleeps. The ox and horse, driven by the slave, appear to sleep also; all is listless inactivity; all motion is evidently compulsory.\n\n\n== Voices for abolition ==\n\n\n=== Methodists and Quakers ===\n\nThe American Revolution had been fought for the cause of liberty of individual men, and many Marylanders who opposed slavery believed that Africans were equally men and should be free. Methodists in particular, of whom Maryland had more than any other state in the Union, were opposed to slavery on Christian grounds. In 1780 the National Methodist Conference in Baltimore officially condemned slavery. In 1784 the church threatened Methodist preachers with suspension if they held people in slavery. This was a period of the Great Awakening, and Methodists preached the spiritual equality of men, as well as licensing slaves and free blacks as preachers and deacons.\nThe Methodist movement in the United States as a whole was not of one voice on the subject of slavery. By the antebellum years in the South, most Methodist congregations supported the institution and preachers had made their peace with it, working to improve conditions of the institution. Ministers (and their congregants) often cited Old Testament scriptures as justification, which they interpreted as representing slavery as a part of the natural order of things. Eventually the Methodist Church split into two regional associations over the issue of slavery before the Civil War.\nThose looking for Biblical support cited Leviticus Chapter 25, verses 44–46, which state as follows:\n\n44 Both thy bondmen, and thy bondmaids, which thou shalt have, shall be of the heathen that are round about you; of them shall ye buy bondmen and bondmaids.\n45 Moreover of the children of the strangers that do sojourn among you, of them shall ye buy, and of their families that are with you, which they begat in your land: and they shall be your possession.\n\n46 And ye shall take them as an inheritance for your children after you, to inherit them for a possession; they shall be your bondmen for ever: but over your brethren the children of Israel, ye shall not rule one over another with rigour.\nNew Testament writings were sometimes used to support the case for slavery as well. Some of the writings of Paul, especially in Ephesians, instruct slaves to remain obedient to their masters. Southern ideology after the Revolution developed to argue a paternalistic point of view, that slavery was beneficial for enslaved people as well as the people who held them in slavery. They said that Christian planters could concentrate on improving treatment of slaves and that the people in bondage were offered protections from many ills, and treated better than industrial workers in the North.In the mid-1790s the Methodists and the Quakers drew together to form the Maryland Society of the Abolition of Slavery. Together they lobbied the legislature. In 1796 they gained repeal of the 1753 law that had prohibited individual manumissions by a slaveholder. Responding to Methodist and Quaker persuasion, as well as revolutionary ideals and lower labor needs, in the first two decades after the war, a number of slaveholders freed their slaves. In 1815 the Methodists and Quakers formed the Protection Society of Maryland, a group which sought protection for the increasing number of free blacks living in the state. By the time of the Civil War, 49.1% of Maryland blacks were free, including most of the large black population of Baltimore.\n\n\n=== Roman Catholic Church ===\nOther churches in Maryland were more equivocal. The Roman Catholic Church in Maryland and its members had long tolerated slavery. Despite a firm stand for the spiritual equality of black people, Jesuit missioners also continued to own slaves on their plantations. The Catholic Church in Maryland had supported slaveholding interests. The Jesuits controlled six plantations totaling nearly 12,000 acres, some of which had been donated to the church. In 1838 they ended slaveholding with a mass sale of their 272 slaves to sugar cane plantations in Louisiana in the Deep South. This was historically one of the largest single slave sales in colonial Maryland. The Jesuits' plantations had not been managed profitably, and they wanted to devote their funds to urban areas, including their schools, such as Georgetown College, located near the busy port on the Potomac River adjacent to Washington, DC, and two new Catholic high schools in Philadelphia and New York City. The Jesuits believed that their mission had to be redirected to urban areas, where the number of Catholic European immigrants were increasing. Pope Gregory XVI issued a resounding condemnation of slavery in his 1839 bull In supremo apostolatus. \n\n\n=== Notable Maryland Enslaved African-Americans ===\n\n\n==== Frederick Douglass ====\n\nAfter his escape from slavery as a young man, Frederick Douglass remained in the North, where he became an influential national voice in favor of abolition and lectured widely about the abuses of slavery. Douglass was born a slave in Talbot County, Maryland, between Hillsboro and Cordova, probably in his grandmother's shack east of Tappers Corner (38.8845°N 75.958°W﻿ / 38.8845; -75.958) and west of Tuckahoe Creek. The exact date of his birth is unknown, though it seems likely he was born in 1818. Douglass wrote of his childhood:\n\nDouglass wrote several autobiographies, eloquently describing his experiences in slavery in his 1845 autobiography, Narrative of the Life of Frederick Douglass, an American Slave. It became influential in its support for abolition, and Douglass spoke widely on the Northern abolition lecture circuit.\n\n\n==== Harriet Tubman ====\n\nIn 1822, Harriet Tubman was born into slavery in Dorchester County, Maryland. After escaping in 1849, she returned secretly to the state several times, helping a total of 70 slaves (including relatives) make their way to freedom. She used the Underground Railroad to make thirteen missions. While later working in the Union Army, Tubman helped more than 700 slaves escape during the Raid at Combahee Ferry.\n\n\n=== Maryland State Colonization Society ===\n\nConcerned about the tensions of discrimination against free blacks (often free people of color with mixed ancestry) and the threat they posed to slave societies, planters and others organized the Maryland State Colonization Society in 1817 as an auxiliary branch of the American Colonization Society, founded in Washington D.C. in 1816. The MSCS had strong Christian support  and was the primary organization proposing \"return\" of all free African Americans to a colony to be established in Africa. But, by this time, most slaves and free blacks had been born in the United States, and wanted to gain their rights in the country they felt was theirs.\nThe ACS founded the colony of Liberia in 1821–22, as a place in West Africa for freedmen. Wanting to control its own territory and solve its perceived problems, the Maryland State Colonization Society founded the Republic of Maryland in West Africa, a short-lived independent state. In 1857 it was annexed by Liberia.\n\nThe society was founded in 1827, and its first president was the wealthy Maryland Catholic planter Charles Carroll of Carrollton, who was a substantial slaveholder. Although Carroll supported the gradual abolition of slavery, he did not free his own slaves, perhaps fearing that they might be rendered destitute by the difficulties of earning a living in the discriminatory society. Carroll introduced a bill for the gradual abolition of slavery in the Maryland senate but it did not pass.Many wealthy Maryland planters were members of the MSCS. Among these were the Steuart family, who owned considerable estates in the Chesapeake Bay, including Major General George H. Steuart, who was on the board of Managers; his father James Steuart, who was vice-president; and his brother, the physician Richard Sprigg Steuart, also on the board of Managers.In an open letter to John Carey in 1845, published in Baltimore by the printer John Murphy, Richard Sprigg Steuart set out his views on the subject of relocating freed slaves to Africa. Such opinions were likely widespread among Maryland slaveholders:\n\nThe colored man [must] look to Africa, as his only hope of preservation and of happiness ... it can not be denied that the question is fraught with great difficulties and perplexities, but ... it will be found that this course of procedure ... will ... at no very distant period, secure the removal of the great body of the African people from our State. The President of the Maryland Colonization Society points to this in his address, where he says \"the object of Colonization is to prepare a home in Africa for the free colored people of the State, to which they may remove when the advantages which it offers, and above all the pressure of irresistible circumstances in this country, shall excite them to emigrate.\nThe society proposed from the outset \"to be a remedy for slavery\", and declared in 1833:\n\nResolved, That this society believe, and act upon the belief, that colonization tends to promote emancipation, by affording the emancipated slave a home where he can be happier than in this country, and so inducing masters to manumit who would not do so unconditionally ... [so that] at a time not remote, slavery would cease in the state by the full consent of those interested.\n\n\n=== Republic of Maryland founded in Africa ===\n\nIn December 1831, the Maryland state legislature appropriated $10,000 for twenty-six years to transport free blacks and formerly enslaved people from the United States to Africa. The act authorized appropriation of funds of up to $20,000 a year, up to a total of $200,000, in order to begin the process of African colonization. Most of the money would be spent on the colony itself, to make it attractive to settlers. Free passage was offered, plus rent, 5 acres (20,000 m2) of land to farm, and low-interest loans which would eventually be forgiven if the settlers chose to remain in the colony. The remainder was spent on agents paid to publicize the new colony.Following Nat Turner's Slave Rebellion in 1831 in Virginia, Maryland and other states passed laws restricting the freedoms of free people of color, as slaveholders feared their effect on slave societies. Persons who were manumitted were given a deadline to leave the state after gaining freedom, unless a court of law found them to be of such \"extraordinary good conduct and character\" that they might be permitted to remain. A slaveholder who manumitted a slave was required to report that action and person to the authorities, and county clerks who did not do so could be fined. To carry out the removal of free blacks from the state, the Maryland State Colonization Society was established. It was similar to the national American Colonization Society.In 1832 the legislature placed new restrictions on the liberty of free blacks, in order to encourage emigration. They were not permitted to vote, serve on juries, or hold public office. Unemployed adult free people of color without visible means of support could be re-enslaved at the discretion of local sheriffs. By this means the supporters of colonization hoped to encourage free blacks to leave the state.John Latrobe, for two decades the president of the MSCS, and later president of the ACS, proclaimed that settlers would be motivated by the \"desire to better one's condition\", and that sooner or later \"every free person of color\" would be persuaded to leave Maryland.\n\n\n== Underground Railroad ==\n\nFor braver souls, impatient with efforts to abolish slavery within the law, there were always illegal methods. Slaves escaped independently; most often they were young males, as they could move more freely than women with children. Free blacks and white supporters of abolition of slavery gradually organized a number of safe places and guides, creating the Underground Railroad to help slaves gain safety in Northern states. The many Indian trails and waterways of Maryland, and in particular the countless inlets of the Chesapeake Bay, afforded numerous ways to escape north by boat or land, with many people going to Pennsylvania as the nearest free state. Supporters would shelter refugees, and sometimes give them food and clothing.\nAs the numbers of slaves seeking freedom in the North grew, so did the reward for their capture. In 1806, the reward offered for the recaptured slaves was $6, but by 1833 it had risen to $30. In 1844, recaptured freedom seekers fetched $15 if recaptured within 30 miles (48 km) of the owner and $50 if captured more than 30 miles (48 km) away.\n\n\n== Status of slavery in 1860 ==\nBy the 1850s few Marylanders still believed that colonization was the solution to the perceived problems of slavery and free blacks in society. Although one in every six Maryland families still held slaves, most slaveholders held only a few per household. Support for the institution of slavery was localized, varying according to its importance to the local economy and it continued to be integral to Southern Maryland's plantations.\nBy 1860 Maryland's free black population comprised 49.1% of the total number of African Americans in the state. The small state of Maryland was home to nearly 84,000 free blacks in 1860, by far the most of any state; the state had ranked as having the highest number of free blacks since 1810. In addition, by this time, the vast majority of blacks in Baltimore were free, and this free black population was more than in any other US city. Many planters in Maryland had freed their slaves in the years following the Revolutionary War. In addition, families of free people of color had been formed during colonial times from unions between free white women and men of African descent and various social classes, and their descendants were among the free. As children took their status from their mothers, these mixed-race children were born free.Marylanders might agree in principle that slavery could and should be abolished, but they were slow to achieve it statewide. Although the need for slaves had declined with the shift away from tobacco culture, and slaves were being sold to the Deep South, slavery was still too deeply embedded into Maryland society for the wealthiest whites to give it up voluntarily on a wide scale. Wealthy planters exercised considerable economic and political power in the state. Slavery did not end until after the Civil War.\n\n\n== Civil War ==\n\n\n=== Approach of war ===\n\nLike other border states such as Kentucky and Missouri, Maryland had a population divided over politics as war approached, with supporters of both North and South. The western and northern parts of the state, especially those Marylanders of German origin, held fewer slaves and tended to favor remaining in the Union, while the Tidewater Chesapeake Bay area – the three counties referred to as Southern Maryland which lay south of Washington D.C.: Calvert, Charles and St. Mary's – with its slave economy, tended to support the Confederacy if not outright secession. After John Brown's raid on Harper's Ferry, Virginia (now in West Virginia), some citizens in slaveholding areas began forming local militias. Of the 1860 population of 687,000, about 60,000 men joined the Union and about 25,000 fought for the Confederacy.  The political sentiments of each group generally reflected their economic interests.\nThe first bloodshed of the Civil War occurred on April 19, 1861 in Baltimore involving Massachusetts troops who were fired on by civilians while marching between railroad stations. After that, Baltimore Mayor George William Brown, Marshal George P. Kane, and former Governor Enoch Louis Lowe requested that Maryland Governor Thomas H. Hicks, a slaveholder from the Eastern Shore, burn the railroad bridges and cut the telegraph lines leading to Baltimore to prevent further troops from entering the state. Hicks reportedly approved this proposal. These actions were addressed in the famous federal court case of Ex parte Merryman.\nMaryland remained part of the Union during the United States Civil War, thanks to President Abraham Lincoln's swift action to suppress dissent in the state. The belated assistance of Governor Hicks also played an important role; although initially indecisive, he co-operated with federal officials to stop further violence and prevent a move to secession.\n\n\n=== Maryland left out of Emancipation Proclamation ===\n\nEmancipation remained by no means a foregone conclusion at the start of the war, though events soon began to move against slaveholding interests in Maryland. On December 16, 1861 a bill was presented to Congress to emancipate enslaved people in Washington, D.C., and in March 1862 Lincoln held talks with Marylanders on the subject of emancipation. Some Marylanders, such as Representative John W. Crisfield, resisted the President, arguing that freedom would be worse for the slaves than slavery. Such arguments became increasingly ineffective as the war progressed.On April 10, 1862, Congress declared that the Federal government would compensate slaveholders who freed their slaves. Slaves in the District of Columbia were freed on April 16, 1862 and slaveholders were duly compensated. In July 1862 Congress took a major step towards emancipation by passing the Second Confiscation Act, which permitted the Union army to enlist African-American soldiers, and barred the army from recapturing runaway slaves. In the same month Lincoln offered to buy out Maryland slaveholders, offering $300 for each emancipated slave, but Crisfield (unwisely as it turned out) rejected this offer.On September 17, 1862 General Robert E. Lee's invasion of Maryland was turned back by the Union army at the Battle of Antietam, which was tactically inconclusive but strategically important. It took place near Sharpsburg, Maryland. Five days later, on September 22, encouraged by relative success at Antietam, President Lincoln issued an executive order known as the Emancipation Proclamation, which declared all enslaved people in Southern states to be free. The order went into effect in January 1863, but Maryland, like other border states, was exempted since it had remained loyal to the Union at the outbreak of war.\nMaryland remained a slave state, but the tide was turning. In 1863 and 1864 growing numbers of Maryland slaves simply left their plantations to join the Union Army, accepting the promise of military service in return for freedom. One effect of this was to bring slave auctions to an end, as any slave could avoid sale, and win freedom, by simply offering to join the army. In 1863 Crisfield was defeated in local elections by the abolitionist candidate John Creswell, amid allegations of vote-rigging by the Union army. In Somerset County, Maryland, Creswell outpolled Crisfield by a margin of 6,742 votes to 5,482, with Union soldiers effectively deciding the vote in favor of Creswell. The Civil War was not yet over, but slavery in Maryland had at last run its course. The abolitionists had almost won.\n\n\n=== The ending of slavery in Maryland ===\n\nThe issue of slavery was finally confronted by the new Maryland Constitution of 1864 which the state adopted late in that year. The document, which replaced the Maryland Constitution of 1851, was pressed by Unionists who had secured control of the state, and was framed by a Convention which met at Annapolis in April 1864. Article 24 of the constitution at last outlawed the practice of slavery.\n\n\n==== Special motion launches campaign to end slavery in the state ====\nOn December 16, 1863, a special meeting of the Central Committee of the Union Party of Maryland was called on the issue of slavery in the state (the Union Party was the most powerful legalized political party in the state at the time). At the meeting, Thomas Swann, a state politician, put forward a motion calling for the party to work for \"Immediate emancipation (of all slaves) in Maryland\". John Pendleton Kennedy seconded the motion. Since Kennedy was the former speaker of the Maryland General Assembly, as well as being a respected Maryland author, his support carried enormous weight in the party. A vote was taken and the motion passed. However, the people of Maryland as a whole were by then divided on the issue, and so twelve months of campaigning and lobbying on the issue followed throughout the state. During this effort, Kennedy signed his name to a party pamphlet, calling for \"immediate emancipation\" of all slaves that was widely circulated.\nOn November 1, 1864, after a year-long debate, a state referendum was put forth on the slavery question: although tied to the larger referendum on changes to the state constitution, the slavery component was extremely well known and hotly debated. The citizens of Maryland voted to abolish slavery, but only by a 1,000 vote margin, as the southern part of the state was heavily dependent on the slave economy.\n\n\n==== Details of final vote ====\nThe constitution was submitted for ratification on October 13, 1864 and was narrowly approved by a vote of 30,174 to 29,799 (50.3% to 49.7%) in a referendum widely characterised by intimidation and fraud.  The vote was carried only after Maryland's soldiers' votes were included in the count. Marylanders serving in the Union Army were overwhelmingly in favor (2,633 to 263).The institution of slavery in Maryland had lasted just over 200 years, since the Assembly had first granted it formal legal status in 1663.\n\n\n== See also ==\n\nAfrican Americans in Maryland\nMaryland in the American Civil War\nMaryland State Colonization Society\nProvince of Maryland\nRepublic of Maryland\nTransatlantic slave trade\nAtlantic Creole\nChesapeake Colonies\nChildren of the plantation\nColonial South and the Chesapeake\nFemale slavery in the United States\nScramble (slave auction)\nSeasoning\nSlavery in the colonial history of the United States\nTobacco colonies\n\n\n== References ==\nAndrews, Matthew Page, History of Maryland, Doubleday, New York (1929)\nChapelle, Suzanne Ellery Greene, Maryland: A History of Its People Retrieved August 10, 2010\nFerguson, Niall, Civilization: The Six Killer Apps of Western Power Retrieved April 2013\nFlint, John E., et al, The Cambridge History of Africa: From c. 1790 to c. 1870 Cambridge University Press (1977) Retrieved February 16, 2010.\nFreehling, William H., The Road to Disunion: Volume I: Secessionists at Bay, 1776–1854 Retrieved March 12, 2010\nHall, Richard, On Afric's Shore: A History of Maryland in Liberia, 1834–1857\nLatrobe, John H. B., p. 125, Maryland in Liberia: a History of the Colony Planted By the Maryland State Colonization Society Under the Auspices of the State of Maryland, U. S. At Cape Palmas on the South-West Coast of Africa, 1833–1853 (1885). Retrieved Feb 16 2010\nRhodes, Jason, Somerset County, Maryland: a Brief History Retrieved August 11, 2010\nStebbins, Giles B., Facts and Opinions Touching the Real Origin, Character, and Influence of the American Colonization Society: Views of Wilberforce, Clarkson, and Others, published by Jewitt, Proctor, and Worthington (1853). Retrieved February 16, 2010.\nSwitala, William J., Underground Railroad in Delaware, Maryland, and West Virginia Retrieved August 12, 2010\nMaryland Colonization Journal published by the Maryland State Colonization Society Retrieved February 16, 2010.\nDiscussion on American Slavery: Between George Thompson, Esq., Agent of the British and Foreign Society for the Abolition of Slavery Throughout the World, 17th of June, 1836, Published by Isaac Knapp, 46 Washington Street (1836). Retrieved February 16, 2010.\nSteven Mintz and Susan Kellogg. \"Domestic Revolutions: A Social History of American Family Life\" (The Free Press. New York. 1989). 31.\n\n\n== Notes ==\n\n\n== External links ==\nLegacy of Slavery in Maryland – Maryland State Archives Retrieved October 2014\nUniversity of Maryland Special Collections Guide on Slavery in Maryland\nGurley, Ralph Randolph, Ed., p. 251, The African Repository, Volume 3 Retrieved February 15, 2010.\nProceedings of the Maryland Colonization Society at Niles' National Register, Volume 47 Retrieved February 16, 2010.\nBrief History of Maryland in Liberia at www.buckyogi.com Retrieved February 16, 2010.\nBrief History of Maryland in Liberia at www.worldstatesmen.org Retrieved February 16, 2010.", "links": ["1838 Jesuit slave sale", "1926 Slavery Convention", "1st Rhode Island Regiment", "A&E Networks", "Abbasid harem", "Abolition of slave trade in Persian gulf", "Abolitionism", "Abolitionism in the United Kingdom", "Abolitionism in the United States", "About.com", "Abraham Lincoln", "Abraham Lincoln and slavery", "Act Prohibiting Importation of Slaves", "Africa", "African Americans", "African Americans in Maryland", "African Slave Trade Patrol", "Afro–Puerto Ricans", "American Civil War", "American Colonization Society", "American Declaration of Independence", "American Revolution", "American Revolutionary War", "American slave court cases", "American slavery", "Ancillae", "Anthony Johnson (American Colonial)", "Anti-Slavery International", "Atlantic Creole", "Atlantic slave trade", "Atlantic slave trade to Brazil", "Aztec slavery", "Babylonian law", "Bacon's Rebellion", "Baháʼí Faith and slavery", "Baltimore", "Baltimore riot of 1861", "Barbados Slave Code", "Barbary pirates", "Barbary slave trade", "Battle of Antietam", "Battle of Great Bridge", "Battle of Kemp's Landing", "Benedict Swingate Calvert", "Black Canadians", "Blackbirding", "Blackbirding in Polynesia", "Blockade of Africa", "Booi Aha", "Border states (American Civil War)", "Breeding of enslaved people in the United States", "Bride buying", "Bristol slave trade", "British Army", "British Empire", "Cape Palmas", "Cariye", "Catholic Church and slavery", "Charles Calvert, 3rd Baron Baltimore", "Charles Carroll of Carrollton", "Charleston, South Carolina", "Chesapeake, Virginia", "Chesapeake Bay", "Chesapeake Colonies", "Child labour", "Child marriage", "Children in the military", "Children of the plantation", "Christian views on slavery", "Christianity", "Chukri System", "Code Noir", "Colonial American bastardy laws", "Colonial South and the Chesapeake", "Colony", "Comfort women", "Common law", "Compensated emancipation", "Confederate States of America", "Conscription", "Continental Army", "Contraband (American Civil War)", "Contubernium", "Coolie", "Cordova, Maryland", "Corvée", "Danish slave trade", "Debt bondage", "Debt bondage in India", "Devshirme", "District of Columbia", "Domestic slave trade", "Dorchester County, Maryland", "Dutch Slave Coast", "Economic history of Colonial Maryland", "Elizabeth River (Virginia)", "Emancipation Day", "Emancipation Proclamation", "Emancipation reform of 1861", "Encomienda", "Enoch Louis Lowe", "Ethiopian Regiment", "Ex parte Merryman", "Executive order", "Federal district", "Female slavery in the United States", "Field slaves in the United States", "Forced labour under German rule during World War II", "Forced marriage", "Forced prostitution", "Forty acres and a mule", "Frederick Douglass", "Free black", "Free people of color", "Freedman", "Freedmen", "Freedmen's Bureau", "Freedom seekers", "Freedom suit", "Freeman (Colonial)", "Fugitive Slave Act of 1793", "Fugitive Slave Act of 1850", "Fugitive slave laws in the United States", "Fugitive slaves in the United States", "Gag rule (United States)", "Galley slave", "George H. Steuart (militia general)", "George III", "George P. Kane", "George Washington Williams", "George Washington and slavery", "George William Brown", "Georgetown University", "Ghilman", "Great Awakening", "Great Dismal Swamp maroons", "Haitian Revolution", "Harem", "Harriet Tubman", "Hillsboro, Maryland", "History of Maryland in the American Revolution", "History of children in the military", "History of concubinage in the Muslim world", "History of serfdom", "History of sexual slavery in the United States", "History of slavery", "History of slavery in Alabama", "History of slavery in Alaska", "History of slavery in Arizona", "History of slavery in Arkansas", "History of slavery in California", "History of slavery in Colorado", "History of slavery in Connecticut", "History of slavery in Delaware", "History of slavery in District of Columbia", "History of slavery in Florida", "History of slavery in Georgia (U.S. state)", "History of slavery in Hawaii", "History of slavery in Idaho", "History of slavery in Illinois", "History of slavery in Indiana", "History of slavery in Iowa", "History of slavery in Kansas", "History of slavery in Kentucky", "History of slavery in Louisiana", "History of slavery in Maine", "History of slavery in Massachusetts", "History of slavery in Michigan", "History of slavery in Minnesota", "History of slavery in Mississippi", "History of slavery in Missouri", "History of slavery in Montana", "History of slavery in Nebraska", "History of slavery in Nevada", "History of slavery in New Hampshire", "History of slavery in New Jersey", "History of slavery in New Mexico", "History of slavery in New York", "History of slavery in North Carolina", "History of slavery in North Dakota", "History of slavery in Ohio", "History of slavery in Oklahoma", "History of slavery in Oregon", "History of slavery in Pennsylvania", "History of slavery in Rhode Island", "History of slavery in South Carolina", "History of slavery in South Dakota", "History of slavery in Tennessee", "History of slavery in Texas", "History of slavery in Utah", "History of slavery in Vermont", "History of slavery in Virginia", "History of slavery in Washington (state)", "History of slavery in West Virginia", "History of slavery in Wisconsin", "History of slavery in Wyoming", "History of slavery in the Muslim world", "House of Commons of Great Britain", "House slave", "Human trafficking", "Human trafficking in Australia", "Human trafficking in Chad", "Human trafficking in Papua New Guinea", "Human trafficking in Southeast Asia", "Human trafficking in the Middle East", "Human trafficking in the United States", "ISBN (identifier)", "Impressment", "In supremo apostolatus", "Indentured servant", "Indentured servants", "Indentured servitude", "Indian Ocean slave trade", "Indigenous peoples of the Americas", "Isaac Knapp", "Islamic views on concubinage", "Islamic views on slavery", "Jarya", "Jewish views on slavery", "John Brown's raid on Harpers Ferry", "John Brown (abolitionist)", "John Creswell", "John H. B. Latrobe", "John Hesselius", "John L. Carey", "John Murray, 4th Earl of Dunmore", "John Ogilby", "John Pendleton Kennedy", "John Quincy Adams and abolitionism", "John W. Crisfield", "Juneteenth", "Kentucky", "Kholop", "Kwalliso", "Laogai", "Lei Áurea", "Liberia", "List of Freedmen's towns", "List of abolitionists", "List of court cases in the United States involving slavery", "List of films featuring slavery", "List of last surviving American enslaved people", "List of members of the United States Congress who owned slaves", "List of presidents of the United States who owned slaves", "List of slave owners", "List of slaves", "List of vice presidents of the United States who owned slaves", "Lord Dunmore's Proclamation", "Ma malakat aymanukum", "Mamluk", "Manumission", "Manumitted", "Manumitting", "Marriage of enslaved people (United States)", "Maryland", "Maryland Constitution of 1851", "Maryland Constitution of 1864", "Maryland Constitution of 1867", "Maryland Eastern Shore", "Maryland General Assembly", "Maryland Society of the Abolition of Slavery", "Maryland State Colonization Society", "Maryland in the American Civil War", "Methodist", "Middle Passage", "Missouri", "Mixed-race", "Montesquieu", "Mormonism and slavery", "Mukataba", "Mulatto", "Narrative of the Life of Frederick Douglass, an American Slave", "Nat Turner's Slave Rebellion", "National Portrait Gallery (United States)", "Native American slave ownership", "Native Americans in the United States", "Negroes", "Nell Butler", "New York City", "Norfolk, Virginia", "North America", "Nova Scotia", "OCLC (identifier)", "Odalisque", "Origins of the American Civil War", "Ottoman Imperial Harem", "Panyarring", "Papal bull", "Partus sequitur ventrem", "Patriots (American Revolution)", "Penal labor in the United States", "Penal labour", "Penal system in China", "Pennsylvania", "Peon", "Philadelphia", "Plantation complexes in the Southern United States", "Plantations in the American South", "Plaçage", "Pope Gregory XVI", "Potomac River", "Protection Society of Maryland", "Province of Maryland", "Qiyan", "Quakers", "Raid at Combahee Ferry", "Ratification", "Reconstruction era", "Referendum", "Republic of Maryland", "Restavek", "Rhode Island", "Richard Sprigg Steuart", "Robert E. Lee", "Role of Nantes in the slave trade", "Roman Catholic Church", "Saqaliba", "Scramble (slave auction)", "Seasoning (colonialism)", "Second Confiscation Act", "Select committee (United Kingdom)", "Serfdom", "Serfdom in Russia", "Sex trafficking in Europe", "Sexual slavery", "Shanghaiing", "Sharpsburg, Maryland", "Sierra Leone", "Slave", "Slave Coast of West Africa", "Slave Power", "Slave Songs of the United States", "Slave Trade Act", "Slave catcher", "Slave catcher (United States)", "Slave codes", "Slave health on plantations in the United States", "Slave iron bit", "Slave market", "Slave name", "Slave narrative", "Slave patrol", "Slave raiding", "Slave raiding in Easter Island", "Slave rebellion", "Slave ship", "Slave states and free states", "Slavery", "Slavery among Native Americans in the United States", "Slavery among the indigenous peoples of the Americas", "Slavery and religion", "Slavery at common law", "Slavery in 21st-century jihadism", "Slavery in Afghanistan", "Slavery in Africa", "Slavery in Angola", "Slavery in Asia", "Slavery in Bhutan", "Slavery in Brazil", "Slavery in Britain", "Slavery in Canada", "Slavery in China", "Slavery in Colombia", "Slavery in Cuba", "Slavery in Egypt", "Slavery in Ethiopia", "Slavery in Haiti", "Slavery in India", "Slavery in Iran", "Slavery in Japan", "Slavery in Korea", "Slavery in Latin America", "Slavery in Libya", "Slavery in Mali", "Slavery in Malta", "Slavery in Mauritania", "Slavery in New France", "Slavery in New Spain", "Slavery in Niger", "Slavery in Oceania", "Slavery in Poland", "Slavery in Portugal", "Slavery in Puerto Rico", "Slavery in Romania", "Slavery in Russia", "Slavery in Seychelles", "Slavery in Somalia", "Slavery in South Africa", "Slavery in Spain", "Slavery in Sudan", "Slavery in Trinidad", "Slavery in Vietnam", "Slavery in Yemen", "Slavery in ancient Egypt", "Slavery in ancient Greece", "Slavery in ancient Rome", "Slavery in antiquity", "Slavery in colonial Spanish America", "Slavery in contemporary Africa", "Slavery in international law", "Slavery in medieval Europe", "Slavery in the 21st century", "Slavery in the Americas", "Slavery in the British Virgin Islands", "Slavery in the British and French Caribbean", "Slavery in the Byzantine Empire", "Slavery in the Ottoman Empire", "Slavery in the United States", "Slavery in the colonial history of the United States", "Slavery on the Barbary Coast", "Smallpox", "Society of Jesus", "Somerset County, Maryland", "Songs of the Underground Railroad", "St. Mary's City", "St. Mary's City, Maryland", "Steuart family", "Swedish slave trade", "Talbot County, Maryland", "The Bible and slavery", "The Slave Route Project", "Third Servile War", "Thirteenth Amendment to the United States Constitution", "Thomas H. Hicks", "Thomas Jefferson and slavery", "Thomas Swann", "Thrall", "Tidewater (region)", "Timeline of abolition of slavery and serfdom", "Tobacco", "Tobacco colonies", "Tobacco in the American colonies", "Trans-Saharan slave trade", "Treatment of the enslaved in the United States", "Tuckahoe Creek", "Turkish Abductions", "Umm walad", "Underground Railroad", "Unfree labour", "Union (American Civil War)", "Union Army", "United States Colored Troops", "United States Virgin Islands", "United States military and prostitution in South Korea", "Virginia", "Voyages: The Trans-Atlantic Slave Trade Database", "Wage slavery", "Washington, D.C.", "Washington D.C.", "West Africa Squadron", "West Virginia", "White American", "White slavery", "White supremacy", "Wife selling", "William Strickland (farmer)", "Women"]}