{"url": "https://en.wikipedia.org/wiki/Hyundai_Accent_WRC", "title": "Hyundai Accent WRC", "summary": "The Hyundai Accent WRC is a World Rally Car built for the Hyundai Castrol World Rally Team by Hyundai Motorsport to compete in the World Rally Championship. It is based upon the Hyundai Accent road car, and was debuted at the 2000 Rally Sweden.\n\n", "content": "The Hyundai Accent WRC is a World Rally Car built for the Hyundai Castrol World Rally Team by Hyundai Motorsport to compete in the World Rally Championship. It is based upon the Hyundai Accent road car, and was debuted at the 2000 Rally Sweden.\n\n\n== Competition history ==\n\nAccent WRC competed in an official capacity, spawning three generations, in the World Rally Championship from 2000 to 2003. After development and testing in 1999, the Hyundai World Rally Team and Motor Sport Developments (MSD) debuted the Accent WRC at the 2000 Swedish Rally. The second evolution, Accent WRC2, featured revised aerodynamics, active front differential, longer suspension travel and improved suspension top mounts, although most of the attention was directed at improving reliability. Like its predecessor's, the car's best result in a WRC event remained a fourth place. The Accent WRC3, featuring new dampers and engine internals among other changes, debuted at the 2002 Tour de Corse.The car, though, in such capable hands across its lifespan as the four-time world champion Juha Kankkunen, ex-Subaru rally-winning and former Group A champion Kenneth Eriksson and former British Rally Champion Alister McRae, albeit the former two in the twilight of their careers, was reasonably competitive at times and showed some promise. Belgian Freddy Loix and 1991 Rally Catalunya winner Armin Schwarz were among the other drivers so long synonymous with life in the works-fettled Accents.Due to budget constraints, the car's development was virtually halted during the 2003 season. In September, Hyundai announced its withdrawal from the WRC. They returned to the championship in 2014, with Hyundai i20 WRC, which was unveiled at the 2012 Paris Motor Show.\n\n\n== Gallery ==\n\n\t\t\n\t\t\n\n\n== References ==\n\n\n== External links ==\nOfficial website", "links": ["1991 World Rally Championship season", "2000 Swedish Rally", "2000 World Rally Championship season", "2001 Rally Finland", "2003 World Rally Championship season", "2012 Paris Motor Show", "2014 World Rally Championship", "Alister McRae", "Armin Schwarz", "Auto racing", "Axle track", "BBC Sport", "Belgium", "British Rally Championship", "Finland", "Freddy Loix", "Germany", "Group A", "Haymarket Media Group", "Hyundai Accent", "Hyundai Castrol World Rally Team", "Hyundai Motorsport", "Hyundai World Rally Championship results", "Hyundai World Rally Team", "Hyundai i20 WRC", "ISBN (identifier)", "Inline-four engine", "Internal combustion engine", "Italy", "Juha Kankkunen", "Kenneth Eriksson", "List of World Rally Championship Drivers' Champions", "Longitudinal engine", "Michelin", "Piero Liatti", "Podium", "Rally Catalunya", "South Korea", "Subaru World Rally Team", "Sweden", "Swedish Rally", "Tire", "Tour de Corse", "Transmission (mechanics)", "Turbo charge", "United Kingdom", "Wheelbase", "World Rally Car", "World Rally Championship"]}