{"url": "https://en.wikipedia.org/wiki/H%C3%A4nneschen-Theater", "title": "Hänneschen-Theater", "summary": "Hänneschen-Theater  (German: [ˈhɛnəsçn̩ teˌʔaːtɐ], Colognian: [ˈhɛn²əsjə tiˈja²tɐ]) is a traditional puppetry-theatre in Cologne, Germany. It was established in the year 1802. The stage is situated in a building on Eisenmarkt in downtown Cologne. The pieces are set in Knollendorf, a fictional village somewhere in the outskirts of Cologne. The popular puppets represent fictional characters who embody typical traits of cologne people, so Tünnes and Schäl, Hänneschen and Bärbelchen, as well as other unique characters. In addition to the ever-changing pieces that are staged for adults and children, the puppet shows are also an important part of the Cologne Carnival. The carnival puppet session is each year a loving parody of a conventional Carnival session.", "content": "Hänneschen-Theater  (German: [ˈhɛnəsçn̩ teˌʔaːtɐ], Colognian: [ˈhɛn²əsjə tiˈja²tɐ]) is a traditional puppetry-theatre in Cologne, Germany. It was established in the year 1802. The stage is situated in a building on Eisenmarkt in downtown Cologne. The pieces are set in Knollendorf, a fictional village somewhere in the outskirts of Cologne. The popular puppets represent fictional characters who embody typical traits of cologne people, so Tünnes and Schäl, Hänneschen and Bärbelchen, as well as other unique characters. In addition to the ever-changing pieces that are staged for adults and children, the puppet shows are also an important part of the Cologne Carnival. The carnival puppet session is each year a loving parody of a conventional Carnival session.\n\n\n== Puppets ==\n\nTwo of the more popular puppets are Tünnes and Schäl (Colognian pronunciation: [ˈtʏnəs ʊn ˈʃɛl²]). The name Tünnes is the Rheinish form of Anthony or Antonius. Tünnes is good natured and has a rural, farmer-type of common sense and cleverness. Schäl can refer to the squinted eyes of the two figures or also a term meaning two-faced or iniquitous in the Kölsch dialect. Schäl is skinnier than Tünnes and wears a tailcoat.\nChristoph Winters, the founder of the first Cologne Hänneschen puppet theater, introduced Tünnes to the ensemble in 1803. Schäl was introduced in 1847 in a competing theater run by Franz Millewitsch, an ancestor of actor Willy Millowitsch. Millewitsch placed the sly figure of Schäl with the good-natured Tünnes, clearly a nudge against his clever competitor Winters.\n\n\n== References ==\n\n\n== External links ==\nOfficial website", "links": ["Anthony (given name)", "Antonius", "Cologne", "Cologne Carnival", "Colognian language", "Geographic coordinate system", "Germany", "Innenstadt, Cologne", "North Rhine-Westphalia", "Puppetry", "Rhinelandic regiolect", "VIAF (identifier)", "Willy Millowitsch"]}