{
    "url": "https://en.wikipedia.org/wiki/I_Idolize_You_(Massive_Ego_song)",
    "title": "I Idolize You (Massive Ego song)",
    "summary": "\"I Idolize You\" is the fifth single from British Darkwave band Massive Ego. It was written by Massive and Thirwall. It was the first release for the band on Marc Massive's own independent label, Public Disordar Records, on 15 August 2011. The single marked the departure from the Hi-NRG, Eurodance sound of the band's previous releases.",
    "content": "\"I Idolize You\" is the fifth single from British Darkwave band Massive Ego. It was written by Massive and Thirwall. It was the first release for the band on Marc Massive's own independent label, Public Disordar Records, on 15 August 2011. The single marked the departure from the Hi-NRG, Eurodance sound of the band's previous releases.\n\n\n== Background ==\nThe video for \"I Idolize You\" was filmed by Bambi Fantastic and directed by Massive and Frost. It features the SuicideGirls model Honey Manko, who later modelled for the cover of the Beautiful Suicide album.\"Devil in Disguise\" was written for the band by Australian production team, T1 Music and originally recorded for their second album, but was later released on the single as a B-side. On 9 July 2013 it was released as a digital only single via the Public Disordar Bandcamp.(The Modification Mix, done by Lloyd Price of Sigue Sigue Sputnik, was just the sound that Massive was looking for. Price later joined the band in 2015.\n\n\n== Versions and remixes ==\nThere have been ten different variations of \"I Idolize You\":\n\nThe original single version\nModification Mix by Lloyd Price\nDirty Solar Nite Mix\nAfterburner Remix\nModification Edit by Lloyd Price (Noise in the Machine)\nAesthetic Perfection Remix (Noise in the Machine)\nLeæther Strip Remix (Noise in the Machine)\nSawtooth Remix (Released as a free download via SoundCloud)\nEnvious Mix by Benjamin'sPlague (Released as a free download via SoundCloud)\nOrchestral Epilogue by Scot Collins (Beautiful Suicide)\n\n\n== Track listing ==\n\n\n== Credits and personnel ==\n\n\n== References ==\n\n\n== External links ==\nOfficial website",
    "links": [
        "Aesthetic Perfection",
        "Bandcamp",
        "Beautiful Suicide",
        "Church for the Malfunctioned",
        "Darkwave",
        "Eurodance",
        "Hi-NRG",
        "Industrial music",
        "Leæther Strip",
        "Low Life (EP)",
        "Massive Ego",
        "Master & Servant (Massive Ego album)",
        "Music genre",
        "Nite Klub Skewl",
        "Noise in the Machine",
        "Noise in the Machine (EP)",
        "Out of Line Music",
        "Peter Wilson (singer)",
        "Record label",
        "Sigue Sigue Sputnik",
        "Single (music)",
        "Songwriter",
        "SoundCloud",
        "SuicideGirls"
    ]
}