{"url": "https://en.wikipedia.org/wiki/Ian_McDonald_(Guyanese_writer)", "title": "Ian McDonald (Guyanese writer)", "summary": "Ian McDonald (born 18 April 1933) is a Caribbean-born poet and writer who describes himself as \"Antiguan by ancestry, Trinidadian by birth, Guyanese by adoption, and West Indian by conviction.\" His ancestry on his father's side is Antiguan and Kittitian, and Trinidadian on his mother’s side. His only novel, The Humming-Bird Tree, first published in 1969, is considered a classic of Caribbean literature.", "content": "Ian McDonald (born 18 April 1933) is a Caribbean-born poet and writer who describes himself as \"Antiguan by ancestry, Trinidadian by birth, Guyanese by adoption, and West Indian by conviction.\" His ancestry on his father's side is Antiguan and Kittitian, and Trinidadian on his mother’s side. His only novel, The Humming-Bird Tree, first published in 1969, is considered a classic of Caribbean literature.\n\n\n== Early years and education ==\nIan McDonald was born on 18 April 1933, in St Augustine, Trinidad, where his mother, Thelma McDonald (née Seheult), and her parents were born and where his father, John Archie McDonald (who was born in St. Kitts and whose parents were born in Antigua), was Agricultural Director of Gordon Grant Limited. His uncle was Air Marshall Sir Arthur McDonald of Royal Air Force. He has four sisters – Heather Murray, Gillian Howie, Robin McDonald and Monica Purkis – and one brother, Archie McDonald.\nHe received his secondary education at Queen's Royal College (1942–51) in Port of Spain, where he obtained distinctions in History and English in the Higher School Certificate. He attended Clare College, Cambridge University (1951–55), where he obtained a BA Honours Degree in History and later received his MA. He was elected President of the Cambridge University West Indian Society.\n\n\n== Career in Guyana ==\n\n\n=== Sugar industry ===\nIn 1955 he went to the then British Guiana with the Booker Group, working first as secretary of the Bookers BG Group Committee, then secretary of Bookers Sugar Estates, where he rose to be Administrative Director. When Bookers was nationalised in 1976 he remained with the Guyana Sugar Corporation where he held the post of Director of Marketing and Administration from 1976 until retirement in 1999. He  represented Guyana and CARICOM on innumerable occasions at international conferences and forums on the sugar industry.\nAt the regional level he was involved with the Sugar Association of the Caribbean as Chairman of Marketing from 1990, then CEO from 1999 until retiring in 2007. In November 1995 he delivered an address and presented a paper on \"The Sugar Industries of the English-Speaking Caribbean\" to the International Sugar Organization in London. He was also Chairman of Demerara Sugar Terminals, which exports Guyana’s sugar. For 35 years he was a member of the Sugar Industry Labour Welfare Fund Committee, which provides land and housing, water supply, and welfare facilities for sugar workers.\n\n\n=== Guyanese business and interest ===\nMcDonald was a member of the Guyana National Advisory Committee on External Negotiations.\nHe holds directorships in the Hand-in-Hand Fire and Life Insurance Companies, the Hand-in-Hand Trust Company, Woodlands Diagnostic & Imaging Centre Inc, the Institute of Private Enterprise Development,  St. Joseph Mercy Hospital (2000–2006), and a Trustee of the St. John Boscoe Orphanage for Boys.\nHe is a member, since 2009, of the Council of Schoolnet Guyana, dedicated to the computerization of schools in Guyana.\nIn 1991/92 he held the position of Editorial Consultant with the West Indian Commission, chaired by Sir Shridath Ramphal. His job was to assist in drafting and producing the Commission’s report, Time for Action. To assist in the work of the Commission he prepared a monograph, Bedrock of a Nation: Cultural Foundations of West Indian Integration.\nIn 1996 he was selected as an inaugural member of the West Indies 2000 Group, a \"think-tank\" of 40 West Indian personalities that had no agenda except to encourage the reality of a West Indian identity and the strengthening of the values of a West Indian heritage.\n\n\n== Sporting activities ==\nMcDonald was junior tennis champion of Trinidad and Tobago for many years and first represented that country at the senior level at the age of 16. He played at Wimbledon in the 1950s (the only player from Trinidad or from Guyana to do so). He captained Cambridge University in 1955. He represented Oxford-Cambridge against Harvard-Yale in the Prentice Cup in America in 1952 and in England in 1954. From 1956 to the early 1970s he was champion of Guyana and captained the Guyana Lawn Tennis team. In 1957 he was Guyana’s \"Sportsman of the Year\" with George De Peana. He also represented and captained Guyana in Squash. He represented the West Indies in its first ever Davis Cup team in 1953 and went on to play for and captain the West Indies Davis Cup team later in 1950s and in the 1960s. He also served as Secretary of the Commonwealth Caribbean Lawn Tennis Association for a number of years.\nHe received the Guyana National Sports Commission Award for Outstanding Contribution to the Development of Sports in Guyana, in 2006 and the Guyana Olympic Association Award for Contribution to the Development of Sport in General and Lawn Tennis in particular, in 2007.\nHe has the unusual distinction of representing his country in five different decades: tennis (Trinidad) in the 1940s; tennis (Trinidad, Guyana, the West Indies) in 1950s; tennis (Guyana, the West Indies) in the 1960s; tennis and squash (Guyana) in the 1970s; squash (Guyana) in the 1980s.\n\n\n=== Sport research ===\nHe was a member, with P. J. Patterson and Sir Alister McIntyre, of the panel set up by the West Indies Cricket Board in 2007 to report and make recommendations on the governance of West Indies cricket. This report was submitted to the West Indies Cricket Board in October 2007. He assisted in the compilation, editing and production of Cricket at Bourda, celebrating the Georgetown Cricket Club, in time for the World Cup, March 2007. With Dr. Stewart Brown he compiled an Anthology of West Indian Cricket Writing in 2010.\n\n\n== Literary activities ==\nHis first poems were published in the 1950s and over the years his poems have appeared in a number of West Indian journals, particularly BIM, Kyk-Over-Al, The Caribbean Writer, The New Voices, The Trinidad And Tobago Review, Poui, The Caribbean Review of Books and Jamaica Journal as well as in Planet, Outposts, Voices, and other magazines in Britain and America. His poems have appeared in many anthologies of poems of the region, including Caribbean Poetry Now, Voiceprint, The Graham House Review issue on West Indian Poetry, the Archipelago issue of Conjunctions, the Caribbean Poetry issue of the Atlanta Review and the Heinemann Book of Caribbean Poetry. He was awarded The Caribbean Writer’s Prize for Poetry in 1991 and 2007.\nHe also writes short stories and his work has appeared in anthologies, most recently in the Penguin Book of Caribbean Short Stories and the Faber Book of West Indian Stories.\nHis novel The Humming-Bird Tree was first published by Heinemann in 1969, when it won the Winifred Holtby Memorial Prize from the Royal Society of Literature for best regional novel. It was re-issued as a paperback in the Heinemann Caribbean Writers series in 1974, and has been widely used as a textbook in schools in the region and abroad. The BBC made a film of The Humming-Bird Tree for broadcast at Christmas 1992, and in the same year Heinemann re-issued the novel in a new edition. In 2006 Macmillan published a new edition of The Humming-Bird Tree.\nHis one-act play The Tramping Man, first produced at the Theatre Guild in Guyana in October 1969, has been staged throughout the West Indies and in London. It has been published by UWI’s School of Continuing Studies in a collection of eight Caribbean plays.\nSince 2009 he has been consulting Editor for the Guyana Classics, a series of Guyanese \"Classics\" to be republished by the Caribbean Press funded by the government of Guyana. He was Chairman of Demerara Publishers Limited, which produced and printed 36 books by Guyanese between 1987 and 1992. McDonald helped to edit and wrote the foreword for the first edition of Martin Carter’s definitive Selected Poems published in 1989 by Demerara Publishers in Georgetown, and later in a new edition by the Red Thread Press in 1997.\nHis Selected Poems, edited and with an Introduction by Professor Edward Baugh, was published by Macmillan in 2008, in honour of his 75th birthday. This book was shortlisted for the Royal Society of Literature Ondaatje Prize in 2009.\n\n\n=== Kyk-Over-Al ===\nIn 1984, he edited the book AJS at 70 in honour of Guyana’s great man of letters A. J. Seymour’s 70th birthday.\nAlso in 1984, he was instrumental in reviving the literary magazine Kyk-Over-Al, which had first been published in Guyana between 1954 and 1961, and was joint editor, with A. J. Seymour, until Seymour's death in 1989, after which McDonald continued to edit the magazine with Vanda Radzik. In June 1990, a joint issue of Kyk-Over-Al and BIM was published, co-edited by McDonald with John Wickham; reviewing it in The Caribbean Writer, Cedric Lindo said: \"Perhaps most striking about this joint issue is the ability of Ian McDonald to provide so much material, and very interesting material at that, in 'Across the Editor's Desk.' Seymour has clearly left a good heir in him.\" The 50th Anniversary issue to Kyk-over-Al, No. 46/47, was published in December 1995. In the Guyana 1997 National Honours List Kyk-Over-Al received the Group Medal of Service for its outstanding contribution to literature.\n\n\n=== Arts organizations ===\nHe was a member of the first Management Committee of the Guyana Prize for Literature in 1987. He was the Regional Chairman (Canada and Caribbean) on the panel of judges for the 1991 Commonwealth Writers' Prize.\nFrom its inception in 1980 he has been a Director of the Theatre Company of Guyana, which during the period 1980–2001 produced nearly 100 plays, musicals and revenues and promoted the careers of many of Guyana’s leading theatrical talents. He is a member of the Board of Trustees of the Theatre Guild of Guyana.\nHe is a member of the Management Committee of the Castellani House National Art Collection in Guyana.\nBetween 1990 and 1995 he was a member of the Guyana Book Foundation, which encourages the wide distribution of books and the establishment of small publishers. He was also a member of the National Archives Advisory Committee. He is a member of the Guyana National Nominating Committee for the Sabga Caribbean Awards for Excellence, from 2006.\n\n\n=== News media ===\nHe is a regular contributor of articles on government, current affairs, problems of the Third World, education, literature, and sport in the newspapers. He has written a weekly column, \"Ian on Sunday\", for the Stabroek News since the newspaper started publication in Guyana in 1986. His columns also appear in The Nation in Barbados, The Gleaner in Jamaica and the Trinidad and Tobago Review. He also contributed to Outlet in Antigua. He contributed more than 400 Viewpoints and Sports Views on the radio to these two GBC series. His writings on cricket in particular have gained widespread regional notice. In January 2009, he was appointed Chairman of Guyana Publications Inc., publishers of Stabroek News.\n\n\n=== Lectures ===\nIn 2005 he gave the inaugural lecture entitled \"Cricket: a Hunger in the West Indian soul\" at the London Metropolitan University in the Frank Worrell lecture series. He gave the address at the Frank Collymore Literary Awards ceremony in Barbados in 2009, entitled \"I Shake Hands With You in My Heart\". In November 2014, his literary archives were donated to the Alma Jordan Library at the University of the West Indies (UWI), St Augustine.\n\n\n== Honours and awards ==\nA Fellow of the Royal Society of Literature since 1970\nGuyana National Honour, Golden Arrow of Achievement in 1986.\nHonorary Degree of Doctor of Letters (D.Litt.) in recognition of his services to Caribbean sugar, sport and literature from the University of the West Indies, St. Augustine Campus in 1997.\nWordsworth McAndrew Award 2004 from the Guyana Cultural Association, New York.\nInducted into the Queen's Royal College Hall of Honour in 2004.\nHonoured by the Friends of Mr Biswas, an NGO in Trinidad dedicated to the preservation and development of the Naipaul House Literary Museum on Nepaul Street, St James in 2014.\n\n\n== Personal life ==\nMcDonald is married to Mary Callender and they have two sons: Jamie and Darren. He has a son Keith, from a previous marriage.\n\n\n== Publications ==\nSugar in B.G: Challenge and Change (1965) – New World Publication, Georgetown.\nThe Tramping Man – one-act play first staged in 1969. Published by UWI's School of Continuing Studies in a collection of eight Caribbean plays entitled...a time and a season.\nPoetry Introduction 3 (1975) – London: Faber and Faber.\nSelected Poems – Labour Advocate, Georgetown, 1984.\nEditor: AJS at 70 – Autoprint, Georgetown, Guyana 1984.\nMercy Ward (1992) – collection of poems published by Peterloo Poets, UK, ISBN 978-0905291956. Republished as Guyana Classics series, Caribbean Press, December 2010.\nEssequibo (1992) – collection of poems published by Peterloo Poets, UK, and Story Line Press, US (winner of the Guyana Prize for Literature 1992), ISBN 9781871471342.\nMonograph, Bedrock of a Nation: Cultural Foundations of West Indian Integration – for West Indian Commission, 1992.\nContribution as Editorial Assistant: Time For Action: Report of the West Indian Commission, 1992.\nHeinemann Book of Caribbean Poetry (1992) – edited jointly with Stewart Brown, published by Heinemann.\nJaffo The Calypsonian (1994) – collection of poems; Peepal Tree Press, UK.\nBetween Silence and Silence – collection of poems; Peepal Tree Press, 2003 (winner of the Guyana Prize for Literature 2004).\nThe Humming-Bird Tree, novel – Heinemann, 1969; Macmillan, 2004; filmed by the BBC in 1992.\nA. J. Seymour, Collected Poems 1937–1989 (edited with Jacqueline de Weever), New York: Blue Parrot Press, 2000.\nForeword to Selected Poems of Martin Carter, first published Demerara Publishers, 1989; revised edition, Red Thread Women's Press, 1997.\nThey Came in Ships (compiled and edited with Lloyd Searwar, Laxshmi Kallicharan and Joel Benjamin), anthology of Guyanese East Indian Writings – Peepal Tree Press, 1998.\nPoems by Martin Carter (edited jointly with Dr. Stewart Brown) – Macmillan, September 2006.\nContributed to Caribbean Despatches – Macmillan, 2006.\nContributed to Penguin Book of Short Stories and the Faber Book of West Indian Stories.\nCricket at Bourda (2007) – compiled with Paul Chan-A-Sue; Sheik Hassan Printery, Georgetown.\nReport of the Governance Committee on West Indies Cricket (2007) – joint author with Hon. P. J. Patterson and Sir Alister McIntyre.\nSelected Poems – Macmillan, 2008.\nThe Bowling Was Superfine – West Indian Writing and West Indian Cricket – edited jointly with Stewart Brown, 2010; paperback 2012, ISBN 978-1845230548\nIan McDonald’s New and Collected Poems (2018) Peepal Tree Press.\n\n\n== References ==\n\n\n== External links ==\nNicholas Laughlin, \"Ian McDonald: Evening in the Garden\", Caribbean Beat, Issue 96, March/April 2009.\nKyk-Over-Al in the Digital Library of the Caribbean\nNewspaper clippings on Ian McDonald digitized by CARICOM and openly available in the Digital Library of the Caribbean", "links": ["2007 ICC World Cup", "A. J. Seymour", "Alister McIntyre", "Alma Jordan Library", "Antigua", "Arthur McDonald", "Atlanta Review", "BBC", "BIM (magazine)", "Booker Group", "British Guiana", "CARICOM", "Cambridge University", "Caribbean", "Caribbean Beat", "Caribbean literature", "Castellani House National Art Collection", "Clare College", "Commonwealth Writers' Prize", "Conjunctions", "Davis Cup", "Digital Library of the Caribbean", "ESPNcricinfo", "Edward Baugh", "Fellow of the Royal Society of Literature", "Frank Collymore", "Georgetown Cricket Club", "Gleaner Company", "Guyana", "Guyana Olympic Association", "Guyana Sugar Corporation", "Hand in Hand Fire & Life Insurance Society", "ISBN (identifier)", "ISNI (identifier)", "Ian McDonald (disambiguation)", "International Sugar Organization", "Jamaica Journal", "Ken Ramchand", "Kyk-Over-Al (magazine)", "London Metropolitan University", "Martin Carter", "Nicholas Laughlin", "Ondaatje Prize", "Orders, decorations, and medals of Guyana", "P. J. Patterson", "Port of Spain", "Queen's Royal College", "Royal Air Force", "Royal Society of Literature", "SUDOC (identifier)", "Sir Shridath Ramphal", "St. Joseph Mercy Hospital", "St. Kitts", "St Augustine, Trinidad", "Stabroek News", "Sugar industry", "The Caribbean Writer", "The Championships, Wimbledon", "The Daily Nation (Barbados)", "Trinidad and Tobago", "University of the West Indies", "VIAF (identifier)", "Wayback Machine", "West Indian", "West Indies Cricket Board", "West Indies Davis Cup team", "Winifred Holtby Memorial Prize", "Wordsworth McAndrew Award"]}