{
    "url": "https://en.wikipedia.org/wiki/Inbal_Dror",
    "title": "Inbal Dror",
    "summary": "Inbal Dror (Hebrew: ענבל דרור, born 1976) is an Israeli fashion designer known for her contemporary wedding gowns. She launched her eponymously-named couture brand in 2005 and her bridal label in 2014. She designed the wedding dress of Ivanka Trump and has also designed gowns for Beyoncé, Naomi Watts, and other celebrities.",
    "content": "Inbal Dror (Hebrew: ענבל דרור, born 1976) is an Israeli fashion designer known for her contemporary wedding gowns. She launched her eponymously-named couture brand in 2005 and her bridal label in 2014. She designed the wedding dress of Ivanka Trump and has also designed gowns for Beyoncé, Naomi Watts, and other celebrities.\n\n\n== Early life and education ==\nDror was born in 1976 in Ashdod, Israel. She is the eldest of three children. She showed promise in her physics and mathematics studies in high school, but decided to pursue a career in art and design. She applied to the Shenkar College of Engineering and Design in Ramat Gan during her discharge from army service, and after completing her studies there she went to Milan, Italy, to study at the fashion house of Roberto Cavalli for four years. Upon her return to Israel, she began designing wedding gowns out of her parents' home.\n\n\n== Career ==\nDror set up a fashion house in Ashdod in 2004 and launched her couture \"Inbal Dror\" brand in 2005. She opened a 250-square-metre (2,700 sq ft) bridal showroom in Tel Aviv in 2014. A diffusion line of street wear was added in 2017, and a diffusion line of bridal gowns in 2018. Dror employs 270 workers in Israel and 35 employees in other parts of the world. She sells out of her flagship store in Tel Aviv and in 75 boutiques internationally. An Inbal Dror gown retails for $8,000 to $10,000. Gowns for rental in Israel only are priced at 14,000 shekel on average.Inbal Dror gowns are known for their \"racy silhouettes\" and \"revealing necklines\". They feature \"attention-demanding details like sheer cup corsets, dramatic cut-outs and slits, and barely there silhouettes\". Beyoncé wore a Dror wedding gown to the 2016 Grammy Awards and also commissioned several ensembles with \"Victorian and tribal influences\" for her 2016 The Formation World Tour. Giuliana Rancic wore an Inbal Dror pantsuit to the 2015 Grammy Awards. Other celebrities who have appeared in Inbal Dror gowns include Naomi Watts, Gala Gonzalez, Rita, Kat Graham, and Bar Refaeli.Celebrities who have been married in an Inbal Dror gown include Karen Hauer, Lisalla Montenegro, and Ivanka Trump. In December 2017, Dror received an official request from the British royal family to submit sketches for a wedding dress for Meghan Markle in advance of Markle's 2018 marriage to Prince Harry.An Inbal Dror wedding gown was chosen as one of the \"10 Most Unconventional Bridal Looks from the Fall 2015 Collections\" by Vogue.\n\n\n== Personal life ==\nWhile Dror is known for her gown designs, she does not wear dresses herself, but jeans and sneakers. Dror says she was married in jeans at a horse ranch. She and her husband have two children. She lives and works in Israel.\n\n\n== See also ==\nIsraeli fashion\n\n\n== References ==",
    "links": [
        "57th Annual Grammy Awards",
        "58th Annual Grammy Awards",
        "Ashdod",
        "Bar Refaeli",
        "Beyoncé",
        "British royal family",
        "Conscription in Israel",
        "Diffusion line",
        "Elle (magazine)",
        "Fashion design",
        "Gala Gonzalez",
        "Giuliana Rancic",
        "Haute couture",
        "Hebrew language",
        "Hello! (magazine)",
        "Independent (UK)",
        "Israeli fashion",
        "Ivanka Trump",
        "Jerusalem Post",
        "Karen Clifton",
        "Kat Graham",
        "Lisalla Montenegro",
        "Marie Claire",
        "Meghan, Duchess of Sussex",
        "Milan",
        "Naomi Watts",
        "People (magazine)",
        "Racked",
        "Ramat Gan",
        "Rita (Israeli singer)",
        "Roberto Cavalli",
        "Shenkar College of Engineering and Design",
        "The Formation World Tour",
        "Vogue (magazine)",
        "Wedding of Prince Harry and Meghan Markle",
        "Yediot Ahronoth",
        "Ynet"
    ]
}