{
    "url": "https://en.wikipedia.org/wiki/Increase_Mather",
    "title": "Increase Mather",
    "summary": "Increase Mather (; June 21, 1639 Old Style – August 23, 1723 Old Style) was a New England Puritan clergyman in the Massachusetts Bay Colony and president of Harvard College for twenty years (1681–1701). He was influential in the administration of the colony during a time that coincided with the notorious Salem witch trials.",
    "content": "Increase Mather (; June 21, 1639 Old Style – August 23, 1723 Old Style) was a New England Puritan clergyman in the Massachusetts Bay Colony and president of Harvard College for twenty years (1681–1701). He was influential in the administration of the colony during a time that coincided with the notorious Salem witch trials.\n\n\n== Biography ==\n\n\n=== Early life ===\nMather was born in Dorchester, Massachusetts Bay Colony, on June 21, 1639, to the Rev. Richard Mather and Kathrine Holt Mather, following their participation in the Great Migration from England due to their nonconformity to the Church of England.The stated reason for his first name was \"...the never-to-be-forgotten increase, of every sort, wherewith God favoured the country about the time of his nativity.\" The name \"Increase\" is a literal translation of the Hebrew \"Yosëf\" (Joseph). He was the youngest of six brothers, the others being Samuel, Nathaniel, Eleazar, Joseph, and Timothy. The first three of these also became ministers.\n\n\n==== Education ====\nIn 1651, Mather was admitted to Harvard College, where he roomed with and studied under Robert Massey. When he graduated in 1656, aged 17, with a Bachelor of Arts, he began to train for the ministry, and gave his first sermon on his 18th birthday. He quickly left Massachusetts and went to Ireland, where he studied at Trinity College, Dublin for a Master of Arts. During his time at Trinity College he was licensed as a Commonwealth Minister by Oliver Cromwell to the joint charge of St Tida's Church (Ballyscullion), and St Swithan's Church (Magherafelt). He graduated in 1658, and worked as a chaplain attached to a garrison in the Channel Islands from 1659 to 1661 with a short stint at a church in Gloucester in 1660.After Cromwell's death in 1658, Mather felt less secure in his post in the Channel Islands due to Charles II's return to the throne. He resigned the position in 1660 and sailed for Boston in 1661. Harvard later awarded Mather the first honorary degree in the New World; he became a Doctor of Sacred Theology in 1692.\n\n\n=== Establishing himself in Massachusetts ===\nIn 1661, with the advent of the English Restoration and resurgence of Anglicanism, Increase returned to Massachusetts, where he married Maria Cotton. She was his step-sister by virtue of his father's marriage to Sarah Hankredge, widow of John Cotton and mother of Maria. She gave birth to Cotton Mather in 1663. In 1676, he published A Brief History of the War with the Indians in New-England, a contemporary account of King Philip's War.\nHe was ordained as minister of the North Church. He held this post until he died.\n\n\n==== Harvard College ====\nIn his autobiography, Increase Mather writes that he was President of Harvard, from 1681 until 1701, but due to charter and organizational changes, his official title varied. On June 11, 1685, he was made Acting President and on July 23, 1686, he was appointed Rector. On June 27, 1692, he finished writing the new college charter and became president. On September 5, 1692, while the Salem trials were still ongoing, Increase Mather was awarded a doctorate of divinity, the first doctorate issued at Harvard, and the last for 79 years.He was rarely present on campus or in the town, especially during his term of Rector as he was out of the Colony for all but two years of his term in that office. Despite his absences he did make some changes: re-implementation of Greek and Hebrew instruction, replacement of classical Roman authors with Biblical and Christian authors in ethics classes, enactment of requirements that students attend classes regularly, live and eat on campus, and that seniors not haze other students.\n\n\n=== Involvement in politics ===\nWhile politics and Puritan religion were closely related during Increase's lifetime, his first direct involvement with politics occurred as a result of James II of England's manipulation of the New England governments. In 1686, James revoked the Charter of Massachusetts in the process of creating the Dominion of New England.The Dominion was headed by Edmund Andros, who not only disliked puritanism and was haughty, but ruled as a near-absolute dictator: Town meetings were outlawed, leaving the Dominion without consent of the governed, marriage was removed from the clergy, and the Old South Church was temporarily appropriated for Anglican services.The 1687 Declaration of Indulgence, prohibiting discrimination against Catholics, saw staunch opposition from the Puritan establishment. When Mather successfully roused opposition to revocation of the charter, he was nearly framed for treason. He traveled to London (eluding spies out to catch him) to petition the King. While engaged in petitioning he published pieces to build popular support for his positions, such as A Narrative of the Miseries of New-England, By Reason of an Arbitrary Government Erected there Under Sir Edmund Andros (1688) and A Brief Relation for the Confirmation of Charter Privileges (1691).He attempted to restore the old charter and obtain a royal charter for Harvard; however, he abandoned that course and changed his petitions, favoring a new charter not lacking any of the rights previously granted. Following the Glorious Revolution and subsequent overthrow of Andros, a new charter was granted to the colony. The 1692 charter was a major departure from its predecessor, granting sweeping home rule, establishing an elective legislature, enfranchising all freeholders (previously only men admitted to a congregation could vote), and uniting the Massachusetts Bay Colony and Plymouth Colony. Following Andros' deposition and arrest, he had William Phips appointed as Royal Governor and they returned to Massachusetts, arriving on May 14, 1692. Following his return, the administration of Harvard grew increasingly insistent that he reside nearer to the institution. Not wanting to leave his Second Church, he did not do so, and eventually resigned the Presidency.\n\n\n=== Early influence and involvement in the Salem witch trials ===\nIn 1681, the same year he became president of Harvard (and when his son Cotton Mather was only eighteen years old), Increase Mather began work on a manuscript that was to be a collection of \"illustrious providences\" and he solicited contributions from the other Puritan ministers. This work demonstrated a belated interest in witchcraft relative to the European continent, where witch trials had gone into a steep decline after reaching \"peak intensity during the century 1570–1670\" but this reflected a similar belated interest among a certain milieu in London around the same time. Increase Mather's book \"Remarkable Providences\" was published in 1684 and forwards a doctrinal belief in the real power of witchcraft. One of the more curious aspects of the book is that while it cites numerous Reformation theologians (Luther, Beza, Melancthon) and many well-known writers on witchcraft including Dominican inquisitor Heinrich Kramer (author of the notorious witch-hunting manual Malleus Maleficarum), it does not cite John Calvin.\nIn November 1692, he published Cases of Conscience Concerning Evil Spirits which defended the judges and trials, but also expressed words of caution, perhaps due to public pressure. In the postscript, included with the initial first edition of the book, he mentions his own attendance at the trial of George Burroughs and his agreement with the capital judgment against him. George Burroughs had been a fellow minister who seems to have substituted at the pulpit for Increase Mather on at least one occasion. Like his work from 1684, this 1692 work also cites Malleus Maleficarum.Notwithstanding this, his reputation was not improved afterwards or for posterity due to his association with the trials as well as his subsequent refusal, for whatever reasons, to denounce them. He was also briefly mentioned in a thorough treatment of his son Cotton by Robert Calef in his comprehensive book of the Salem Trials and their aftermath, More Wonders of the Invisible World (referred to as More Wonders of the Spiritual World by the Encyclopædia Britannica Eleventh Edition). Increase Mather was said to have burned Calef's book in Harvard Yard.\n\n\n=== Later life and death ===\n \nIn 1715, following the death of his wife Maria the previous year, he married Ann Cotton, widow of his nephew John.Mather owned a slave named Spaniard.On September 27, 1722, he fainted and was thereafter bedridden. In August 1723 he suffered bladder failure and died three weeks later on August 23, 1723, in Boston, aged 84. He was buried in Copp's Hill Burying Ground.Before his death, he took lodging at the retreat of Mineral Spring Pond to recover from his illness and drink from the famous healing waters of the springs from Spring Pond.\n\n\n== Beliefs ==\nThroughout his life Mather was a staunch Puritan, opposing anything openly contradictory to, mutually exclusive with, or potentially \"distracting\" from, his religious beliefs. He supported suppression of intoxication, unnecessary effort on Sundays and ostentatious clothing. He was initially opposed to the Half-Way Covenant but later supported it. He firmly believed in the direct appearance of God's disfavor in everyday life, e.g. the weather, political situations, attacks by Native Americans, fires and floods, etc.He was strenuous in attempting to keep people to his idea of morality, making strong use of jeremiads to try to prevent indifference and especially to try to get government officials to enforce public morality. During his tenure at Harvard he regularly stamped out any relaxation of Puritan strictness, such as latitudinarianism, which had flourished during his overseas absence.Following his acceptance of the Covenant, Solomon Stoddard and others attempted to further liberalize Puritanism by baptism of children who had nonmember parents and admittance of all but the openly immoral to services. To try to stop this, Mather had a synod called to outlaw similar measures. A declaration was adopted, but never made binding.\n\n\n== In popular culture ==\nIn John Neal's 1828 novel Rachel Dyer, Increase Mather appears at the end of Martha Corey's witchcraft trial to announce the guilty verdict and give a speech. He is also played by Stephen Lang in the 2014 TV series Salem.\n\n\n== Portraiture ==\nA portrait of Increase Mather hangs in the Middle Common Room of Mansfield College, Oxford.\n\n\n== See also ==\nSalem witch trials\nCotton Mather\nJohn Ratcliff\n\n\n== References ==\n\n\n== Further reading ==\nBaker, Emerson W. A Storm of Witchcraft: The Salem Trials and the American Experience (2014)\nKenneth Murdock, Increase Mather: The Foremost American Puritan (Harvard, 1925)\nMichael G. Hall. The Last American Puritan: The Life of Increase Mather. Wesleyan, 1992.\nThomas James Holmes. Increase Mather: a Bibliography of his Works. Cleveland, 1931.\nMason I. Lowance. Increase Mather. New York, 1974.\nRobert Middlekauff. The Mathers: Three Generations of Puritan Intellectuals, 1596–1728. New York, 1971.\nKenneth B. Murdock. Increase Mather: The Foremost American Puritan. Cambridge, Massachusetts, 1925.\nIncrease Mather's Catechismus Logicus: \"A Translation and an  Analysis of the Role of a Ramist Catechism at Harvard\", co-authored with Thomas Knoles,  Proceedings of the American Antiquarian Society 109 (1999): 145–181[1]\nMather, Frederic Gregory (1900). \"Mather, Richard\" . Appletons' Cyclopædia of American Biography.\n\n\n== External links ==\nWorks by Increase Mather at Project Gutenberg\nWorks by Increase Mather at LibriVox (public domain audiobooks) \nWorks by or about Increase Mather at Internet Archive\nWorks by Increase Mather at Google Books",
    "links": [
        "1689 Boston revolt",
        "A. Lawrence Lowell",
        "Abigail Barker (Salem witch trials)",
        "Abigail Faulkner",
        "Abigail Faulkner, Sr. (Salem witch trials)",
        "Abigail Hobbs",
        "Abigail Martin, Jr. (Salem witch trials)",
        "Abigail Rowe (Salem witch trials)",
        "Abigail Soames (Salem witch trials)",
        "Abigail Williams",
        "Abraham Kuyper",
        "Afrikaner Calvinism",
        "Alice Parker (Salem witch trials)",
        "Andrew Carrier (Salem witch trials)",
        "Anglicanism",
        "Ann Dolliver (Salem witch trials)",
        "Ann Foster",
        "Ann Pudeator",
        "Ann Putnam",
        "Ann Sears (Salem witch trials)",
        "Anne Bradstreet (Salem witch trials)",
        "Appletons' Cyclopædia of American Biography",
        "Arthur C. Abbot (Salem witch trials)",
        "B.B. Warfield",
        "Bachelor of Arts",
        "Ballyscullion",
        "Baptism",
        "Bartholomew Gedney",
        "Benjamin Abbot House",
        "Benjamin Wadsworth",
        "Bethiah Carter, Jr. (Salem witch trials)",
        "Bethiah Carter, Sr. (Salem witch trials)",
        "Betty Parris",
        "Bible",
        "Boston",
        "Boston, Massachusetts",
        "Bray Wilkins",
        "Bridget Bishop",
        "British America",
        "Calvinism",
        "Candy (Salem witch trials)",
        "Capt. Daniel Wycomb (Salem witch trials)",
        "Channel Islands",
        "Chaplain",
        "Charles Chauncy",
        "Charles Hodge",
        "Charles II of England",
        "Charles William Eliot",
        "Christian Trask (Salem witch trials)",
        "Christian ministry",
        "Christianity",
        "Church of England",
        "Commonwealth of Massachusetts",
        "Congregational church",
        "Consent of the governed",
        "Continental Reformed church",
        "Copp's Hill",
        "Copp's Hill Cemetery",
        "Cornelius Conway Felton",
        "Cotton Mather",
        "Covenant theology",
        "Cultural depictions of the Salem witch trials",
        "Daniel Andrew (Salem witch trials)",
        "Daniel Eames (Salem witch trials)",
        "Declaration of Indulgence",
        "Deliverance Dane",
        "Deliverance Hobbs",
        "Deodat Lawson",
        "Derek Bok",
        "Dictatorship",
        "Doctor of Sacred Theology",
        "Dominion of New England",
        "Dorcas Hoar",
        "Dorchester, Massachusetts",
        "Dorothy Good",
        "Drew Gilpin Faust",
        "Dudley Bradstreet (magistrate)",
        "Ebenezer Babson (Salem witch trials)",
        "Edmund Andros",
        "Edward Bishop (Salem witch trials)",
        "Edward Everett",
        "Edward Farrington (Salem witch trials)",
        "Edward Holyoke",
        "Edward Payson (Salem witch trials)",
        "Edward Putnam (Salem witch trials)",
        "Edward Wooland (Salem witch trials)",
        "Eliphalet Pearson",
        "Elizabeth Booth",
        "Elizabeth Cary (Salem witch trials)",
        "Elizabeth Colson (Salem witch trials)",
        "Elizabeth Dicer (Salem witch trials)",
        "Elizabeth Fosdick (Salem witch trials)",
        "Elizabeth Howe",
        "Elizabeth Hubbard (Salem witch trials)",
        "Elizabeth Hutchinson Hart (Salem witch trials)",
        "Elizabeth Proctor",
        "Elizabeth Scargen (Salem witch trials)",
        "Encyclopædia Britannica Eleventh Edition",
        "English Restoration",
        "Ephraim Stevens (Salem witch trials)",
        "Esther Elwell (Salem witch trials)",
        "Ethics",
        "Eunice Frye (Salem witch trials)",
        "Fee simple",
        "Frances Wycomb (Salem witch trials)",
        "Francis Dane",
        "Francis Dane (Salem witch trials)",
        "Francis Turretin",
        "Frederic Gregory Mather",
        "Friedrich Schleiermacher",
        "Geneva Bible",
        "George Burroughs",
        "George Herrick",
        "George Jacobs (Salem witch trials)",
        "Giles Corey",
        "Glorious Revolution",
        "Google Books",
        "Great Migration (Puritan)",
        "Greek language",
        "Half-Way Covenant",
        "Hannah Foster (Salem witch trials)",
        "Hannah Putnam (Salem witch trials)",
        "Hannah Tyler (Salem witch trials)",
        "Harvard College",
        "Harvard University",
        "Harvard Yard",
        "Hazing",
        "Hebrew language",
        "Heinrich Bullinger",
        "Heinrich Kramer",
        "Henry Dunster",
        "Henry Kinney (Salem witch trials)",
        "Herman Bavinck",
        "Hezekiah Usher II (Salem witch trials)",
        "History of New England",
        "Home rule",
        "Honorary degree",
        "Huguenots",
        "Huldrych Zwingli",
        "ISBN (identifier)",
        "ISNI (identifier)",
        "Increase (given name)",
        "Institutes of the Christian Religion",
        "International Conference of Reformed Churches",
        "Internet Archive",
        "James B. Conant",
        "James Best Jr. (Salem witch trials)",
        "James Best Sr. (Salem witch trials)",
        "James II of England",
        "James Russell (Massachusetts colonist)",
        "James Walker (Harvard)",
        "Jane Lilly or Lillie (Salem witch trials)",
        "Jared Sparks",
        "Jeremiad",
        "Jeremiah Neale (Salem witch trials)",
        "Joan Penney (or Penny) (Salem witch trials)",
        "Joanna Tyler (Salem witch trials)",
        "Job Tookey (Salem witch trials)",
        "John Alden (sailor)",
        "John Bly Sr. and Rebecca Bly (Salem witch trials)",
        "John Bradstreet (Salem witch trials)",
        "John Busse (Salem witch trials)",
        "John Calvin",
        "John Cotton (puritan)",
        "John DeRich (Salem witch trials)",
        "John Durrant (Salem witch trials)",
        "John Emerson (Salem witch trials)",
        "John Hale (Beverly minister)",
        "John Hale (minister)",
        "John Hathorne",
        "John Higginson (minister)",
        "John Howe (Salem witch trials)",
        "John Indian (Salem witch trials)",
        "John Knox",
        "John Leverett the Younger",
        "John Mayo (minister)",
        "John Neal (writer)",
        "John Proctor (Salem witch trials)",
        "John Proctor III",
        "John Putnam, Jr. (Salem witch trials)",
        "John Putnam, Sr. (Salem witch trials)",
        "John Ratcliff (bookbinder)",
        "John Richards (Salem witch trials)",
        "John Rogers (Harvard)",
        "John Thornton Kirkland",
        "John Wilkins (Salem witch trials)",
        "John Willard",
        "John Winthrop (educator)",
        "John van der Spriett",
        "Jonathan Corwin",
        "Jonathan Edwards (theologian)",
        "Jonathan Putnam (Salem witch trials)",
        "Jonathan Walcott (Salem witch trials)",
        "Joseph",
        "Joseph Draper (Salem witch trials)",
        "Joseph Emons (Salem witch trials)",
        "Joseph Fowler (Salem witch trials)",
        "Joseph Herrick",
        "Joseph Hutchinson (Salem witch trials)",
        "Joseph Whipple (Salem witch trials)",
        "Joseph Willard",
        "Josiah Quincy III",
        "Karl Barth",
        "Katerina Biss (Salem witch trials)",
        "King Philip's War",
        "Latitudinarianism",
        "Lawrence Bacow",
        "Lawrence Summers",
        "Legislature",
        "Leonard Hoar",
        "LibriVox",
        "List of Reformed denominations",
        "List of people of the Salem witch trials",
        "Logical order of God's decrees",
        "Lord's Supper in Reformed theology",
        "Lydia Dustin (Salem witch trials)",
        "Magherafelt",
        "Malleus Maleficarum",
        "Mansfield College, Oxford",
        "Margaret Hawkes (Salem witch trials)",
        "Margaret Jacobs (Salem witch trials)",
        "Margaret Prince (Salem witch trials)",
        "Margaret Rule (Salem witch trials)",
        "Margaret Scott (Salem witch trials)",
        "Margaret Thacher (Salem witch trials)",
        "Margaret Wilkins Knight (Salem witch trials)",
        "Martha Carrier (Salem witch trials)",
        "Martha Corey",
        "Martha Emerson (Salem witch trials)",
        "Martha Sprague (Salem witch trials)",
        "Martha Tyler (Salem witch trials)",
        "Martin Bucer",
        "Mary Barker (Salem witch trials)",
        "Mary Black (Salem witch trials)",
        "Mary Bradbury",
        "Mary Bridges, Jr. (Salem witch trials)",
        "Mary Bridges, Sr. (Salem witch trials)",
        "Mary Colson (Salem witch trials)",
        "Mary Daniel (Salem witch trials)",
        "Mary Dyer (Salem witch trials)",
        "Mary Eastey",
        "Mary Fuller (Salem witch trials)",
        "Mary Green (Salem witch trials)",
        "Mary Harrington Taylor (Salem witch trials)",
        "Mary Herrick (Salem witch trials)",
        "Mary Lacey, Jr. (Salem witch trials)",
        "Mary Lacey, Sr. (Salem witch trials)",
        "Mary Lovett Tyler (Salem witch trials)",
        "Mary Osgood Marston (Salem witch trials)",
        "Mary Parker (Salem witch trials)",
        "Mary Post (Salem witch trials)",
        "Mary Rowe (Salem witch trials)",
        "Mary Walcott",
        "Mary Warren (Salem witch trials)",
        "Mary Whittredge (Salem witch trials)",
        "Massachusetts Bay Colony",
        "Massachusetts Charter",
        "Massachusetts Historical Society",
        "Master of Arts",
        "Mehitable Downing (Salem witch trials)",
        "Mercy Lewis",
        "Mercy Short (Salem witch trials)",
        "Metrical psalter",
        "Minister (religion)",
        "Moses Tyler (Salem witch trials)",
        "Nathan Pusey",
        "Nathaniel Coit (Salem witch trials)",
        "Nathaniel Eaton",
        "Nathaniel Ingersoll (Salem witch trials)",
        "Nathaniel Putnam (Salem witch trials)",
        "Nathaniel Saltonstall",
        "Nehemiah Abbot, Jr. (Salem witch trials)",
        "Neil Rudenstine",
        "Neo-Calvinism",
        "New Calvinism",
        "New World",
        "Nicholas Noyes",
        "Nicholas Rist (Salem witch trials)",
        "Nonconformist (Protestantism)",
        "North American Presbyterian and Reformed Council",
        "OCLC (identifier)",
        "Old North Church",
        "Old South Church",
        "Old Style",
        "Oliver Cromwell",
        "Ordination",
        "Peter Martyr Vermigli",
        "Peter Tufts (Salem witch trials)",
        "Phillip English (Salem witch trials)",
        "Pilgrims (Plymouth Colony)",
        "Plymouth Colony",
        "Predestination in Calvinism",
        "Presbyterianism",
        "Presbyterianism in South Korea",
        "Presbyterianism in the United States",
        "President of Harvard University",
        "Project Gutenberg",
        "Protestantism",
        "Province of Massachusetts Bay",
        "Puritan",
        "Puritans",
        "Rachel Clinton",
        "Rachel Dyer",
        "Rachel Vinson (Salem witch trials)",
        "Ralph Farnum Sr. (Salem witch trials)",
        "Rebecca Dike (Salem witch trials)",
        "Rebecca Eames",
        "Rebecca Eames (Salem witch trials)",
        "Rebecca Jacobs (Salem witch trials)",
        "Rebecca Nurse",
        "Rector (academia)",
        "Reformation",
        "Reformed Baptists",
        "Reformed baptismal theology",
        "Reformed confessions of faith",
        "Reformed scholasticism",
        "Reformed systematic theology bibliography",
        "Regulative principle of worship",
        "Richard Carrier (Salem witch trials)",
        "Richard Mather",
        "Richard Walker (Salem witch trials)",
        "Robert Calef",
        "Robert Middlekauff",
        "Roger Toothaker",
        "Roman Catholicism",
        "SUDOC (identifier)",
        "Salem (TV series)",
        "Salem witch trials",
        "Samuel Langdon",
        "Samuel Locke",
        "Samuel Parris",
        "Samuel Phillips (Salem witch trials)",
        "Samuel Pickworth (Salem witch trials)",
        "Samuel Sewall",
        "Samuel Wardwell",
        "Samuel Webber",
        "Samuel Wilkins",
        "Samuel Willard",
        "Samuel and Ruth Perley (or Pearly) (Salem witch trials)",
        "Sarah Bibber",
        "Sarah Bridges (Salem witch trials)",
        "Sarah Buckley (Salem witch trials)",
        "Sarah Carrier (Salem witch trials)",
        "Sarah Churchwell (Salem witch trials)",
        "Sarah Clapp Swift (Salem witch trials)",
        "Sarah Cloyce",
        "Sarah Davis Rice (Salem witch trials)",
        "Sarah Good",
        "Sarah Hawkes, Jr. (Salem witch trials)",
        "Sarah Morey",
        "Sarah Murrell (Salem witch trials)",
        "Sarah Nurse (Salem witch trials)",
        "Sarah Osborne (Salem witch trials)",
        "Sarah Pease (Salem witch trials)",
        "Sarah Phelps (Salem witch trials)",
        "Sarah Proctor (Salem witch trials)",
        "Sarah Rist (Salem witch trials)",
        "Sarah Root (Salem witch trials)",
        "Sarah Wildes",
        "Sarah Wildes (Salem witch trials)",
        "Sarah Wilson, Jr. (Salem witch trials)",
        "Sarah Wilson, Sr. (Salem witch trials)",
        "Second Church, Boston",
        "Slavery in the colonial United States",
        "Solomon Stoddard",
        "Spring Pond, Massachusetts",
        "Stephen Lang",
        "Substance intoxication",
        "Sumptuary law",
        "Susanna Rootes (Salem witch trials)",
        "Susannah Martin",
        "Susannah Post (Salem witch trials)",
        "Susannah Sheldon",
        "Synod",
        "The Reverend",
        "Theodore Beza",
        "Theology of John Calvin",
        "Thomas Barnard (Salem witch trials)",
        "Thomas Boreman (Salem witch trials)",
        "Thomas Brattle",
        "Thomas Carrier, Jr. (Salem witch trials)",
        "Thomas Chandler (Salem witch trials)",
        "Thomas Danforth",
        "Thomas Farrar, Sr. (Salem witch trials)",
        "Thomas Hill (clergyman)",
        "Thomas Maule (Quaker)",
        "Thomas Preston (Salem witch trials)",
        "Thomas Putnam",
        "Thomas Putnam (Salem witch trials)",
        "Thomas and Mary Jacobs (Salem witch trials)",
        "Three Forms of Unity",
        "Timeline of the Salem witch trials",
        "Timothy Swan or Swann (Salem witch trials)",
        "Tituba",
        "Town meeting",
        "Treason",
        "Trinity College, Dublin",
        "Trinity College Dublin",
        "Trove (identifier)",
        "Unconsciousness",
        "Urian Oakes",
        "Urinary bladder",
        "VIAF (identifier)",
        "Wait Winthrop",
        "Westminster Standards",
        "William Barker, Jr. (Salem witch trials)",
        "William Barker, Sr. (Salem witch trials)",
        "William Griggs (physician)",
        "William Milbourne",
        "William Phips",
        "William Proctor (Salem witch trials)",
        "William Stoughton (judge)",
        "Wilmot Redd",
        "World Communion of Reformed Churches",
        "World Reformed Fellowship",
        "Zacharias Ursinus"
    ]
}