{"url": "https://en.wikipedia.org/wiki/Ines_Rau", "title": "Ines Rau", "summary": "Ines-Loan Rau (born 1990) is a French model. She was Playboy magazine's Playmate of the Month for November 2017 and the first openly transgender Playmate.", "content": "Ines-Loan Rau (born 1990) is a French model. She was Playboy magazine's Playmate of the Month for November 2017 and the first openly transgender Playmate.\n\n\n== Early life ==\nRau was born in Paris and is of Algerian descent. Assigned male at birth, Rau transitioned and underwent sex reassignment surgery at the age of 16, after being inspired by the life story of English trans model Caroline \"Tula\" Cossey. Afterwards, she lived as a woman but did not divulge her transgender identity until she was 24.\n\n\n== Career ==\nAfter turning 18, Rau started dancing for DJs in Ibiza, during which she became friends with David Guetta. In 2013, at age 23, she first posed nude with Tyson Beckford for a spread in OOB, a French luxury magazine, shortly after coming out as transgender. In May 2014, she first appeared in Playboy's \"A-Z issue\" in a spread titled \"Evolution\" that aimed to depict the growing acceptance of gender identities beyond the male-female binary. She became the second transgender woman to be featured in Playboy after Cossey in 1981 and the first who came out voluntarily (Cossey was outed against her will and reappeared in the magazine in 1991).Following her magazine appearances, Rau worked as a model for Nicole Miller, Alexis Bittar and Barneys New York. She also appeared in Vogue Italia and in a campaign for Balmain.In October 2017, Cooper Hefner, son of Playboy founder Hugh Hefner, announced that Rau would appear as \"Playmate of the Month\" in the magazine's November/December 2017 issue, making her the first openly transgender woman to be featured this way. Hefner likened the choice to feature Rau to his father's decision to feature Jennifer Jackson as the first African-American model to appear in Playboy as a Playmate in 1965.\n\n\n== Activism ==\nFollowing her coming-out, Rau became more active campaigning for transgender rights. In 2016, she appeared on the TF1 news format Sept à Huit on an episode focused on her life.\n\n\n== References ==", "links": ["20 minutes (France)", "Alexis Bittar", "Assigned male at birth", "Balmain (fashion house)", "Caroline Cossey", "Cooper Hefner", "David Guetta", "ISSN (identifier)", "Ibiza", "Jennifer Jackson (model)", "Nicole Miller", "Paris", "Playboy", "Playboy Playmate", "Playmate", "Sept à Huit", "Sex reassignment surgery", "TF1", "The New York Times", "Trans woman", "Transgender", "Tyson Beckford", "VIAF (identifier)", "Vogue Italia"]}