{
    "url": "https://en.wikipedia.org/wiki/James_Doyle_(mayor)",
    "title": "James Doyle (mayor)",
    "summary": "James E. Doyle (August 23, 1938 – August 26, 2016) was an American educator, businessman, and politician. Doyle served as the Mayor of Pawtucket, Rhode Island, from 1997 until 2011, becoming the longest consecutive serving mayor in the city's history. Doyle also served in the Pawtucket city council from 1970 to 1997 by winning re-election to the council in thirteen elections. Doyle has been credited with shepherding the revitalization of Pawtucket, as well as the expansion of the city's arts scene, during his thirteen years as the mayor.",
    "content": "James E. Doyle (August 23, 1938 – August 26, 2016) was an American educator, businessman, and politician. Doyle served as the Mayor of Pawtucket, Rhode Island, from 1997 until 2011, becoming the longest consecutive serving mayor in the city's history. Doyle also served in the Pawtucket city council from 1970 to 1997 by winning re-election to the council in thirteen elections. Doyle has been credited with shepherding the revitalization of Pawtucket, as well as the expansion of the city's arts scene, during his thirteen years as the mayor.\n\n\n== Biography ==\nDoyle received a bachelor's degree in teaching from Providence College, a Catholic college in Rhode Island, in 1960. He then taught social studies at Pawtucket West High School (now called Shea High School) from 1960 to 1962. By 1997, the year he was elected mayor, Doyle was working as a salesman for an envelope company in nearby Massachusetts.During his tenure as the city's mayor, Doyle oversaw the creation of the Arts & Entertainment District, which comprises 307-acres, in 1999. Doyle hired Herb Weiss to oversee implementation of the new Arts and Culture initiative and participated in hiring Ann Galligan to create a strategic plan for the city's Arts and Cultural project. He also helped to create the annual Pawtucket Arts Festival, which also began in 1999. Additionally, Doyle was a strong proponent for the renovation and development of the city's numerous blighted, abandoned mill buildings, many of which had fallen into disuse by the 1990s, into new residences, beginning with the Riverfront Lofts on the waterfront. Other mills became the Bayley Lofts, Slater Cotton Mill, and The Lofts 125, which brought new residents and businesses to Pawtucket. In 2005, Doyle lobbied a California-based developer to convert a vacant, 650,000-square-foot mill building into the Hope Artiste Village, which is now home to more than 100 small businesses which employ more than 500 people, as of 2016.Doyle worked to revitalize Pawtucket in numerous other ways.  He reduced the number of blighted and abandoned houses.   The Pawtucket Water Supply Board began a system wide improvement project and the Doyle administration initiated plans for a commuter rail station.In 2004, the Arts & Business Council of Rhode Island awarded Mayor Doyle and the city with the Arts Advocacy Award. The Rhode Island Chamber of Commerce also presented Doyle with its Barbara C. Burlingame Award in 2004. Two years later, Doyle won the John H. Chafee Public Service Award from the Rhode Island Historical Preservation and Heritage Commission for his work to preserve and redevelop Pawtucket's mills in 2006.James Doyle died on August 26, 2016, at the age of 78.\n\n\n== References ==",
    "links": [
        "Alma mater",
        "City council",
        "Cotton mill",
        "Don Grebien",
        "Envelope",
        "Massachusetts",
        "Pawtucket, Rhode Island",
        "Pawtucket Arts Festival",
        "Pawtucket Times",
        "Providence College",
        "Providence Journal",
        "Rhode Island",
        "Rhode Island Historical Preservation and Heritage Commission",
        "Shea High School",
        "Small business",
        "Social studies",
        "Urban decay"
    ]
}