{"url": "https://en.wikipedia.org/wiki/James_Shapiro_(physician)", "title": "James Shapiro (physician)", "summary": "Dr. A. M. James Shapiro (born in Leeds, England) is a British-Canadian surgeon best known for leading the clinical team that developed the Edmonton Protocol – an islet transplant procedure for the treatment of type 1 diabetes.  Dr. Shapiro is Professor of Surgery, Medicine, and Surgical Oncology at the University of Alberta and the Director of the Clinical Islet Transplant Program and the Living Donor Liver Transplant Program with Alberta Health Services.", "content": "Dr. A. M. James Shapiro (born in Leeds, England) is a British-Canadian surgeon best known for leading the clinical team that developed the Edmonton Protocol – an islet transplant procedure for the treatment of type 1 diabetes.  Dr. Shapiro is Professor of Surgery, Medicine, and Surgical Oncology at the University of Alberta and the Director of the Clinical Islet Transplant Program and the Living Donor Liver Transplant Program with Alberta Health Services.\n\n\n== Career ==\nJames Shapiro obtained his medical degree from the University of Newcastle upon Tyne, and trained in surgery at the University of Bristol. After coming to Canada in 1993, he received training in liver transplantation and hepatobiliary surgery at the University of Alberta, and earned a PhD in Experimental Surgery.\nShapiro developed a brand new approach to optimize islet cell transplant engraftment that involved a radical departure from previous practice. Of almost 300 islet transplants attempted before 1999, fewer than 10% of these worked in patients. His protocol was designed to address many of the previous shortcomings by transplanting sufficient numbers of islets into the liver by using multiple donors, and by testing a novel antirejection strategy that avoided steroids and allowed the transplanted islets to work at their best. The result became known internationally as the ‘Edmonton Protocol.’\nShapiro led the clinical team that tested his approach in seven initial patients, all of whom (100%) were able to discontinue the need for insulin injections for periods beyond a year. He was the lead author in the landmark paper published in July, 2000 that described these results. Since then, he and his team have transplanted almost 300 Canadians and have continued to refine and optimize the protocol. This treatment has been replicated many times internationally, and over 2000 patients worldwide have now received islet transplants using the backbone of his protocol.\nA large ‘registration’ trial conducted in Canada and the USA reported its positive findings in 2016 in the Journal Diabetes Care.  Countries including England, Scotland, France, Switzerland, Australia, and Canada have approved and funded islet transplantation as part of ‘standard of care’ for patients with brittle, difficult-to-control, forms of Type 1 diabetes.\nSince the development of the Edmonton Protocol, he has led or co-led three major ongoing international multicentre clinical trials to further improve islet transplantation outcomes. He leads the Edmonton team, which is the largest islet transplantation team worldwide.\nShapiro also led the first-in-human stem cell transplant trials in Edmonton, Canada in 2014, and continues to refine stem cell transplantation approaches in patients. So far these studies are proving both promising and safe when tested in Canadians.\nIn his basic science laboratory, Professor Shapiro developed a new means to transplant cells beneath the skin by using a temporary tube to induce new blood vessels to grow. Before then, islet transplants beneath the skin failed universally, but this treatment is now known as the ‘Deviceless Technique’.In liver transplantation research, Shapiro and his team recently conducted two trials in Edmonton of a new machine designed to incubate and keep donated human livers alive outside the body before transplantation.  This technology is radically altering our ability to rescue damaged livers and provide safer livers for transplant. It is also allowing these transplants to happen during regular daylight hours. Professor Shapiro further led a cross-Canadian research team to test similar technologies in heart, lung, kidney and pancreas transplantations as part of the Canadian National Transplant Research Project.His busy research lab is currently working on more than 30 projects and 15 human clinical trials. One is an exciting immune reset trial. In this study, people newly diagnosed with type 1 diabetes are given a combination of targeted medications designed to reset their immune system and repair the pancreas.Besides maintaining an active immunology/transplant research laboratory, Dr. Shapiro has a busy clinical practice specializing in hepatobiliary and pancreatic surgery, surgical oncology, as well as transplant surgery, and was featured in an internationally acclaimed movie about organ transplantation called ‘Memento Mori.’ A shorter length version of this called ‘Vital Bonds’ was aired last year across Canada by the CBC’s David Suzuki’s 'The Nature of Things'. An edited version called ‘Transplanting Hope’ has been aired across the USA as part of PBS. This movie is helping to raise awareness about organ donation.\n\n\n== Professional achievements ==\nDr. Shapiro was awarded the prestigious Hunterian Professorship from the Royal College of Surgeons of England. He also served as the President of the International Pancreas and Islet Transplantation Association (IPITA), as well as serving as President of the Canadian Society of Transplantation.\nIn 2011, Dr. Shapiro was elected as a Fellow of the Royal Society of Canada.  In 2013, he was awarded a Tier 1 Canada Research Chair in Transplant Surgery and Regenerative Medicine and in 2015, he was inducted as a Fellow of the Canadian Academy of Health Sciences.He is a prolific author, having published over 350 medical journal articles, over 400 abstracts, and 28 medical book chapters, as well as being Co-Editor of a book on islet transplantation and beta cell replacement therapy.\n\n\n== Other acknowledgements ==\n1988\tAnthony Wood Memorial Prize (Clinical Oncology) – University of Newcastle on Tyne\n1995\tClinical Fellowship Award – Alberta Innovates Health Solutions\n2000\tOutstanding Leadership in Alberta Science Award for development and implementation of the Edmonton Protocol\n2000\tHunterian Medal Award and Professorship – Royal College of Surgeons of England\n2000 \tGold Medal in Surgery for 2000 – Royal College of Physicians and Surgeons of Canada\n2001\tSmart City Award – City of Edmonton\n2001\tSalute to Excellence Award of Distinction – City of Edmonton\n2001\tOutstanding Achievement Award – Canadian Diabetes Association\n2001 \tGovernor General’s Gold Medal Award – Government of Canada\n2002\tHighest Recognition Award – Spanish Diabetes Society\n2003\tMary Jane Kugel Award – Juvenile Diabetes Research Foundation\n2004\tEdmontonian of the Century – City of Edmonton\n2004\tInaugural Paul E. Lacy Medal for Outstanding Scientific Achievement\n2005\tMeritorious Service Medal – Government of Canada\n2005\tPhysicians of the Century Award – Alberta Medical Association\n2006\tMost Remarkable and Influential personalities from the past 10 years – Nature Biotechnology\n2014\tHonorary Doctorate Degree – University of Uppsala, Uppsala, Sweden\n2016\tDavid Rumbough Award – Juvenile Diabetes Research Foundation\n2018\tLifetime Achievement Award – Diabetes Canada\n\n\n== References ==", "links": ["Alberta Health Services", "American Society of Transplantation", "Canadian Academy of Health Sciences", "Doi (identifier)", "Edmonton Protocol", "James Shapiro (disambiguation)", "New England Journal of Medicine", "Newcastle University", "PMC (identifier)", "PMID (identifier)", "Royal Society of Canada", "S2CID (identifier)", "University of Alberta", "University of Bristol"]}