{
    "url": "https://en.wikipedia.org/wiki/James_Dean_(2001_film)",
    "title": "James Dean (2001 film)",
    "summary": "James Dean is a 2001 American made-for-television biographical drama film based on the life of the American actor James Dean. James Franco plays the title role under the direction of Mark Rydell, who chronicles Dean's rise from a struggling actor to an A-list movie star in 1950s Hollywood. The film's supporting roles included Michael Moriarty, Valentina Cervi, Enrico Colantoni, and Edward Herrmann.\nThe biopic began development at Warner Bros. in the early 1990s. At one point, Michael Mann was contracted to direct with Leonardo DiCaprio starring in the lead role. After Mann's departure, Des McAnuff, Dennis Hopper, and Milčo Mančevski were considered for the director's chair. Rydell was hired as director in 1996, but the film continued to languish in development hell.\nWarner Bros. then decided to produce James Dean as a TV movie for Turner Network Television (TNT); both Warners and TNT are owned by Time Warner. Franco was cast as Dean in May 2000 after a search that resulted in 500 auditions. Franco researched his role to closely portray Dean. James Dean was shown on TNT in the United States on August 5, 2001, receiving generally positive reviews from critics and widespread acclaim for Franco's performance.\n\n",
    "content": "James Dean is a 2001 American made-for-television biographical drama film based on the life of the American actor James Dean. James Franco plays the title role under the direction of Mark Rydell, who chronicles Dean's rise from a struggling actor to an A-list movie star in 1950s Hollywood. The film's supporting roles included Michael Moriarty, Valentina Cervi, Enrico Colantoni, and Edward Herrmann.\nThe biopic began development at Warner Bros. in the early 1990s. At one point, Michael Mann was contracted to direct with Leonardo DiCaprio starring in the lead role. After Mann's departure, Des McAnuff, Dennis Hopper, and Milčo Mančevski were considered for the director's chair. Rydell was hired as director in 1996, but the film continued to languish in development hell.\nWarner Bros. then decided to produce James Dean as a TV movie for Turner Network Television (TNT); both Warners and TNT are owned by Time Warner. Franco was cast as Dean in May 2000 after a search that resulted in 500 auditions. Franco researched his role to closely portray Dean. James Dean was shown on TNT in the United States on August 5, 2001, receiving generally positive reviews from critics and widespread acclaim for Franco's performance.\n\n\n== Plot ==\nAt eight years old, James Dean lives with his estranged father Winton and mother Mildred in 1939 Santa Monica, California. When Mildred dies of cancer in 1940, Winton sends James on a train to Fairmount, Indiana, along with the coffin containing her body. Winton does not show up at the funeral, leaving James to be raised by his aunt and uncle on a farm in Fairmount. Over the years, he becomes more curious about his father's decision to abandon him. He tries to impress him by sending him a package displaying his various athletic trophies in high school sports.\nJames moves back to Santa Monica in June 1949, shortly after high school graduation, and finds that Winton has remarried. He decides to become an actor and takes classes under James Whitmore. Whitmore is impressed by his acting ability, which encourages him to move to New York City in September 1951 to pursue an acting career. Despite being a struggling actor, he enjoys the new lifestyle. He befriends fellow actor Martin Landau and has a romantic relationship with Christine White. Both  are accepted into the prestigious Actors Studio. He receives critical acclaim in Broadway theatre productions and for a role in a television movie drama that is broadcast nationwide. He tries to tell Winton about his successful rise in acting, but his father still reacts with indifference, causing more emotional turmoil for him.\nFilm producer-director Elia Kazan hires James for the leading role in East of Eden (1955), marking his Hollywood debut. He moves to Hollywood in April 1954 to begin filming for Eden and is introduced to Jack L. Warner, the stern president of Warner Bros. Studios who is determined to transform him into a movie star. Warner becomes suspicious of his personal life (such as his possible bisexuality and passions for auto racing and motorcycling). On the Warner Bros. backlot, he falls in love with actress Pier Angeli, who is working on the neighboring production of The Silver Chalice (1954).\nDespite concerns from Pier's domineering mother, James and his girlfriend buy a beach house in which they live together. Meanwhile, eccentric director Nicholas Ray casts him in the lead role for Rebel Without a Cause (1955). He once again hopes to impress his father with his rising movie star career in Hollywood, but Winton persists with his indifference. When East of Eden debuts, Warner is furious that he does not show up at the premiere.  He considers shutting down production of Rebel Without a Cause, but he drops the idea due to James's praised performance in Eden. Later, he finds out that Warner sided with Pier's mother over his break up with her. She ends up marrying Vic Damone, while James then signs a one million dollar contract with Warner Bros. and is cast in Giant (1956). His mental breakdowns become more apparent when he starts conflicting with director George Stevens.\nAngered with his life, James decides to learn the truth about his father's disinterest toward him since he was eight years old. Winton tells him that his real father was a man with whom his mother had an affair during the marriage and that he did not have the courage to raise him, not being his real father. With his inner demons resolved, he begins to enjoy life once more and adopts a friendly relationship with director Stevens. Shortly afterward, he dies in a car crash that shocks the film industry and the general public. En route on a train to Indiana, Winton sits next to his coffin in the storage room, he would not leave him this time.\n\n\n== Cast ==\nJames Franco as James Dean: A movie star who has emotional struggles with his father, Hollywood policies, acting, and romantic relationships.\nKyle Chambers portrays young James Dean\nMichael Moriarty as Winton \"Winnie\" Dean: James' father who abandons him at a young age.\nValentina Cervi as Pier Angeli: Italian actress who James first meets on the Warner Bros. backlot. Under pressure from her domineering mother, Pier breaks off her relationship with James and marries Vic Damone.\nEnrico Colantoni as Elia Kazan: Acclaimed Hollywood film director. Kazan casts James in East of Eden, using unconventional directing techniques that land James critical praise.\nAmy Rydell as Christine White: James' girlfriend in New York. The two successfully audition their way into the Actors Studio.\nDirector Mark Rydell as Jack L. Warner: President of Warner Bros. Pictures. who signs James under contract. Mr. Warner acts as a strict father figure to James' Hollywood lifestyle.\nSamuel Gould as Martin Landau: Actor who befriends James in New York.\nWendy Benson as Julie Harris: East of Eden actress who expresses sympathy for James' break-up with Pier.\nDavid Parker as James Whitmore: James' acting teacher in Los Angeles.\nLisa Robins as Mildred Dean: James' mother. Mildred dies of cancer when her son is just a child.\nKaren Kondazian as Mrs. Pierangeli: Pier's strict religious mother who convinces her daughter to marry Vic Damone.\nBarry Primus as Nicholas Ray: Eccentric director of Rebel Without a Cause who avoids pressure to cast Marlon Brando in the lead role.\nPeggy McCay as Emma Dean: James Dean's grandma.\nEdward Herrmann as Raymond Massey: Distinguished actor who portrays Dean's screen father on East of Eden. Massey is dubious over James' method acting.\nCraig Barnett as George Stevens: Director of Giant who, at first, has trouble accommodating James' emotional and movie star status.\nJoanne Linville as Hedda Hopper: Hollywood gossip columnist who praises James' acting abilities in East of Eden.\nAndrew Prine as Rogers Brackett: Homosexual New York theater director who meets James and Martin Landau (then struggling actors) in a diner.\nLisa Blake Richards as Ethel Dean: Winton's wife after the death of Mildred. She is not satisfied over her husband's fathering of James.\nHolly Beavon as Marilyn Monroe (uncredited)\nElizabeth Karsell as Judy Garland (uncredited)\n\n\n== Production ==\nIn the early 1990s, Warner Bros. planned to produce a feature biographical film about actor James Dean, and the studio hired Israel Horovitz to write the script. One of the working titles was James Dean: An Invented Life before it was finalized as James Dean. When Horovitz wrote the script, he explored the \"psychological insight\" of Dean by showcasing the abandonment of his father, which became the fulcrum of the storyline. Horovitz recalled, \"Why would a father ship his wife's body back on a train with an 8-year-old son, never go to the funeral and never pick the son up again, never bring the son back out to him?\" The screenwriter felt it was best to portray Dean's purported homosexuality by innuendo rather than explicitly. He wanted to focus on the romance between Dean and Pier Angeli and Dean's growth as an actor, and believed that a homosexuality subplot would distract from the storyline. Producer Marvin Worth explained in July 1995, \"We'll try to make a good movie... not one of rumor and innuendo.\"\n\nMichael Mann was contracted to direct James Dean in September 1993, and filming was scheduled to start in May 1994. Johnny Depp and Brad Pitt were under serious consideration for the lead role, while both actors were also attached to the part. Mann approached Leonardo DiCaprio for the role of James Dean, feeling that DiCaprio was the best candidate. Gary Oldman was also discussed for a supporting role. In March 1994, Mann decided not to direct James Dean due to scheduling conflicts with Heat (1995). Mann also thought that DiCaprio was too young and wanted to wait another year.Des McAnuff replaced Mann as director, and filming was rescheduled to December 1994. Screenwriter Horovitz was busy playwrighting in Europe, so McAnuff and producer Marvin Worth were constantly rewriting the script in July 1994. The budget was estimated at $20 million. McAnuff stepped down as director and was replaced by Dennis Hopper. Hopper was a close friend with Dean and co-starred with the actor in both Rebel Without a Cause and Giant. Hopper met with DiCaprio for the lead role, but the director eventually dropped out of the film. By May 1995, DiCaprio was still the top candidate to portray Dean with Milčo Mančevski in discussions to direct the film.After negotiations with Mančevski fell through, Mark Rydell was contracted to direct the biopic in February 1996. Rydell was also close friends with Dean; the two studied together at Actors Studio in Manhattan, New York during the early 1950s. DiCaprio dropped out of the lead role entirely when his asking price was determined to be too high after the actor's success with Romeo + Juliet (1996) and Titanic (1997). Meanwhile, Rydell worked with Horovitz on another rewrite, and Warner Bros. planned to fast track production. Don Was was hired to write and compose the film score, but he was later replaced by John Frizzell. Shortly after Rydell's hiring, Stephen Dorff entered discussions to portray James Dean. Ethan Hawke would later turn down the role.With the film languishing in development hell, producer Bill Gerber from Warner Bros. decided James Dean would work best as a television movie for Turner Network Television (TNT); both Warners and TNT are owned by Time Warner. Gerber explained the format choice, \"It was just hard to find bankable names that the studio would finance a $20 million movie with. And there were marketing problems. He died in a highway accident in 1955 so almost everyone would know the outcome of the movie. James Dean also isn't that well known by the general movie-going public these days.\" Actor James Franco was cast into the lead role, and principal photography for James Dean started in June 2000. Filming took place around the Los Angeles area and at the Sony Pictures Studios in Culver City.\n\n\n=== Casting ===\nRydell and other filmmakers started a casting call in late March 2000 to find the most suitable actor for the lead role. The call encompassed New York, Los Angeles, Toronto, Vancouver, Atlanta, Chicago and the Midwestern United States. Casting director Nancy Foy commented that the search included \"everyone from highly-trained, experienced actors in their early and mid-20s, to people who had no training and had sent in self-made tapes\". Five hundred actors auditioned, and James Franco was ultimately cast as James Dean in May 2000. Franco acknowledged he was cautious of taking the role over fear of typecasting.Franco did extensive research for his role. He went from being a non-smoker to smoking two packs of cigarettes a day, but has since quit the habit. He learned how to ride a motorcycle, play guitar, as well as the conga and bongo drums. The actor also carefully studied Dean's mannerisms by watching his three films (East of Eden, Rebel Without a Cause and Giant). Franco also read numerous biographies on Dean's life. The actor also took advice from some of Dean's closest friends, including Martin Landau, Dennis Hopper, Liz Sheridan (Dean's former girlfriend) and Leonard Rosenman. \"Martin was the most informative person that I spoke to. He helped me tremendously with James's physical mannerisms,\" Franco reflected. \"I isolated myself a lot during the filming. I did this because I think he had a pervasive loneliness throughout his life and I wanted to feel what that felt like. Not talking to my family or loved ones had quite an emotional effect on me.\"\n\n\n== Release ==\nJames Dean premiered at the 27th Deauville American Film Festival in July 2001.  Press conferences were held with the screening, and James Dean's three feature films, East of Eden, Rebel Without a Cause and Giant, were also screened at the festival. Turner Network Television (TNT) originally intended to premiere the film on United States national television in June 2001, but the release date for James Dean was pushed to August 5, 2001. The film attracted 3.18 million viewers and received generally favorable reviews from critics. James Dean was released on DVD in January 2002 by Warner Home Video. David Thomson, reviewing in The New York Times, felt Franco's performance as Dean gave Baby Boomer audiences a positive sense of nostalgia of the 1950s. James Poniewozik of Time magazine also highly praised Franco's performance, but felt the script was overtly cliché. Ken Tucker wrote in Entertainment Weekly that James Dean, alongside Life with Judy Garland: Me and My Shadows (2001), was a revolutionary force in the television movie genre.Rydell received a Directors Guild of America Award nomination, while Franco was nominated for his performance at the 8th Screen Actors Guild Awards. In addition, Franco won the Golden Globe Award for Best Actor in a Miniseries or Television Film. The film also received multiple awards and nominations at the 54th Primetime Emmy Awards. Michael Moriarty won the Award for Outstanding Supporting Actor in a Miniseries or Movie for his portrayal of Winton Dean. The art department (led by Robert Pearson, Marc Dabe and Leslie McCarthy-Frankenheimer), also won an Emmy. Nominations included Outstanding Made for Television Movie, Lead actor (James Franco), Direction (Mark Rydell), Cinematography (Robbie Greenberg), Casting (Nancy Foy), Costume design (Yvonne Blake and Randy Gardell), Film editing (Antony Gibbs), Makeup (John M. Elliot, Jr.) and Hairstyling (Carol A. O'Connell).\n\n\n== Home Video ==\nThe film was released on DVD and VHS on January 22, 2002 by Warner Home Video. It featured Theatrical trailers of Rebel Without a Cause and Giant, English, French, Spanish subtitles and Dolby Digital 5.1 Audio.\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nJames Dean at IMDb",
    "links": [
        "54th Primetime Emmy Awards",
        "8th Screen Actors Guild Awards",
        "A-list",
        "Academy of Television Arts & Sciences",
        "Actors Studio",
        "Amazon.com",
        "Andrew Prine",
        "Antony Gibbs",
        "Army Archerd",
        "Art department",
        "Asking price",
        "Baby Boomer",
        "Backlot",
        "Barry Primus",
        "Bill Gerber",
        "Biographical film",
        "Bisexuality",
        "Bongo drum",
        "Brad Pitt",
        "Christine White (actress)",
        "Cinderella Liberty",
        "Cliché",
        "Conga",
        "Costume design",
        "Crime of the Century (1996 film)",
        "Culver City, California",
        "David Thomson (film critic)",
        "Death of James Dean",
        "Deauville American Film Festival",
        "Dennis Hopper",
        "Des McAnuff",
        "Development hell",
        "Directors Guild of America Award",
        "Don Was",
        "Drama (film and television)",
        "East of Eden (film)",
        "Edward Herrmann",
        "Elia Kazan",
        "Enrico Colantoni",
        "Entertainment Weekly",
        "Ethan Hawke",
        "Even Money (film)",
        "Fairmount, Indiana",
        "Father figure",
        "Film score",
        "For the Boys",
        "Gary Oldman",
        "George Stevens",
        "George W. Perkins (television producer)",
        "Giant (1956 film)",
        "Golden Globe Award for Best Actor - Miniseries or Television Film",
        "Gossip columnist",
        "Harry and Walter Go to New York",
        "Heat (1995 film)",
        "Hedda Hopper",
        "Hollywood Foreign Press Association",
        "IMDb",
        "Intersection (1994 film)",
        "Israel Horovitz",
        "Jack L. Warner",
        "James Dean",
        "James Franco",
        "James Whitmore",
        "Joanne Linville",
        "John Frizzell",
        "John Frizzell (composer)",
        "Johnny Depp",
        "Judy Garland",
        "Julie Harris (actress)",
        "Karen Kondazian",
        "Leonard Rosenman",
        "Leonardo DiCaprio",
        "Life with Judy Garland: Me and My Shadows",
        "Liz Sheridan",
        "Marilyn Monroe",
        "Mark Rydell",
        "Marlon Brando",
        "Martin Landau",
        "Marvin Worth",
        "Michael Mann",
        "Michael Mann (director)",
        "Michael Moriarty",
        "Milčo Mančevski",
        "Nicholas Ray",
        "Nostalgia",
        "On Golden Pond (1981 film)",
        "Peggy McCay",
        "Pier Angeli",
        "Primetime Emmy Award for Outstanding Casting - Miniseries, Movie, or a Special",
        "Primetime Emmy Award for Outstanding Directing for a Miniseries, Movie or Dramatic Special",
        "Primetime Emmy Award for Outstanding Lead Actor - Miniseries or a Movie",
        "Primetime Emmy Award for Outstanding Made for Television Movie",
        "Primetime Emmy Award for Outstanding Supporting Actor - Miniseries or a Movie",
        "Principal photography",
        "Raymond Massey",
        "Rebel Without a Cause",
        "Robbie Greenberg",
        "Romeo + Juliet",
        "Santa Monica, California",
        "Sony Pictures Studios",
        "Stephen Dorff",
        "TNT (American TV network)",
        "TNT (U.S. TV network)",
        "Television film",
        "The Atlanta Journal-Constitution",
        "The Cowboys",
        "The Fox (1967 film)",
        "The New York Times",
        "The Reivers (film)",
        "The River (1984 film)",
        "The Rose (film)",
        "The Silver Chalice (film)",
        "Time (magazine)",
        "Time Warner",
        "Titanic (1997 film)",
        "Typecasting (acting)",
        "USA Today",
        "Valentina Cervi",
        "Variety (magazine)",
        "Vic Damone",
        "Warner Bros.",
        "Warner Bros. Television Studios",
        "Warner Home Video",
        "Wendy Benson",
        "Working title"
    ]
}