{"url": "https://en.wikipedia.org/wiki/Janet_Lever", "title": "Janet Lever", "summary": "Janet Lever (born December 5, 1946) is an American sociologist and professor emerita of sociology at California State University, Los Angeles. She is recognized for her research on sex, intimate relationships, gender, and sport.", "content": "Janet Lever (born December 5, 1946) is an American sociologist and professor emerita of sociology at California State University, Los Angeles. She is recognized for her research on sex, intimate relationships, gender, and sport.\n\n\n== Education ==\nLever earned her BA summa cum laude from Washington University in her native St. Louis (1968) and her Ph.D. in sociology from Yale University (1974). While in graduate school, she coauthored with Pepper Schwartz the 1971 book Women at Yale, documenting the historic first year of undergraduate coeducation at that university.\n\n\n== Career and research ==\nBefore joining the CSULA faculty in 1990, she taught sociology at Yale, Northwestern, UCLA, and UCSD, and completed a post-doctoral program in health policy at RAND.\nLever and Schwartz had several other collaborations, most notably coauthoring Glamour magazine's \"Sex and Health\" column for nearly all the 1990s, and then drawing on that advice to publish the 1998 Putnam book The Great Sex Weekend: A 48-hour Guide to Rekindling Sparks for Bold, Busy, or Bored Lovers.. The 2015 Frommer’s Places for Passion is their most recent joint production.Lever’s most notable solo-authored academic achievements include 1970’s articles on sex differences in children’s play. This research was invited to appear in Feminist Foundations: Toward Transforming Sociology because the editors believed the articles exemplified some of the “strongest feminist scholarship” in the discipline.  Referring to the articles, scholar Toni Calasanti reflected: “It is a tribute to the creativity and clarity of the arguments made: To transcend these works required the solid foundations they erected so that we could move ahead and not retrace our steps.\"Lever's 1983 University of Chicago Press book Soccer Madness was published in English, Spanish, Portuguese and Japanese.  Waveland Press kept the book in production through 2017. University of Chicago Press endorsements included James F. Short, Jr., then president of the American Sociological Review, who said, “By addressing the most fundamental of problems addressed by the social sciences, [Soccer Madness] elevates sociology of sport to a subdiscipline of the highest importance,” while endorser Ian Taylor noted, “Lever’s interest in Brazilian soccer and her friendship with Pelé should become one of the folk tales of the sociology of sport.” The review in Scientific American concluded: \"Lever has given the reader a small book as well written as it is thoughtful: the role of sport in human society is deserving more study, and this account is a happy example painted in the bright colors and sharp contrasts of Brazilian Life.\"Being a pioneer in the emerging fields of gender studies and sociology of sport won her the unanimous support of her colleagues in sociology in her bid for tenure at Northwestern, but was less appreciated by senior faculty in the physical sciences. She was denied tenure by a single vote by the university promotions committee after a review that had several deviations from routine. In 1981, Lever sued Northwestern University for sex discrimination in violation of Title VII of the Civil Rights Act of 1964. The case was dismissed on a timing technicality in 1992 without any hearing on the merits. Labor lawyer and Yale scholar Julius Getman devoted eight pages to “The Case of Janet Lever” in his book subtitled The Struggle for the Soul of Higher Education and concluded that the denial of tenure to Lever was “a loss to the students she might have taught, and a loss to the world of scholarship.\" Federal Judge Nancy Gertner, in her book In Defense of Women: Memoirs of an Unrepentant Advocate, described the twofold challenges of Lever v. Northwestern: (1) the difficulty of proving a case based on disparate treatment and (2) the astronomical cost of litigation.In addition to fundraising in the academic community, Lever supplemented paying for her legal fees in the protracted battle by cohosting “Women on Sex,” an all-female (crew and audience, as well as cast) advice show on the new Playboy Channel; episodes ran from 1983 through 1988. Lever came to the attention of Hugh Hefner when she was the senior advisor on the 1982 Playboy Readers Sex Survey, the largest magazine study of the era.Lever’s work on the Playboy survey led to her interest in HIV/AIDS research, and she participated in large team projects at the RAND Corporation, most notably the first study on how to safely lift the ban against gays in the military and later an ambitious representative survey of 1000 street prostitutes in LA County. As a bridge between the research community and society at large, Lever spearheaded ten new surveys, funded by ELLE magazine, that were posted on the popular website NBCNews.com (msnbc.com at the time) between 2002–2010, some attracting more than 70,000 volunteer respondents. The Office Sex and Romance Survey (2002) and Work and Power Survey (2007) are among the largest surveys on these workplace topics; the other surveys focused on issues related to body image, intimate relationships, sexual behaviors, and sexual satisfaction. Each of her teams’ internet surveys has been reanalyzed for social science, management, health, and medical audiences, two of their articles won awards (see publication notations).\n\n\n== Selected works ==\nLever, J. “Soccer:  Opium of the Brazilian People,” Trans-action, 7: 36–43 (December, 1969).\nLever, J. and Goodman, L.W. “Toys and Socialization to Sex Roles,” Ms., December, 1972.\nLever, J. and Wheeler, S. (December 1984) “The Sports Page:  1900–1975,” with Stanton Wheeler, Sociology of Sport Journal. (Lead Article)\nLever, J. “Condoms and Collegians,”  Playboy, September, 1988.\nLever, J. “College Women Talk About Campus Sex,” Playboy, October, 1989.\nLever, J, Kanouse, D.E., Rogers, W.H., Carson, S, and Hertz, R. \"Behavior Patterns and Sexual Identity of Bisexual Males,\" Journal of Sex Research, (Lead Article, May, 1992).\nLever, J. \"The 1994 Advocate Survey of Sexuality and Relationships: The Men,\" Issue 661/662, The Advocate,  August 23, 1994, pp. 16–24.\nLever, J. \"The 1995 Advocate Survey of Sexuality and Relationships: The Women,\" The Advocate, Issue 687/688. August 22, 1995, pp. 22–30.\nLever, J., Zellman, G., and Hirschfeld, S.J. “The Truth About Sex in the Office: You Can’t Stamp Out Workplace Romance, so Here’s How to Handle It Better” (March/April 2006) Across the Board, (the magazine for The Conference Board) Cover Story.\nLever, J., Frederick, D. A., Laird, K., Sadeghi-Azar, L. (2007).  Tall women’s satisfaction with their height: General population data challenge assumptions behind medical interventions to stunt girls’ growth.  Journal of Adolescent Health, 40, 192–194.\nElsesser, K.M. and J Lever (2011) Does gender bias against female leaders persist? Quantitative and qualitative data from a large-scale survey? Human Relations 64: 1555-1578 (second place HR Paper of the Year Award).\nGillespie, B.J., Lever, J., Frederick, D.A., and Royce. T. (2014) \"Close Adult Friendships, Gender, and the Life Cycle.\" Journal of Social and Personal Relationships. doi: 10.1177/0265407514546977\nLever, J. “Making Friends with Pelé,” London’s Financial Times Magazine (World Cup Special Edition) June 7/8, 2014, p. 25.\nLever, J., Frederick, D. A., & Hertz, R. Paying for dates: Following versus challenging gender norms. SAGE Open. Oct-Dec. 2015: 1-14   DOI: 10.1177/2158244015613107\nFrederick, D.A.  Lever, J., Gillespie, B.J. & Garcia, J.R. (2017) What Keeps Passion Alive? Journal of Sex Research, 54:2, 186–201, DOI: 10.1080/00224499.2015.1137854 (winner of JSR’s 2017 Hugo Beigel Award for research excellence in sexual science).\nLever, J. “From Here to Eternity” Los Angeles Magazine, February 2018, pp. 64–66. https://www.lamag.com/culturefiles/got-dream-plot-hollywood-forever-cemetery-almost/\n\n\n== References ==", "links": ["California State University, Los Angeles", "ELLE magazine", "Frommer’s", "Gays in the military", "Glamour (magazine)", "HIV/AIDS research", "Hugh Hefner", "ISBN (identifier)", "ISNI (identifier)", "NBCNews.com", "Northwestern University", "Pelé", "Pepper Schwartz", "Playboy", "Playboy Channel", "Putnam Publishing", "RAND", "RAND Corporation", "SUDOC (identifier)", "Title VII of the Civil Rights Act of 1964", "UCLA", "UCSD", "University of Chicago Press", "VIAF (identifier)", "Washington University", "Yale", "Yale University"]}