{
    "url": "https://en.wikipedia.org/wiki/Jeff_Newman_(musician)",
    "title": "Jeff Newman (musician)",
    "summary": "Jeff Newman (January 7, 1942 – April 7, 2004) was an American country musician who played the pedal steel guitar. He was a veteran Nashville session player. Together with his wife, Fran, he operated the Jeffran College of Pedal Steel Guitar outside Nashville for many years. His \"Top Gun\" boot camp (one on one instruction for five days) was an exceptional learning experience. His instructional material remains available through Steel Guitars Canada and popular as of 2017. Newman was inducted into the International Steel Guitar Hall of Fame in 1999.",
    "content": "Jeff Newman (January 7, 1942 – April 7, 2004) was an American country musician who played the pedal steel guitar. He was a veteran Nashville session player. Together with his wife, Fran, he operated the Jeffran College of Pedal Steel Guitar outside Nashville for many years. His \"Top Gun\" boot camp (one on one instruction for five days) was an exceptional learning experience. His instructional material remains available through Steel Guitars Canada and popular as of 2017. Newman was inducted into the International Steel Guitar Hall of Fame in 1999.\n\n\n== Career ==\nHe started a school for steel guitar players in Nashville Tennessee which carried his name. Newman said that The Jeffran College of Pedal Steel Guitar was the only school of its kind in the world.Newman appeared on the cover of Steel Guitarist Magazine #3 in September 1979. The magazine called Newman, \"Steel's Foremost Instructor\".\n\n\n== Death ==\nNewman was an airplane pilot, and he died on April 7, 2004 while trying to land an aircraft in Watertown, Tennessee. While he was attempting to land the plane it began spiraling and he lost control. He was the only person on the plane. Newman had a commercial pilot license and was piloting his Ultralight aircraft.\n\n\n== Discography ==\nMusic to Get C6th By; pedal steel instructional record, Jeffran Music, 1969\nSteelin Feelin; pedal steel instructional record and book, Jeffran Music, 1970?\nSlidin' Smoke (with dobro player Mike Auldridge), Rounder Records, 1978 [1]\nMusic To Steel By; pedal steel instructional record and book, Jeffran Music, 1969\n\n\n== References ==\n\n\n== External links ==\nJeffran College, Newman's instructional website\nSteel Guitars Canada, Jeff's Instructional Material\nVideo Jeff Newman - Right Hand Alpha course sample",
    "links": [
        "Country music",
        "Mike Auldridge",
        "Pedal steel guitar",
        "Rounder Records",
        "Steel Guitar Hall of Fame",
        "Tennessee",
        "Ultralight aircraft (United States)"
    ]
}