{
    "url": "https://en.wikipedia.org/wiki/Jehoram_of_Israel",
    "title": "Jehoram of Israel",
    "summary": "Jehoram (Hebrew: יְהוֹרָם Yəhōrām; also Joram) was the ninth king of the northern Kingdom of Israel (2 Kings 8:16, 2 Kings 8:25–28). He was the son of Ahab and Jezebel, and brother to Ahaziah and Athaliah.\nAccording to 2 Kings, 2 Kings 8:16, in the fifth year of Jehoram of Israel, (another) Jehoram became king of Judah. The author of Kings speaks of both Jehoram of Israel and Jehoram of Judah in the same passage.",
    "content": "Jehoram (Hebrew: יְהוֹרָם Yəhōrām; also Joram) was the ninth king of the northern Kingdom of Israel (2 Kings 8:16, 2 Kings 8:25–28). He was the son of Ahab and Jezebel, and brother to Ahaziah and Athaliah.\nAccording to 2 Kings, 2 Kings 8:16, in the fifth year of Jehoram of Israel, (another) Jehoram became king of Judah. The author of Kings speaks of both Jehoram of Israel and Jehoram of Judah in the same passage.\n\n\n== Reign ==\nJehoram began to reign in Israel in the 18th year of Jehoshaphat of Judah and ruled 12 years (2 Kings 3:1). William F. Albright dated his reign to 849–842 BCE, whereas E. R. Thiele proposed  852–841 BCE.Unlike his predecessors, Jehoram did not worship Ba'al, and he removed the pillar of Baal, probably a special pillar which Ahab had erected near his palace at Jezreel for his own and Jezebel's worship. However, the writer of 2 Kings says that he still \"followed in the ways of Jeroboam, son of Nebat, who led the Israelites to sin\". With Jehoshaphat of Judah, Jehoram attacked Mesha, King of the Moabites. In the war between Aram-Damascus and Israel, Elisha befriended Joram, revealing to him the plans of the enemy. Subsequently, when Ben-hadad besieged Samaria, reducing the city almost to starvation and cannibalism, Jehoram sought to behead the prophet. The latter, however, foretold that a period of plenty was imminent; the siege was soon lifted, the city's food supplies were replenished, and the old relation between the king and the prophet was restored.When Hazael, king of the Arameans, violently revolted in Damascus, as Elisha had predicted (2 Kings 8:12), Jehoram made an alliance with his nephew Ahaziah, King of Judah. The two kings set forth to take Ramoth-gilead from Aram. The battle failed; Jehoram was wounded in the fighting, and he withdrew to Jezreel to recover. It is likely that his defeat at Ramoth-Gilead was a disaster. As a result, while Jehoram was recuperating at Jezreel, his general, Jehu, incited a revolt. Jehu executed Jehoram by shooting him in the back with an arrow and had his body thrown into the field of Naboth the Jezreelite, as punishment for his parent's sin in illegally stealing Naboth's land. With the death of Jehoram and his other family members, the Ahab Dynasty came to an end. Jehu claimed the throne of Israel as his own.\n\n\n== Archeology ==\nThe author of the Tel Dan Stele claimed to have slain both Ahaziah and Jehoram. Hazael is the most likely to have written it.\n\n\n== References ==",
    "links": [
        "2 Kings 3:1",
        "2 Kings 8",
        "2 Kings 8:16",
        "Abijah of Judah",
        "Ahab",
        "Ahaz",
        "Ahaziah of Israel",
        "Ahaziah of Judah",
        "Alexander Jannaeus",
        "Amaziah of Judah",
        "Amon of Judah",
        "Antigonus II Mattathias",
        "Aram-Damascus",
        "Aristobulus I",
        "Aristobulus II",
        "Asa of Judah",
        "Athaliah",
        "Ba'al",
        "Baasha of Israel",
        "Books of Kings",
        "Cannibalism",
        "David",
        "Davidic line",
        "E. R. Thiele",
        "Elah (king)",
        "Elisha",
        "Guillaume Rouillé",
        "Hasmonean dynasty",
        "Hazael",
        "Hebrew language",
        "Hezekiah",
        "History of ancient Israel and Judah",
        "Hoshea",
        "Hyrcanus II",
        "ISBN (identifier)",
        "Ish-bosheth",
        "Jeconiah",
        "Jehoahaz of Israel",
        "Jehoahaz of Judah",
        "Jehoash of Israel",
        "Jehoash of Judah",
        "Jehoiakim",
        "Jehoram of Judah",
        "Jehoshaphat",
        "Jehu",
        "Jeroboam",
        "Jeroboam II",
        "Jewish leadership",
        "Jezebel (Bible)",
        "Jezreel (city)",
        "John Hyrcanus",
        "Josiah",
        "Jotham",
        "King of Judah",
        "Kingdom of Israel (Samaria)",
        "Kingdom of Israel (united monarchy)",
        "Kingdom of Judah",
        "Kings of Israel and Judah",
        "Kings of Judah",
        "List of Jewish leaders in the Land of Israel",
        "Maccabees",
        "Manasseh of Judah",
        "Menahem",
        "Mesha",
        "Naboth",
        "Nadab of Israel",
        "Omri",
        "Omrides",
        "Pekah",
        "Pekahiah",
        "Promptuarii Iconum Insigniorum",
        "Ramoth-gilead",
        "Rehoboam",
        "Salome Alexandra",
        "Saul",
        "Shallum of Israel",
        "Simon Thassi",
        "Solomon",
        "Tel Dan Stele",
        "The Mysterious Numbers of the Hebrew Kings",
        "Tibni",
        "Uzziah",
        "VIAF (identifier)",
        "William F. Albright",
        "Zechariah of Israel",
        "Zedekiah",
        "Zimri (king)"
    ]
}