{"url": "https://en.wikipedia.org/wiki/Jess_Stearn", "title": "Jess Stearn", "summary": "Jess Stearn (April 26, 1914 – March 27, 2002) was an American journalist and author of more than thirty books, nine of which were bestsellers.", "content": "Jess Stearn (April 26, 1914 – March 27, 2002) was an American journalist and author of more than thirty books, nine of which were bestsellers.\n\n\n== Early life ==\nStearn was born in Syracuse, New York to David Stearn, a rabbi. He graduated from Syracuse University.\n\n\n== Career ==\nStearn became a journalist for the New York Daily News and later an associate editor for Newsweek. He credited his journalistic training with helping him become a successful author.Stearn specialized in books of sensationalist speculative non-fiction. His early work focused on outsiders and marginalized individuals such as prostitutes, drug addicts, and gay men (The Sixth Man). His later work focused on spirituality, the occult, and psychic phenomena. His most popular works were two biographies on the American psychic Edgar Cayce; Stearn was a conference speaker for the Association for Research and Enlightenment and a proponent of Cayce's theories.Stearn might have been one of the forerunners of bringing Eastern thought into the Western world through his best-selling 1965 book, Yoga, Youth and Reincarnation.\n\n\n== Personal life ==\nStearn married twice and had two children, Martha and Fred. He had a longtime close friendship with actress and radio/television personality Arlene Francis. That may have had a connection to the first mention of his name in a nationally syndicated newspaper column. A reference to his latest book appeared in the Voice of Broadway column written by Francis' television colleague Dorothy Kilgallen.  Either Kilgallen or her editor at the New York Journal American placed a plug for Yoga, Youth and Reincarnation in that paper's September 15, 1965 edition immediately after an item about an upcoming Johnnie Ray concert in Las Vegas. Ten years later, Francis discussed one of her recurring dreams with Stearn for a book he was writing that included a section on dreams.  Stearn and Francis shared interests in yoga and weightlifting.\n\n\n== Death ==\nStearn died of congestive heart failure on March 27, 2002 in his Malibu, California home. He chose not to have a funeral because of his belief in reincarnation.\n\n\n== Bibliography ==\n— (1954). Sisters of the Night: The Startling Story of Prostitution in New York Today.\n— (1959). The Wasted Years: Drug & Delinquent Stories.\n— (1961). The Sixth Man: A Startling Investigation of the Spread of Homosexuality in America.\n— (1963). The Door to the Future: Can the Future be Foreseen?.\n— (1964). The Grapevine: A Report on the Secret World of the Lesbian.\n— (1965). Yoga, Youth and Reincarnation.\n— (1967). Edgar Cayce: The Sleeping Prophet.\n— (1968). The Search for the Girl with the Blue Eyes: A Venture Into Reincarnation.\n— (1969). Adventures into the Psychic.\n— (1969). The Second Life of Susan Ganther: Startling Story of Reincarnation.\n— (1972). The Seekers: Drugs and the New Generation.\n— (1972). A Time for Astrology.\n— (1972). The Miracle Workers; America's Psychic Consultants.\n— (1973). Dr Thompson's New Way for You to Cure Your Aching Back.\n— (1973). The Search for a Soul: Taylor Caldwell's Psychic Lives.\n— (1975). A Prophet in his Own Country: The Story of the Young Edgar Cayce.\n—; Caldwell, Taylor (1975). Romance of Atlantis.\n— (1976). A Matter of Immortality: Dramatic Evidence of Survival.\n— (1976). The Power of Alpha-Thinking: Miracle of the Mind.\n—; Caldwell, Taylor (1977). I, Judas.\n— (1979). The Reporter.\n—; Geller, Larry (1980). The Truth About Elvis.\n— (1981). In Search of Taylor Caldwell.\n— (1984). Soulmates: Perfect Partners Past, Present, and Beyond.\n— (1989). Intimates Through Time: Edgar Cayce's Mysteries Of Reincarnation.\n— (1997). Meetings: A Reporter's Notebook: Provocative Interviews that Capture the Spirit of Our Times.\n—; McGarey, Gladys (1998). The Physician Within You: Discovering the Power of Inner Healing.\n— (1998). Edgar Cayce on the Millennium.\n\n\n== References ==", "links": ["Arlene Francis", "Association for Research and Enlightenment", "Congestive heart failure", "Dorothy Kilgallen", "Dreams", "Drug addicts", "Edgar Cayce", "ISBN (identifier)", "ISNI (identifier)", "Johnnie Ray", "Los Angeles Times", "Malibu, California", "Marginalized", "Memphis Mafia", "New York Daily News", "New York Journal American", "New York Times", "Newsweek", "Olympic weightlifting", "Psychic phenomenon", "Rabbi", "Reincarnation", "Sensationalist", "Spirituality", "Syracuse, New York", "Syracuse University", "Taylor Caldwell", "The occult", "VIAF (identifier)"]}