{
    "url": "https://en.wikipedia.org/wiki/Jibou",
    "title": "Jibou",
    "summary": "Jibou (Romanian: [ʒiˈbow] (listen); Hungarian: Zsibó [ˈʒiboː]; German: Siben; Yiddish: זשיבוי) is a town in Sălaj County, Transylvania, Romania. In 2011 it had a population of 10,407. Jibou includes the town proper and other four villages: Rona (Hungarian: Szilágyróna), Cuceu (Kucsó), Husia (Hosszúújfalu) and Var (Szamosőrmező).\nJibou is 25 km northeast of the county seat Zalău; the two are linked by national road DN1H and county road DJ108A, as well as by railroad. Its major attractions are the old Wesselényi Castle, Vasile Fati Botanical Garden and the thermal baths.",
    "content": "Jibou (Romanian: [ʒiˈbow] (listen); Hungarian: Zsibó [ˈʒiboː]; German: Siben; Yiddish: זשיבוי) is a town in Sălaj County, Transylvania, Romania. In 2011 it had a population of 10,407. Jibou includes the town proper and other four villages: Rona (Hungarian: Szilágyróna), Cuceu (Kucsó), Husia (Hosszúújfalu) and Var (Szamosőrmező).\nJibou is 25 km northeast of the county seat Zalău; the two are linked by national road DN1H and county road DJ108A, as well as by railroad. Its major attractions are the old Wesselényi Castle, Vasile Fati Botanical Garden and the thermal baths.\n\n\n== Geography ==\nJibou is located in the northeastern part of Sălaj County, on the left bank of Someș River, at its confluence with the Agrij River. It is crossed by the 47°16′N parallel and the 23°15′E meridian.\n\n\n== History ==\n\nThe city is located in a Daco-Roman area and developed early as a rural settlement. The first documentary attestation of Jibou dates to 1205, under the name Chybur. Among the many names Jibou bore are the titles villa (town) in 1219 and oppidum (fortified town) in 1564, which attest the importance of the locality at the time. Jibou is likely older than its first documentary attestation, given that the Roman road connecting the castra of Tihău with that of Porolissum passed through its boundary. The other component localities were noted a little later: Rona in 1338, Cuceu in 1388, Husia in 1405 and Var in 1469. The development of Jibou continued in medieval times, but suffered from Turkish invasions such as those in 1610 and 1665.Jibou is well known for his participation in the Kurucz rebellion (1703–1711) (see Battle of Zsibó) taken against Habsburg rule. The Wesselényi family played an important role in the evolution of Jibou, which built a castle there in 1584; today, only traces of the foundation are preserved. The construction of the current castle, the largest baroque complex in Transylvania, began in 1778 and lasted more than 30 years. The most prominent representative of this family was Baron Miklós Wesselényi Jr., who lived between 1796 and 1850. He fought for the liberation of the serfs, being considered the leader of the reformist Hungarian nobility opposition, which struggled against the conservatism of Habsburg monarchy.\n\nIn 1781, his father, Miklós Wesselényi Sr., conflicts with aulic chancellor Johan Haller, his neighbor from Gârbou. On 16 October 1781, with an army of 540 people, armed \"some with rifles, most with scythes, iron pitchforks, cudgels\" and 12 outlaws (Romanian: haiduci), Miklós Wesselényi appears at Gârbou, taking Haller by surprise, who did not expect such a gesture. As a result of this conflict, Haller sends Wesselényi to trial for six counts: \"blasphemy, crooked oath, fire implementing threat, challenge to a duel, infestation and arrest of royal officials, disturbing public security\". The process is settled only after three years, when the very Emperor Joseph II, son of Maria Theresa, condemns Wesselényi to several years of prison at Kufstein.The last forty-eighter revolutionary army in Europe, made up of about 8,000 soldiers commanded by General Kazinczy, capitulated at the castle on 25 August 1849.\nFrom 1876 to 1920, Jibou was part of the Szilágy County of the Kingdom of Hungary.\nInauguration of Dej–Jibou–Zalău railway in 1890, and over several years to Baia Mare, made Jibou to become an important railway center. Through the development of industries and construction of railway the number of employees and workers increased. Nevertheless, agriculture remained main branch of the economy, especially after the introduction of alternative crops and the use of agricultural machines. To the end of 19th century in Jibou established many Jewish families, which made to increase the role of exchange of the locality. The main occupation of the Jews was trade; they opened a number of stores.\n\nDocuments of the time attested that residents here have participated in the Bobâlna uprising (1437) and the revolt led by Gheorghe Doja in 1514. Locals fought oppression by outlawry and local uprisings, which have been reported both in the 17th century, and in the 18th century. During the rebellion led by Horea, Cloșca and Crișan in 1784 and during the revolution of 1848, serfs in Jibou have been with the thought and deeds by the side of other exploited inhabitants of the Transylvanian settlements, regardless of nationality. The Great National Assembly in Alba Iulia (1 December 1918) was also attended by delegates from Jibou, headed by Gheorghe Petruca. On 16 October 1944 enter in Jibou the Romanian army and liberates the locality.\nIn 1950, Jibou became a district seat within the Cluj Region; it lost the statute in 1960, when the district seat became Zalău. Jibou was declared a town in 1968, when a new administrative law was adopted .\n\n\n== Demography ==\n\nAccording to the population census of 2011, Jibou numbered at that time 10,407 inhabitants, of which 5,141 male and 5,266 female. Decrease in population is mainly due to negative natural growth, but also emigration to other western European countries.\nAccording to the 2011 census, the city's population is made up of 8,210 Romanians (9,181 in 2002), alongside also live 1,192 Hungarians (1,503 in 2002), 584 Gypsies (603 in 2002), 5 Ukrainians (3 in 2002), 3 Slovaks (2 in 2002) and 7 of other nationalities. Likewise, 401 persons have not declared their ethnicity.On religious confessions, situation of Jibou population in 2011 was as follows: 7,153 Orthodox (9,044 in 2002), 151 Roman Catholic (162 in 2002), 127 Greek Catholic (175 in 2002), 1,088 Reformed (1,520 in 2002), 4 Unitarians (1 in 2002), 402 Baptist (500 in 2002), 746 Pentecostal (560 in 2002), 7 Seventh-day Adventist (12 in 2002), 12 Evangelical (8 in 2002), 3 Muslim (2 in 2002), 220 Jehovah's Witness, 14 other religions, 11 without religion (6 in 2002), 5 atheists (2 in 2002) and 460 with undeclared religion.\n\n\n== Economy ==\nOver time, Jibou has kept its predominant agricultural and handicraft character. If before 1968 it had only one industrial unit, Red Star (Romanian: Steaua Roșie, Hungarian: Vörös Csillagot), that produced joinery articles, in the years that followed were built and expanded: the Flax Plant, the Clothing Firm, the Flax Melter, the Dairy, the Mining Company, the CFR Depot, sections of the Zalău Enterprise of Industrial Armature of Iron and Steel, Zalău Ceramics, the Forest Unit of Exploitation and Transport, the handicraft cooperatives the Craftsmen Collective and the Progress and others. After 1989, some of these economic units have ceased work, others had reprofiled, adapting in one way or another to market economy. The most worrisome effect is the large number of unemployed, which is why it falls upon the general standard of living of the inhabitants.\n\n\n=== Industry ===\nIn terms of industry, Jibou has profiled, in time, on certain sectors of light industry, wood processing, food, crafts and construction. Productive units have small production capacities, but optimally harness material and human resources of the area. In this regard can be mentioned: Confecții SA, Samtex, Multiprod, Mining Company, Bălănean Mill, the Progress cooperative, the Craftsman cooperative, the Cheese Factory, Absolut Typography, Clem SRL, Calion Prod, etc.\n\n\n=== Agriculture and silviculture ===\nFertile lands in Someș meadow and terraces favored the cultivation of the main agricultural plants, but also the animals' growth. Along with acreage, appear sectors covered by deciduous forests, which complete the natural landscape.\n\n\n=== Commerce ===\nThe geographical position of the city favored the layout of a market for sale of industrial and agricultural products, but also of an animal market. There are many commercial units making a wide range of products, such as: Bujor SNC, Alfa, But Impex, Bălănean, Tora, Baciu, Paloma, Criss and Consumcoop units.\n\n\n=== Services ===\nIn order to meet certain needs of the population, there are many units providing services, such as: Prod Fizeș, Arcada, Consomes, Tinca SRL, the Craftsman cooperative, the Progress cooperative, that perform construction, plumbing, heating and water works, carpentry, repair of household appliances, auto repair shops, etc.\n\n\n=== Banking system ===\nMonetary circulation in the city and surroundings is provided by the CEC Bank, the Romanian Commercial Bank, the Romanian Bank for Development, the Treasury and the Credit Cooperative. In the insurance field operates the following units: Asirom, Unita, Ardaf.\n\n\n=== Tourism ===\n\n\n==== Monuments ====\n\nOld Orthodox Church (1931)\nSt. George Orthodox Church – built between 1998 and 2001, it is nicknamed the \"high-tech church\" for its modern amenities (electronic censer, underfloor heating, altar with remote control).\nReformed Church – burned by Tatars in 1658 and by Lobonts in 1705, it is rebuilt in 1749.\nAssumption of the Virgin Mary Roman Catholic Church (1886)\nWesselényi Castle, in the courtyard of which is arranged the Botanical Garden.\nBéldy Castle – built in 1903 by Béldy family for its boy, the castle houses a neuropsychiatric hospital.\nFormer casino (late 19th century)\nOld train station (1890), subsequently converted into bus terminal\nTown Hall (late 19th century)\nTown Hospital, formerly Court (late 19th century)\n\n\n== Education ==\nRegisters of the Calvin (Reformed) confessional school are run starting in 1746, but the institution is much older. State education dates from 1895. According to monographist Petri Mór, here functioned, by the late 19th century, the first kindergarten in Transylvania, with Júlia Teleki as educator.\nJibou has three kindergartens, two high schools and a secondary school:\nIon Agârbiceanu Theoretical High School (established on 1 September 1957);\nOctavian Goga Technological High School (until 23 October 2001, general school; until 12 January 2012, school group);\nLucian Blaga Secondary School (since 1971).\n\n\n== Personalities ==\nMiklós Wesselényi (1796–1850), statesman\nȘtefan Birtalan (b. 1948), handball player and coach\nCornel Damian (b. 1960), Roman Catholic cleric\n\n\n== Climate ==\nJibou has a humid continental climate (Cfb in the Köppen climate classification).\n\n\n== References ==\n\n\n== External links ==\nMap of Jibou\nJibou Botanical Garden\nOld images of Jibou",
    "links": [
        "Agriculture",
        "Agrij",
        "Agrij River",
        "Alba Iulia",
        "Almașu",
        "Assumption of the Virgin Mary",
        "BRD – Groupe Société Générale",
        "Baia Mare",
        "Banca Comercială Română",
        "Baptist",
        "Battle of Zsibó",
        "Benesat",
        "Bobota, Sălaj",
        "Bocșa, Sălaj",
        "Boghiș",
        "Buciumi, Sălaj",
        "Budai Nagy Antal revolt",
        "Bus station",
        "Băbeni, Sălaj",
        "Bălan, Sălaj",
        "Bănișor",
        "CEC Bank",
        "Camăr",
        "Carastelec",
        "Casino",
        "Cehu Silvaniei",
        "Chieșd",
        "Cizer",
        "Cluj Region",
        "Coat of arms of Jibou",
        "Communes of Romania",
        "Cornel Damian",
        "Counties of Romania",
        "Coșeiu",
        "Crasna, Sălaj",
        "Creaca",
        "Cristolț",
        "Crișeni",
        "Cuzăplac",
        "Deciduous forest",
        "Dej",
        "Dobrin, Sălaj",
        "Dragu",
        "Eastern European Summer Time",
        "Eastern European Time",
        "Evangelical",
        "Fildu de Jos",
        "Geographic coordinate system",
        "German language",
        "Great Union Day",
        "Greek Catholic",
        "Gypsies",
        "György Dózsa",
        "Gâlgău",
        "Gârbou",
        "Halmășd",
        "Hereclean",
        "Hida, Sălaj",
        "Horoatu Crasnei",
        "Humid continental climate",
        "Hungarian language",
        "Hungarians",
        "ISBN (identifier)",
        "Ileanda",
        "Ip, Sălaj",
        "Jehovah's Witness",
        "Jews",
        "Jibou Botanical Garden",
        "Joseph II, Holy Roman Emperor",
        "Kindergarten",
        "Kingdom of Hungary",
        "Köppen climate classification",
        "Letca",
        "Light industry",
        "List of cities and towns in Romania",
        "Lozna, Sălaj",
        "Marca, Sălaj",
        "Maria Theresa",
        "Market economy",
        "Meseșenii de Jos",
        "Miklós Wesselényi",
        "Mirșid",
        "Municipiu",
        "Muslim",
        "Măeriște",
        "National Institute of Statistics (Romania)",
        "Nușfalău",
        "Năpradea",
        "Orthodox Christianity",
        "Pentecostal",
        "Pericei",
        "Petri Mór",
        "Plopiș",
        "Poiana Blenchii",
        "Porolissum",
        "Postal codes in Romania",
        "Precipitation",
        "Reformed tradition",
        "Revolt of Horea, Cloșca and Crișan",
        "Roman Catholic",
        "Romania",
        "Romanian language",
        "Romanians",
        "Românași",
        "Rus, Sălaj",
        "Rákóczi's War of Independence",
        "Seventh-day Adventist",
        "Slovaks",
        "Social Democratic Party (Romania)",
        "Someș-Odorhei",
        "Someș River",
        "Surduc",
        "Szilágy County",
        "Sâg",
        "Sânmihaiu Almașului",
        "Sălaj County",
        "Sălățig",
        "Sărmășag",
        "Tatars",
        "Tihău",
        "Time zone",
        "Train station",
        "Transylvania",
        "Treznea",
        "Ukrainians",
        "Unitarianism",
        "VIAF (identifier)",
        "Valcău de Jos",
        "Vehicle registration plates of Romania",
        "Vârșolț",
        "Wikimedia Commons",
        "Yiddish language",
        "Zalha",
        "Zalău",
        "Zimbor",
        "Șamșud",
        "Șimișna",
        "Șimleu Silvaniei",
        "Ștefan Birtalan"
    ]
}