{"url": "https://en.wikipedia.org/wiki/Jimmy_Omonga", "title": "Jimmy Omonga", "summary": "Jimmy Omonga is a singer and songwriter from the Democratic Republic of the Congo. With his debut album \"Destin\" (2008), he became within a few months one of Congo's new popular singers, known for his characteristic and unique voice; clear and ringing in its upper reaches, with soulful low notes.", "content": "Jimmy Omonga is a singer and songwriter from the Democratic Republic of the Congo. With his debut album \"Destin\" (2008), he became within a few months one of Congo's new popular singers, known for his characteristic and unique voice; clear and ringing in its upper reaches, with soulful low notes.\n\n\n== Biography ==\nOmongo was born in Kinshasa. He began to perform when he was 14. A notable feature in Congo culture is it has blended its ethnic musical sources with Cuban rumba and merengue to give birth to soukous. Some of the music Omonga is a direct derivative, but blended with other African styles he picked up while touring in Angola and South Africa.\nOn his arrival in South Africa in 1998, Omonga joined the Brothers Band (the later Afro Fiesta) as singer and percussionist with his longtime friends Mermans Mosengo on bass, Papy (Felix Garemua) Lilawu joining as lead guitarist, Junior Kisangwa, drum, percussion & backing vocal and Christian Eboko on rhythm guitar, keyboards and backing vocal. The band soon became a draw card at various venues around Cape Town, including Mama Afrika, Chapman's Peak Hotel, Kennedy's Cigar Lounge, Africa Junction, Marco's African Restaurant.\nOmonga sings mostly about love. He sings in many languages (French, English, Italian and Lingala).\nThe new millennium brought changes as Jimmy did his first European gigs as a singer-songwriter, no longer as Jibriel but Jimmy Omonga.\nOmonga's big break in African popular music came when two of his songs were released at a Womex sampler-CD in 2007.\nBefore his debut album \"Destin\" was released in 2008 (UK distribution Harmonia Mundi) Omonga won the Music of the World Award in Amsterdam. The Award Ceremony was transmitted by UPC to the Amsterdam A1 channel and the Amsterdam TV Foundation Salto for providing a live-stream of the show, so the event was seen live in over 200 countries on New Years Day 2008. A record of over 57.000 votes were cast online by music fans from across the globe. MokumTV's Music of the World Awards unveiled Jimmy Omonga as the best of that year in Worldmusic.\nIn 2007, Omonga traveled to South Africa, where he, together with Junior Kisangwa, recorded his debut album Destin.\n\n\n== Awards and recognition ==\n2008 – Music of the World Award (Victoires de la musique mondial) as \"Best Newcomer\"\n2008 – Nominated for the Edison Award\n2009 – First Congolese singer to tour Mexico (13–19 April)\n\n\n== Discography ==\n2007 – Hippo Records Womex Sampler\n2008 – Destin\n\n\n== External links ==\nOfficial site\nMusic of the World Award\nKumani fansite in Dutch\nAfro-Fiesta, former Brothers Band of Jimmy Omonga", "links": ["African popular music", "Afro Fiesta", "Afro pop music", "Amsterdam", "Angola", "Cape Town", "Cuban music", "Cuban rumba", "Democratic Republic of the Congo", "Edison Award", "Harmonia Mundi", "Hippo Records", "Junior Kisangwa", "Kinshasa", "Lingala", "Merengue music", "Mermans Mosengo", "Pop music", "Soukous", "UPC Netherlands", "Womex", "Worldmusic"]}