{"url": "https://en.wikipedia.org/wiki/Jimmy_McShane", "title": "Jimmy McShane", "summary": "James Harry McShane (23 May 1957 – 29 March 1995) was a singer from Northern Ireland, best known as the front-man of Italian band Baltimora, with the hit song \"Tarzan Boy\".", "content": "James Harry McShane (23 May 1957 – 29 March 1995) was a singer from Northern Ireland, best known as the front-man of Italian band Baltimora, with the hit song \"Tarzan Boy\".\n\n\n== History ==\nMcShane was born in Derry, Northern Ireland. Hired as a stage dancer and backing singer, he soon went around Europe with Dee D. Jackson and her band. During a visit to Italy with the band, McShane was attracted to the country's underground dance scene, which led to his settling in Milan in 1984. He told Dick Clark on American Bandstand in 1986 that he fell in love with Italy from that moment. He also learned to speak Italian and acquired Italian citizenship.He made his debut playing in small clubs in his hometown without success. In view of this, McShane decided to work as an Emergency Medical Technician (EMT) for the Red Cross  until he met Italian record producer & keyboardist Maurizio Bassi, with whom he created Baltimora. The act found success with its most popular single, \"Tarzan Boy\", released in 1985.\nIn America, he was overwhelmed with the success of \"Tarzan Boy\". Some sources state lead vocals were performed by Maurizio Bassi, the group's keyboardist, with McShane actually providing the backing vocals. This still remains uncertain, and McShane lip synced while appearing in the \"Tarzan Boy\" music video, and not Bassi.\n\n\n== Illness and death ==\nMcShane was diagnosed with AIDS in Milan during 1994. A few months later he returned to Northern Ireland to spend his final year, and died in his native Derry on 29 March 1995 at the age of 37. A family spokesman issued the following statement after his death: \"He faced his illness with courage and died with great dignity.\" In the centre of Derry, a commemorative plaque was bestowed upon the grave of McShane and his father, who had died three years prior.\n\n\n== References ==\n\n\n== External links ==\nJimmy McShane at Find a Grave", "links": ["AIDS", "American Bandstand", "Baltimora", "Bayerischer Rundfunk", "Belfast Telegraph", "Columbia Records", "Dance-pop", "Dee D. Jackson", "Derry", "Dick Clark", "EMI", "Emergency Medical Technician", "Find a Grave", "ISBN (identifier)", "ISNI (identifier)", "Italian language", "Italo disco", "Juke Box Boy", "Key Key Karimba", "Living in the Background (album)", "Living in the Background (song)", "MBA (identifier)", "Manhattan Records", "Maurizio Bassi", "Milan", "New wave music", "Northern Ireland", "Red Cross", "Survivor in Love", "Synth-pop", "Tarzan Boy", "VIAF (identifier)", "Wayback Machine", "Woody Boogie"]}