{"url": "https://en.wikipedia.org/wiki/John_Brown_of_Pittsfield", "title": "John Brown of Pittsfield", "summary": "John Brown (October 19, 1744 – October 19, 1780) of Pittsfield, Massachusetts, was a Revolutionary War officer, a state legislator, and a Berkshire County judge. He played key roles in the conquest of Fort Ticonderoga at the start of the war, during the American invasion of Canada in 1775-1776, and once again in 1777 during Lieutenant General John Burgoyne's invasion of the United States by way of Lake Champlain and the Hudson River.\nBrown was the first man to bring formal charges against Benedict Arnold, who was then a prominent American general.\nBrown died in battle at Stone Arabia in the Mohawk Valley in 1780.", "content": "John Brown (October 19, 1744 – October 19, 1780) of Pittsfield, Massachusetts, was a Revolutionary War officer, a state legislator, and a Berkshire County judge. He played key roles in the conquest of Fort Ticonderoga at the start of the war, during the American invasion of Canada in 1775-1776, and once again in 1777 during Lieutenant General John Burgoyne's invasion of the United States by way of Lake Champlain and the Hudson River.\nBrown was the first man to bring formal charges against Benedict Arnold, who was then a prominent American general.\nBrown died in battle at Stone Arabia in the Mohawk Valley in 1780.\n\n\n== Early life ==\nBrown was born in Haverhill, in eastern Massachusetts, the youngest son of Daniel Brown and Mehitable Sanford Brown. Soon after his birth, the family moved to Enfield in central Massachusetts and then to Sandisfield in Berkshire County, which was then frontier. Daniel Brown was one of the earliest settlers in Sandisfield and a \"principal inhabitant.\"Some confusion exists about John Brown's education. Without question, he attended Yale College, graduating in 1771, and he studied law under the guidance of his sister Elizabeth's husband, Oliver Arnold of Providence, Rhode Island, who was the state's attorney general and an uncle of New Haven, Connecticut, merchant Benedict Arnold. Most historians assume that Brown attended Yale first and then read law. However, Arnold died in the fall of 1770, making this chronology impossible.\n\nBrown was a close friend to Yale classmate David Humphreys, who went on to be staff officer in the Continental army, a diplomat, George Washington's private secretary, and one of the Connecticut Wits. Both Humphreys and Brown were founding members of Yale's society of Brothers in Unity. Humphrey's lengthy poem \"Address to the Armies of the United States of America\" mentions Brown's death as a notable and tragic event in the Revolution.Brown began his law practice in Caughnawaga (Johnstown), New York, and was appointed king's attorney. He resigned that position, settled in Pittsfield, and was chosen as representative to the General Court of Massachusetts, the colony's legislature.\n\n\n== American Revolution ==\n\n\n=== Mission to Canada ===\nIn March 1775, as a member of the Massachusetts Committee of Correspondence, Brown was sent to Montreal by way of Lake Champlain to meet with Canadians interested in joining the other 13 colonies in their dispute with the British government. He received support from Thomas Walker and other leading British-American merchants, but concluded, \"There is no prospect of Canada sending Delegates to the Continental Congress.\"\nHe reported, \"One thing I must mention, to be kept as a profound secret. The Fort at Ticonderoga must be seized as soon as possible, should hostilities be committed by the King' s Troops.\"\n\n\n=== Fort Ticonderoga ===\n\nAs part of the Pittsfield militia company commanded by Colonel James Easton, Brown participated in the successful surprise attack on Fort Ticonderoga on May 10, 1775. Ethan Allen and Benedict Arnold clashed over who had overall command of the expedition. In this dispute, Brown was an Allen supporter.Allen selected Brown to carry the news of the victory to the Continental Congress in Philadelphia, an honor given to a young officer who has distinguished himself.\n\n\n=== Summer and Fall Campaign 1775 ===\nIn the summer of 1775, Brown acted as a spy in Canada, reporting back to Major General Philip Schuyler and Brigadier General Richard Montgomery about British efforts to improve the fortifications at Fort St. John (Saint-Jean) on the Richelieu River and to build vessels-of-war to sail on Lake Champlain.\nOn September 17, 1775 Brown with 80 men opened action north of Fort St John but was driven back by 200 British and Canadians but not before he destroyed a key bridge and captured supplies en route to the Fort.\nOn September 24, Ethan Allen was captured while attempting to take Montreal. Brown's role is far from clear. Allen later claimed that he and Brown had agreed on a joint attack, but that Brown failed to follow through on his part of the plan. In his The Natural and Political History of the State of Vermont (1798), Allen's brother Ira added Colonel Seth Warner to the plan. In this account, Brown and Warner found the nighttime crossing of the St. Lawrence too dangerous and went \"quietly to rest.\" \"The conduct of Brown and Warner is hard to be accounted for, on any principles honourable to themselves,\" Ira Allen wrote.However, at the time Brown received no criticism from commanding officers, who blamed Allen's \"imprudence\" alone for the disaster. Defenders of Brown have pointed to his reputation for heroism throughout the war and have questioned the truthfulness of Ethan and Ira Allen.\nOn October 18, 1775, Brown joined with James Livingston, 50 Americans, and 300 Canadians, to lay siege and capture the British Fort Chambly along with six tons of gun powder, 6000 musket cartridges, and 134 barrels of pork. The action was key to the surrender of Fort St. John and then the city of Montreal. General Montgomery wrote of Brown, \"Upon this and all other occasions I have found him active and intelligent.\"On November 19–20, at Sorel on the St. Lawrence River, Brown forced the surrender of a British fleet of 11sails by exaggerating the size and number of the guns in the American batteries. Benedict Arnold later accused Brown and Colonel James Easton of plundering the captured British ships.\n\n\n=== Winter 1775 ===\nUnequipped for winter, many men from northwestern New England returned home after the surrender of Montreal. But Brown took command of a small regiment made up of those who remained and accompanied General Montgomery to Quebec where they joined with Benedict Arnold in besieging the city. \n\nWith many enlistments due to expire with the New Year, the small army was in turmoil. Three captains asked to be transferred to the command of someone other than Arnold. \"I am much afraid my friend [blank] is deeply concerned in this business. I will have an eclaircissement with him on the subject,\" wrote Montgomery. Many historians believe that the blank in Montgomery's letter represented John Brown.During the Battle of Quebec, fought in the early morning of December 31, Brown and Livingston were responsible for a diversionary attack on the upper walled city while Montgomery and Arnold attacked from opposite sides of the Lower Town. Montgomery was killed and Arnold was wounded; Brown's diversion failed.\n\n\n=== Death at Stone Arabia ===\nBrown was killed in action on his 36th birthday, October 19, 1780, at the Battle of Stone Arabia, on the Mohawk Valley frontier.\n\n\n== See also ==\nIntelligence in the American Revolutionary War\nIntelligence operations in the American Revolutionary War\n\n\n== Notes ==\n\nBrown died in the battle of Stone Arabia, see New York in the revolution published 1876 and many other sources.\n\n\n== References ==\nHowe, Archibald M (September 29, 1908). \"Colonel John Brown of Pittsfield, Massachusetts, the Brave Accuser of Benedict Arnold\". Archived from the original on March 28, 2006. Retrieved August 1, 2006.\nLanctot, Gustave (1967). Canada and the American Revolution. Harvard University Press.\nWard, Christopher (1952). The War of the Revolution. New York: Macmillan.\n\n\n== External links ==\nNewsletter \"Stone Arabia Battle Chapter, Sons of The American Revolution\": March 1995 issue", "links": ["Battle of Quebec (1775)", "Battle of Stone Arabia", "Benedict Arnold", "Brothers in Unity", "Continental Congress", "David Humphreys (soldier)", "Ethan Allen", "Fort Chambly", "Fort Saint-Jean (Quebec)", "Fort Ticonderoga", "Intelligence in the American Revolutionary War", "Intelligence operations in the American Revolutionary War", "Lake Champlain", "Mohawk Valley", "Montreal", "Philip Schuyler", "Pittsfield, Massachusetts", "Richard Montgomery", "Richelieu River", "Seth Warner", "VIAF (identifier)"]}