{"url": "https://en.wikipedia.org/wiki/John_D._and_Katherine_Gleissner_Lustron_House", "title": "John D. and Katherine Gleissner Lustron House", "summary": "The John D. and Katherine Gleissner Lustron House is a historic enameled steel prefabricated house in Birmingham, Alabama.  Designed and constructed by the Lustron Corporation, this example is one of three confirmed to have been built in Birmingham.  Another, the Bernice L. Wright Lustron House, is just one house over from the Gleissner Lustron House.Lustron houses were only produced during a two-year period, with 2,495 known to have been made.  A majority of those originally constructed (roughly 2,000) are still standing today.  Many of those that do remain have been altered significantly.  Twenty Lustron houses are known to have been ordered in Alabama, although it is not clear if twenty were erected.  Only eleven remained in 2000.The house forms part of the National Register of Historic Places' Lustron Houses in Alabama MPS.  It was placed on the National Register on February 24, 2000, due to its architectural significance.  The house was slated for demolition in 2015 to make way for a condominium development.", "content": "The John D. and Katherine Gleissner Lustron House is a historic enameled steel prefabricated house in Birmingham, Alabama.  Designed and constructed by the Lustron Corporation, this example is one of three confirmed to have been built in Birmingham.  Another, the Bernice L. Wright Lustron House, is just one house over from the Gleissner Lustron House.Lustron houses were only produced during a two-year period, with 2,495 known to have been made.  A majority of those originally constructed (roughly 2,000) are still standing today.  Many of those that do remain have been altered significantly.  Twenty Lustron houses are known to have been ordered in Alabama, although it is not clear if twenty were erected.  Only eleven remained in 2000.The house forms part of the National Register of Historic Places' Lustron Houses in Alabama MPS.  It was placed on the National Register on February 24, 2000, due to its architectural significance.  The house was slated for demolition in 2015 to make way for a condominium development.\n\n\n== Architecture ==\nThe Gleissner Lustron House is an example of Lustron's \"Westchester\" 3-bedroom model.  It retains the original enameled steel roof, wall panels, and \"zig-zag\" support column, although a wood-frame porch extension has been added to the original porch and all of it screened in.  Lustron houses came in several exterior colors. The Gleissner Lustron is in the company's \"Desert Tan\" color.\n\n\n== References ==", "links": ["Alabama", "Bernice L. Wright Lustron House", "Birmingham, Alabama", "Condominium", "Contributing property", "Geographic coordinate system", "Historic districts in the United States", "History of the National Register of Historic Places", "Keeper of the Register", "List of National Historic Landmarks in Alabama", "List of bridges on the National Register of Historic Places in Alabama", "Lustron house", "Multiple Property Submission", "National Park Service", "National Register of Historic Places", "National Register of Historic Places Multiple Property Submissions in Alabama", "National Register of Historic Places listings in Alabama", "National Register of Historic Places listings in Baldwin County, Alabama", "National Register of Historic Places listings in Barbour County, Alabama", "National Register of Historic Places listings in Birmingham, Alabama", "National Register of Historic Places listings in Butler County, Alabama", "National Register of Historic Places listings in Calhoun County, Alabama", "National Register of Historic Places listings in Clarke County, Alabama", "National Register of Historic Places listings in Colbert County, Alabama", "National Register of Historic Places listings in Dallas County, Alabama", "National Register of Historic Places listings in DeKalb County, Alabama", "National Register of Historic Places listings in Elmore County, Alabama", "National Register of Historic Places listings in Etowah County, Alabama", "National Register of Historic Places listings in Greene County, Alabama", "National Register of Historic Places listings in Hale County, Alabama", "National Register of Historic Places listings in Jackson County, Alabama", "National Register of Historic Places listings in Jefferson County, Alabama", "National Register of Historic Places listings in Lauderdale County, Alabama", "National Register of Historic Places listings in Lee County, Alabama", "National Register of Historic Places listings in Limestone County, Alabama", "National Register of Historic Places listings in Macon County, Alabama", "National Register of Historic Places listings in Madison County, Alabama", "National Register of Historic Places listings in Marengo County, Alabama", "National Register of Historic Places listings in Marshall County, Alabama", "National Register of Historic Places listings in Mobile, Alabama", "National Register of Historic Places listings in Mobile County, Alabama", "National Register of Historic Places listings in Montgomery County, Alabama", "National Register of Historic Places listings in Morgan County, Alabama", "National Register of Historic Places listings in Perry County, Alabama", "National Register of Historic Places listings in Russell County, Alabama", "National Register of Historic Places listings in St. Clair County, Alabama", "National Register of Historic Places listings in Sumter County, Alabama", "National Register of Historic Places listings in Talladega County, Alabama", "National Register of Historic Places listings in Tuscaloosa County, Alabama", "National Register of Historic Places listings in Wilcox County, Alabama", "National Register of Historic Places property types", "Prefabricated", "The Birmingham News", "Vitreous enamel"]}