{"url": "https://en.wikipedia.org/wiki/John_Hamilton_(Queensland_politician)", "title": "John Hamilton (Queensland politician)", "summary": "John Hamilton (19 August 1841 – 7 December 1916), also known as John Dinwoodie, was an Australian politician.", "content": "John Hamilton (19 August 1841 – 7 December 1916), also known as John Dinwoodie, was an Australian politician.\n\n\n== Early life ==\nHe was born in Melbourne to saddler John Dinwoodie and Janet, née McFarlane. He was sent to a private tutor in England before travelling to Rockhampton with the intention to become a pastoralist. He instead became a gold miner at the Calliope gold rush and moved to Gympie in 1867, where he became a magistrate under the name John Hamilton. He also practiced as a doctor despite his lack of qualifications, and in 1877 was a surgeon to the hospital at the Hodgkinson gold rush, where he attracted publicity with a public dispute with the local warden and a successful defamation case after allegations that he seduced the daughter of a friend of the local editor.\n\n\n== Politics ==\nIn 1878 he was elected to the Legislative Assembly of Queensland for Gympie and supported Thomas McIlwraith's conservative group. In 1883 he changed seat to Cook, winning the election amid allegations of vote rigging.Hamilton supported the North Queensland separatist movement and continued to support McIlwraith's conservative successors, becoming a significant but occasionally rebellious backbencher, successfully opposing the attempted reduction of parliamentary salaries in 1893 and defeating the nomination of Alfred Cowley as Speaker in 1899. In 1903 he lost his post as government whip and in 1904 lost his seat to a Labour candidate.\n\n\n== Later life ==\nFollowing his defeat he retired, and died in 1916 at the Royal Brisbane Hospital, having never married and was buried at Toowong Cemetery.\n\n\n== References ==", "links": ["Alfred Cowley", "Australian Dictionary of Biography", "Australian Labor Party (Queensland Branch)", "Australian National University", "Brisbane", "Calliope, Queensland", "Charles Lumley Hill", "Electoral district of Cook", "Electoral district of Gympie", "Frederick Cooper (politician)", "Gold mining", "Gympie", "Hodgkinson, Queensland", "James Kidgell", "John Hargreaves (Queensland politician)", "John Walsh (Australian politician)", "Legislative Assembly of Queensland", "Melbourne", "North Queensland", "Parliament of Queensland", "Physician", "Queensland", "Queensland Legislative Assembly", "Rockhampton", "Royal Brisbane and Women's Hospital", "Speaker of the Legislative Assembly of Queensland", "The Brisbane Courier", "Thomas Campbell (Australian politician)", "Thomas McIlwraith", "Toowong Cemetery", "Trove (identifier)", "VIAF (identifier)", "Victoria, Australia", "Wayback Machine", "William Smyth (Australian politician)"]}