{
    "url": "https://en.wikipedia.org/wiki/John_H._McFadden_House",
    "title": "John H. McFadden House",
    "summary": "The John H. McFadden House is a historic two-story house in Bartlett, Tennessee.\n\n",
    "content": "The John H. McFadden House is a historic two-story house in Bartlett, Tennessee.\n\n\n== History ==\nThe house was built in 1840 for Dr. Samuel Bond, a settler and cotton farmer who served as a member of the Tennessee House of Representatives. It survived the American Civil War of 1861–1865, when it was used as a base by the Union Army. From 1870 to 1905, it belonged to Edmund Orgill.The house was acquired by John H. McFadden, a cotton broker, in 1939. McFadden was an immigrant from England who served in World War I and became the president of the New York Cotton Exchange as well as an advisor to the National Cotton Council of America. After his death in 1955, the house was acquired by Eric Catmur, followed by John Green.\n\n\n== Architectural significance ==\nThe house was redesigned in the Colonial Revival style by architect Estes W. Mann in 1940. It has been listed on the National Register of Historic Places since June 10, 1994.\n\n\n== References ==",
    "links": [
        "American Civil War",
        "American Legation, Tangier",
        "Bartlett, Tennessee",
        "Colonial Revival architecture",
        "Contributing property",
        "Estes W. Mann",
        "Geographic coordinate system",
        "Historic Preservation Fund",
        "Historic districts in the United States",
        "History of the National Register of Historic Places",
        "Keeper of the Register",
        "List of U.S. National Historic Landmarks by state",
        "List of jails and prisons on the National Register of Historic Places",
        "National Cotton Council of America",
        "National Historic Preservation Act of 1966",
        "National Park Service",
        "National Register of Historic Places",
        "National Register of Historic Places architectural style categories",
        "National Register of Historic Places listings in Alabama",
        "National Register of Historic Places listings in Alaska",
        "National Register of Historic Places listings in American Samoa",
        "National Register of Historic Places listings in Arizona",
        "National Register of Historic Places listings in Arkansas",
        "National Register of Historic Places listings in California",
        "National Register of Historic Places listings in Colorado",
        "National Register of Historic Places listings in Connecticut",
        "National Register of Historic Places listings in Delaware",
        "National Register of Historic Places listings in Florida",
        "National Register of Historic Places listings in Georgia",
        "National Register of Historic Places listings in Guam",
        "National Register of Historic Places listings in Hawaii",
        "National Register of Historic Places listings in Idaho",
        "National Register of Historic Places listings in Illinois",
        "National Register of Historic Places listings in Indiana",
        "National Register of Historic Places listings in Iowa",
        "National Register of Historic Places listings in Kansas",
        "National Register of Historic Places listings in Kentucky",
        "National Register of Historic Places listings in Louisiana",
        "National Register of Historic Places listings in Maine",
        "National Register of Historic Places listings in Maryland",
        "National Register of Historic Places listings in Massachusetts",
        "National Register of Historic Places listings in Michigan",
        "National Register of Historic Places listings in Minnesota",
        "National Register of Historic Places listings in Mississippi",
        "National Register of Historic Places listings in Missouri",
        "National Register of Historic Places listings in Montana",
        "National Register of Historic Places listings in Nebraska",
        "National Register of Historic Places listings in Nevada",
        "National Register of Historic Places listings in New Hampshire",
        "National Register of Historic Places listings in New Jersey",
        "National Register of Historic Places listings in New Mexico",
        "National Register of Historic Places listings in New York",
        "National Register of Historic Places listings in North Carolina",
        "National Register of Historic Places listings in North Dakota",
        "National Register of Historic Places listings in Ohio",
        "National Register of Historic Places listings in Oklahoma",
        "National Register of Historic Places listings in Oregon",
        "National Register of Historic Places listings in Palau",
        "National Register of Historic Places listings in Pennsylvania",
        "National Register of Historic Places listings in Puerto Rico",
        "National Register of Historic Places listings in Rhode Island",
        "National Register of Historic Places listings in Shelby County, Tennessee",
        "National Register of Historic Places listings in South Carolina",
        "National Register of Historic Places listings in South Dakota",
        "National Register of Historic Places listings in Tennessee",
        "National Register of Historic Places listings in Texas",
        "National Register of Historic Places listings in Utah",
        "National Register of Historic Places listings in Vermont",
        "National Register of Historic Places listings in Virginia",
        "National Register of Historic Places listings in Washington, D.C.",
        "National Register of Historic Places listings in Washington state",
        "National Register of Historic Places listings in West Virginia",
        "National Register of Historic Places listings in Wisconsin",
        "National Register of Historic Places listings in Wyoming",
        "National Register of Historic Places listings in the Federated States of Micronesia",
        "National Register of Historic Places listings in the Marshall Islands",
        "National Register of Historic Places listings in the Northern Mariana Islands",
        "National Register of Historic Places listings in the United States Minor Outlying Islands",
        "National Register of Historic Places listings in the United States Virgin Islands",
        "National Register of Historic Places property types",
        "New York Cotton Exchange",
        "Union Army",
        "University and college buildings listed on the National Register of Historic Places",
        "World War I"
    ]
}