{"url": "https://en.wikipedia.org/wiki/Kanki,_Uttar_Dinajpur", "title": "Kanki, Uttar Dinajpur", "summary": "Kanki  is a village under Goalpokhar II community development block in the district of Uttar Dinajpur, West Bengal, India. It is also the center of the Kanki Gram Panchayat. It is famous for historical Jain Mandir Kanki and Ramdev Baba Mandir.", "content": "Kanki  is a village under Goalpokhar II community development block in the district of Uttar Dinajpur, West Bengal, India. It is also the center of the Kanki Gram Panchayat. It is famous for historical Jain Mandir Kanki and Ramdev Baba Mandir.\n\n\n== Features ==\nThe village is located in North Dinajpur, a district of West Bengal. It is situated beside NH-31. The population is about 1600, and the town has a railway station named Kanki railway station with trains to the nearest city, Kishanganj. The area has a population of around 12000. Kanki has a church and two nationalised banks (Punjab National Bank and Indian Overseas Bank), with a temple of Shri Krishna Avatar Baba Ramdev, Digambar Jain Mandir and a Mosque considered tourist attractions.\nKanki's daily temperatures tend to coincide with those of Darjeeling, by virtue of their proximity. In summer, temperatures reach 40 °C and can drop as low as 4 °C in the winter.\n\n\n== Gram Panchayat ==\nThe Kanki gram panchayat (village council) is the local government for the villages of Basatput, Chaugharia, Dangi, Deogaon, Hathipaon, Hatwar, Kanki, Mahishakhor, Majlispur, Manora, Matiari, Najarpur, Nayanagar, Pachim Lahil, Peazgaon, Sahaspur, Simulia, Suhia, and Suhiasani.\n\n\n== Industry ==\nThe majority of the workforce is involved with the agricultural industry. As suits its agricultural focus, Kanki serves as a hub for vegetable exports and Lahil developing in progress.\n\n\n== Education ==\nHere is a High School (Kanki Shree jain Vidya Mandir) with co-education facility up to class XII. There is also a girls' school, offering up to class VIII.\nSchools offering primary education in the area include Marigold English school, Simulia f.p. School, Evergreen Public School Kanki, Kanki Public School, Kanki Jr. Basic School, Darul Ulum Mohammadia, Hatwar F.p. School, Basatpur Madrasah Shiksha Kendra, Hatwar Msk, Children Ideal English School, Hatipaon F.p. School, Kanki Colony Ssk, Aljamiatus Sunnia Lahil Manora, Sahapur F.p. School, Mahisakhore Ssk, Manora Urdu Medium F.p.school, Monara High School, Al-jame-atul Ashrafia Garib, Dr. Zakir Hussain Public School, Sani Suhia F.p. School, and Nayanagar Ssk.\n\n\n== References ==", "links": ["Darjeeling", "Geographic coordinate system", "Goalpokhar II (community development block)", "Gram Panchayat", "Gram panchayat", "Kanki railway station", "Kishanganj", "National Highway 31 (India)", "Uttar Dinajpur district", "West Bengal"]}