{"url": "https://en.wikipedia.org/wiki/Kathryn_Findlay", "title": "Kathryn Findlay", "summary": "Kathryn Findlay (26 January 1953 – 10 January 2014) was a Scottish architect.", "content": "Kathryn Findlay (26 January 1953 – 10 January 2014) was a Scottish architect.\n\n\n== Early life and education ==\nFindlay was born in Forfar in Scotland, the daughter of a sheep farmer, and studied fine arts at the Edinburgh College of Art. She moved to England at the end of her first year in 1972 to study at the Architectural Association. While Findlay was studying at the Architectural Association, she was tutored by Peter Cook, Christine Hawley, and Leon Van Schaik. Findlay graduated with an Architectural Association Diploma in 1979.\n\n\n== Career in Japan ==\nIn 1979 Findlay went to Tokyo. While there, Findlay worked in Arata Isozaki's office where she met her future husband, Eisaku Ushida. Findlay formed the architectural practice, Ushida Findlay, in Tokyo in 1986 with her then-husband, Eisaku Ushida. While in Japan, Findlay spent twenty years teaching and working in Japan. She was appointed as the first female academic in the Department of Architecture at the Tokyo University and the first foreigner to teach there since the 19th century Meiji Period.Ushida Findlay built the Truss Wall House (1993) and Soft and Hairy House (1994) with their practice gaining recognition.\n\n\n== Later career ==\nFindlay eventually returned to London and took her practice with her after having split from her husband in 1999. Findlay worked on notable projects such as the RIBA Nominated Grafton New Hall (2002) and Pool House 2 (2009). The practice also undertook a number of other projects that were not realized, including one for a country house in a radical 'starfish' design in Cheshire, and another for a Maggie's cancer centre for Wishaw hospital, Lanarkshire. Findlay's practice went into bankruptcy in 2004. Findlay was subsequently employed by the School of Architecture at the University of Dundee, becoming a professor of Architecture and Environment in 2006. She was elected an Associate Member of the Royal Scottish Academy in 2007. In 2012 Findlay worked as a delivery architect for Anish Kapoor's monumental ArcelorMittal Orbit for the London Olympics. Findlay was also made an Honorary Fellow of the Royal Incorporation of Architects in Scotland on the 11th of September in 2013.Just hours before her death on the 10th of January in 2014, Findlay was awarded the 2014 Jane Drew Prize 'for her outstanding contribution to the status of women in architecture'.\n\n\n== References ==\n\n\n== Further reading ==\n\"A house built on sand\". Building Design. 27 May 2010.\nTitman, Mark (2013). \"'You Can Touch But Do Not Read': The 'Future-Rustic' Work of Kathryn Findlay\". Architectural Design. 83 (3): 32–39. doi:10.1002/ad.1587.\nOstwald, Michael J. (1 April 2001). \"'Fractal Architecture': Late Twentieth Century Connections Between Architecture and Fractal Geometry\". Nexus Network Journal. 3 (1): 73–84. doi:10.1007/s00004-000-0006-1. S2CID 123159970.\n\"Should architects be looking forward to 2012?\". Building Design. 16 December 2011.\n\n\n== External links ==\nUshida Findlay\nKathryn Findlay: Back with a redefined approach (The Architects' Journal, 27 February 2009)\nhttps://www.independent.co.uk/news/obituaries/kathryn-findlay-designer-curved-andtactile-  buildings-combining-practicality-organic-or-other-worldly-presence-  9142485.html.\nhttps://www.architectural-review.com/essays/kathryn-findlay-1953-2014.\nhttps://www.royalscottishacademy.org/members/kathrynfindlay-  rsa-elect/.", "links": ["Anish Kapoor", "Arata Isozaki", "ArcelorMittal Orbit", "Architectural Association", "Architectural Association School of Architecture", "Art UK", "Cheshire", "Doi (identifier)", "Edinburgh College of Art", "Forfar", "ISBN (identifier)", "Jane Drew Prize", "London", "Maggie's Centres", "Meiji (era)", "Peter Cook (architect)", "Royal Scottish Academy", "S2CID (identifier)", "Tokyo", "Tokyo University", "University of Dundee", "Ushida Findlay Architects", "VIAF (identifier)", "Wishaw"]}