{"url": "https://en.wikipedia.org/wiki/Keishi_%C5%8Ctomo", "title": "Keishi Ōtomo", "summary": "Keishi Ōtomo (Japanese: 大友啓史, Hepburn: Ōtomo Keishi, born May 6, 1966 in Morioka, Iwate, Japan) is a Japanese film director and screenwriter. He is known for psychological thrillers and historical dramas, as well as adapting a variety of manga and novels to film, including The Vulture  (2009), Ryōmaden (2010), and the Rurouni Kenshin film series. Ōtomo’s awards include the Audience Award at the 18th Fantasia International Film Festival in Montreal (2014), the Popularity Award at the 38th Japanese Academy Awards (2014), and Best Director at the 31st Japanese Critics Award (2022).", "content": "Keishi Ōtomo (Japanese: 大友啓史, Hepburn: Ōtomo Keishi, born May 6, 1966 in Morioka, Iwate, Japan) is a Japanese film director and screenwriter. He is known for psychological thrillers and historical dramas, as well as adapting a variety of manga and novels to film, including The Vulture  (2009), Ryōmaden (2010), and the Rurouni Kenshin film series. Ōtomo’s awards include the Audience Award at the 18th Fantasia International Film Festival in Montreal (2014), the Popularity Award at the 38th Japanese Academy Awards (2014), and Best Director at the 31st Japanese Critics Award (2022).\n\n\n== Early life ==\nŌtomo was born on May 6, 1966 in Morioka City, Iwate Prefecture, Japan. He graduated from Morioka First High School before moving to Tokyo in 1986 to study at the Faculty of Law at Keio University [https://en.wikipedia.org/wiki/Keio_University]. After graduation in 1990, he joined the Japanese public television network NHK where he was assigned to their Akita Broadcasting Station as a director.\n\n\n== Career ==\n\n\n=== 1990-1999: Early directing ===\nIn addition to producing documentaries for national broadcast, From 1990 to 1994, Ōtomo was director for a variety of TV programs, including a number of regional shows aimed at teen audiences. These included the long-running singing contest NHK Nodo Jiman and High School Baseball Live . He was transferred to the Drama Programming Department from 1994, a move which enabled him to focus more on storytelling.\nIn 1997, NHK granted Ōtomo a 2-year sabbatical to study directing and scriptwriting in Los Angeles, California. During this time, he took courses at several educational institutions, including the University of Southern California. When not in classes, he worked as an on-set crew member on various Hollywood productions, where he gained a valuable understanding of the US commercial film-making industry.\n\n\n=== 1999-2010: Drama works and critical success ===\nIn 1999, Ōtomo returned to Japan to join NHK’s Division 2 Drama Department. He directed many dramas during his tenure there, including the highly acclaimed Churasan, the 64th Serial TV Novel. The series boasted an average viewer rating of 22.2% and ran for an unprecedented 4 seasons.In 2007, Ōtomo directed the action-packed corporate thriller TV series The Vulture (Hagetaka) starring Nao Ōmori. The film deftly reflected the financial shock and the growing public mistrust at the time and won numerous national and international awards the same year, including the prestigious international Prix Italia.\nFollowing this critical success, Ōtomo moved into films full-time, making his directorial debut with a film version of The Vulture, released in 2009 as a sequel to the TV drama. He won an Asian Television Award for Encouragement in 2009 for his work on Shirasu Jiro, a biographical adaptation about Jiro Shirasu, who played an active role in the reconstruction of Japan during the West’s occupation after World War II.\nIn 2010, he became the youngest Chief Director in NHK's history, and directed the 49th annual Taiga drama series, Ryōmaden. Ryōmaden won many accolades and is considered one of the most successful series to date, renewing the image of historical dramas by its innovative approaches of meticulous modern film making, which deftly incorporated the use of long takes and pursued painstaking realism in character design.\n\n\n=== 2011-present: Rurouni Kenshin and wider acclaim ===\nOn April 30, 2011, after more than a decade as a successful television and film director, Ōtomo left NHK and established his own film company, Keishi Otomo & Co, the following month.\nSeveral months later, in August 2011, Ōtomo signed a 3-film directing deal with Warner Bros. Japan, becoming the first Japanese director to receive such a large multi-picture deal. The first of these films, Rurouni Kenshin, based on the popular manga series of the same name, was theatrically released on August 25, 2012 in Japan. With its period setting, intricate plot (based on the popular manga series), and unusual degree of high-speed action, film captivated audiences, going on to gross $36 million domestically. The film was also well received internationally, and was invited to screen at the Busan International Film Festival, which included a Q&A with the lead actor, Takeru Sato. The film went on to be shown in 64 countries and 2 territories worldwide, grossing over $60 million internationally.\nIn 2013, Ōtomo directed Platinum Data, a cautionary mystery-thriller about overreliance on DNA analysis in investigations, set in the near future. Released by Toho, the film recorded the highest first-day advance ticket sales of any Toho film to date at the time (103,655 tickets) and grossed 2.7 billion yen ($26.1 million) in Japan.\nThe following year, Ōtomo directed 2 much-anticipated sequels to Rurouni Kenshin, produced back-to-back. The first sequel, Rurouni Kenshin: Kyoto Inferno, was released domestically on August 1, 2014, becoming the most popular live-action film of the year and cementing the series as one of the most successful film franchises in Japan. The third film, Rurouni Kenshin: The Legend Ends followed shortly after on September 13, 2014. The 2 films were both commercial hits, grossing 5.25 billion yen ($52.9 million) and 4.39 billion yen ($44 million) respectively. As with the first film, both were also critical successes, winning awards at film festivals in Japan and abroad, including the Audience Award at the 18th Fantasia International Film Festival and the Popularity Award at the 38th Japan Academy Film Prize.In August of the same year, the Asian premiere was held at the \"SM MEGA MALL\" shopping center in the center of Manila, Philippines, and was attended by approximately 11,000 local fans over the course of two days and was screened in 64 countries around the world, including Asia and Europe.\nOn August 6, 2016, Ōtomo released a live-action film adaptation of the popular manga Himitsu - Top Secret. (winner of the Excellence Award in the Manga Division of the 15th Japan Media Arts Festival) which explores the repercussions of probing the memories of the dead, was released.\nThe same year, Ōtomo released another manga film adaptation, Museum, which opened in Japan on November 12, 2016. The film was released to commemorate the 25th anniversary of WOWOW. The film marked his first successful foray into the horror-suspense genre and received awards from both the 29th Tokyo International Film Festival and Busan International Film Festival. The film was also an official selection at the fantasy and horror-orientated Festival Internacional de Cinema Fantàstic de Catalunya.\nIn 2017, a live-action film adaptation of March Comes in Like a Lion —based on the highly acclaimed manga of the same name—which won first place in the \"Book of the Year\" comic category in Da Vinci magazine for three consecutive years and later won the grand prize in the manga category at the 24th Japan Media Arts Festival Awards—was released in two consecutive parts (first part: March 18, second part: April 22) and was also shown at the 20th Shanghai International Film Festival.\nIn a span of approximately 18 months between 2018 and 2019, Ōtomo filmed Million Dollar Man (Okuotoko), Beneath the Shadow (Eiri), and the final two installments of Rurouni Kenshin in rapid succession.\nMillion Dollar Man (Okuotoko)  was based on Genki Kawmura’s novel which was nominated for the 12th annual Japan Bookseller’s Award (Honya Taisho Award,2015) and featured extensive international filming in Morocco, was released on October 19, 2018.\nOn February 14, 2020, Beneath the Shadow (Eiri) (winner of the 157th Akutagawa Prize, Ōtomo’s first foray into arthouse films, was released. Shot entirely on location in his hometown of Morioka, Iwate Prefecture, explored loss and resilience in the aftermath of the devastating Great East Japan Earthquake. Beneath the Shadow was the only Japanese film selected for the Competition section of the 2nd Hainan Island International Film Festival, where it made its world premiere. Ryuhei Matsuda, one of the leading actors in the film, received the Best Actor Award.In 2020, Ōtomo signed a management deal with LUKA Productions International, a production company based in Hollywood and is currently managed overseas by LUKA Management, a subsidiary of LUKA Productions International.\nRurouni Kenshin: The Final and Rurouni Kenshin:The Beginning, a two-part film which the theatrical release was postponed for one year due to the Covid-19 pandemic, and was released on April 23 and June 4, 2021. Even though a state of emergency was declared in Japan and theaters across major cities such as Tokyo and Osaka closed on the third day of its release, The Final was a smash hit, grossing 4.35 billion yen ($37.8 million) at the box office. The Beginning also went on to bring in an additional 2.50 billion yen ($21.3 million), making it the first franchise in Japan to take the No. 1 and 2 spot at the box office. ,The Rurouni Kenshin series has garnered international acclaim. The first overseas screening of all five films and the international premiere of the final two parts were held at the 24th Shanghai International Film Festival to an enthusiastic audience, the first franchise outside of Hollywood to do so.Soon after the film's release in Japan, the films were made available for viewing on Netflix for the global fan base. The film achieved the highest viewer ranking of No. 4 worldwide, including English-speaking countries. The unprecedented critical and financial success of the franchise helped revitalize the manga-to-live-action adaptations in Japan.\nHis latest film will be released in 2023.\n\n\n== Filmography ==\n\n\n=== Films ===\nRurouni Kenshin live-action film series\nRurouni Kenshin, 2012 (also as scriptwriter)\nRurouni Kenshin: Kyoto Inferno, 2014 (also as scriptwriter)\nRurouni Kenshin: The Legend Ends, 2014 (also as scriptwriter)\nRurouni Kenshin: The Final, 2021 (also as scriptwriter)\nRurouni Kenshin: The Beginning, 2021 (also as scriptwriter)\nHagetaka (The Vulture), 2009\nPlatinum Data, 2013\nMuseum, 2016\nThe Top Secret: Murder in Mind, 2016 (also as scriptwriter)\nMarch Comes In like a Lion/March Comes In Like a Lamb, 2017 (also as scriptwriter)\nMillion Dollar Man, 2018 (also as scriptwriter)\nBeneath the Shadow, 2020\nThe Legend and Butterfly, 2023\n\n\n=== Television series ===\nHideyoshi (NHK, 1996)\nChurasan (NHK, 2001)\nHagetaka: Road to Rebirth (NHK, 2007)\nShirasu Jiro (NHK, 2009)\nRyōmaden  (NHK, 2010)\n\n\n== Awards and Recognition ==\nHagetaka (2007）\n\n59th Italian Awards for Best Series Drama\nThe 33rd Hoso Bunka Foundation Award, Main Prize (Program Category, TV Drama Program)\nAsian Television Awards 2007, Grand Prize in the Series Drama Category\n44th Galaxy Award for Excellence\nMy Best TV Award Grand Prix\n32nd Hélandres Award for Best Film, TV Guide Award\nSpecial Mosfilm Award at the 32nd Golden Chest International Television FestivalShirasu Jiro (2009）\n\nAward of Excellence, 64th Japan Arts Festival\nAsian Television Awards 2009, Jury's Encouragement Award, Series Drama DivisionRyomaden (2010）\n\nTokyo Drama Award 2010 Excellence Prize\n2011 Hélandres Award for Best Film\nThe 1st Location Japan Grand Prize\n37th Hoso Bunka Foundation Award for Excellence (Program Division TV Drama Program)\nTeamwork of the Year (Sponsored by the Logical Teamwork Committee)Rurouni Kenshin (2012)\n\n1st Japan Action Award, Grand Prize for Best Action, Best Action Film Grand Prize\n30th Golden Gross Special Award, Zenkoren Special AwardRurouni Kenshin: Kyoto Inferno/The Legend Ends (2014)\n\nAudience Award, 18th Fantasia International Film Festival\n38th Japan Academy Film Prize, Popularity Award\n27th Nikkan Sports Film Awards, Yujiro Ishihara Award\n69th Mainichi Film Contest, TSUTAYA Film Fan Award\nThe 3rd Japan Action Awards Prizes\n32nd Golden Gross Awards, Best PictureRurouni Kenshin: The Final/The Beginning (2021)\n\nThe 76th Mainichi Film Contest, TSUTAYA Film Fan Award 2021\n2022 VFX-JAPAN Award, Best PictureDirecting Awards\n\nHitmaker of the Year (Nikkei Entertainment!)\n37th Hoso Bunka Foundation Award for Individual Achievement (Direction)\n31st Japanese Critics Award, Best Director\n\n\n== References ==\n\n\n== External links ==\nKeishi Ōtomo at IMDb", "links": ["Akutagawa Prize", "Asadora", "Asian Television Awards", "Busan International Film Festival", "Fantasia International Film Festival", "Hepburn romanization", "Hideyoshi (TV series)", "Himitsu – Top Secret", "IMDb", "ISNI (identifier)", "Iwate Prefecture", "Japan", "Japan Academy Film Prize", "Japan Booksellers' Award", "Japanese language", "Japanese people", "Jirō Shirasu", "Keio University", "MBA (identifier)", "March Comes In like a Lion", "March Comes In like a Lion (film)", "Morioka", "Museum (2016 film)", "NHK", "NHK Nodo Jiman", "Netflix", "Nikkei Entertainment", "Prix Italia", "Rurouni Kenshin", "Rurouni Kenshin: Kyoto Inferno", "Rurouni Kenshin: The Beginning", "Rurouni Kenshin: The Final", "Rurouni Kenshin: The Legend Ends", "Rurouni Kenshin (film)", "Ryuhei Matsuda", "Ryōmaden", "SUDOC (identifier)", "Shanghai International Film Festival", "Sitges Film Festival", "Taiga drama", "Takeru Satoh", "Toho", "Tokyo International Film Festival", "University of Southern California", "VIAF (identifier)", "Wowow"]}