{"url": "https://en.wikipedia.org/wiki/Kellie_Castle", "title": "Kellie Castle", "summary": "Kellie Castle is a castle just outside Arncroach and below the dominant hill in the area, Kellie Law.  it is about 4 kilometres north of Pittenweem in the East Neuk of Fife, Scotland.", "content": "Kellie Castle is a castle just outside Arncroach and below the dominant hill in the area, Kellie Law.  it is about 4 kilometres north of Pittenweem in the East Neuk of Fife, Scotland.\n\n\n== Early history ==\nThe earliest records of Kellie go back to 1150 where it is mentioned in a charter issued by King David I. The first known owner was Robert of London, the illegitimate son of King William the Lion. By 1266 Kellie had passed to the Siward family, who had hailed from Northumbria and had assisted King Malcolm Canmore to overthrow Macbeth. The Siewards supported England during the wars of independence (1296-1328) and as a result Sir Richard Sieward forfeited his lands in Scotland after Bannockburn. However his daughter Helena Sieward, “Lady Kellie” retained Kellie.  None of the buildings they occupied appear to have survived.\nIn about 1360 Helena, or Elena, assigned Kellie to her kinsman Walter Olifard (or Oliphant) of Aberdalgie who was married to Elizabeth, a daughter of Robert the Bruce.  Thus began 250 years of occupation by the Oliphant family.  The estate was signed over to a Siward relative, Walter Oliphant, in 1360 and the castle remained in the  ownership of the Oliphant family until 1613. It was purchased by Sir Thomas Erskine, who had saved the life of King James VI during the Gowrie Conspiracy by killing Sir Alexander Ruthven. The King stayed at Kellie in 1617 during his only visit to Scotland after the Union of the Crowns, and he appointed Erskine as Earl of Kellie in 1619.\nIt is likely that the ceiling of what is now the library in the 1573 east tower was decorated in plaster in anticipation of a Royal visit by King James. This room may be the first in Scotland where plaster decoration was used ‘in the London style’ in preference to the painted beams and boarded ceilings that were generally fashionable in the early 17th century.  Incorporated in the ceiling is the date \"1617\" and monogram \"T V F\" for Thomas Viscount Fenton, which title the King awarded Thomas Erskine in 1606.\n\nOriginally a simple tower house, the lower section of what now constitutes the northwest tower is the oldest part of the castle, dating from around 1360, and is said to be haunted. In 1573 a new tower was built by the 4th Lord Oliphant to the east of the original tower. It is believed that the 4th Lord built the east tower as a jointure-house (a property set aside for the wife after the husband's death) for his wife Margaret.  Between 1573 and 1606 the two towers were linked by a new range, terminated by another tower in the south-west, creating the T-plan layout that remains today. The castle is a fine example of Scots Baronial domestic architecture, with an imposing mix of gables, corbelled towers, and chimneys.\n\n\n== Recent history ==\nMethven Erskine the 10th Earl of Kellie died in 1829 to be succeeded by John Francis Miller Erskine as 11th Earl of Kellie. The castle was abandoned by Erskine and cleared of its contents at a muckle roup (public auction) in 1830. John Francis Miller Erskine was confirmed as 26th Earl of Mar in 1835 and the Earldom of Kellie was united with the Earldom of Mar. The property then seems to have fallen to James Maitland Hog of Newliston (thereafter titled \"of Newliston and Kellie\") but Hog made little use of the estate, and the castle lay abandoned for many years. In 1878 it was rented from the Earl of Mar and Kellie by James Lorimer, Regius Professor of Public Law at Edinburgh University, and father to Sir Robert Lorimer, the renowned Scottish architect. The Lorimer family set about restoring the castle for use as a holiday retreat, but it soon became the family home. Robert Lorimer was instrumental in much of the restoration work, restoring magnificent plaster ceilings, painted panelling and furniture.\nThere are examples of Robert Lorimer’s work as an architect across the world.  At Kellie we have the doocot and garden house as well as the restoration of the garden with his sister Caroline-Louise.  The Kellie Castle survey drawing (1887) featured at Kellie, illustrates his draftsmanship.  Close to Kellie is the renovation and extension of Lundie Cottage (1902) in Arncroach.  The interesting dormer windows can be seen from the roadway, opposite the church, as you drive west into the village.\nFollowing the death of the professor the tenancy was taken by his wife Hannah in 1890. Robert Lorimer began the first of his alterations in 1900: building a doocot and garden house.On the death of Hannah in 1916 the tenancy was taken over by their son, John Henry Lorimer the famous Scottish painter.  Robert then began work on restoring the main house, this previously having been resisted by Hannah.Upon John's death in 1936, the tenancy lapsed and the house was cleared and the castle once again became vacant.  In 1936 Sir Robert's son, the sculptor Hew Lorimer and his wife Mary, renewed the Lorimer tenancy.  Hew and Mary Lorimer purchased the castle in 1948 and it remained in his ownership until 1970. Between 1970 and 1990 Hew continued to live in part of the castle and used the stable block as his studio.\n\n\n== Present day ==\nHew Lorimer sold the castle, together with 6.5 hectares of gardens and an organic walled garden to the National Trust for Scotland in 1970. The walled garden is 17th century, with late Victorian additions, and contains a fine collection of old-fashioned roses, fruit trees and herbaceous plants.\nThe main castle contents were given into the care of the Trust by the Secretary of State for Scotland and, in 1998 the Trust purchased the Lorimer family artifacts. Amongst these artifacts are included paintings by Hannah Cassels im Thurn, the eldest daughter of Hannah and James Lorimer. The castle and gardens are open to the public, and there is a permanent exhibition of Hew Lorimer's work and studio in the old stables.\n\n\n== Interior ==\nPhoebe Anna Traquair, who was an outstanding proponent of the Arts and Crafts philosophy, completed the painted panel above the fireplace in the drawing room in  1897.   The painting is based on Botticelli's Primavera and was completed when John Henry Lorimer lived in the castle.  Hew and Mary Lorimer, who took over the tenancy after John Henry, apparently did not like the painting and they had it covered in the late 1940s.  They were careful not to damage the painting and they used cartridge paper with flour paste.  The painting was restored in 1996 by the National Trust for Scotland following the death of Hew Lorimer who had remained at Kellie and lived in part of the east tower of the castle until 1990.\nThe tapestry now in the dining room is made up of at least two, possibly three, different tapestries.  The centre and main element is a Flemish tapestry (1580) that depicts Europa and the Bull.  This tapestry used to be located in the drawing room as illustrated in a Country Life photograph taken in 1964.  The beauty of Europa inspired the love of Zeus, who approached her in the form of a white bull. He carried her away from Phoenicia to Crete.  The Latin inscription, which does not refer or relate to the main tapestry –‘The young man has saved his wounded father, carried him back and put him on his horse'. The borders have been added at some later time.\nIn the 1930s John Henry Lorimer was vice-president of what was then known as the Edinburgh Astronomical Association and now the Astronomical Society of Edinburgh.  Upon his death in 1936 he left a substantial legacy to the society who now award a medal in his honour. The society owns a bust of John Henry and two of his paintings.  The bust and both paintings, “Sunlight in the South Room, Kellie” and “The Long Shadows”, are exhibited at Kellie Castle.\nThe largest room in the castle, used by the Lorimers as the drawing room, is the Great Hall, completed circa 1606.  On the west wall are two mirrors with eagle cresting, designed by Sir Robert Lorimer and made by Whytock and Reid of Edinburgh.  These mirrors, hanging on either side of the west window, appear to have a magical effect.  No matter how far back you go, your image appears to stay the same size.\n\n\n== See also ==\nEarl of Kellie\nList of places in Fife\nList of National Trust for Scotland properties\n\n\n== References ==\n\n\n== External links ==\nKellie Castle on National Trust for Scotland website\nKellie Castle on the Gazetteer for Scotland\nFife Place-name Data :: Kellie\nKellie Castle Grounds Virtual Tour", "links": ["Alexander Ruthven", "Architect", "Arncroach", "Arts and Crafts", "Astronomical Society of Edinburgh", "Botticelli", "Castle", "Charter", "Chimney", "Corbel", "Country Life (magazine)", "Crete", "David I of Scotland", "Doi (identifier)", "Doocot", "Earl of Kellie", "Earl of Mar and Kellie", "East Neuk", "Europa (consort of Zeus)", "Fife", "Furniture", "Gable", "Geographic coordinate system", "Ghost", "Hannah Cassels im Thurn", "Hew Lorimer", "ISBN (identifier)", "James I of England", "James Lorimer (advocate)", "James Maitland Hog", "John Henry Lorimer", "John Ruthven, 3rd Earl of Gowrie", "Kellie's Castle", "List of National Trust for Scotland properties", "List of places in Fife", "Macbeth of Scotland", "Malcolm III of Scotland", "National Trust for Scotland", "Newliston", "Northumbria", "Oliphant family", "Panelling", "Phoebe Anna Traquair", "Phoenicia", "Pittenweem", "Plaster", "Primavera (Botticelli)", "Regius Professor", "Robert Lorimer", "Robert the Bruce", "Scottish baronial style", "Secretary of State for Scotland", "Thomas Erskine, 1st Earl of Kellie", "Tower house", "Union of the Crowns", "University of Edinburgh", "Victorian architecture", "Walled garden", "William I of Scotland"]}