{
    "url": "https://en.wikipedia.org/wiki/Kieran_Campbell",
    "title": "Kieran Campbell",
    "summary": "Kieran Campbell (born 6 July 1979) is a former Irish rugby union scrumhalf, former manager of Ulster Rugby's academy, and former head coach of the Ireland under-20 team.\nBorn in Hillingdon to an Irish father and Sri Lankan mother, Campbell was a key player for Gunnersbury Catholic School and helped them reach the last eight of the Daily Mail school's cup and to win the Middlesex School's County cup three years in a row.  From a young age he excelled at sports including Gaelic football and played for his local side Heston Gaels.",
    "content": "Kieran Campbell (born 6 July 1979) is a former Irish rugby union scrumhalf, former manager of Ulster Rugby's academy, and former head coach of the Ireland under-20 team.\nBorn in Hillingdon to an Irish father and Sri Lankan mother, Campbell was a key player for Gunnersbury Catholic School and helped them reach the last eight of the Daily Mail school's cup and to win the Middlesex School's County cup three years in a row.  From a young age he excelled at sports including Gaelic football and played for his local side Heston Gaels.\n\n\n== Professional ==\nCampbell started his professional playing career in 1997 at London Irish and was part of the Under 19 World Cup winning side of 1998. After four seasons with the exiles he joined Ulster Rugby at the start of the 2001–02 season. However, he would have to wait until the start of the 2003 season before he would emerge as a first team regular overhauling the scrumhalf Neil Doak.\nThe 2003–04 season was to be the most important in his career. After succeeding Neil Doak for the scrumhalf position at Ulster Kieran was to enshrine himself in the Ravenhill faithful for a stunning individual try scored against Stade Français during the December 2004 Heineken Cup match. His performances through this season were instrumental in gaining a place on the Ireland's summer tour of Japan in 2005.\nFollowing in his breakthrough to the Irish national squad Campbell continued with a successful 2006–07 season where he would win a further 21 caps with Ulster. His performances were good enough to grant him a place in the Ireland A squad for the Churchill Cup during May 2007.\nIt was however the emergence of Isaac Boss at Ulster and his subsequent breakthrough into the Irish National side that was to allow Campbell to leave the Ravenhill setup in 2008 after seven seasons to join fellow Celtic League team Connacht.\n\n\n== Coaching ==\nCampbell joined the Ulster Rugby academy in 2012 as Elite Performance Officer and backs specialist. He was appointed acting academy manager in July 2014, before taking on the job on a permanent basis in February 2015.He was an assistant coach for the Ireland under-20 team at the 2017 World Rugby Under 20 Championship and the 2019 Six Nations Under 20s Championship. In January 2021 he was appointed the Ireland under-20s head coach, which he will combine with his role with the Ulster academy. He left his positions with the Ulster academy and the Ireland under-20s in the summer of 2021.\n\n\n== Personal life ==\nKieran is married to Orla.\n\n\n== References ==\n\n\n== External links ==\nUlster profile",
    "links": [
        "2009 Rugby World Cup Sevens",
        "2017 World Rugby Under 20 Championship",
        "2019 Six Nations Under 20s Championship",
        "Belfast Harlequins",
        "Brian Carney (rugby)",
        "Brunel University London",
        "Churchill Cup",
        "Conan Doyle (rugby union)",
        "Connacht Rugby",
        "Daniel Riordan (rugby union)",
        "Dungannon RFC",
        "England",
        "Felix Jones (rugby union)",
        "Gary Brown (rugby union)",
        "Gunnersbury Boys' School",
        "Gunnersbury Catholic School",
        "Heineken Cup",
        "Hillingdon",
        "Ireland Wolfhounds",
        "Ireland national rugby sevens team",
        "Ireland national rugby union team",
        "Ireland national under-20 rugby union team",
        "Isaac Boss",
        "James Coughlan",
        "Kyle Tonetti",
        "London",
        "London Irish",
        "Neil Doak",
        "Paul Marshall (rugby union)",
        "Pro14",
        "Rugby union",
        "Stade Français",
        "Tom Gleeson (rugby union)",
        "Ulster Rugby"
    ]
}