{"url": "https://en.wikipedia.org/wiki/Kilambakkam_bus_terminus", "title": "Kilambakkam bus terminus", "summary": "Vandalur Kilambakkam Bus Terminus is under construction in Kilambakkam on GST Road, Chennai to catering the southern Tamil Nadu bus services. Spread over an area of 88.52 acres (358,200 m2), it is built to decongest the Chennai Mofussil Bus Terminus in Koyambedu. It will chiefly handle buses to southern Tamil Nadu, including cities such as Kanniyakumari, Madurai, Thoothukudi, Tiruchirappalli, Tirunelveli, Tiruvannamalai, Thanjavur and Villupuram. It is an integrated bus terminus of mofussil buses of government buses, omni buses, and MTC buses.\n\n", "content": "Vandalur Kilambakkam Bus Terminus is under construction in Kilambakkam on GST Road, Chennai to catering the southern Tamil Nadu bus services. Spread over an area of 88.52 acres (358,200 m2), it is built to decongest the Chennai Mofussil Bus Terminus in Koyambedu. It will chiefly handle buses to southern Tamil Nadu, including cities such as Kanniyakumari, Madurai, Thoothukudi, Tiruchirappalli, Tirunelveli, Tiruvannamalai, Thanjavur and Villupuram. It is an integrated bus terminus of mofussil buses of government buses, omni buses, and MTC buses.\n\n\n== Timeline ==\nNew bus stand project was announced by former Chief Minister J. Jayalalithaa on 30 April 2012. The proposed bus stand would be located in Vandalur zone.\nThe 88 acres for building the bus terminus lies within protected and prohibited zone of Archaeological Survey of India as it contains \"Megalithic Burial Sites.\" According to an amendment to the Ancient Monuments and Archaeological Sites and Remains Act (AMASR Act) in January 2010, all constructions are banned within 100 metres of ASI-protected areas and any construction or reconstruction or repair of a building with 200 metres of such areas requires permission from NMA.Chennai Metropolitan Development Authority (CMDA) asked Reach Foundation to undertake the Heritage Impact Assessment for development of the terminus and submit a report. NMA gave its clearance for construction of bus terminus with a total height of 34 metres on five conditions. These include that there should be no development in the 100 metre prohibited area except greenery; boundary of the site and signages should be done by the State government; space for education and interpretation of the site for public; involvement of archaeologist at the time of excavation and mitigation measures to be taken at the time of construction.The foundation stone was laid on 22 February 2019 by the Tamil Nadu Chief Minister Edappadi K. Palaniswami. The proposed terminus will be built at a cost of ₹ 3,940 million. The design and engineering consultant is C.R. Narayana Rao (Consultants) Private Limited for this project.\n\n\n== Facilities ==\nThe size of the land earmarked for the project is 88.52 acres. The total built-up area is 640,000 square feet with 215 bus bays, including 130 bays for government buses and 85 bays for omni buses, besides 3.99 acre area of parking spaces for 300 spare buses, 1.99 acre area for 275 cars and 3,582 two wheeler at any given time.The proposed terminus will have 2,014-square-meter area of public lobby with the following facilities: \n\n\"Mother's room\", medical centre, clinic, two store room, cloak room and an ATM\nA gents dormitory to accommodate 100 males and Ladies Dormitory to accommodate 40 females; 4 nos of driver dormitory to accommodate for 340's drivers\nFour toilet blocks on the ground floor, a security/CCTV room, six electrical room and control room\n20 ticket counters, 3 transport offices and 3 time offices\n2 restaurants over 405 square meters, 40 retail stores across an area of 1,402 square meters\nFire service station over 0.54 acre/Electrical sub station across 0.98 acre/sewage treatment plant across 0.96 acre\n\n\n=== Bus Bays ===\nThe terminus has 14 platforms in 8 bus fingers.\nMofussil bus bays have been designed in a space of 14 acres to accommodate 130 government buses and 85 omni buses, offering connectivity to cities and towns in the southern parts of Tamilnadu.\nAn MTC bus terminus has also been planned in a space measuring 7.4 acres adjacent to GST Road, with a platform 1,100 metres long and four metres wide, covered with roofing eight metres wide.\nA space of two acres has also been earmarked for a bus depot with a workshop.\n\n\n== Metro ==\nAn extension of the Chennai Metro Blue Line to the bus terminus has been announced, with a feasibility study completed and land surveys in progress.\n\n\n== See also ==\nChennai Mofussil Bus Terminus metro station\nChennai Contract Carriage Bus Terminus\nMadhavaram Inter-city Bus Terminus\nChennai Central\nTransport in Chennai\n\n\n== References ==", "links": ["Ancient Monuments and Archaeological Sites and Remains Act", "Archaeological Survey of India", "CMBT", "Chennai", "Chennai Central", "Chennai Contract Carriage Bus Terminus", "Chennai Metro", "Chennai Metropolitan Development Authority", "Chennai Mofussil Bus Terminus metro station", "Edappadi K. Palaniswami", "GST Road", "J. Jayalalithaa", "Kanniyakumari", "Kilambakkam", "Koyambedu", "Madhavaram Inter-city Bus Terminus", "Madurai", "Metropolitan Transport Corporation (Chennai)", "Thanjavur", "Thoothukudi", "Tiruchirappalli", "Tirunelveli", "Tiruvannamalai", "Transport in Chennai", "Vandalur", "Villupuram"]}