{"url": "https://en.wikipedia.org/wiki/Kilmuckridge", "title": "Kilmuckridge", "summary": "Kilmuckridge (Irish: Cill Mhucraise), formerly Ford or The Ford, is a village in County Wexford in Ireland, near the Irish Sea coast. As of the 2016 census, the village had a population of 722 people, having more than tripled in size (from 235) in the 20 years since the 1996 census. It is known for the nearby beach at Morriscastle.", "content": "Kilmuckridge (Irish: Cill Mhucraise), formerly Ford or The Ford, is a village in County Wexford in Ireland, near the Irish Sea coast. As of the 2016 census, the village had a population of 722 people, having more than tripled in size (from 235) in the 20 years since the 1996 census. It is known for the nearby beach at Morriscastle.\n\n\n== History ==\nThe village is in the civil parish of Kilmuckridge and in the Catholic parish of Litter (from the Irish language Leitir, meaning a hillside). On older maps, the village is sometimes referred to by its older name of Ford, or The Ford. The name Kilmuckridge originally referred to a small road junction about 1.5 km from the main village and site of the Church of Ireland church. This junction was previously the location of the village post office and it is said that when the post office was moved to The Ford, the latter placename gradually declined in use.\nNearby Morriscastle was once the site of a castle belonging to a prominent Gaelic family. By the 19th century, this castle was in ruins, and it was demolished in 1936. It was succeeded by a later castle, owned by the Annesley family, the ruins of which can be seen to the south of the roadway. \nWells House has a history dating back to the 1600s.The local Roman Catholic church was built in 1796. The Church of Ireland church dates from 1815. The graveyard next to the Church of Ireland church also contains the remains of members of the Catholic Church, with a \"sailor's hole\" for the bodies of sailors washed ashore. The village also has a historic graveyard at Killincooley with a holy well.Several Kilmuckridge people played a part in the Irish Rebellion of 1798, including John Murphy of nearby Boolavogue. Local participants were said to have rendezvoused at a local site known as Hatter's Bridge before proceeding to battle at the Battle of Oulart Hill.There are no listed shipwrecks off Morriscastle but several have occurred in the general area, including the clipper ship Pomona, which ran aground off Ballyconigar in 1859 while en route from Liverpool to New York and sank with the loss of nearly four hundred people, mostly poor Irish people. Additionally, a 61-ton coal boat named the Lavinia was wrecked at Tinnaberna in 1915.On 14 November 1815, twenty-four local fishermen were lost in a storm, having sailed from Tinnaberna. The disaster is said to have left nineteen widows and had a long-term impact on the population of the small settlement at Tinnaberna. The disaster was largely forgotten, commemorated mainly in a local ballad, but was revived due following the unveiling of a memorial plaque on the two-hundredth anniversary in 2015. Another local ballad commemorates the 1885 rescue of a sailing ship, the Vivandiere, which had been abandoned by her crew and set adrift. The ship was boarded near Tinnaberna by local men, who later profited from its salvage.The Tithe Applotment Books contain data for the parish of Kilmuckridge in 1833. Griffith's Valuation was completed for County Wexford in 1854, and data for Kilmuckridge can be found here. The 1901 census also holds details of households in the Kilmuckridge area in the District Electoral Division of Ballyvaldon.A number of local men were involved in the Irish republican movement, including Laurence 'Lar' Redmond and Jim O'Brien, both of the Morriscastle area, who served in the Irish Republican Brotherhood. Redmond claimed to be a descendant of John Murphy (of the 1798 Rebellion) and was active in Enniscorthy in the 1916 Rising. He was elected as a councillor in the district of Gorey. On 14 August 1920, he was part of a company of men that set fire to the Royal Irish Constabulary barracks on the road to Morriscastle. Redmond and his colleagues also set fire to the coast guard station at Morriscastle in July 1921. Jim O'Brien was shot dead by members of the Royal Irish Constabulary in Rathdrum, County Wicklow, on 12 February 1920, during the Irish War of Independence. At the time, he was an IRA commandant and the officer commanding the East Wicklow Brigade. A plaque in Market Square, Rathdrum, commemorates the shooting. In April 2016, a memorial stone was unveiled to commemorate local participants in the 1916 Rising.The lives of Redmond, O'Brien and their colleagues contrast with another local man of the same era, Tom Ryan (1873-1958), who joined the British Army as a teenager and saw active service in South Africa, France and Palestine. He rose to the rank of lieutenant colonel and later joined the army of the Irish Free State. He remained prominent in Wexford life and his love of his childhood home is evident in his poetry. As one local historian described: \"Tom Ryan, like all poets and literary persons lived imaginatively, in a parallel universe that both represented and re-ordered his life experience: the homely places, the touching scenes and drama of his childhood memories of Tinnaberna.\"During World War 2, the area saw three plane crashes. On 29 September 1940, an RAF Hawker Hurricane crash-landed in the townland of Ballyvadden, having taken part in an aerial skirmish off the coast. The aircraft was one of eight sent from Pembrey, Wales to intercept a group of German bombers heading for Liverpool. The RAF pilot was unhurt in the crash and was interned at The Curragh before escaping back to Britain and subsequently being killed the following year. His Canadian-built aircraft was repaired, bought by the Irish Air Corps and flown until 1946. Of the German aircraft downed in the skirmish, the body of a German airman washed ashore near Kilmuckridge and was initially buried in the sailor's hole at the old graveyard, before later reinternment elsewhere. In May 1941, a German Heinkel He 111 bomber crashed in the sea and sank near the Blackwater lightship, with two recorded fatalities. Two survivors came ashore in a liferaft and were treated hospitably by a local priest before their internment at The Curragh. In 1945, an American Martin Marauder aircraft crashed at Killenagh, with no fatalities.\n\n\n== Tourism ==\n\nThe local beaches are a tourism attraction of the area, part of a long stretch of unbroken sandy beach that connects Cahore to Raven Point.\nMorriscastle, the largest beach, is used by swimmers, walkers, horse riders and anglers, and is the focal point for a cluster of holiday home developments, caravan parks and camp sites. As of 2019, the beach held a Blue Flag award, granted due to its water quality, safety, well-managed environment and local services. Morriscastle beach was listed (at number 5) in a 2016 article in the Irish Times titled \"50 great Irish beaches\".Other beaches nearby include Ballinoulart, Tinnaberna and Ballynamon. The local coast is host to some rare flora and fauna and is part of a national heritage site, Kilmuckridge-Tinnaberna Sandhills. A substantial wind farm, Ballywater Wind Farm, is located near Ballinoulart beach. Fish which are caught in the area include bass and flounder, and a small number of local boats still trawl for herring in the early winter.\nKilmuckridge contains a number of historical buildings as well as restaurants, guesthouses, pubs, and shops.\nBlackwater Golf Course is located about five kilometres from Kilmuckridge.\n\n\n== Sport ==\nKilmuckridge's local GAA club is Buffers Alley, which is shared with the neighbouring village of Monamolin and based at Ballinastraw. It is predominantly a hurling and camogie club but also fields teams in junior Gaelic football.\nThe club's hurling won the 1989 All-Ireland Senior Club Hurling Championship, becoming the first Wexford team to do so. As of 2012, the club has won twelve Wexford Senior Hurling Championship titles, all in a period from 1968 to 1992. Players of this period included Tony Doran, Colm Doran, Mick Butler, Henry Butler, and Tom Dempsey.\nBuffer's Alley's camogie team also has several national successes, winning the All-Ireland Senior Club Camogie Championship five times in a six-year period from 1979 to 1984, jointly making it the competition's most successful team, until being surpassed some years later by St Paul's Camogie Club of Kilkenny.\nThe local soccer club is St Joseph's, which is based at Grove Park in the centre of Kilmuckridge.\nAside from the area's beaches, the locality has several running and walking routes. These include a loop around Ballinlow lane (5.2 km), from the village to Morriscastle Beach (3.1 km), along the beach from Morriscastle to Tinnaberna (4.6 km) and from Tinnaberna to the village (4.4 km).\n\n\n== Transport ==\nThe village is located approximately 119 kilometres from central Dublin via the M11/N11 National Primary Route, exiting near Gorey. The village lies on the R742 regional road 22 km (14 mi) south of Gorey, but many locals take the R741 regional road. Wexford town is a further 24 km south.\nBus Éireann local route 379 serves the village.\n\n\n== Arts ==\nThe village hosts the annual Kilmuckridge Drama Festival, which has been running since the 1950s. In April 2015, the village hosted the All-Ireland Confined Drama Finals.Local band The Jades finishing as runners-up on the RTÉ series You're a Star during the 2000s.\n\n\n== See also ==\nList of towns and villages in Ireland\nMarkéta Irglová\nWexford Rebellion\n\n\n== References ==\n\n\n== External links ==\nA local history project which details sites of historical interest", "links": ["1916 Rising", "Adamstown, County Wexford", "All-Ireland Senior Club Camogie Championship", "All-Ireland Senior Club Hurling Championship", "Arthurstown", "Ballycanew", "Ballycullane", "Ballyedmond", "Ballygarrett", "Ballyhack, County Wexford", "Ballymurn", "Ballywater Wind Farm", "Ballywilliam", "Bannow", "Barntown", "Battle of Oulart Hill", "Blackwater, County Wexford", "Blue Flag beach", "Bree, County Wexford", "Bridgetown, County Wexford", "British Army", "Broadway, County Wexford", "Buffers Alley GAA", "Bunclody", "Bus Éireann", "Camogie", "Camolin, County Wexford", "Campile", "Castlebridge", "Castletown, County Wexford", "Catholic Church", "Church of Ireland", "Civil parishes in Ireland", "Cleariestown", "Clogh, County Wexford", "Clohamon", "Clongeen", "Clonroche", "Colm Doran", "Coolgreany", "Counties of Ireland", "County Wexford", "County town", "Courtown", "Craanford", "Crossabeg", "Cullenstown", "Curracloe", "Daylight saving time", "Dublin", "Duncannon", "Duncormick", "Dáil Éireann", "Enniscorthy", "Fauna (animals)", "Ferns, County Wexford", "Fethard-on-Sea", "Flora (plants)", "Foulkesmill", "France", "Gaelic Athletic Association", "Gaelic football", "Geographic coordinate system", "Gorey", "Griffith's Valuation", "Hawker Hurricane", "Heinkel He 111", "Henry Butler (hurler)", "Heritage site", "Herring", "Hollyfort", "Hurling", "Inch, County Wexford", "Irish Air Corps", "Irish Free State", "Irish Rebellion of 1798", "Irish Republican Brotherhood", "Irish Sea", "Irish Standard Time", "Irish Times", "Irish War of Independence", "Irish language", "John Murphy (priest)", "Kilkenny", "Killinierin", "Kilmore, County Wexford", "Kilmore Quay", "Kilmuckridge-Tinnaberna Sandhills", "Kilmyshall", "Kiltealy", "Leinster", "Lieutenant colonel", "Lightvessel", "List of cities, boroughs and towns in the Republic of Ireland", "List of townlands of County Wexford", "List of towns and villages in the Republic of Ireland", "Liverpool", "Markéta Irglová", "Martin Marauder", "Mick Butler (Wexford hurler)", "Monageer", "Monamolin", "Monaseed", "Murrintown", "N11 road (Ireland)", "New Ross", "Newbawn", "Oulart", "Oylegate", "Palestine (region)", "Pembrey", "Poulpeasty", "Provinces of Ireland", "R741 road", "R742 road", "RAF", "RTÉ", "Raheen, County Wexford", "Rathangan, County Wexford", "Rathnure", "Regional road (Ireland)", "Republic of Ireland", "Roads in Ireland", "Roman Catholic", "Rosslare Harbour", "Rosslare Strand", "Royal Irish Constabulary", "Saltmills", "South Africa", "St Paul's Camogie Club", "Taghmon", "Tagoat", "The Curragh", "The Jades (Irish band)", "Time zone", "Tom Dempsey (hurler)", "Tony Doran", "Townland", "UTC+0", "UTC-1", "United Kingdom", "VIAF (identifier)", "Vaughan Williams Memorial Library", "Wales", "Watch House Village", "Wellingtonbridge", "West European Time", "Western European Summer Time", "Wexford", "Wexford (Dáil constituency)", "Wexford Rebellion", "Wexford Senior Hurling Championship", "Wind farm", "You're a Star"]}