{"url": "https://en.wikipedia.org/wiki/Koichi_Domoto", "title": "Koichi Domoto", "summary": "Koichi Domoto (堂本 光一, Dōmoto Kōichi, born January 1, 1979) is a Japanese idol, singer, actor, singer-songwriter, composer, lyricist, television personality, voice actor. Along with Tsuyoshi Domoto (with whom he has no blood-relation), he is a member of the duo KinKi Kids, who holds the Guinness World Records for having the most consecutive No.1 singles since debut and the most consecutive years with a Japanese No.1 single, and is one of the top 20 best-selling artists of all time in Japan.\nAlthough Domoto also actively works as a television actor and host, he is most famous for his musical SHOCK series, which he participates as the lead actor and director at the same time. SHOCK series started at the Tokyo Imperial Theatre in 2000, making him the youngest Zachō (chairman and lead role) and the first idol to perform at Imperial Theatre. With more than 1800 performances, SHOCK series is now the most-performed musical and the second most-performed theatre with a single-lead in Japan. In 2018, he starred in musical Knights’ Tale directed by John Caird as well.", "content": "Koichi Domoto (堂本 光一, Dōmoto Kōichi, born January 1, 1979) is a Japanese idol, singer, actor, singer-songwriter, composer, lyricist, television personality, voice actor. Along with Tsuyoshi Domoto (with whom he has no blood-relation), he is a member of the duo KinKi Kids, who holds the Guinness World Records for having the most consecutive No.1 singles since debut and the most consecutive years with a Japanese No.1 single, and is one of the top 20 best-selling artists of all time in Japan.\nAlthough Domoto also actively works as a television actor and host, he is most famous for his musical SHOCK series, which he participates as the lead actor and director at the same time. SHOCK series started at the Tokyo Imperial Theatre in 2000, making him the youngest Zachō (chairman and lead role) and the first idol to perform at Imperial Theatre. With more than 1800 performances, SHOCK series is now the most-performed musical and the second most-performed theatre with a single-lead in Japan. In 2018, he starred in musical Knights’ Tale directed by John Caird as well.\n\n\n== Career ==\n\nBorn in Ashiya, Hyōgo, Japan, Domoto joined the Japanese talent agency Johnny & Associates at the age of 12 after his sister sent in his application without his knowledge. Domoto and his bandmate Tsuyoshi Domoto first worked together as back-dancers for Hikaru Genji, who were holding a concert at Yokohama Arena, and has since then been partnered up for magazine photoshoots, music acts and drama projects. The duo eventually made their debut in 1997 with a double release of a single Garasu no Shōnen and an album A Album, both of which went on to sell over a million copies.\n\n\n=== Theatre ===\nIn 1993, Domoto played in his first stage in SMAP's ANOTHER. As early as in 1994, he expressed his enthusiasm of musical, saying that his dream was to \"play in musicals that have singing, dancing and acting\" in an interview. In 1997, he played in the stage kyotokyo with many others from Johnny & Associates. He managed to star as the lead (or Zachō in Japanese) in musical MASK'99 in Nissay Theatre in 1999.\nIn November 2000, Domoto played the lead role in musical MILLENNIUM SHOCK, becoming the youngest Zachō and also the first idol to play the lead at Tokyo Imperial Theatre. Since then, SHOCK series has continued to perform every year. The title was changed to Shōgeki・SHOCK, SHOCK is Real SHOCK and Shocking SHOCK in the following years but had the similar story. In 2005, it was revised to Endless SHOCK and the story was changed completely. Domoto started to participate as the director and composed several songs since this year. In April 2008, the long-running musical Endless SHOCK was awarded the Grand Prize of the 33rd Kazuo Kikuta Drama Awards for theatre. In January 2012, Endless SHOCK was performed at Hakata-za in Fukuoka, which was the first time for the musical to be performed in places other than Tokyo. On March 21, 2013, Endless SHOCK welcomed its 1000th performance, making it the forth theatre to reach 1000 performances in Japan. It was also brought to Umeda Arts Theatre in Osaka in September 2013. After its 1408th performance on October 26, 2014, Endless SHOCK overtook Matsumoto Hakuō II's Japanese version of Man of La Mancha to become the most-performed musical and the second most-performed theatre with single lead-starring in Japan. In April 2020, Domoto alone was awarded the Grand Prize of the 45th Kazuo Kikuta Drama Awards for his achievement for leading SHOCK series for twenty years, becoming the youngest single winner of this award. SHOCK series reached its 1800th performance on February 12, 2021.\nDomoto has also participated in some other theatres. In November 2010, he played in stage Shichinin no Samurai produced by Kansai Yamamoto, which was an adaptation of Seven Samurai. From July to September 2018, he starred as Arcite in John Caird's musical Knights’ Tale, which was an adaptation of William Shakespeare's The Two Noble Kinsmen, at Imperial Theatre. Since 2019, Domoto took over the position of director of another musical DREAM BOYS produced by Johnny & Associates and played by his junior colleagues.\nThe premiere of MILLENNIUM SHOCK in 2000 at Imperial Theatre was very controversial since it was also the first time a theatre from Johnny & Associates to be performed there. It was believed that idols were unqualified to stand at the most famous and important theatre in Japan, let alone playing the lead at the age of 21. However, SHOCK gradually becomes one of the most important musicals at Imperial Theatre and one of the representing Japanese original musicals. In 2018, Domoto played the lead in Endless SHOCK and Knights’ Tale from February to March and from July to August respectively at Imperial Theatre, becoming the fourth person in history and the first person in 26 years to play a lead for four months in a year at Imperial Theatre. After the success of SHOCK, several other stages from Johnny & Associates and musicals starred idols from other companies started to be performed at Imperial Theatre, and Domoto is credited for broadening the career of musical actors for idols.\n\n\n=== Acting ===\nAfter joining Johnny & Associates, Domoto played his first role in movie 200X Nen Shō in 1992 and first role in drama Aiyo Nemuranaide in 1993. From July 1994 to September 1994, Domoto and his bandmate Tsuyoshi appeared in drama Ningen Shikkaku, which had a peak rating of 28.9% on its final episode. In 1994 and 1995, he starred as the main male role in move Ie Naki Ko and the drama Ie Naki Ko 2, which had a rating of 31.9% on its final episode. He gained unprecedented popularity through these works even though he had not formally debuted as KinKi Kids. From January to March 1996, he played two roles, Ginrō Fuwa and Kōsuke Fuwa, in drama Ginrō Kaiki File: Futatsu No Zunō Wo Motsu Shōnen, which had an average rating of more than 20%. He also starred together with his bandmate Tsuyoshi for their second drama together in Wakaba No Koro in 1996.\nOn August 23, 1997, Domoto starred in his first drama after debut in Yūki To Iu Koto, as a special drama corner of  NTV's annual telethon 24-Hour Television, in which KinKi Kids were also appointed as the main host. The drama had a rating of 26.3%, becoming the highest rated 24-Hour Television special drama at the time, and it is still the second highest one until now. From October to December 1997, Domoto and his bandmate Tsuyoshi Domoto starred in their third drama together called Bokura no Yūki Miman City. Since then, Domoto starred in one drama every year, which all received relative high ratings. He shifted his focus to musicals after starring in Remote from October to December 2002, where he won the best supporting actor in the 35th Drama Academy Award.In 2006, Domoto starred in his first drama in four years as the lead in Kinō Kōen, which was part of TV special Tales of The Unusual 2006 Autumn Special Drama.  In July 2007, Domoto starred as the lead in a drama entitled Sushi Ōji!, where he played the role of a martial artist training in the art of sushi. In addition, the sequel movie Ginmaku Ban Sushi Ōji!: New York e Iku was released on April 19, 2008. It was his first movie appearance since the 1994 movie Ienaki Ko.On March 7, 2015, Domoto played Kazumi Ishioka in his first drama in nearly eight years in Tensai Tantei Mitarai Nankai Jiken File: Kasa o Oru Onna, which was an adaptation of Soji Shimada's Detective Kiyoshi Mitarai Series. On September 13, 2015, he played Minamoto no Hiromasa in Onmyōji. To commemorate the 20th anniversary of KinKi Kids, the sequel of 1997 drama Bokura no Yūki Miman City was broadcast as a special drama Bokura no Yūki Miman City: 2017 in NTV, where Domoto played the same character as before.\n\n\n=== Music ===\nIn the early days after KinKi Kids debuted, Domoto had several solo songs credited as KinKi Kids in their albums. He held his first solo concert tour in 2004, mainly performing his solo songs in group albums and songs from SHOCK. On January 11, 2006, he released his first CD album Koichi Domoto「Endless Shock」Original Sound Track,  but was not regarded as his solo debut. The album peaked in Oricon and became the first musical soundtrack album to reach No.1, winning the Soundtrack album of the year in 21st Japan Gold Disc Award. He made his official CD debut on July 12, 2006, with a release of single Deep in your heart/+MILLION but -LOVE, followed by the release of album Mirror on September 13.\nOn April 30, 2008, Domoto released a new single No More under the name of \"Tsukasa Maizu\", the character he played in Sushi Ōji!, as the theme song of the movie Ginmaku Ban Sushi Ōji!: New York e Iku. His second single Ayakashi was released on July 29, 2009. On September 1, 2010, Domoto released BPM, his first solo album in four years. On October 3, 2012, Domoto released his third solo album Gravity, which ranked the first in Oricon. Domoto released his first DVD/Blu-ray single INTERACTIONAL/SHOW ME UR MONSTER on June 10, 2015, followed by his fourth solo album Spiral on July 8. On April 19, 2017, the second original soundtrack of his musical Endless SHOCK  was released. On June 2, 2021, Domoto released his fifth solo album PLAYFUL and topped in Oricon. The album also featured a collaboration short movie made by Square Enix, in which Domoto himself and a CG version of him starred together.\nDomoto wrote his first song in KinKi Kids's music variety LOVE LOVE Aishiteru in 1997, where they were required to learn guitar and write songs. Since then, he wrote a great number of songs, mainly devoted to the group, his solo work and musical SHOCK. He composed several No.1 winning singles for KinKi Kids and himself, such as Suki ni Natteku Aishitteku (2000), Deep in your heart (2006), Family~Hitotsu ni Naru Koto (2010) and Topaz Love (2018). In 2002, Domoto wrote the lyrics for and composed KinKi Kids' single solitude~Honto no Sayonara~ , which was also the theme song for his drama Remote, under the pen name \"K.Dino\". The single also reached No.1 in Oricon and won the best theme song in the 35th Drama Academy Award. The song Ai no Katamari of KinKi Kids he composed in 2001 was voted as the most loved song by fans in an official voting held for creation of KinKi Kids's 10th anniversary compilation album 39 in 2007. He composed various songs used in his musical Endless SHOCK. Domoto has also provided songs for other artists from Johnny & Associates, such as NEWS, Hideaki Takizawa, and the musical DREAM BOYS.\n\n\n== Discography ==\n\n\n=== Studio albums ===\n\n\n=== Singles ===\n\n\n=== Video albums ===\n\n\n== Solo activities ==\n\n\n=== Concerts and Events ===\nKOICHI DOMOTO LIVE TOUR 2004 1/2 (Concert tour; March 29 – June 5, 2004)\nKOICHI DOMOTO Presents IT LOOKS BACK UPON 1/2 (Event; November 1, 2004)\nKOICHI DOMOTO CONCERT TOUR 2006 \"mirror\" 〜The Music Mirrors My Feeling〜 (Concert tour; September 13 – October 3, 2006)\nKoichi Domoto CONCERT TOUR 2009 Best Performance And Music (Concert tour; August 15 – October 12, 2009)\nKOICHI DOMOTO CONCERT TOUR 2010 BPM (Concert tour; September 11 – November 14, 2010)\nKOICHI DOMOTO 2011 BPM Concerts in Seoul, Taipei (Concert tour in Korea and Taiwan; September 9 – October 2, 2011)\nKOICHI DOMOTO 2012 \"Gravity\" (Concert tour; September 23 – December 16, 2012)\nKOICHI DOMOTO LIVE TOUR 2015 Spiral (Concert tour; July 12 – August 21, 2015)\nKOICHI DOMOTO LIVE TOUR 2021 PLAYFUL (Concert tour: June 20 - August 12, 2021)\n\n\n=== Television (as personality) ===\n\n\n=== Television (as actor) ===\n\n\n=== Anime ===\nJyu Oh Sei (Fuji TV: May 18, 2006 – June 22, 2006)\n\n\n=== Movies ===\n200X Nen Shō (Humax: November 14, 1992)\nShoot! (Shochiku: March 12, 1994)\nIe Naki Ko (Toho: December 17, 1994)\nGinmaku Ban Sushi Ōji!: New York e Iku (Warner Bros.: April 19, 2008 (2008-04-19))\nEndless SHOCK (Toho: February 1, 2021)\n\n\n=== Musicals ===\nAnother (August 6, 1993 - August 24, 1993)\nMask'99 (January 6, 1999 - January 31, 1993)\nSHOCK series\nMILLENNIUM SHOCK (November 2–26, 2000: 38 shows): Lead Role\nSHOW 劇・SHOCK (December 1, 2001 - January 7, 2002; June 4–28, 2002: 114 shows): Lead Role\nSHOCK is Real Shock (January 8 - February 25, 2003: 76 shows): Lead Role\nShocking SHOCK (February 6–29, 2004: 38 shows): Lead Role\nEndless SHOCK (2005 -): Lead Role\nKnights' Tale (July 27 –  October 15, 2018; 8 September - 30 November 2021): Lead role\n\n\n=== Dubbing ===\nRush, James Hunt (Chris Hemsworth)\n\n\n== Publications ==\n\n\n=== Book ===\nWhen I become a fan (January 20, 2011; Sony Magazines) ISBN 978-4-7897-3449-3 (compiled and edited from Domoto's serial F1 hymn in GRAND PRIX SPECIAL specialized magazine)\nWhen I become a fan 2 (March 14, 2013; M-ON! Entertainment Inc.) ISBN 978-4-7897-3598-8 (compiled and edited from Domoto's serial F1 hymn in GRAND PRIX SPECIAL specialized magazine)\nThe Entertainer Case (February 14, 2016; Nikkei Business Publications, Inc.) ISBN 978-4-8222-7272-2 (compiled and edited from Domoto's serial The Entertainer Case in Nikkei Entertainment magazine)\n\n\n=== Serial ===\nF1 hymn「F1賛歌」in GRAND PRIX SPECIAL (February 2006 – January 2016)\nSpeed of Light Corner「光速コーナー」in Tokyo Chunichi Sports (2007 – December 1, 2012; 2017 –)\nDomoto Koichi's Endless Days「Endless Days 〜堂本光一のオワラナイ日々〜」in Susumeru Pia! (February – December 2012)\nThe Entertainer Case「エンタテイナーの条件」in Nikkei Entertainment (September 2013 –)\nDomoto Koichi – 0.1 second ecstasy「堂本光一 コンマ一秒の恍惚」in Weekly Playboy (October 2016 –)\n\n\n== Awards ==\n2002: 6th Nikkan Sports Drama Grand Prix: Best Supporting Actor for Remote\n2003: 35th Television Drama Academy Awards (Winter): Best Supporting Actor for Remote\n2008: 33rd Kikuta Kazuo Drama Award: Grand Prize Award for high achievements in stage performance (together with Endless SHOCK staff and cast)\n2020: 45th Kikuta Kazuo Drama Award: Grand Prize Award \n\n\n== References ==\n\n\n== External links ==\nKoichi Domoto at IMDb\nKoichi Domoto  at Anime News Network's encyclopedia", "links": ["39 (KinKi Kids album)", "A Album", "Anime News Network", "Ashiya, Hyōgo", "Atsuro Watabe", "B Album", "C Album", "Chris Hemsworth", "D Album", "E Album", "F Album", "Fuji Television", "Fuku Suzuki", "Fukuoka", "G Album: 24/7", "Gaku Hamada", "Guinness World Records", "H Album: Hand", "Hakata-za", "Hideaki Takizawa", "Hikaru Genji (band)", "Hyōgo Prefecture", "IMDb", "ISBN (identifier)", "ISNI (identifier)", "I Album: ID", "Imperial Theatre (Japan)", "J-pop", "J Album", "Japanese idol", "Japanese television drama", "John Caird (director)", "Johnny & Associates", "Jun Matsumoto", "Junichi Okada", "Jyu Oh Sei", "K Album", "Kansai Yamamoto", "Kataoka Ainosuke VI", "Kazuya Kamenashi", "Kento Hayashi", "KinKi Kids", "KinKi Kids discography", "KinKi Single Selection", "KinKi Single Selection II", "Kōichi Satō (actor)", "MBA (identifier)", "Matsumoto Hakuō II", "Minamoto no Hiromasa", "NEWS (band)", "NHK", "Nikkan Sports Drama Grand Prix", "Nikkei Business Publications, Inc.", "Nippon Television", "Nissay Theatre", "Nomura Mansai", "Onmyōji (novel series)", "Oricon", "Phi (KinKi Kids album)", "RIAJ", "Rush (2013 film)", "Ryo Nishikido", "Seiyō Uchino", "Seven Samurai", "Shock (musical)", "Shota Sometani", "Shounen Club", "Soji Shimada", "Sushi Ōji!", "Takaya Kamikawa", "Telethon", "Teruyuki Kagawa", "The Two Noble Kinsmen", "Tokyo Chunichi Sports", "Toma Ikuta", "Tomohisa Yamashita", "Tsuyoshi Domoto", "VIAF (identifier)", "Voice acting in Japan", "Warner Bros.", "William Shakespeare", "Yokohama Arena", "Yuta Kishi"]}