{"url": "https://en.wikipedia.org/wiki/La_Oreja_de_Van_Gogh", "title": "La Oreja de Van Gogh", "summary": "La Oreja de Van Gogh (Spanish pronunciation: [la oˈɾexa ðe βaŋ ˈɡoɣ]; English: \"Van Gogh's Ear\") is a Spanish pop band from Donostia-San Sebastián, Spain. The band's lyrics and compositions are written primarily by Xabi San Martín, and additionally by Pablo Benegas and Amaia Montero (who remained in the group until her departure in 2007). The lyrical themes of their songs typically include love, friendship and relationships.  Since their debut, they have sold more than 8 million albums worldwide.In November 2007, lead singer Amaia Montero announced that she would be leaving the group to begin a solo career. Her replacement, Leire Martínez, was announced in July 2008; the first single featuring the new singer, \"El Último Vals\" (The Last Waltz), was released at the same time. The album from which the single was taken, A las cinco en el Astoria, followed in September 2008. Leire was discovered on the Spanish reality show Factor X.", "content": "La Oreja de Van Gogh (Spanish pronunciation: [la oˈɾexa ðe βaŋ ˈɡoɣ]; English: \"Van Gogh's Ear\") is a Spanish pop band from Donostia-San Sebastián, Spain. The band's lyrics and compositions are written primarily by Xabi San Martín, and additionally by Pablo Benegas and Amaia Montero (who remained in the group until her departure in 2007). The lyrical themes of their songs typically include love, friendship and relationships.  Since their debut, they have sold more than 8 million albums worldwide.In November 2007, lead singer Amaia Montero announced that she would be leaving the group to begin a solo career. Her replacement, Leire Martínez, was announced in July 2008; the first single featuring the new singer, \"El Último Vals\" (The Last Waltz), was released at the same time. The album from which the single was taken, A las cinco en el Astoria, followed in September 2008. Leire was discovered on the Spanish reality show Factor X.\n\n\n== History ==\n\n\n=== Fronted by Amaia Montero (1996–2007) ===\n\nThe band was formed under the provisional name Los Sin Nombre (The Nameless) in 1996 by four college students from San Sebastián: Xabi San Martín (keyboard), Pablo Benegas (guitar), Álvaro Fuentes (bass guitar) and Haritz Garde (drums). They recorded covers of songs from international rock bands, such as U2, Pearl Jam and Nirvana, usually with San Martín providing lead vocals.\nAs they began to write songs, the band wanted to recruit a female lead vocalist. They met Amaia Montero at a friend's party, and after listening to her sing \"Nothing Compares 2 U\" by Sinéad O'Connor, Benegas convinced her to join the group. She subsequently became the lead singer and frontwoman of the band. After several meetings in local cafés, Montero suggested La Oreja de Van Gogh (Van Gogh's Ear) as the definitive name of the band, inspired by the story of Vincent van Gogh severing one of his ears.\nThe band first rose to prominence when it won a local pop-rock music festival in San Sebastian, giving the group the chance to record a 4-song EP. This encouraged the band to send some of their songs to major record companies, with Sony Music-scout Jennifer Ces being the first one interested in the band after listening to only one of the band's songs. She urged them to send her more of their songs to see if they had enough material for an LP. After composing and submitting over 20 tracks in a very short period of time, Ces reacted very positively and signed the band to Epic Records, a subsidiary of Sony. Manolo Moreno, one of Epic's managers at the time, reportedly said after listening to some of the band's material: \"This is the new Mecano\".\nIn 1998, La Oreja de Van Gogh released its debut album Dile al sol (Tell the Sun), produced by Alejo Stivel, earning praise from contemporary critics and performing well in the Spanish Albums Chart. The album sold more than 800,000 copies and was certified 7-time platinum, and the band received an Ondas Award for Best New Act.\n\nThe success of the band was further increased with the release of El viaje de Copperpot (Copperpot's Journey, a reference to the character Chester Copperpot from the movie The Goonies) in 2000 and Lo que te conté mientras te hacías la dormida (What I Told You While You Pretended to Be Asleep) in 2003. Both albums were produced by Nigel Walker and managed to sell more than 2 million copies worldwide each, establishing La Oreja de Van Gogh as one of the most popular bands in Spain as well as in Latin America. El viaje de Copperpot was certified diamond in Spain for shipments of over 1,000,000, and singles \"La Playa\" (\"The Beach\"), \"Puedes Contar Conmigo\" (\"You Can Count on Me\") and \"Rosas\" (\"Roses\"), amongst others, were international hits in most Spanish-speaking countries.\nIn 2006, the band released what would be its fourth and last studio album with Amaia Montero. Guapa (Beautiful) was the best-selling album of 2006 in Spain and won a Latin Grammy for Best Pop Album by a Duo or Group and a 40 Principales Award for Best Spanish Album. Singles \"Muñeca de Trapo\" (\"Rag Doll\") and \"Dulce Locura\" (\"Sweet Madness\") were also very successful, peaking at number 1 in many charts, including the Mexican Singles Chart and the Argentinian Charts. Late in the same year, the band re-released the album as a new edition called Más Guapa (More Beautiful), which included a second CD with tracks made for but cut from all of the band's albums since 1998, including both unreleased songs and some alternative versions of previously-released tracks. One of the former was released as a single, \"En Mi Lado del Sofá\" (\"On My Side of the Sofa\"), which has since become La Oreja de Van Gogh's last single before changing its line-up.\n\n\n=== Fronted by Leire Martínez (2008–present) ===\n\nIn 2007, Amaia Montero left the group and Xabi, Pablo, Álvaro and Haritz held an audition looking for a new vocalist. In July 2008 they presented Leire Martínez as the new vocalist and the new song \"El Último Vals\" as the first single of their new album A las cinco en el Astoria (At Five O'Clock At the Astoria).\nIn 2009, they released Nuestra casa a la izquierda del tiempo  (Our home on the left side of time), which consisted of re-recordings of their older songs with Martinez, the new vocalist, plus one new song.\nTheir next studio album proper was Cometas por el cielo  (Kites in the sky), released in 2011, with the first single sharing the name of the album.\nIn 2013, they released a new album called Primera Fila (First Row), a live recording of previous songs as well as some new tracks including the single El primer día del resto de mi vida (The First Day of the Rest of my Life).\nIn 2016, they released El planeta imaginario (The Imaginary Planet), and in December of that same year, started a tour showcasing its songs.\nOn December 2019, the group made an announcement on their official Facebook page, saying that they will start recording their new album on January 7, 2020.\nOn April 13, 2020 the group released the first single called \"Abrázame\" of their new album, titled Un susurro en la tormenta (A Whisper in the Storm), that would be released around September. On July 2, the band released another song from their upcoming album, \"Te pareces tanto a mí\". Later that month, the complete tracklist and the album release date were revealed, with the latter being September 18.\n\n\n== Members ==\nCurrent membersLeire Martínez – lead vocals (2008–present)\nPablo Benegas – guitars (1996–present)\nXabi San Martín – keyboards (1996–present)\nÁlvaro Fuentes – bass (1996–present)\nHaritz Garde – drums (1996–present)Former membersAmaia Montero – lead vocals (1996–2007)\nLuis Meyer – guitars (1996)Timeline\n\n\n== Discography ==\n\nStudio albums\n\n1998: Dile al sol\n2000: El viaje de Copperpot\n2003: Lo Que te Conté Mientras te Hacías la Dormida\n2006: Guapa\n2008: A las Cinco en el Astoria\n2011: Cometas por el cielo\n2016: El Planeta Imaginario\n2020: Un Susurro en la Tormenta\n\n\n== Filmography ==\n1999: Dile al sol - VHS\n2002: El viaje de Copperpot - VHS & DVD\n2003: Lo que te conté mientras te hacías la dormida, Gira 2003 CD+DVD\n2010: Un viaje por el Mar Muerto, their first full-length feature film, which was filmed in Israel in collaboration with other artists. Included as a bonus disc in the special edition of Nuestra casa a la izquierda del tiempo.\n2012: Cometas por el Cielo - En directo desde America: Second CD-DVD filmed in Mexico and in Argentina.\n\n\n== References ==", "links": ["A las Cinco en el Astoria", "A las cinco en el Astoria", "Aitana (singer)", "Amaia Montero", "Amaral (music group)", "Argentine Chamber of Phonograms and Videograms Producers", "Auryn", "Basque Country (autonomous community)", "CD", "Cometas por el Cielo - En directo desde America", "Cometas por el cielo", "Dile al sol", "Dover (band)", "Dulce Locura", "El Canto del Loco", "El Planeta Imaginario", "El planeta imaginario", "El viaje de Copperpot", "El Último Vals", "Enrique Bunbury", "Enrique Iglesias", "Epic Records", "Extended play", "Factor X (Spain)", "Guapa", "Guipuzcoa", "Haritz Garde", "ISNI (identifier)", "Inmortal (La Oreja de Van Gogh song)", "La Excepción", "La Oreja de Van Gogh discography", "Latin America", "Latin Grammy Awards of 2006", "Leire Martínez", "Lo Que te Conté Mientras te Hacías la Dormida", "Lo que te conté mientras te hacías la dormida", "Lola Índigo", "Long play", "Los Premios 40 Principales 2006", "MBA (identifier)", "MTV Europe Music Award for Best Spanish Act", "Mecano", "Mexican Singles Chart", "Miguel Bosé", "Muñeca de Trapo", "Nirvana (band)", "Nothing Compares 2 U", "Nuestra casa a la izquierda del tiempo", "Pablo Benegas", "Pearl Jam", "Pop music", "Pop rock", "Premios Ondas", "Puedes Contar Conmigo", "Russian Red", "SUDOC (identifier)", "San Sebastián", "Single (music)", "Sinéad O'Connor", "Sony Music", "Spanish Albums Chart", "Tequila (band)", "The Goonies", "U2", "Un susurro en la tormenta", "Un viaje por el Mar Muerto", "VIAF (identifier)", "Vincent van Gogh", "Violadores del Verso", "Xabi San Martín", "Álvaro Fuentes"]}