{"url": "https://en.wikipedia.org/wiki/Lakeside_Lake", "title": "Lakeside Lake", "summary": "Lakeside Lake is located at Chuck Ford-Lakeside Park in east Tucson, Arizona, United States, on the northwest corner of Stella Road and Sarnoff Drive.\n\n", "content": "Lakeside Lake is located at Chuck Ford-Lakeside Park in east Tucson, Arizona, United States, on the northwest corner of Stella Road and Sarnoff Drive.\n\n\n== History ==\nAccording to David Leighton, historian for the Arizona Daily Star newspaper, the origins of Lakeside Lake began with Hal Kinnison. Mr. Kinnison arrived in Tucson in 1909 with his family for his wife's health, taking up residence along The Speedway (now called Speedway Blvd). In 1914, Kinnison started purchasing homesteaded property along the Pantano River (now Pantano Wash)and over the next six years made more land buys close to the original land. At some juncture, Kinnison built a canal and dam which in turn formed a reservoir, on his property from the river runoff, to allow him to water his crops. The reservoir, often called the Kinnison Reservoir, Kinnison Lake or Kinnison Dam existed for several years under Mr. Kinnison's ownership until he lost the land during the Great Depression.\nLeighton, continued \"This land soon after became a guest ranch, called El Rancho Pantano and in time became the property of the Atterbury family.\" Boudinot and Ruth Atterbury first bought part of the old Kinnison Lake property in 1947 and later would purchase more of the land. Their daughter, Joan Atterbury moved to the property a couple years later where she resided and raised race horses. In 1960, after first attempting to sell the property to Pima County, Mr. Atterbury sold it to the Lusk Corporation who developed the Lakeside subdivisions.\nIt's now a neighborhood called Lakeside Park and the old Kinnison Lake is now called Lakeside Lake. According to Leighton, Kinnison Wash which begins at present-day Lakeside Lake is named for Hal Kinnison and the Atterbury Wash which starts at the same place is named for the Atterbury family.\n\n\n== Fish species ==\nRainbow trout\nLargemouth bass\nCrappie\nSunfish\nChannel catfish\nCarp\n\n\n== References ==\n\nInformation and Education Division (2007), Arizona Fishin' Holes, Phoenix, AZ: Arizona Game and Fish Department\n\n\n== External links ==\nLakeside Lake", "links": ["Arizona Daily Star", "Arizona Game and Fish Department", "Body of water", "Carp", "Centrarchidae", "Channel catfish", "Crappie", "Drainage basin", "Geographic coordinate system", "Largemouth bass", "Rainbow trout", "Reservoir", "Tucson", "Tucson, Arizona", "United States"]}