{"url": "https://en.wikipedia.org/wiki/Lance_Henriksen", "title": "Lance Henriksen", "summary": "Lance Henriksen (born May 5, 1940) is an American actor and artist. He is known for his works in various science fiction, action and horror films, such as that of Bishop in the Alien film franchise, and Frank Black in Fox television series Millennium. He has also done extensive voice work for Kerchak the gorilla in the 1999 Walt Disney Feature Animation film Tarzan (1999), General Shepherd in Call of Duty: Modern Warfare 2 (2009) and Fleet Admiral Steven Hackett (as well as Narl) in BioWare's Mass Effect video game trilogy (2007-2012). He also appeared as Vukovich in The Terminator, Chains Cooper in Stone Cold, and starred as Ed Harley in the cult horror film Pumpkinhead (1988).", "content": "Lance Henriksen (born May 5, 1940) is an American actor and artist. He is known for his works in various science fiction, action and horror films, such as that of Bishop in the Alien film franchise, and Frank Black in Fox television series Millennium. He has also done extensive voice work for Kerchak the gorilla in the 1999 Walt Disney Feature Animation film Tarzan (1999), General Shepherd in Call of Duty: Modern Warfare 2 (2009) and Fleet Admiral Steven Hackett (as well as Narl) in BioWare's Mass Effect video game trilogy (2007-2012). He also appeared as Vukovich in The Terminator, Chains Cooper in Stone Cold, and starred as Ed Harley in the cult horror film Pumpkinhead (1988).\n\n\n== Early life ==\nHenriksen was born on May 5, 1940, in Manhattan, New York. His father, James Henriksen, was a Norwegian merchant sailor and boxer nicknamed \"Icewater\" who spent most of his life at sea, while his mother, Margueritte Werner, struggled to find work as a dance instructor, waitress and model. His parents divorced when he was two years old, and his mother struggled to raise him and his brother, leading to his spending part of his childhood in foster care. During an interview, Henriksen recounted how, at the age of seven, his mother handed him his birth certificate, said, \"You'll always know who you are\", then pushed him out of his home. Henriksen did not actually leave home until he was 12, saying he'd \"had enough\" of his home life, and that he had been physically assaulted by multiple family members: \"I got bludgeoned a lot. Different people, relatives. I remember every single face from my childhood. My alcoholic uncles, whoever. I’m not having a pity party here; I’m not Quasimodo. That’s just how it was\".  On another occasion, two of his uncles tried to persuade him to take Methadrine and then take part in a staged car accident for the insurance money.Growing up, Henriksen had a reputation for getting into trouble in the various schools he attended, and even spent time in a children's home. He left school after completing first grade, and was illiterate until the age of 30. He served in the United States Navy from 1955 to 1958 and attained the rank of petty officer third class.\n\n\n== Career ==\nHenriksen found work as a muralist and as a laborer on ships. For a time, he worked in Europe. His first theater work, around age 30, was as set designer, and he received his first acting role because he built the set for a production. Illiterate until then, it was around this time that he taught himself to read. For his first role, he put the entire script to tape with the help of a friend, learning everyone's part in addition to his own. Soon afterward, he graduated from the Actors Studio and began acting in New York City.Henriksen's first film appearance was in It Ain't Easy in 1972. It was followed by supporting roles in a variety of films, including Dog Day Afternoon (1975), Close Encounters of the Third Kind (1977), and Damien: Omen II (1978). He played Police Chief Steve Kimbrough in Piranha Part Two: The Spawning (1982), the astronaut Walter Schirra in The Right Stuff (1983), and actor Charles Bronson in the television film Reason for Living: The Jill Ireland Story (1991).When James Cameron was writing The Terminator (1984), he originally envisioned Henriksen, with whom he had worked on Piranha II: The Spawning, playing the title role, a cyborg. The role ultimately went to Arnold Schwarzenegger. Henriksen does appear in the film in the supporting role of Vukovich, a member of the Los Angeles Police Department.\n\nHenriksen played the android Bishop in Cameron's film Aliens (1986), and as Bishop's unnamed designer in Alien 3 (1992). He also played Charles Bishop Weyland, the man upon whom Bishop was based, in Alien vs. Predator (2004). He played the vampire leader Jesse Hooker in Kathryn Bigelow's cult film Near Dark.He portrayed gunfighters in the Westerns Dead Man and The Quick and the Dead, and appeared with British actor Bruce Payne in Aurora: Operation Intercept in 1995. He appeared with Payne again in Face the Evil (1997), and the dystopian classic Paranoia 1.0 (2004). That year, he also played Sheriff Doug Barnum in the film Powder.In 1996, Henriksen starred in the television series Millennium, created and produced by Chris Carter, the creator of The X-Files. Henriksen played Frank Black, a former FBI agent who possessed a unique ability to see into the minds of killers. Carter created the role specifically for the actor. His performances on Millennium earned him critical acclaim, a People's Choice Award nomination for Favorite New Male TV Star, and three consecutive Golden Globe nominations for Best Performance by an Actor in a TV Series (1997–1999). The series was cancelled in 1999. On television, Henriksen appeared in the ensemble of Into the West (2005), a miniseries executive-produced by Steven Spielberg. He appeared in a Brazilian soap opera, Caminhos do Coração (Ways of the Heart) from Rede Record, aired in 2007–2008. Henriksen guest-starred on a Season 6 episode of NCIS (2009) playing an Arizona sheriff, and appeared in a recurring role as The Major on NBC's The Blacklist.\n\nIn the years after Millennium, Henriksen has become an active voice actor, lending his distinctive voice to a number of animated features and video game titles. In Disney's Tarzan (1999) and its direct-to-video followup, he is Kerchak, the ape who serves as Tarzan's surrogate father. He provided the voice for the alien supervillain Brainiac in Superman: Brainiac Attacks (2006) and for the character Mulciber in Godkiller (2009). Henriksen is the voice of the character Molov in the video game Red Faction II (2002) and has also contributed to GUN (2005), Run Like Hell (2002), the canceled title Four Horsemen of the Apocalypse (2004), and the role-playing game Mass Effect (2007) as Admiral Hackett of the Human Systems Alliance. Henriksen was also the voice behind PlayStation 3's internet promotional videos.In 2005, Henriksen was the voice of Andrei Rublev in Cartoon Network's IGPX. The actor lent his voice to the animated television series Transformers: Animated as the character Lockdown. In 2009, Henriksen voiced Lieutenant General Shepherd in the award-winning game Call of Duty: Modern Warfare 2. He would later voice Karl Bishop Weyland in Aliens vs. Predator; also, this character's appearance resembles Henriksen's. Henriksen voiced Master Gnost-Dural in Star Wars: The Old Republic, and he also reprised his role as Admiral Hackett in Mass Effect 3. He is also the narrator of the recent Verizon Droid commercials. Recently, Henriksen reprised his role as Bishop in Aliens: Colonial Marines.Henriksen maintains a prominent role in live action television. He has starred in a 2003 series of Australian television commercials for Visa, titled Unexplained (about the raining of fish from the sky over Norfolk) and Big Cats (about the Beast of Bodmin Moor). In these commercials, Henriksen speaks as a Frank Black-type character about these phenomena as Mark Snow-inspired mysterious music plays in the background, as a link to Henriksen's TV series Millennium. Unexplained went on to a gold world medal at the 2004 New York Festivals.In addition to his television and voice acting work, Henriksen continues to be active in film. He made a cameo appearance in the 2009 horror comedy Jennifer's Body, and starred in the After Dark Horrorfest film, Scream of the Banshee, released in 2011. He played Henry Gale in Leigh Scott's The Witches of Oz.In January 2015, he was signed for the lead in the indie thriller Monday at 11:01 A.M. In 2016, he starred in the feature film Deserted, a psychological thriller. Henriksen played the role of Hopper.In 2018, Henriksen performed motion capture and vocal performance for the character of Carl Manfred in the video game Detroit: Become Human. The game's plot involves androids gaining sentience and free will, topics explored briefly with Henriksen's Bishop character in Aliens.\nIn October 2018, Henriksen was signed for one of the two leads in Falling, the directorial debut of actor Viggo Mortensen, who also wrote, produced and co-starred. Reviewing the film's 2020 premiere, The Hollywood Reporter's John DeFore noted not only the quality of Henriksen's performance, but the opportunity Mortensen's script presented: \"[F]ew moviegoers who've enjoyed him over the years will be surprised, but many will resent that we, and he, have waited so long for a role like this.\"He received a Canadian Screen Award nomination for Best Actor at the 9th Canadian Screen Awards in 2021, for his performance in Falling.\n\n\n== Art ==\nHenriksen continues to produce art. He worked as a muralist before he became an actor, and he has worked with clay since 1960. In September 2017, Henriksen set up a   website to showcase and find homes for some of his most recent clay works. He \"still believes that there is nothing as simple and beautiful as raw clay... And that Potters have the remaining soul of the nomads...always searching....\"\n\n\n== Personal life ==\nHenriksen has been married three times. His current wife is Louise Lunde. He was married to Mary Jane Evans from 1985 to 1989 and to Jane Pollack from 1995 to 2006.\nHenriksen has four children, including two sons with Lunde, Thiise and Lawrence Henriksen. Lawrence died in 1995. He has one grandson, Thiise Brok Henriksen. Though uncredited, his daughter Alcamy appears in an episode of the TV series Millennium. After Millennium ended its run, Henriksen moved to Hawaii with his then-wife Jane Pollack and their child Sage.\n\n\n== Books ==\nAutobiographyNot Bad for a Human – The Life and Films of Lance Henriksen – Lance Henriksen with co-author Joseph Maddrey, published in 2011 by Bloody Pulp Books, featuring art by Bill Sienkiewicz, Mike Mignola, Tom Mandrake, Tim Bradstreet, Eric Powell and Ashley Wood.Comic booksTo Hell You Ride (five-issue comic book from Dark Horse Comics) (2012) – Lance Henriksen and Joseph Maddrey (co-authors) with Tom Mandrake (artist); a motion-comic video was also made by Dark Horse Comics) (2012) – Lance Henriksen and Joseph Maddrey (co-authors), Tom Mandrake (artist), Lance Henriksen (narrator), TKU: Tecamachalco Underground (Cesar Gallegos/Mateo Latosa) (musical score)\n\n\n== Filmography ==\n\n\n=== Film ===\n\n\n=== Television ===\n\n\n=== Video games ===\n\n\n== References ==\n\n\n== External links ==\nLance Henriksen at IMDb\nLance Henriksen at the TCM Movie Database\nLance Henriksen at the Internet Broadway Database \nLance Henriksen at FEARnet\nLance Henriksen at AllMovie\nLance Henriksen Magic\nFilms in Review interview\nThe Making of Hard Target on YouTube", "links": ["9th Canadian Screen Awards", "Abominable (2006 film)", "Abraham Lincoln", "Action film", "Actors Studio", "Adam Driver", "Adventures in Voice Acting", "After Dark Horrorfest", "Albert R. Broccoli", "Alec Guinness", "Alfred Hitchcock", "Alien (franchise)", "Alien 3", "Alien vs. Predator (film)", "Aliens: Colonial Marines", "Aliens (film)", "Aliens vs. Predator (video game)", "AllMovie", "All Hail King Julien", "All Movie Guide", "Alone in the Dark II (film)", "Americans", "Andrew Garfield", "Andy Serkis", "Animated television series", "Antibody (film)", "Appaloosa (film)", "Arnold Schwarzenegger", "Arte Johnson", "Ashley Wood", "Astronaut: The Last Push", "Atlanta", "Aurora: Operation Intercept", "Awaken (upcoming film)", "B.A.D. Cats", "Baseline (database)", "Beast of Bodmin", "Beautiful Wave", "Beauty and the Beast (1987 TV series)", "Ben Affleck", "Ben Kingsley", "Bert I. Gordon", "Better Things (TV series)", "Big Legend", "Bill Hader", "Bill Paxton", "Bill Sienkiewicz", "BioWare", "Bishop (Alien)", "Bishop (Aliens)", "Blake Edwards", "Blood Feud (1983 film)", "Bone Dry (2007)", "Boulevard (1994 film)", "Brad Pitt", "Brainiac (character)", "Brent Spiner", "Brian Grazer", "Bruce Payne", "Burgess Meredith", "Cagney & Lacey", "Call of Duty: Modern Warfare 2", "Caminhos do Coração", "Canadian Screen Award", "Canadian Screen Award for Best Actor", "Cartoon Network", "Castle (TV series)", "Charles Bronson", "Choke Canyon", "Chris Carter (screenwriter)", "Christopher Lee", "Clark Gregg", "Cliffs of Freedom", "Close Encounters of the Third Kind", "Color of Night", "Criminal Minds", "Cyborg", "Cyrus (2010 thriller film)", "DEA (2008 TV series)", "Damien: Omen II", "Dark Reel", "David Carradine", "David Lynch", "Daylight's End", "Dead Man", "Deadwater (film)", "Delta Heat", "Den of Geek", "Deserted (2016 film)", "Detroit: Become Human", "Dick Van Dyke", "Dino De Laurentiis", "Dog Day Afternoon", "Dragon Con", "Drew Struzan", "Dutch Schultz", "Dying God", "ET Canada", "Edward R. Pressman", "Eminence Hill", "Emperor of the North", "Entertainment Weekly", "Eric Powell (comics)", "Evel Knievel (2004 film)", "Excessive Force (film)", "FBI", "Falling (2020 film)", "Felony (film)", "Four Horsemen of the Apocalypse", "Fox Broadcasting Company", "Fragile Storm", "Frank Black (character)", "Frank Oz", "Fritz Lang", "Garm Wars: The Last Druid", "Gary Sinise", "Gene Roddenberry", "George Barris (photographer)", "Georgia (U.S. state)", "Gingerclown", "Godkiller (series)", "Golden Globe", "Gone Are the Days (2018 film)", "Good Day for It", "Grey's Anatomy", "Grim Reaper (comics)", "Gun (video game)", "Gunfighter's Moon", "Hannibal (TV series)", "Harbinger Down", "Hard Target", "Hardcastle and McCormick", "Harrison Ford", "Harsh Realm", "Hawaii", "Heath Ledger", "Hellraiser: Hellworld", "Hit List (1989 film)", "Hollows Grove", "Horror film", "IGPX", "IGPX: Immortal Grand Prix", "IMDb", "ISNI (identifier)", "Ian McKellen", "In the Spider's Web", "Independent film", "Internet Broadway Database", "Into the Badlands (TV series)", "Into the West (miniseries)", "Irvin Kershner", "It Ain't Easy (film)", "Jagged Edge (film)", "James Cameron", "James Coburn", "James Karen", "James Remar", "Javier Bardem", "Jay Robinson", "Jennifer's Body", "Jennifer 8", "Jill Ireland", "Joel Silver", "John Agar", "John Frankenheimer", "John Goodman", "John Lithgow", "Johnny Handsome", "Jonathan Frakes", "Josh Brolin", "Kathryn Bigelow", "Kerchak", "Kids vs Monsters", "Knights (film)", "Kobra (DC comics)", "Kurt Russell", "Ladies of the House", "Lake Eerie", "Last Assassins", "Lee Majors", "Legends of Tomorrow", "Legmen", "Leonard Nimoy", "List of Immortal Grand Prix characters", "Lockdown (Transformers)", "Long John Silver", "Los Angeles Police Department", "Lost Voyage", "Madhouse (2004 film)", "Malcolm McDowell", "Man's Best Friend (1993 film)", "Manhattan", "Mansion of the Doomed", "Mark Snow", "Marty Feldman", "Mass Effect", "Mass Effect (video game)", "Mass Effect 2: Arrival", "Mass Effect 3", "Memphis Beat", "Methadrine", "Michael Biehn", "Michael Clarke Duncan", "Michael Crichton", "Mickey Rourke", "Mike Mignola", "Millennium (TV series)", "Millennium (The X-Files)", "Mimic 3: Sentinel", "Mind Ripper (1995 film)", "Miniseries", "Modigliani (film)", "Mom and Dad (2017 film)", "Monday at 11:01 A.M.", "Monster Brawl", "NBC", "NCIS (TV series)", "Nathan Juran", "Near Dark", "Necessary Evil (2008 film)", "Network (1976 film)", "New Looney Tunes", "New York (state)", "Nichelle Nichols", "Nightmares (1983 film)", "No Contest II", "No Escape (1994 film)", "Norfolk", "Obsidian (comics)", "One Point O", "Paranoia 1.0", "Patrick Stewart", "People's Choice Award", "People (magazine)", "Petty officer third class", "Phantom (2013 film)", "Piranha II: The Spawning", "Piranha Part Two: The Spawning", "Pirates of Treasure Island", "Pistol Whipped", "PlayStation 3", "Powder (film)", "Prairie Fever", "Prince of the City (film)", "Pumpkinhead: Ashes to Ashes", "Pumpkinhead: Blood Feud", "Pumpkinhead (film)", "Rapunzel's Tangled Adventure", "Ray Harryhausen", "Ray Walston", "Red Faction II", "Rede Record", "Richard Armitage (actor)", "Richard Dawson", "Richard Fleischer", "Richard Lynch", "Riptide (American TV series)", "Road to Paloma", "Robert Englund", "Robert Halmi", "Robert Loggia", "Robin Williams", "Roddy McDowall", "Roger Corman", "Run Like Hell (video game)", "Ryan's Hope", "SUDOC (identifier)", "Samuel Z. Arkoff", "San Diego Comic-Con International", "Sasquatch Mountain", "Saturn Award for Best Supporting Actor", "Scatman Crothers", "Science fiction", "Scream 3", "Scream of the Banshee", "Screamers: The Hunting", "Sean Astin", "Sean Connery", "Sid and Marty Krofft", "Soap opera", "Stan Lee", "Star Wars: The Old Republic", "Starkweather (film)", "Static Shock", "Stephen J. Cannell", "Stephen Lang", "Steve Reeves", "Stone Cold (1991 film)", "Stung (film)", "Super Mario Bros. (film)", "Super Robot Monkey Team Hyperforce Go!", "Superman: Brainiac Attacks", "Supernova (2005 film)", "Survival Quest", "Sylvester Stallone", "Tales from the Crypt (TV series)", "Tarzan (1999 film)", "Tarzan II", "Teenage Mutant Ninja Turtles (2012 TV series)", "Terminator (character)", "The A-Team", "The Arcadian", "The Avengers: Earth's Mightiest Heroes", "The Blacklist (TV series)", "The Book of Daniel (film)", "The Chosen One (2007 film)", "The Chronicles of Riddick: Assault on Dark Athena", "The Da Vinci Treasure", "The Day Lincoln Was Shot", "The Four Horsemen of the Apocalypse (video game)", "The Garden (2006 film)", "The Genesis Code", "The Guardian", "The Hollywood Reporter", "The Horror Show", "The Legend of Korra", "The Legend of Tarzan (TV series)", "The Life Career Award", "The Lost Tribe (2010 film)", "The Mangler 2", "The Nature of the Beast (1995 film)", "The Next Man", "The Night Shift (TV series)", "The Outsider (1961 film)", "The Pit and the Pendulum (1991 film)", "The Quarry (video game)", "The Quick and the Dead (1995 film)", "The Right Stuff (film)", "The Seamstress (2009 film)", "The Slammin' Salmon", "The Strain (TV series)", "The Terminator", "The Untold (film)", "The Visitor (1979 film)", "The Walt Disney Company", "The Witches of Oz", "The X-Files", "Thomas F. Wilson", "Tim Bradstreet", "To Hell You Ride", "Tom Mandrake", "Tom Rothman", "Tomás de Torquemada", "Tracey Walter", "Transformers: Animated", "Transformers Animated: The Game", "Tron: Uprising", "Turner Classic Movies", "United Press International", "United States Navy", "Unspeakable (2002 film)", "VIAF (identifier)", "Video game", "Viggo Mortensen", "Vincent D'Onofrio", "Vincent Price", "Visa Inc.", "Wally Schirra", "Walter Schirra", "Wes Craven", "When a Stranger Calls (2006 film)", "Whit Bissell", "Willem Dafoe", "William Sadler (actor)", "William Shatner", "YouTube"]}