{"url": "https://en.wikipedia.org/wiki/Lars_van_Meijel", "title": "Lars van Meijel", "summary": "Lars van Meijel (born 12 June 1994) is a Dutch professional golfer who plays on the Challenge Tour. He won the 2019 Open de Provence.", "content": "Lars van Meijel (born 12 June 1994) is a Dutch professional golfer who plays on the Challenge Tour. He won the 2019 Open de Provence.\n\n\n== Amateur career ==\nVan Meijel was a member of the Dutch National Team, and represented the Netherlands  three times at the European Boys' Team Championship 2010–2012 and four times at the European Amateur Team Championship 2013–2016. He also played in the Eisenhower Trophy twice, 2014 in Japan and 2016 in Mexico.\nIn 2012, Van Meijel won the Gran Premio Padova, reached the quarterfinals of the Italian Amateur, and played the Talihade Cup in Argentina. In 2013, he won both the Trompbeker (Dutch National U21 Stroke Play Championship) at the Noord-Nederlandse Golf Club and the Dutch National Stroke Play Championship at Golfclub Houtrak. In June 2014, he won the Brabants Open, which earned him a spot in the KLM Open.In 2013, Van Meijel enrolled at the University of Memphis and started playing with the Memphis Tigers men's golf team. He won his first college golf tournament, the Shoal Creek Invitational, and his third tournament, the Bridgestone Collegiate. In 2016, he became only the fourth player within the Memphis men's golf program to earn Golf Coaches Association of American (GCAA) Division I All-America honors, joining Hillman Robbins (1954), Greg Powers (1969), and Steve Metz (1986) as All-Americans. He crowned his college career by winning the 2016 Arnold Palmer Cup.\n\n\n== Professional career ==\nAt the end of 2016, Van Meijel turned professionals and joined 2017 Alps Tour. After a fourth place in his first tournament, he won his second tournament in Egypt. After six further top-10s, he finished in fourth place in the ranking, and was promoted to the 2018 Challenge Tour. In 2019, he won the Open de Provence and finished in 19th place in the ranking. He earned his European Tour card at Qualifying School just months after securing his maiden Challenge Tour win.He struggled to make an impact on the European Tour and finished ranked 154th in 2020 and 174th in 2021.\n\n\n== Amateur wins ==\n2012 Gran Premio Padova\n2013 Dutch National U21 Stroke Play Championship, Dutch National Stroke Play Championship, Graeme McDowell Shoal Creek Invitational, Bridgestone Collegiate\n2014 Dutch Brabants Open\n2015 Pinetree IntercollegiateSource:\n\n\n== Professional wins (3) ==\n\n\n=== Challenge Tour wins (1) ===\n\n\n=== Alps Tour wins (2) ===\n\n\n== Team appearances ==\nAmateur\n\nEuropean Boys' Team Championship (representing the Netherlands): 2010, 2011, 2012\nEuropean Amateur Team Championship (representing the Netherlands): 2013, 2014, 2015\nEisenhower Trophy (representing the Netherlands): 2014, 2016\nArnold Palmer Cup (representing Europe): 2016 (winners)\n\n\n== See also ==\n2019 European Tour Qualifying School graduates\n\n\n== References ==\n\n\n== External links ==\nLars van Meijel at the European Tour official site\nLars van Meijel at the Official World Golf Ranking official site", "links": ["2013 European Amateur Team Championship", "2014 Eisenhower Trophy", "2014 European Amateur Team Championship", "2015 European Amateur Team Championship", "2016 Arnold Palmer Cup", "2016 Eisenhower Trophy", "2017 Alps Tour", "2018 Challenge Tour", "2019 Alps Tour", "2019 Challenge Tour", "2019 European Tour Qualifying School graduates", "2020 European Tour", "2021 European Tour", "Alps Tour", "Arnold Palmer Cup", "Challenge Tour", "Dutch name", "Eindhoven", "Eisenhower Trophy", "European Amateur Team Championship", "European Boys' Team Championship", "European Tour", "France", "Germany", "Greg Powers", "Hillman Robbins", "Hopps Open de Provence", "Italy", "Jacopo Vecchi Fossa", "KLM Open", "Memphis Tigers men's golf", "Netherlands", "Nicolas Platret", "Official World Golf Ranking", "Open de Provence", "PGA European Tour", "Professional golfer", "Sebastian Heisele", "Steve Metz", "Surname", "University of Memphis"]}