{
    "url": "https://en.wikipedia.org/wiki/Laura_Coryton",
    "title": "Laura Coryton",
    "summary": "Laura Coryton is a British campaigner, feminist activist and author. She is the founder of Stop Taxing Periods, a campaign to abolish the Tampon Tax in the United Kingdom and make menstrual products exempt from VAT, and runs the Relationships and Sex Education (RSE) social enterprise Sex Ed Matters. Coryton published her first book 'Speak Up!', a campaign guide for rebel girls, in 2019.\nCoryton was named one of The Observer's and Nesta's 2016 New Radicals. In December 2016, the BBC included her in their list of Five women who aren’t on Wikipedia but should be.",
    "content": "Laura Coryton is a British campaigner, feminist activist and author. She is the founder of Stop Taxing Periods, a campaign to abolish the Tampon Tax in the United Kingdom and make menstrual products exempt from VAT, and runs the Relationships and Sex Education (RSE) social enterprise Sex Ed Matters. Coryton published her first book 'Speak Up!', a campaign guide for rebel girls, in 2019.\nCoryton was named one of The Observer's and Nesta's 2016 New Radicals. In December 2016, the BBC included her in their list of Five women who aren’t on Wikipedia but should be.\n\n\n== Education and career ==\nShe was born on 28 May 1993 in Devon.  Coryton graduated from Goldsmiths, University of London in 2015 and worked for the Labour Party before completing her MSt in Women's Studies at the University of Oxford, for which she gained a distinction. She is also an ambassador for The Eve Appeal, a British charity that raises awareness of and funds research into gynaecological cancers, and founded the Homeless Period Project, a campaign to support homeless women's access to menstrual products.\n\n\n== Stop Taxing Periods campaign ==\nCoryton started the Stop Taxing Periods campaign in May 2014 while a student at Goldsmiths. The campaign was centred around an online petition on campaign hosting website Change.org. By early 2016 the petition had gained more than 320,000 signatures and global recognition. Stop Taxing Periods also used protests, demonstration and viral social media.\nIn 2015 the campaign gained the support of the then Prime Minister David Cameron, who said \"I wish we could get rid of this… [but] there's a problem with getting rid of VAT on certain individual issues because of the way this tax is regulated and set in Europe.\" Change.org's UK director Brie Rogers cited Coryton as a successful example of clicktivism and the influence of online political activism on national politics.In March 2016 Parliament accepted a Tampon Tax amendment proposed by Paula Sherriff MP, the then Chancellor George Osborne pledged in his budget to make menstrual products exempt from sales tax. \nVAT on sanitary products was abolished on 1 January 2021 in the UK.\n\n\n== Sex Ed Matters ==\nLaura co-founded 'Sex Ed Matters', a Relationship and Sex Education (RSE) social enterprise, in 2019. The organisation, which she runs with her twin sister Julia, is designed to help schools deliver the political aspects of the new RSE curriculum, including period education, consent and LGBT rights, through the means of workshops and resources.\n\n\n== References ==\n\n\n== External links ==\nperiodwatch.org official website\n#TheHomelessPeriod official website",
    "links": [
        "BBC",
        "Brie Rogers Lowery",
        "Chancellor of the Exchequer",
        "Change.org",
        "David Cameron",
        "Devon",
        "Feminist activism",
        "George Osborne",
        "Goldsmiths, University of London",
        "Gynaecological cancer",
        "Homelessness in England",
        "Labour Party (UK)",
        "MSt",
        "Menstrual products",
        "Nesta (charity)",
        "Parliament of the United Kingdom",
        "Paula Sherriff",
        "Petition",
        "Prime Minister of the United Kingdom",
        "Relationship and Sex Education",
        "Slacktivism",
        "Stop Taxing Periods",
        "Tampon Tax",
        "The Observer",
        "United Kingdom",
        "University of Oxford",
        "VAT"
    ]
}