{
    "url": "https://en.wikipedia.org/wiki/Lee_Leavitt",
    "title": "Lee Leavitt",
    "summary": "Lorne Lee Leavitt (December 6, 1906 –  January 13, 1984) was a teacher and a provincial level politician from Alberta, Canada. He served as a member of the Legislative Assembly of Alberta from 1952 to 1955 and a second stint from 1963 to 1971 sitting both times with the governing Social Credit caucus.",
    "content": "Lorne Lee Leavitt (December 6, 1906 –  January 13, 1984) was a teacher and a provincial level politician from Alberta, Canada. He served as a member of the Legislative Assembly of Alberta from 1952 to 1955 and a second stint from 1963 to 1971 sitting both times with the governing Social Credit caucus.\n\n\n== Political career ==\nLeavitt would run for a seat in the 1952 Alberta general election. He ran as a Social Credit candidate in the electoral district of Banff-Cochrane. Leavitt easily won the district defeating two other candidates, including Independent Social Credit incumbent Arthur Wray.Leavitt ran for a second term in the 1955 Alberta general election. He was defeated in a hotly contested fight by Frank Gainer. Gainer ran under the Coalition banner as he was jointly nominated by the Liberals and the Progressive Conservatives.Leavitt would try and run for a seat to the House of Commons of Canada in the electoral district of Calgary North as a candidate for federal Social Credit in the 1958 federal election. He finished a very distant second place to incumbent Douglas Harkness.Leavitt would run again provincially for Social Credit in the 1963 Alberta general election in the electoral district of Calgary Queens Park. He won the district with just under half the popular vote defeating five candidates including future MLA Roy Farran. He stood for his third term in office in the 1967 Alberta general election. His margin of victory dropped as he only took 42% of the vote. He defeated future MLA Eric Musgreave and two other candidates. Leavitt retired from provincial politics at dissolution of the assembly in 1971.\n\n\n== References ==\n\n\n== External links ==\nLegislative Assembly of Alberta Members Listing",
    "links": [
        "1952 Alberta general election",
        "1955 Alberta general election",
        "1958 Canadian federal election",
        "1963 Alberta general election",
        "1967 Alberta general election",
        "Alberta",
        "Arthur Wray",
        "Banff-Cochrane",
        "Calgary North",
        "Calgary Queens Park",
        "Cardston, Alberta",
        "Douglas Scott Harkness",
        "Eric Musgreave",
        "Frank Gainer",
        "House of Commons of Canada",
        "Legislative Assembly of Alberta",
        "Roy Farran",
        "Social Credit Party of Alberta",
        "Social Credit Party of Canada"
    ]
}