{"url": "https://en.wikipedia.org/wiki/LGBT_culture_in_Washington,_D.C.", "title": "LGBT culture in Washington, D.C.", "summary": "LGBT culture in Washington, D.C. is heavily influenced by the U.S. federal government and the many nonprofit organizations headquartered in the capital city of the United States.", "content": "LGBT culture in Washington, D.C. is heavily influenced by the U.S. federal government and the many nonprofit organizations headquartered in the capital city of the United States.\n\n\n== Demographics ==\nFrom 2015 to 2016, Gallup polling reported that 8.6% of District of Columbia residents identified as LGBT, a higher percentage than any U.S. state. There are an estimated 209,000 LGBT people living in the broader Washington Metropolitan Area, making up 4.5% of the population. The U.S. Census Bureau reported that there were 6,935 same-sex households in Washington, D.C. in 2018, of which 61% were same-sex spouses. In 2017, 2.9% of all households were same-sex couple households. 77.4% of these households were male couples.\n\n\n== History ==\n\n\n=== 1950s and 1960s ===\nStarting in 1950, in parallel to McCarthyism, the \"Lavender Scare\" resulted in the firing of thousands of government employees and contractors who were believed to be gay or lesbian, on the grounds of a tenuous perceived connection between homosexuality and espionage. Washington, D.C. vice squad lieutenant Roy Blick asserted to the Senate without evidence that there were 5,000 homosexual government employees. In 1961, following the Lavender Scare, Frank Kameny and Jack Nichols founded the Washington chapter of the Mattachine Society, adapting tactics learned from the civil rights movement and organizing pickets at the White House, Pentagon, and State Department.\n\n\n=== 1970s and 1980s ===\nIn 1970, activists from the civil rights movement, antiwar movement, and Black Panthers created the Gay Liberation Front-DC. The group staged public demonstrations and helped organize Washington's first gay pride in May 1972. The festival took place in Lafayette Park and at George Washington University and featured a dance, a drag show, and a religious celebration.\nIn 1971, Kameny ran unsuccessfully in the 1971 District of Columbia's at-large congressional district special election.\nThe Furies Collective, a lesbian feminist collective whose members included Rita Mae Brown and Joan E. Biren, pressured the National Organization for Women to accept lesbians in the early 1970s.\nA former member of the Gay Liberation Front-DC, Deacon Maccubbin, opened Lambda Rising in 1974. The now-defunct bookstore was one of the United States' largest gay bookstores and provided a space for other community groups. Maccubbin organized the first official DC gay pride in 1975.\nIn 1979, students at Howard University created the Lambda Student Alliance, the first organization for LGBT students created at a historically black college or university. In October the same year, the National Third World Lesbian and Gay Conference took place at an unknown hotel near the university, coinciding with the first National March on Washington for Lesbian and Gay Rights.\nIn 1982, James Tinney created Faith Temple to cater to LGBT Christians.The Second National March on Washington for Lesbian and Gay Rights was a large political rally that took place in Washington, D.C., on October 11, 1987.\nThe AIDS Memorial Quilt, originally created by Cleve Jones in response to the assassination of Harvey Milk was displayed on the National Mall in 1987.\n\n\n=== 1990s and 2000s ===\nThe March on Washington for Lesbian, Gay and Bi Equal Rights and Liberation in 1993 generated widespread attention and included a performance by Melissa Etheridge. The 1993 march was organized by Urvashi Vaid, the president of the National Gay and Lesbian Task Force. According to Joan E. Biren, this was the first time Jumbotrons were set up on the National Mall aside from government-organized events.The Millennium March on Washington was an event to raise awareness and visibility of lesbian, gay, bisexual and transgender (LGBT) people and issues of LGBT rights in the US, it was held April 28 through April 30, 2000.\nThe National Equality March was a national political rally that occurred October 11, 2009 in Washington, D.C.\n\n\n=== 2010s and 2020s ===\nIn 2015, following the U.S. Supreme Court rulings that states must recognize same-sex marriages, the White House was lit in with the colors of the Pride flag.\n\nIn 2017, protesters with No Justice No Pride blocked the Capital Pride Parade near 15th Street NW and P Street NW. The group opposed Capital Pride's corporate sponsorship and cooperation with police, and accused the event of marginalizing minorities. The parade was re-routed onto 16th Street NW and towards Rhode Island Avenue, while Police allowed the group to continue protesting with no arrests.The National Pride March took place on June 11, 2017 alongside Capital Pride. Marchers walked past the White House towards the U.S. Capitol.\n\n\n== Neighborhoods ==\n\n\n=== Dupont Circle ===\nThe Dupont Circle neighborhood is a historical hub of LGBT life in Washington D.C. The area hosts several LGBT events, including the 17th Street High Heel Race and the Capital Pride Parade. The neighborhood also has several gay bars, including JR's. A stretch of 17th Street NW is named in honor of Frank Kameny. Before closing in 2010, the Lambda Rising bookstore was located on Connecticut Avenue NW.\n\n\n=== The Gay Way ===\nThe neighborhood around 8th Street Southeast was the location of many LGBT establishments from the 1960s through the 1980s and became known as \"The Gay Way.\" Following riots in 1968, 8th Street became a hub for LGBT culture, including lesbian bars Phase 1, Jo-Anna's, and Club Madame. As the area gentrified in the 2000s, many LGBT establishments closed. \n\n\n== Organizations and community institutions ==\n\nMany LGBT nonprofit organizations have headquarters in Washington, D.C., including:\n\nHuman Rights Campaign\nLGBTQ Victory Fund\nNational Center for Transgender Equality\nNational LGBTQ Task Force\nNational LGBT Chamber of Commerce\nPFLAGAdditionally, a number of local organizations provide services to the LGBT community in the Washington metropolitan area, including:\n\nCasa Ruby\nThe DC Center for the LGBT Community\nSupporting and Mentoring Youth Advocates and Leaders (SMYAL)\nUs Helping Us\nWhitman-Walker Health\n\n\n== Media ==\n\nThe Washington Blade is the oldest LGBT newspaper in the United States, with its first issue published in 1969 and its first newsprint edition published in 1974. The American radical feminist periodical off our backs was first published in 1970, and ran until 2008. Blacklight, a periodical for black lesbians and gay men was first published in 1979. Metro Weekly has been published since 1994.\n\n\n== Recreation ==\n\n\n=== Nightclubs, bars and other businesses ===\nMany gay bars are located throughout Washington, D.C., with notable locations including JR's, Number 9, Nellie's Sports Bar, and The Fireplace.\n\n\n==== Defunct ====\n\nNob Hill opened in 1957, and was one of the first African-American gay bars in the United States.Located in a former Tropical Oil Company warehouse within the industrial neighborhood of Buzzard Point, Pier 9 was a gay disco open from 1970 through the early 1980s. In 2001, another gay club, Ziegfeld's/Secrets, opened in the building. Ziegfeld's/Secrets had opened in 1980 in another location on O Street S.E. but was forced to move due to the construction of Nationals Park. The club closed in March 2020, during the COVID-19 pandemic, and the building was demolished as part of the redevelopment of Buzzard Point.Operating from 1971 to January 2016, Phase 1 had been the longest continuously running lesbian bar in the country. The bar's second location, Phase 1 Dupont, was open from 2012 to 2014.The LGBT bookstore Lambda Rising operated from 1974 to 2010.Ray Melrose opened the Enik Alley Coffeehouse in 1982. The coffeehouse served as a meeting space for LGBT people of color, particularly black lesbians.\nDelta Elite Social Club in the Brookland neighborhood catered to black LGBTQ people until it closed in 2014.Lace on the Avenue, a nightclub for LBTQ women of color  was open from 2008 to 2014.\n\n\n=== Events ===\n\nThe first Capital Pride Parade was held in 1975, following a small event festival in May 1972.The 17th Street High Heel Race, drag queen sprint, takes place annually in Dupont Circle on the Tuesday before Halloween.D.C. Black Pride includes a week of events, and was noted as the first Black Pride event in the U.S.\n\n\n== Notable people ==\n\nRuby Corado, trans activist\nKelela, singer and songwriter\nJ. August Richards, actor\nAndré Leon Talley, fashion journalist and former editor-at-large of Vogue magazine\nTatianna, drag queen\nMichael W. Twitty, writer and culinary historian\nSamira Wiley, actress\n\n\n== See also ==\nLGBT rights in the District of Columbia\nLGBT culture in Baltimore\n\n\n== References ==", "links": ["1968 Washington, D.C., riots", "1971 District of Columbia's at-large congressional district special election", "Agence France-Presse", "André Leon Talley", "Annie's Paramount Steakhouse", "Bet Mishpachah", "Black Panther Party", "Black people", "Buzzard Point", "Capital Pride (Washington, D.C.)", "Capital city", "Casa Ruby", "Christians", "CiteSeerX (identifier)", "Civil rights movement", "Cleve Jones", "D.C. Black Pride", "DC Cowboys", "Deacon Maccubbin", "Death of Tyra Hunter", "Dr. Franklin E. Kameny House", "Dupont Circle", "Editor-at-large", "Espionage", "Federal government of the United States", "Feminism", "Frank Kameny", "GLIFAA", "Gallup (company)", "Gay Liberation Front", "Gay Men's Chorus of Washington, D.C.", "Gay Women's Alternative", "Gay and Lesbian Activists Alliance", "Gay bar", "Gentrification", "George Washington University", "Halloween", "Harvey Milk", "High Heel Drag Queen Race", "Historically black colleges and universities", "Homosexuality", "House of Aviance", "Howard University", "Human Rights Campaign", "ISBN (identifier)", "ISSN (identifier)", "J. August Richards", "Jack Nichols (activist)", "James Tinney", "Joan E. Biren", "Jumbotron", "Kelela", "LGBT", "LGBTQ Victory Fund", "LGBT culture in Austin, Texas", "LGBT culture in Baltimore", "LGBT culture in Boston", "LGBT culture in Chicago", "LGBT culture in Dallas–Fort Worth", "LGBT culture in Eugene, Oregon", "LGBT culture in Houston", "LGBT culture in Los Angeles", "LGBT culture in Metro Detroit", "LGBT culture in Miami", "LGBT culture in Nashville", "LGBT culture in New York City", "LGBT culture in Philadelphia", "LGBT culture in Portland, Oregon", "LGBT culture in San Francisco", "LGBT culture in Seattle", "LGBT culture in St. Louis", "LGBT history", "LGBT rights in the District of Columbia", "Lafayette Square, Washington, D.C.", "Lambda Rising", "Lavender scare", "Lesbian Concentrate", "List of LGBT people from Chicago", "List of LGBT people from New York City", "List of LGBT people from Portland, Oregon", "List of LGBT people from San Francisco", "List of LGBT people from Seattle", "Logan Circle (Washington, D.C.)", "March on Washington for Lesbian, Gay and Bi Equal Rights and Liberation", "Mattachine Society", "McCarthyism", "Melissa Etheridge", "Metro Weekly", "Michael W. Twitty", "Millennium March on Washington", "NAMES Project AIDS Memorial Quilt", "National Center for Transgender Equality", "National Equality March", "National LGBTQ Task Force", "National LGBT Chamber of Commerce", "National Mall", "National March on Washington for Lesbian and Gay Rights", "National Organization for Women", "National Pride March", "Nationals Park", "No Justice No Pride", "Nonprofit organization", "OCLC (identifier)", "Off Our Backs", "Off our backs", "Olivia Records", "One in Ten (organization)", "Opposition to United States involvement in the Vietnam War", "PFLAG", "Phase 1 (bar)", "Pride parade", "Radical feminism", "Rainbow flag (LGBT)", "Reel Affirmations", "Rita Mae Brown", "Roy Early Blick", "Ruby Corado", "Same-sex marriage in the District of Columbia", "Samira Wiley", "Second National March on Washington for Lesbian and Gay Rights", "Supporting and Mentoring Youth Advocates and Leaders (SMYAL)", "Tatianna", "The DC Center for the LGBT Community", "The Furies Collective", "The Pentagon", "The Rainbow History Project", "The Sydney Morning Herald", "The Washington Blade", "Tropical Oil Company", "United States", "United States Capitol", "United States Census Bureau", "United States Department of State", "Urvashi Vaid", "Us Helping Us", "Velvet Nation", "Vogue (magazine)", "Washington Blade", "Washington Metropolitan Area", "Washington metropolitan area", "White House", "Whitman-Walker Health", "Williams Institute"]}