{
    "url": "https://en.wikipedia.org/wiki/Louis_Conneau",
    "title": "Louis Conneau",
    "summary": "Louis Napoléon Eugène Joseph Conneau (born 9 January 1856, at Paris; died 29 January 1930, at Chaville and was buried in Montmartre Cemetery) was a French general who graduated from Saint Cyr military academy as part of the class of 1874–1876.",
    "content": "Louis Napoléon Eugène Joseph Conneau (born 9 January 1856, at Paris; died 29 January 1930, at Chaville and was buried in Montmartre Cemetery) was a French general who graduated from Saint Cyr military academy as part of the class of 1874–1876.\n\n\n== Early life ==\nLouis Conneau was the son of Dr. Henri Conneau, a good friend of Napoléon III, who aided the future sovereign to escape from his imprisonment at Ham and served as physician to Napoléon III and his wife when they were emperor and empress. Conneau, who was named after members of the Bonaparte family, his given names being those of the emperor's brothers and of Eugene de Beauharnais, was born and raised at the Tuileries Palace with the Prince Imperial, who was younger than Conneau by only two months. After the fall of the Second Empire, the two attended the Royal Military Academy, Woolwich, together. They remained friends until the prince's death in 1879, sharing an Occitan oath: Passavant le meillor (\"Accepting only the best\"). From 1874–1876 Conneau attended, without the prince, Saint Cyr military academy, graduating as an army sub-lieutenant and joining the 23rd Dragoons.\nOn 30 June 1900, Conneau married Adèle Marguerite Fourrier. They had three children.\n\n\n== Military career ==\nAt the beginning of World War I, Conneau held the rank of général de division and commanded the 10th Cavalry Division, which immediately moved east of Lunéville. In October 1914, Conneau was put in command of the 1st Cavalry Corps, a command he held until 1917. The corps took part in operations around Sarrebourg and, after the Great Retreat ended and the offensive recommenced, played an important role in the First Battle of the Marne, supporting the Fifth Army during operations around Berry-au-Bac, Pontavert, and Sissonne. During the Race to the Sea, Conneau commanded the 1st and 2nd cavalry corps, which included French and British units. Never had such a large cavalry unit operated under one command. It became known as the Conneau Cavalry Corps.\nIn the trench warfare that followed the Battle of the Marne, the Conneau Corps sometimes supported one army, sometimes another, and sometimes acted independently with attached infantry divisions. In 1918, having reached the age limit for active command, Conneau became part of the reserve and commanded, at Châlons-sur-Marne, the 6th Region at the height of the German bombing.\n\n\n== Decorations ==\nCommander, then Grand Officer (to rank from 1 April 1917), of the Legion of Honour\nKnight Grand Cross of the British Order of St Michael and St George\nKnight Grand Cross of the Russian Order of Saint Anna\nKnight of the Italian Order of Saints Maurice and Lazarus\nOfficer of the Mexican Order of Our Lady of Guadalupe\n\n\n== See also ==\nFrench Army in World War I\n\n\n== References ==",
    "links": [
        "10th Cavalry Division (France)",
        "1st Cavalry Corps (France)",
        "2nd Cavalry Corps (France)",
        "5th Army (France)",
        "Augustin Filon",
        "Berry-au-Bac",
        "Chaville",
        "Croix de guerre 1914-1918 (France)",
        "Divisional general",
        "Eugene de Beauharnais",
        "First Battle of the Marne",
        "France",
        "French Army",
        "French Army in World War I",
        "Great Retreat",
        "Ham, Somme",
        "Hdl (identifier)",
        "ISBN (identifier)",
        "ISNI (identifier)",
        "Legion of Honour",
        "Lunéville",
        "Légion d'honneur",
        "Montmartre Cemetery",
        "Napoléon, Prince Imperial",
        "Napoléon III",
        "OCLC (identifier)",
        "Occitan language",
        "Order of Our Lady of Guadalupe",
        "Order of Saint Anna",
        "Order of Saints Maurice and Lazarus",
        "Order of St Michael and St George",
        "Paris",
        "Pontavert",
        "Race to the Sea",
        "Royal Military Academy, Woolwich",
        "Sarrebourg",
        "Second French Empire",
        "Sissonne",
        "Sub-lieutenant",
        "Trench warfare",
        "Tuileries Palace",
        "VIAF (identifier)",
        "World War I",
        "École spéciale militaire de Saint-Cyr"
    ]
}