{
    "url": "https://en.wikipedia.org/wiki/Lynching_of_Deben_Dutta",
    "title": "Lynching of Deben Dutta",
    "summary": "The lynching of Deben Dutta happened on 31 August 2019 when the Teok Tea Estate hospital of Jorhat district in Assam was attacked by a mob of tea garden workers angry that treatment delays had caused the death of a worker.\n\n",
    "content": "The lynching of Deben Dutta happened on 31 August 2019 when the Teok Tea Estate hospital of Jorhat district in Assam was attacked by a mob of tea garden workers angry that treatment delays had caused the death of a worker.\n\n\n== Hospital attack ==\nDr. Deben Dutta (age 73) was working as the senior medical officer at Teok Tea Estate Hospital when a mob attacked following the allegation of treatment of a tea garden worker Somra Majhi's treatment delay resulted in the worker's death. Dutta attempted to calm the mob but was assaulted and also injured by broken glass stones thrown at the hospital's windows. The mob called for the doctor's lynching, delayed an ambulance arriving at the scene, and prevented Dutta from receiving medical treatment for his injuries.A team of the Central Reserve Police Force arrived one and half hours later, and they took Dutta to Jorhat Medical College Hospital but he had already died of injuries.  Dutta was blamed for not being present at the hospital when Somra Majhi was admitted in critical condition.\n\n\n== Tea Estate doctors resign ==\nThe incident sparked fear amongst the doctors working in Tea Estate hospitals and 7 doctors resigned from their jobs for their security concerns. Following the incident, the Indian Medical Association and Assam Medical service called for a withdrawal of medical services by doctors for 24 hours and on 3 September the doctors across the state withdrew their services except for emergency cases. Further, on 4 September, the Indian Medical Association sought a report from the Assam Chief Minister Sarbananda Sonowal within 24 hours and wrote to the Prime Minister, Home Minister, and the Health Minister demanding a legal act to protect health workers. The World Medical Association also condemned the lynching of Dutta and wrote to Prime Minister Narendra Modi and Health Minister Harsh Vardhan, following which the Home Ministry of India drafted the Healthcare Service Personnel and Clinical Establishments (Prohibition of Violence and Damage to Property) Bill, 2019.\n\n\n== Family seeks justice ==\nDutta's family wrote to the Prime Minister of India Narendra Modi seeking justice for the incident. The family of Dutta and the Indian Medical Association  demanded a fast-track trial of the case.\n\n\n== Investigation ==\nInvestigating the incident of Dutta's killing, the Assam Police arrested 32 people and submitted a charge sheet of 602 pages that included 56 witnesses. The investigation was led by Deputy Inspector general Shiv Prasad Ganjawala. The Assam government decided the trial to be in a fast-track court.\n\n\n== Sentencing ==\nThe trial of the case ended on 12 October 2020. The session court of Jorhat 25 of the 32 accused were convicted under sections 147 (punishment for rioting), 148 (punishment for rioting and armed with deadly weapon), 302 (punishment for murder), 342 (punishment for wrongful confinement), 353 (punishment for assault or criminal force to deter public servant from discharge of his duty) of the Indian Penal Code and, on 19 October, the court awarded death penalty to one (Sanjay Rajkonwar), and life imprisonment to 24 others for murder of Dutta. Six of the accused were acquitted due to lack of evidences, one accused (Hari Majhi) died during the trial. After the judgment was delivered, the Assam Police stated that the case is the first case in India, where witness identity concealment approach was used.\n\n\n== See also ==\n2018 Karbi Anglong lynching\n2013 Jhankar Saikia mob lynching\n\n\n== References ==\n\n\n== Further reading ==\nKumar, Raman (December 2019). \"Death of a doctor - Ek Doctor Ki Maut-Time to boost the ailing and failing public health system in India\". Journal of Family Medicine and Primary Care. 8 (12): 3771–3772. doi:10.4103/jfmpc.jfmpc_897_19. PMC 6924225. PMID 31879611.",
    "links": [
        "2013 Jhankar Saikia mob lynching",
        "2018 Karbi Anglong lynching",
        "Assam",
        "Assam Police",
        "Capital punishment",
        "Central Reserve Police Force",
        "Deccan Herald",
        "Deputy inspector general of police",
        "Doi (identifier)",
        "Geographic coordinate system",
        "Government of Assam",
        "Harsh Vardhan (Delhi politician)",
        "Hindustan Times",
        "India",
        "Indian Medical Association",
        "Indian Penal Code",
        "Jorhat Medical College and Hospital",
        "Jorhat district",
        "Life imprisonment",
        "List of chief ministers of Assam",
        "Minister of Home Affairs (India)",
        "Ministry of Home Affairs (India)",
        "NDTV",
        "Nagaland Post",
        "Narendra Modi",
        "Outlook (Indian magazine)",
        "PMC (identifier)",
        "PMID (identifier)",
        "Prime Minister of India",
        "Sarbananda Sonowal",
        "Scroll.in",
        "Teok",
        "The Economic Times",
        "The Indian Express",
        "The New Indian Express",
        "The Statesman (India)",
        "The Telegraph (India)",
        "The Week (Indian magazine)",
        "The Wire (India)",
        "World Medical Association"
    ]
}