{
    "url": "https://en.wikipedia.org/wiki/Manoj_Gogoi",
    "title": "Manoj Gogoi",
    "summary": "Manoj Gogoi (Assamese: মনোজ গগৈ) is an Indian wildlife conservationist and wildlife rehabilitationist from Assam. He has rescued over  5000 Animals in Kaziranga National Park, a national park in the Golaghat, Karbi Anglong and Nagaon districts of the state of Assam, India. He is widely known for saving desperate animals from the annual Assam floods.",
    "content": "Manoj Gogoi (Assamese: মনোজ গগৈ) is an Indian wildlife conservationist and wildlife rehabilitationist from Assam. He has rescued over  5000 Animals in Kaziranga National Park, a national park in the Golaghat, Karbi Anglong and Nagaon districts of the state of Assam, India. He is widely known for saving desperate animals from the annual Assam floods.\n\n\n== Early life and education ==\nGogoi was born in Bochagaon village of Kaziranga to Junaram and Rupa Gogoi on 4 January 1975. He completed his high school leaving certificate examination from Kohora National Park High School in the year 1992. He dropped out of higher secondary school in order to pursue his passion. During initial days, he started working as a gypsy driver-cum-tourist guide ferrying tourists inside the Kaziranga National Park.\n\n\n== Personal life ==\nHe is married to Kashmiri Saikia Gogoi. He tied the knot with Kashmiri in 2005.\n\n\n== Wildlife conservation works ==\nGogoi is a keen bird watcher and a naturalist. He grew up in the lap of nature teeming with various birds, rhinoceros, leopards, and snakes, even venomous ones. After working as a gypsy driver-cum-tourist guide ferrying tourists  till 2013, Gogoi decided to become a full-fledged environmentalist after a chance meeting with Kedar Gore, director of Corbett Foundation.Gogoi was a part of a television documentary filmed by wildlife film maker Vijay Bedi, which was aired on Animal Planet and Discovery Channel. The Corbett Foundation awarded him with the title ‘Wildlife Warrior’ in 2014.\n\n\n== Award ==\nGogoi receives India Star Passion Award 2019 for his social service (environment).\n\n\n== References ==",
    "links": [
        "Animal Planet",
        "Assam",
        "Discovery Channel",
        "Golaghat district",
        "Indian Pond Heron",
        "Indian hog deer",
        "Jim Corbett National Park",
        "Karbi Anglong district",
        "Kaziranga National Park",
        "King cobra",
        "List of national parks of India",
        "Nagaon district",
        "Scroll.in",
        "Television documentary",
        "Vijay Bedi",
        "Wildlife conservation",
        "Wildlife rehabilitation"
    ]
}