{
    "url": "https://en.wikipedia.org/wiki/Manuel_Roxas",
    "title": "Manuel Roxas",
    "summary": "Manuel Acuña Roxas (born Manuel Roxas y Acuña; Tagalog: [maˈnwel aˈkuɲa ˈɾohas]; January 1, 1892 – April 15, 1948) was the fifth president of the Philippines, who served from 1946 until his death in 1948. He briefly served as the third and last president of the Commonwealth of the Philippines from May 28, 1946, to July 4, 1946, and became the first president of the independent Third Philippine Republic after the United States ceded its sovereignty over the Philippines.",
    "content": "Manuel Acuña Roxas (born Manuel Roxas y Acuña; Tagalog: [maˈnwel aˈkuɲa ˈɾohas]; January 1, 1892 – April 15, 1948) was the fifth president of the Philippines, who served from 1946 until his death in 1948. He briefly served as the third and last president of the Commonwealth of the Philippines from May 28, 1946, to July 4, 1946, and became the first president of the independent Third Philippine Republic after the United States ceded its sovereignty over the Philippines.\n\n\n== Early life and career ==\nRoxas was born on January 1, 1892, in Capiz, Capiz (present-day Roxas City) to Gerardo Roxas y Arroyo and Rosario Acuña y Villaruz. He was a posthumous child, as his father died after being mortally wounded by the Spanish Guardia Civil the year before. He and his older brother, Mamerto, were raised by their mother and her father, Don Eleuterio Acuña. His other siblings from his father included Leopoldo and Margarita, while he also had half siblings, Consuelo, Leopoldo, Ines and Evaristo Picazo, after his mother remarried.\nRoxas received his early education in the public schools of Capiz and attended St. Joseph's College in Hong Kong at age 12, but due to homesickness, he went back to Capiz. He eventually transferred to Manila High School, graduating with honors in 1909.\nRoxas began his law studies at a private law school established by George A. Malcolm, the first dean of the University of the Philippines College of Law. On his second year, he enrolled at University of the Philippines, where he was elected president of both his class and the student council. In 1913, Roxas obtained his law degree, graduated class valedictorian, and subsequently topped the bar examinations with a grade of 92% on the same year. He then became professor of law at the Philippine Law School and National University. He served as secretary to Judge Cayetano Arellano of the Supreme Court.\n\n\n== Political career ==\n\nIn 1917, Roxas became a member of the municipal council of Capiz, serving until 1919. He then became the youngest provincial governor of Capiz, and served in that capacity from 1919 to 1922.Roxas was elected to the Philippine House of Representatives in 1922, and for twelve consecutive years was Speaker of the House. He served as a member of the Constitutional Convention of 1934, secretary of finance, chairman of the National Economic Council, chairman of the National Development Company, and served in many other government corporations and agencies. He also served as a brigadier general in the United States Army Forces in the Far East (USAFFE), was a recognized guerrilla leader and military leader of the Philippine Commonwealth Army. Roxas became one of the leaders of the Nacionalista Party, which was dominated by the hacendado class who owned the vast hacienda estates that made up most of the cultivated land in the Philippines. The same hacendado elite who dominated the Philippines under Spanish rule continued to be the dominant social element under American rule. Roxas himself was a hacendado, who had used his wealth to further his political ambitions. The politics of the Philippines were characterized by a clientistic system under which politicians would use their offices to create patronage networks, and personal differences between politicians were far greater than any ideological differences.With the Great Depression, the Philippines started to be seen as a liability in the United States as demands were made to end Filipino immigration to the United States and end the tariff free importation of Filipino agriculture into the American market as many American farmers complained they could not compete with Filipino farmers. To end Filipino immigration and access to the American market, many U.S. congressional leaders favored granting immediate independence to the Philippines. At the same time that the U.S. Congress was debating granting independence to the Philippines, many Filipino leaders were worried by the increasing assertive claims being made by Japan that all of East Asia was its sphere of influence. In a role reversal, it was the Filipinos who were opposed to immediate independence, which was proposed in the Hare-Hawes-Cutting Bill being debated within the halls of Congress.In early 1930, Roxas flew to the United States with Sergio Osmeña to lobby the U.S. Congress to go slow on the granting of independence in the Hare-Hawes-Cutting Bill. Aside from the fear of Japan, many Filipinos were deeply worried about the plans to impose heavy tariffs on Filipino agriculture after independence, which provided another reason to go slowly with independence. In Washington, Roxas lobbied U.S. government leaders such as Secretary of State Henry Stimson and Secretary of War Patrick Hurley. Roxas testified before the U.S. Congress that he favored Philippine independence, saying the Filipinos had fulfilled the \"stable government\" provision of the Jones Act of 1916, which mandated that independence be granted when Filipinos proved that they had a \"stable government\". However, Roxas went on to testify that \"with the granting of tariff autonomy, serious difficulties may arise\". In common with the rest of the Filipino elite, Roxas saw the plans of the U.S. Congress to impose tariffs on Filipino goods after independence as an economic disaster for the Philippines.In May 1930, Roxas reported to Manuel L. Quezon that both Hurley and Stimson had testified before the U.S. Congress saying that the Philippines were not ready for independence nor would be for anytime in the foreseeable future, which he thought had a major impact on the U.S. Congress. Roxas advised that Quezon should now try to appease Senators Harry B. Hawes and Bronson B. Cutting by sending them a message saying he wanted immediate independence, which Roxas felt was not likely at present. On May 24, 1930, Quezon followed Roxas's advice and sent public telegrams to both Hawes and Cutting saying the Filipinos \"crave their national freedom\". In a compromise, the Senate Insular Committee advised on June 2, 1930, that the Philippines should be given more autonomy to prepare for independence within the next 19 years. Upon his return to the Philippines in 1930, Roxas founded a new pro-independence group called Ang Bagong Katipunan (\"The New Association\") that proposed disbanding all political parties under its fold and the unification of national culture in order to negotiate better with the United States. The plans for Ang Bagong Katipunan created widespread opposition, as the group was seen as too authoritarian and as a vehicle for Roxas to challenge Quezon for the leadership of the Nacionalista Party. Ang Bagong Katipunan was soon disbanded.In the summer of 1931, Hurley visited the Philippines to assess its readiness for independence. In talks with Quezon, Osmeña and Roxas, it was agreed that the Philippines should become an autonomous commonwealth under American rule and would be allowed to keep exporting sugar and coconut oil to the United States at the present rate. Roxas became seen as one of the less radical independence leaders, who favored \"going slow\" on independence to keep access to the U.S. market. At the time, Roxas cynically stated he and the other Nacionalistas had to make \"radical statements for immediate, complete and absolute independence to maintain hold of the people\". Filipino politics tended to be based more on personal loyalties to a politician who would reward his followers via patronage rather than ideological issues, and despite criticism of the Democratas that the Nacionalistas had abandoned their platform, the Nacionalistas triumphed in the election of 13 July 1931. In the election, Roxas was reelected and returned to his position as speaker of Philippine House of Representatives. In September 1931, Japan seized the Manchuria region of China. After the Mukden incident, the leaders of both the U.S. Army and U.S. Navy started to argue in Washington that the Philippines occupied a strategical position in Asia, as naval and air bases located in the Philippines would allow any power that controlled them to dominate the South China Sea, the key sea that linked the markets of Southeast Asia to China. The prevailing opinion within the U.S. military was that the United States needed its Philippine bases to deter Japan from trying to seize control of all of East Asia.In 1933, Roxas and Osmeña flew to Washington to negotiate Filipino independence from the United States. The Americans agreed to grant the Filipinos independence, but only on the condition that the United States be allowed to retain military bases in the Philippines, a condition that led for the act to be rejected by the Philippine Congress. Quezon was late to state that the allowing of the United States to retain its bases in the Philippines would make Filipino independence no different from the independence of the Japanese sham state of Manchukuo.\n\n\n=== Senate ===\n\nAfter amendments to the 1935 Philippine Constitution were approved in 1941, Roxas was elected to the Philippine Senate, but was unable to serve until 1945 because of the outbreak of World War II. The United States was scheduled to grant the Philippines independence in 1945 while Japan started to make claims for a Greater East Asia Co-Prosperity Sphere from 1940 onward. In common with other members of the Filipino elite, Roxas started to cultivate ties with Japan as it was unclear whatever the Philippines would remain in the American sphere of influence after independence or fall into the Japanese sphere of influence. However, as the United States was planning on granting independence, ending more than 400 years of foreign rule, Filipino public opinion was hostile to the idea of the Philippines joining the Greater East Asia Co-Prosperity Sphere.Having enrolled prior to World War II as an officer in the reserves, Roxas was made liaison officer between the Commonwealth government and the USAFFE headquarters of General Douglas MacArthur. On December 7, 1941, Japan went to war against the United States, bombing the U.S. naval base in Pearl Harbor, Hawaii while also bombing American bases in the Philippines. Shortly after, Japanese invasion forces landed on Luzon, the largest and most populous of the islands of the Philippine archipelago. MacArthur had claimed that the American–Filipino forces under his command would stop any Japanese invasion \"on the beaches\", but instead the Japanese forces marched on Manila, the capital and largest city of the Philippines. Roxas accompanied President Quezon to Corregidor where he supervised the destruction of Philippine currency to prevent its capture by the Japanese. When Quezon left Corregidor, Roxas went to Mindanao to direct the resistance there. It was prior to Quezon's departure that he was made executive secretary and designated as successor to the presidency in case Quezon or Vice President Sergio Osmeña were captured or killed. On January 3, 1942, President Quezon presented General MacArthur with a secret guaranty of $500,000.  The payment was related to the Filipino concept of utang na loob, where one offers a lavish gift in order to create a reciprocal obligation from the individual who receives the gift. Through the payment was legal, it was questionable from an ethical perspective, and MacArthur always kept the payment secret, which did not become public knowledge until 1979. Later that year, Quezon offered payment to General Dwight D. Eisenhower, which he refused, saying that as a United States Army official, his first loyalty was to the United States, which made accepting such a payment as morally wrong in his viewpoint. Roxas was one of the few people who did know about Quezon's gift to MacArthur.Roxas was captured in April 1942 by the Japanese invasion forces. He became chief advisor to the collaborationist government of José P. Laurel. The American historian Gerhard Weinberg wrote that through many claims have been made that Roxas was secretly a member of the Filipino resistance during the Japanese occupation, no evidence has ever emerged to support these claims. The American journalist Richard Rovere wrote that the evidence that Roxas was actually a resistance fighter was \"obscure\". Rovere described Roxas as typical of the Filipino hacendado class (the wealthy owners of the hacienda estates) who sought to opportunistically ingratiate themselves with whatever power ruled the Philippines. An additional reason for the hacendados to support the Japanese occupation was that the main resistance group, the Hukbong Bayan Laban sa Hapon  (People's Army against the Japanese), better known as the Huks, was a Communist movement. Besides for opposing the Japanese, the Huks promised land reform, by breaking up the haciendas, which caused the hacendados as a group to support the Japanese. The Manila chapter of the fascist Falange party had a membership of about 10, 000 people, including members of the most prominent hacendado families such as the Ayalas, Zobels, Elizaldes and Sorianos. By 1945, the Huks had over 70, 000 guerrillas in action, making them into easily the largest resistance group in the Philippines. The American historian Russell Buhite wrote: \"Roxas was the Philippine equivalent of the fabled French statesman Charles Maurice de Tallyrand who was able to blend with the wind, able to work with authority wherever he found it\". The American historian Richard Bernstein stated: \"If Japan had won the war...the top man in the Philippines today would probably have been Manuel Roxas\". \nRoxas was captured in April 1942 by Japanese invasion forces. He became chief advisor to the collaborationist government of José P. Laurel.During the Japanese occupation, Roxas was in charge of the rice procurement agency for the collaborationist government from 1943 onward, which helped Japan exploit its the Philippines by gathering up the rice harvests to feed the Japanese forces in Southeast Asia. The ruthless policies of confiscating rice harvests pushed many of the Filipino peasantry to the brink of starvation and made Roxas into one of the most hated men in the Philippines. Roxas served in the Laurel government until April 1945, when he surrendered to American forces at Baguio. After his capture, MacArthur announced that Roxas was really a resistance fighter. It appears that MacArthur was blackmailed by Roxas, who threatened to reveal the guaranty he accepted in 1942. This was especially the case as MacArthur had ambitions to run as the candidate of the Republican Party for the 1944 United States presidential election. MacArthur's political ambitions were an open secret at the time, because in early 1944, letters between MacArthur and Congressman Albert Miller were leaked to the press. In his letters to Miller, MacArthur expressed his loathing for President Franklin D. Roosevelt and the New Deal, and dropped broad hints that he would be willing to accept the Republican nomination for the presidential election to be held after the war.Shortly after his capture, Roxas told the Americans that he wanted the United States to keep its military bases in the Philippines after independence in 1946, and promised to use all of his influence to persuade the Filipino congress to accept independence on those terms. Buhite wrote that by pardoning Roxas, MacArthur \"...undermined his ability to treat other collaborators more harshly\". Beyond his presidential ambitions, MacArthur had additional reasons to treat Roxas leniently. MacArthur had a low opinion of the average Filipino and believed that the men of the hacendado class were only people capable of providing the Philippines with competent leadership. The general felt that whatever Roxas and the other hacendados had done during the Japanese occupation was irrelevant compared to the need to have the haendados continue as the dominant group as MacArthur believed that the Philippines would descend into anarchy without the leadership of the haendados.Osmeña was opposed to MacArthur's rehabilitation of Roxas, only to receive the reply that: \"I have known General Roxas for over twenty years, and I know that he is no threat to our military security. Therefore we are not detaining here\". MacArthur strongly disliked President Osmeña, whom he felt was an incompetent leader, and much preferred Roxas to be the country's next president. The charismatic Roxas made for more appealing social company, and he proceeded to massage MacArthur's ego through flattery. Moreover, Osmeña had often opposed MacArthur before the war was another point against him as far as MacArthur was concerned, who was quite determined that Roxas should be the first president after independence. President Osmeña traveled to Washington in early 1945 to appeal for President Roosevelt's help against MacArthur, but he made tactless remarks in his meeting at the White House that Roosevelt declared after meeting him that MacArthur should be allowed to rule the Philippines whatever way he liked. MacArthur announced in a speech that Roxas was \"one of the prime factors in the guerilla movement\" against the Japanese, an image which Roxas himself had embraced. Aside from Roxas, MacArthur pardoned over 5,000 Filipino collaborators, and despite the fact that over 80% of the Filipino Army officers went over to the Japanese in 1942, these men had their commissions restated.When the Congress of the Philippines re-convened in 1945, legislators elected in 1941 Roxas as Senate president. Of all members of the 1st Commonwealth Congress, 8 out of 14 senators and 19 out of 67 representatives had collaborated with the Japanese during the occupation. In an attempt to undermine Osmeña's chances of winning the 1946 Philippine presidential election, MacArthur forced the Osmeña administration to make unpopular decisions while he groomed Roxas to run in the 1946 election. On April 12, 1945, President Roosevelt died and his vice-president, Harry S Truman, succeeded him. Truman had little interest in the Philippines, as he had more pressing concerns to face in his first months of office. When MacArthur left the Philippines for Japan to sign the armistice ending the war on August 30, 1945, the Philippines has been in a chaotic state, with the economy in tatters and the political status undecided.  When he took over the American occupation of Japan, MacArthur in turn lost his interest in the Philippines, only returning to Manila on July 4, 1946, to witness the declaration of Filipino independence before promptly returning to Tokyo.\n\n\n== Presidential election of 1946 ==\nPrior to the Philippine national elections of 1946, at the height of the last Commonwealth elections, Senate President Roxas and his friends left the Nacionalista Party and formed the Liberal Party. Roxas became their candidate for president and Elpidio Quirino for vice-president. The Nacionalistas, on the other hand, had Osmeña for president and Senator Eulogio Rodriguez for vice-president. Roxas had the staunch support of General MacArthur. The American military government strongly favored Roxas during the election, regarding him as the Filipino politician most likely to allow the American bases to continue in the Philippines after independence. The British historian Francis Pike wrote that Roxas \"effectively brought\" the 1946 election, helped by the fact that he owned the largest newspaper empire in the Philippines. The Roxas newspapers election coverage were essentially campaign ads for the Roxas campaign. Osmeña refused to campaign, saying that the Filipino people knew of his reputation. On April 23, 1946, Roxas won 54 percent of the vote, and the Liberal Party won a majority in the legislature.\n\n\n== Presidency ==\n\n\n=== Administration and cabinet ===\n\n\n=== Last president of the Commonwealth ===\nOn May 8, 1946, prior to his inauguration, president-elect Roxas, accompanied by United States High Commissioner Paul V. McNutt, left for the United States. During his U.S. visit, Roxas came out clearly for the United States to maintain its bases after independence, saying in a speech: \"We will welcome the existence of your naval, air and army bases on such of our soil as it is mutually agreeable for the common protection of the United States and the Philippines, and will co-operate in the defense and security of those bases insofar as it is within our power to do so\". After the experience of the Japanese occupation, Filipino public opinion was no longer against the presence of American bases after independence in quite the same way as before 1941. However, the U.S. government was apparently not aware of the change in public opinion, and favored Roxas as the man best able to allow the United States to keep its bases after independence.\nOn May 10, 1946, a draft agreement was signed in Washington allowing the United States to keep its Filipino bases for 99 years after independence. Roxas was willing to sign the agreement, but demanded that the number of American bases be reduced and complained that the sweeping immunity from Filipino law enjoyed by American military personnel envisioned in the agreement would not be popular with Filipino public opinion. He also made it clear that he was more comfortable with the Americans mostly having naval and air bases in the Philippines, and wanted the number of U.S. Army bases kept to the minimum. Some aspects of the Roxas desiderata were incorporated in the final agreement as the Americans agreed to reduce the number of bases in the Philippines after independence. Roxas's argument against the U.S. Army having bases were also incorporated in the agreement, through the fact that the Pentagon saw the Philippines primarily as a place to project power into Asia led to most of the American bases being naval and air bases. Furthermore, as long the Americans dominated the waters and air spaces around the Philippines, another invasion was unlikely. However, the Americans refused to give make concessions on the immunity issue, being adamant that American military personnel enjoy immunity from Filipino law after independence.\n\nOn May 28, 1946, Roxas was inaugurated as the last president of the Commonwealth of the Philippines. The inaugural ceremonies were held in the ruins of the Legislative Building (now part of the National Museum of the Philippines) and were witnessed by about 200,000 people. In his address, he outlined the main policies of his administration, mainly: closer ties with the United States; adherence to the newly created United Nations; national reconstruction; relief for the masses; social justice for the working class; the maintenance of peace and order; the preservation of individual rights and liberties of the citizenry; and honesty and efficiency of government.\nOn June 3, 1946, Roxas appeared for the first time before a joint session of Congress to deliver his first State of the Nation Address. Among other things, he told the members of the Congress the grave problems and difficulties the Philippines face and reported on his special trip to the United States to discuss the approval for independence.On June 21, Roxas reappeared in front of another joint session of Congress and urged the acceptance of two laws passed by the Congress of the United States on April 30, 1946—the Tydings–McDuffie Act, of Philippine Rehabilitation Act, and the Bell Trade Act or Philippine Trade Act. Both recommendations were accepted by the Congress. Under the Bell Trade Act, the goods from the Philippines were granted tariff-free access to the American market, achieving one of Roxas's key aims; in exchange, he accepted pegging the Philippine peso to the U.S. dollar and American corporations were granted parity rights when it came to exploiting the minerals and forests of the Philippines. In exchange for accepting the Bell Trade Act, the U.S. Congress voted for some $2 billion US in aid to the Philippines. Though the $2 billion was intended to assist with the reconstruction of the war-devastated nation, the vast majority of the money was stolen by Roxas and his corrupt friends. The American journalist Robert Shaplen noted after a visit to Manila: \"It may well be that in no other city in the world was there so much graft and corruption and conniving after the war\".In the congressional elections, the Huks joined forces with socialists and peasant unions to form a new party, the Democratic Alliance. The party won six seats in Congress on a platform of punishing collaborators, land reform and opposing the Bell Trade Act. Among the Huk leaders elected to Congress was the party's leader Luis Taruc. In what was described as \"a monstrous abrogation of democratic procedure\", Roxas expelled all members of Congress from the Democratic Alliance, claiming that they been elected illegally, and replaced them with his own bets. Roxas's expulsion of the Democratic Alliance from Congress was the beginning of a nation-wide purge of those who served in the Huk resistance against the Japanese as arrests and murders followed. Those who survived fled to the jungle and formed the Hukbong Mapagpalaya ng Bayan (the People's Revolutionary Army).\".\n\n\n=== First president of the Third Republic (1946–1948) ===\n\nRoxas served as the president of the Commonwealth of the Philippines in a brief period, from May 28, 1946, to July 4, 1946, during which time Roxas helped prepare the groundwork for an independent Philippines.\nRoxas's term as the president of the Commonwealth ended on the morning of July 4, 1946, when the Third Republic of the Philippines was inaugurated and independence from the United States proclaimed. The occasion, attended by some 300,000 people, was marked by the simultaneous lowering of the U.S. flag and raising of the Philippine national flag, a 21-gun salute, and the pealing of church bells. Roxas then took the oath of office as the first president of the new republic before Supreme Court Chief Justice Manuel Moran.\nThe inaugural ceremonies took place at Luneta Park in the City of Manila. On the Grandstand alone were around 3,000 dignitaries and guests, consisting of President Roxas, Vice President Quirino, their respective parties, and the Cabinet; first United States Ambassador to the Philippines Paul McNutt; General Douglas MacArthur (coming from Tokyo); United States Postmaster General Robert E. Hannegan; a delegation from the U.S. Congress led by Maryland Senator Millard Tydings (author of the Tydings–McDuffie Act) and Missouri Representative C. Jasper Bell (author of the Bell Trade Act); and former Civil Governor-General Francis Burton Harrison.\n\n\n=== Domestic policies ===\n\n\n==== Economy ====\nNo sooner had the fanfare of the independence festivities ended that the government and the people quickly put all hands to work in the tasks of rescuing the country from its dire economic straits. Reputed to be the most bombed and destroyed country in the world, the Philippines was in a sorry mess. Only Stalingrad and Warsaw, for instance, could compare with Manila in point of destruction. All over the country more than a million people were unaccounted for. The war casualties as such could very well reach the two million mark. Conservative estimates had it that the Philippines had lost about two thirds of her material wealth. In 1946, the Filipino gross domestic produce was down 38.7% from where it had been in 1937.The country was facing near bankruptcy. There was no national economy, no export trade. Indeed, production for exports had not been restored. On the other hand, imports were to reach the amount of three million dollars. There was need of immediate aid from the United Nations Relief and Rehabilitation Administration. Something along this line was obtained. Again, loans from the United States, as well as some increase in the national revenues, were to help the new Republic.President Roxas, with bold steps, met the situation with the same confidence he exuded in his inaugural address, when he said: \"The system of free but guided enterprise is our system\". Among the main remedies proposed was the establishment of the Philippine Rehabilitation Finance Corporation. This entity would be responsible for the construction of twelve thousand houses and for the grant of easy-term loans in the amount of P177,000,000. Another proposal was the creation of the Central Bank of the Philippines to help stabilize the Philippine dollar reserves and coordinate and the nations banking activities gearing them to the economic progress.\nConcentrating on the sugar industry,  Roxas would exert such efforts as to succeed in increasing production from 13,000 tons at the time of the Philippine liberation to an all-high of one million tons.\n\n\n==== Reconstruction after the war ====\nThe war had burned cities and towns, ruined farms and factories, blasted roads and bridges, shattered industries and commerce, massacred thousands of civilians, and paralyzed the educational system, where 80% of the school buildings, their equipment, laboratories and furniture were destroyed. Numberless books, invaluable documents and works of art, irreplaceable historical relics and family heirlooms, hundreds of churches and temples were burned. The reconstruction of the damaged school buildings alone cost more than P126,000,000,000. Pike noted that the Japanese as part of their efforts of \"liberation\" from American imperialism by bringing the Philippines into the Greater East Asia Co-Prosperity Sphere \"...had smashed industrial buildings, banks, government offices and hotels. Infrastructure including ports had been sabotaged or destroyed in the heavy fighting for Manila\".The new republic began to function on an annual deficit of over P200,000,000 with little prospect of a balanced budget for some years to come. Manila and other cities then were infested with criminal gangs which used techniques of American gangsters in some activities—bank holdups, kidnapping and burglaries. In rural regions, especially the provinces of Central Luzon and the Southern Tagalog regions, the brigands terrorized towns and barrios.\n\n\n==== Agrarian Reform ====\n\nIn 1946, shortly after his induction to presidency, Roxas proclaimed the Rice Share Tenancy Act of 1933 effective throughout the country. However, problems of land tenure continued. In fact, these became worse in certain areas. Among the remedial measures enacted was Republic Act No. 34, likewise known as the Tenant Act, which provided for a 70–30 sharing arrangements and regulated share-tenancy contracts. It was passed to resolve the ongoing peasant unrest in Central Luzon.\n\n\n==== Amnesty Proclamation ====\nPresident Roxas, on January 28, 1948, granted full amnesty to all Philippine collaborators, many of whom were on trial or awaiting to be tried, particularly former President José P. Laurel (1943–1945). The Amnesty Proclamation did not apply to those collaborators, who were charged with the commission of common crimes, such as murder, rape, and arson. The presidential decision did much to heal a standing wound that somehow threatened to divide the people's sentiments. It was a much-called for measure to bring about a closer unity in the trying times when such was most needed for the progress of the nation.\n\n\n==== Civil War ====\nAfter persecuting the Hukbóng Bayan Laban sa Hapón, Roxas opened peace talks with the Huks and invited a delegation of Huk leaders led by Juan Feleo to come to Manila in August 1946. While returning to their jungle bases, Felco and the other Huk leaders were ambushed by police forces, with Felco's head was found floating in the Pampanga River. The ambush was intended to cripple the Huks, but instead led to a civil war as the police and the army rapidly lost control of much of Luzon to the Huks. Strongly opposed to the guerrilla movement Hukbó ng Bayan Laban sa Hapón (Nation's Army Against the Japanese, also called \"the Huks\"), Roxas issued a proclamation outlawing the Huk movement on March 6, 1948. At the same time, Roxas pardoned the Filipinos who had collaborated with the Japanese. The pardon of the collaborators lent some substance to the charge by the Huks that his administration was a continuation of the wartime collaborationist puppet government.\nThe Central Intelligence Agency in a report noted that the Philippines was dominated by \"an irresponsible ruling class which exercises economic and political power almost exclusively in its own interests\". Secretary of State Dean Acheson complained that the Philippines was one of the most corrupt nations in Asia as he commented with some understatement \"much of the aid to the Philippines has not been used as wisely as we wish it had\". Acheson wanted to cease aid to the Philippines until reforms were mounted to crack down on corruption, but was blocked by John Melby, the head of the Filipino desk at the U.S. State Department, who warned that to cut off aid would mean handing over the Philippines to the Huks. U.S. officials throughout the late 1940s that Roxas was a corrupt leader whose policies openly favored the hacendado class and that unless reforms were made, it was inevitable that the Huks would win.\n\n\n=== Foreign policies ===\n\n\n==== Treaty of General Relations ====\n\nOn August 5, 1946, Congress ratified the Treaty of General Relations that had been entered into by and between the Republic of the Philippines and the United States on July 4, 1946. Aside from withdrawing her sovereignty from the Philippines and recognizing her independence, the Treaty reserved for the United States some bases for the mutual protection of both countries; consented that the United States represent the Philippines in countries where the latter had not yet established diplomatic representation; made the Philippines assume all debts and obligations of the former government in the Philippines; and provided for the settlement of property rights of the citizens of both countries.\n\n\n==== United States military bases ====\n\nAlthough Roxas was successful in getting rehabilitation funds from the United States after independence, he was forced to concede military bases (23 of which were leased for 99 years), trade restriction for the Philippine citizens, and special privileges for U.S. property owners and investors. On March 21, 1947, the United States granted the Philippines some $17.7 million in military aid and another $25 million to assist with reconstruction. The Communist Huk rebellion led to fears in the United States that the Huks might come to power while the fact that the Kuomintang were clearly losing the Chinese civil war by this point led to the very real possibility that Chinese Communists might come to the power. In turn, there was much fear in Washington that a Communist China would grant the Soviet Union air and naval bases. The possibility of a Communist China vastly increased the geopolitical importance of the Philippines to the United States, which wanted to retain its air and naval bases in the Philippines to maintain control of the South China Sea. The Americans made it clear that they were prepared to pay \"handsomely\" for the right to keep their Filipino bases, which Roxas exploited.\n\n\n==== Parity Rights Amendment ====\nOn March 11, 1947, Philippine voters, agreeing with Roxas, ratified in a nationwide plebiscite the \"parity amendment\" to the 1935 Constitution of the Philippines, granting United States citizens the right to dispose of and utilize Philippine natural resources, or parity rights.\n\n\n==== Turtle and Mangsee Islands ====\n\nOn September 19, 1946, the Republic of the Philippines notified the United Kingdom that it wished to take over the administration of the Turtle Islands and the Mangsee Islands. Pursuant to a supplemental international agreement, the transfer of administration became effective on October 16, 1947.\n\n\n=== Controversies ===\nHis administration was marred by graft and corruption; moreover, the abuses of the provincial military police contributed to the rise of the left-wing (Huk) movement in the countryside. His heavy-handed attempts to crush the Huks led to widespread peasant disaffection.The good record of the Roxas administration was marred by notable failures: the failure to curb graft and corruption in the government (as evidenced by the surplus war property scandal), the Chinese immigration scandal, the school supplies scandal and the failure to check and stop the communist Hukbalahap movement.\n\n\n=== Assassination attempt ===\nThe night before the plebiscite, Roxas narrowly escaped assassination by Julio Guillen, a disgruntled barber from Tondo, Manila, who hurled a grenade at the platform on Plaza Miranda immediately after Roxas had addressed a rally.\n\n\n== Death ==\n\nOn April 15, 1948, President Roxas delivered a speech before the United States Thirteenth Air Force at the Kelly Theater in Clark Air Base, Pampanga. After the speech, he suffered dizziness and fatigue and was brought to the residence of Major General Eugene L. Eubank. That night, he suffered multiple heart attacks and died at 9:23 PM at the age of 56. Roxas' term as president is the shortest, lasting one year, ten months, and 18 days.\nHis body was brought to Manila the following day on a special train, reaching Malacañang at about 9:20 AM. Sessions of Congress were suspended until after the burial which was set on Sunday, April 25, 1948. Vice President Elpidio Quirino, who was on board a southern cruise at the time of Roxas's death, arrived in Manila on April 17. That morning, he immediately went to Malacañang and took the oath of office as president in the Council of State Room. The new president then appointed a committee to take charge of the funeral arrangements for the late president and issued a proclamation declaring a period of national mourning from April 17 to May 17.\nRoxas was buried at the Manila North Cemetery.\n\n\n== Legacy ==\nOn July 3, 1956, Roxas was posthumously awarded the Quezon Service Cross. The award was presented to his widow, Trinidad L. Roxas, by then Vice-president Carlos P. Garcia on behalf of President Magsaysay.In his honor, various cities and municipalities in the Philippines have been renamed after him, including Roxas, Oriental Mindoro in (1948), the first town to be named as such; Roxas, Isabela (1948); President Roxas, Capiz (1949); Roxas City, Capiz (1951); Roxas, Palawan (1951); President Roxas, Cotabato (1967); and President Manuel A. Roxas, Zamboanga del Norte (1967). Dewey Boulevard in Metro Manila was renamed in his memory, and he is currently depicted on the 100 Philippine peso bill.\n\n\t\t\n\n\n== Family and ancestry ==\n\n\n== References ==\n\n\n=== Bibliography ===\nBuhite, Russell (2008). Douglas MacArthur Statecraft and Stagecraft in America's East Asian Policy. Lanham, Maryland: Rowman & Littlefield. ISBN 9780742544253.\nHutchinson, Joseph (1971). \"Quezon's Role in Philippine Independence\".  In Owen, Norman G. (ed.). Compadre Colonialism: Studies in the Philippines under American Rule. Ann Arbor: University of Michigan Press. pp. 157–194.\nKerr, George (1974). Formosa: Licensed Revolution and the Home Rule Movement, 1895–1945. Honolulu: University of Hawaii Press.\nPike, Francis (2010). Empires at War A Short History of Modern Asia Since World War II. London: I.B.Tauris. ISBN 9780857730299.\nRovere, Richard (1992). General MacArthur and President Truman The Struggle for Control of American Foreign Policy. Piscataway, New Jersey: Transaction Publishers. ISBN 9781412824392.\nSalamanca, Bonifacio (Summer 1989). \"Quezon, Osmeña and Roxas and the American Military Presence in the Philippines\". Philippine Studies. 32 (3): 301–316.\nShafer, Michael (1988). Deadly Paradigms The Failure of U.S. Counterinsurgency Policy. Princeton: Princeton University Press. ISBN 9781400860586.\nWeinberg, Gerhard (2005). A World In Arms A Global History of World War Two. Cambridge: Cambridge University Press. ISBN 0521618266.\nZaide, Gregorio F. (1984). Philippine History and Government. National Bookstore Printing Press.\nZaide, Gregorio (1956). Philippine Political and Cultural History: the Philippines since British Invasion (1957 Revised ed.). Manila, Philippines: McCullough Printing Company.\n\n\n== External links ==\nThe Philippine Presidency Project\nA Country Study: Philippines\nManuel A. Roxas Elementary School",
    "links": [
        "1934 Philippine Constitutional Convention election",
        "1935 Constitution of the Philippines",
        "1944 United States presidential election",
        "1946 Philippine general election",
        "1946 Philippine presidential election",
        "1947 Philippine Parity Rights plebiscite",
        "1st Congress of the Commonwealth of the Philippines",
        "21-gun salute",
        "Alan Peter Cayetano",
        "Albert C. Miller",
        "Alma mater",
        "Angeles City",
        "Antonio de las Alas",
        "Aquilino Pimentel III",
        "Aquilino Pimentel Jr.",
        "Arnulfo Fuentebella",
        "Arturo Belleza Rotor",
        "Arturo Tolentino",
        "Asia",
        "Asuncion A. Perez",
        "Barrio",
        "Bell Trade Act",
        "Benigno Aquino III",
        "Benigno Aquino Sr.",
        "Blas Ople",
        "Bongbong Marcos",
        "Bronson M. Cutting",
        "Burglar",
        "C. Jasper Bell",
        "Cabinet of the Philippines",
        "Camilo Osías",
        "Capiz",
        "Capiz's 1st congressional district",
        "Carlos P. Garcia",
        "Carlos P. Romulo",
        "Cayetano Arellano",
        "Central Bank of the Philippines",
        "Central Intelligence Agency",
        "Central Luzon",
        "Chief Justice of the Philippines",
        "China",
        "City of Manila",
        "Clark Air Base",
        "Coconut oil",
        "Commission on Audit (Philippines)",
        "Commonwealth of the Philippines",
        "Congress of the United States",
        "Constitution of the Philippines",
        "Corazon Aquino",
        "Cornelio Villareal",
        "Corregidor Island",
        "Daniel Romualdez",
        "Dean Acheson",
        "Department of Agriculture (Philippines)",
        "Department of Education (Philippines)",
        "Department of Finance (Philippines)",
        "Department of Foreign Affairs (Philippines)",
        "Department of Health (Philippines)",
        "Department of Justice (Philippines)",
        "Department of Labor and Employment (Philippines)",
        "Department of National Defense (Philippines)",
        "Department of Public Works and Highways",
        "Department of Social Welfare and Development (Philippines)",
        "Department of the Interior and Local Government",
        "Diosdado Macapagal",
        "Douglas MacArthur",
        "Dwight D. Eisenhower",
        "East Asia",
        "Edgardo Angara",
        "Electric chair",
        "Elpidio Quirino",
        "Embassy of the United States",
        "Emilio Aguinaldo",
        "Ernesto Maceda",
        "Eugenio Pérez",
        "Eulogio Rodriguez",
        "Exchange rate",
        "Executive Secretary (Philippines)",
        "Feliciano Belmonte Jr.",
        "Ferdinand Marcos",
        "Fidel V. Ramos",
        "First Philippine Republic",
        "Flag of the Philippines",
        "Flag of the United States",
        "Francis Burton Harrison",
        "Franklin D. Roosevelt",
        "Franklin Drilon",
        "Gangster",
        "George A. Malcolm",
        "Gerardo Roxas",
        "Gerardo Roxas y Arroyo",
        "Gil Montilla",
        "Gil Puyat",
        "Gloria Macapagal Arroyo",
        "Governor-General of the Philippines",
        "Governor of Capiz",
        "Great Depression",
        "Greater East Asia Co-Prosperity Sphere",
        "Grenade",
        "Guardia Civil",
        "HUKBALAHAP",
        "Hare–Hawes–Cutting Act",
        "Harry B. Hawes",
        "Harry S. Truman",
        "Hawaii",
        "Heart attack",
        "Heirloom",
        "Henry L. Stimson",
        "High Commissioner to the Philippines",
        "Hilario Moncado",
        "His Excellency",
        "History of the Philippines (1898–1946)",
        "History of the Philippines (1946–1965)",
        "History of the Philippines (1946–65)",
        "History of the Philippines (1965–1986)",
        "History of the Philippines (1986–present)",
        "Hong Kong",
        "House of Representatives of the Philippines",
        "Hukbalahap",
        "ISBN (identifier)",
        "ISNI (identifier)",
        "Independence",
        "Japan",
        "Japanese occupation of the Philippines",
        "Joint session",
        "Jones Law (Philippines)",
        "Jorge B. Vargas",
        "Jose P. Laurel",
        "Jose de Venecia Jr.",
        "Joseph Estrada",
        "Josè Avelino",
        "José Avelino",
        "José Laurel Jr.",
        "José P. Laurel",
        "José Yulo",
        "José Zulueta",
        "Jovito Salonga",
        "Juan Feleo",
        "Juan Ponce Enrile",
        "Kidnapping",
        "Land reform in the Philippines",
        "Land tenure",
        "Lawyer",
        "Liberal Party (Philippines)",
        "List of cabinets of the Philippines",
        "List of presidents of the Philippines",
        "Lord Allan Velasco",
        "Luis Salvador (Philippine politician)",
        "Luis Taruc",
        "Luneta Park",
        "Luzon",
        "Malacañang Palace",
        "Manchukuo",
        "Manchuria",
        "Mangsee Islands",
        "Manila",
        "Manila High School (Intramuros)",
        "Manila North Cemetery",
        "Manuel L. Quezon",
        "Manuel Luis Quezon",
        "Manuel Moran",
        "Manuel Villar",
        "Mar Roxas",
        "Marcelo Fernan",
        "Mariano Garchitorena",
        "Mariano Jesús Cuenco",
        "Metro Manila",
        "Middle name",
        "Miguel Cuaderno",
        "Military history of the Philippines during World War II",
        "Millard Tydings",
        "Mukden Incident",
        "Municipal council",
        "Muntinlupa",
        "Nacionalista Party",
        "National Assembly of the Philippines",
        "National Museum of the Philippines",
        "National University (Philippines)",
        "Neptali Gonzales",
        "New Deal",
        "Newsreel",
        "Nicanor Yñiguez",
        "Office of the Executive Secretary of the Philippines",
        "Official Gazette (Philippines)",
        "Pampanga",
        "Pantaleon Alvarez",
        "Pasay",
        "Patrick J. Hurley",
        "Paul V. McNutt",
        "Pearl Harbor",
        "Philippine Commonwealth Army",
        "Philippine Law School",
        "Philippine Turtle Islands",
        "Philippine name",
        "Philippine one hundred-peso note",
        "Philippine peso",
        "Philippines",
        "Philippines campaign (1944-45)",
        "Plaza Miranda",
        "Plebiscite",
        "Posthumous birth",
        "President Manuel A. Roxas, Zamboanga del Norte",
        "President Roxas, Capiz",
        "President Roxas, Cotabato",
        "President of the Philippines",
        "President of the Senate of the Philippines",
        "President of the United States",
        "Prospero Nograles",
        "Querube Makalintal",
        "Quezon Service Cross",
        "Quintin Paredes",
        "Quintín Paredes",
        "Quirino Grandstand",
        "Ramon Magsaysay",
        "Ramon Mitra Jr.",
        "Rappler",
        "Republic of the Philippines",
        "Republican Party (United States)",
        "Resident Commissioner of the Philippines",
        "Robbery",
        "Robert E. Hannegan",
        "Rodrigo Duterte",
        "Roxas, Capiz",
        "Roxas, Isabela",
        "Roxas, Oriental Mindoro",
        "Roxas, Palawan",
        "Roxas, Zamboanga del Norte",
        "Roxas (disambiguation)",
        "Roxas Boulevard",
        "Roxas City, Capiz",
        "Ruperto Kangleon",
        "Santa Cruz, Manila",
        "Second Philippine Republic",
        "Secretary of Finance (Philippines)",
        "Senate President of the Philippines",
        "Senate of the Philippines",
        "Senator of the Philippines",
        "Sergio Osmeña",
        "Soldier",
        "South China Sea",
        "Southeast Asia",
        "Southern Tagalog",
        "Spanish Empire",
        "Speaker of the House of Representatives of the Philippines",
        "Speaker of the Philippine House of Representatives",
        "St. Joseph's College (Hong Kong)",
        "Stalingrad",
        "State of Maryland",
        "State of Missouri",
        "State of the Nation Address (Philippines)",
        "Style (manner of address)",
        "Sugar",
        "Supreme Court of the Philippines",
        "Surname",
        "The Pentagon",
        "The Sydney Morning Herald",
        "Third Republic of the Philippines",
        "Thirteenth Air Force",
        "Tito Sotto",
        "Tokyo",
        "Tondo, Manila",
        "Treaty of Manila (1946)",
        "Trinidad Roxas",
        "Trove (identifier)",
        "Turtle Islands, Tawi-Tawi",
        "Tydings–McDuffie Act",
        "United Kingdom",
        "United Nations",
        "United Nations Relief and Rehabilitation Administration",
        "United States Army",
        "United States Army Forces in the Far East",
        "United States Congress",
        "United States Department of State",
        "United States Navy",
        "United States Postmaster General",
        "United States Secretary of State",
        "United States Secretary of War",
        "Universal Newsreel",
        "University of Manila",
        "University of the Philippines",
        "University of the Philippines College of Law",
        "Utang na loob",
        "VIAF (identifier)",
        "Valedictorian",
        "Vice President of the Philippines",
        "Vice President of the United States",
        "Warsaw",
        "Washington, D.C.",
        "White House",
        "Wikisource",
        "World War II"
    ]
}