{
    "url": "https://en.wikipedia.org/wiki/Maorimorpha_sulcata",
    "title": "Maorimorpha sulcata",
    "summary": "Maorimorpha sulcata is a species of sea snail, a marine gastropod mollusk in the family Mitromorphidae.",
    "content": "Maorimorpha sulcata is a species of sea snail, a marine gastropod mollusk in the family Mitromorphidae.\n\n\n== Description ==\nThe length of the shell attains 9.6 mm, its diameter 3.5 mm.\n(Original description) The high and turreted light orange-yellow spire is subfusiform. The protoconch consists of 1½ whorls, the teleoconch 4 slightly convex whorls that are narrowly shouldered at the suture. The upper half of the whorls is smooth, and the lower half spirally grooved. The orthocline axial ribs are crossed on each whorl by 7–8 strong spiral lirae forming small tubercles. The body whorl is slightly inflated and shows 9–14 spiral lirae. The outer lip shows 3–5 denticles..The white aperture is ovate. The peristome is simple and slightly incrassate.This species varies in color, breadth and strength of the shoulder both individually and geographically. it is the largest species in this genus.\n\n\n== Distribution ==\nThis marine species occurs off the Eastern Cape, Southern KwaZulu-Natal and Cape Agulhas, South Africa\n\n\n== References ==\n\nSteyn, D.G. & Lussi, M. (1998) Marine Shells of South Africa. An Illustrated Collector’s Guide to Beached Shells. Ekogilde Publishers, Hartebeespoort, South Africa, ii + 264 pp\n\n\n== External links ==\nPetit, R. E. (2009). George Brettingham Sowerby, I, II & III: their conchological publications and molluscan taxa. Zootaxa. 2189: 1–218\nTucker, J.K. (2004). \"Catalog of recent and fossil turrids (Mollusca: Gastropoda)\" (PDF). Zootaxa. 682: 1–1295.",
    "links": [
        "Animal",
        "Aperture (mollusc)",
        "Binomial nomenclature",
        "Body whorl",
        "Caenogastropoda",
        "Cape Agulhas",
        "Conoidea",
        "Family (biology)",
        "Gastropod",
        "Gastropoda",
        "Global Biodiversity Information Facility",
        "Interim Register of Marine and Nonmarine Genera",
        "KwaZulu-Natal",
        "Lip (gastropod)",
        "Maorimorpha",
        "Mitromorphidae",
        "Mollusca",
        "Mollusk",
        "Neogastropoda",
        "Peristome (gastropod)",
        "Protoconch",
        "Public domain",
        "SeaLifeBase",
        "Sea snail",
        "Spire (mollusc)",
        "Synonym (taxonomy)",
        "Taxonomy (biology)",
        "Teleoconch",
        "Whorl (mollusc)",
        "Wikidata",
        "World Register of Marine Species"
    ]
}