{
    "url": "https://en.wikipedia.org/wiki/Marcola",
    "title": "Marcola",
    "summary": "Marco Willians Herbas Camacho (born 13 April 1968), also known as Marcola, is a Brazilian drug lord and the current leader of the Primeiro Comando da Capital (PCC), the largest Brazilian criminal organization and prison gang according to a 2012 Brazilian Government report; it is based in the state of São Paulo. Marcola is currently serving 234 years in prison. With a net worth of R$90 million, Marcola is considered to be one of the most wanted drug traffickers in Brazil and in all of Latin America.",
    "content": "Marco Willians Herbas Camacho (born 13 April 1968), also known as Marcola, is a Brazilian drug lord and the current leader of the Primeiro Comando da Capital (PCC), the largest Brazilian criminal organization and prison gang according to a 2012 Brazilian Government report; it is based in the state of São Paulo. Marcola is currently serving 234 years in prison. With a net worth of R$90 million, Marcola is considered to be one of the most wanted drug traffickers in Brazil and in all of Latin America.\n\n\n== Early life ==\nMarcola was born in 1968 to a Bolivian father and a Brazilian mother. He began his criminal career as a thief at the age of nine. At 35 years of age, Marcola had already spent half of his life in prison, where he claimed to have read more than 3,000 books (particularly influenced by Dante) and took basic education there. Marcola's brother, Alejandro Juvenal Herbas Camacho Jr., is a criminal associated with the PCC and is one of the most wanted members by the Federal Police, having escaped prison in 2001.\n\n\n== Criminal career ==\nMarcola eventually became the leader of the Primeiro Comando da Capital, one of the most organized drug cartels in Brazil, and had placed a death bounty on former leaders César \"Césinha\" (Little César) Augusto Roris da Silva and José \"Geleião\" (Big Jelly) Márcio Felício. Under the leadership of Marcola, there was more structure in the drug cartels, members are forced to pay a monthly income and even a code of discipline known as the \"Devil's Code\". Marcola is also responsible for causing 29 prison riots in 2001 and for the murder of Judge Antônio José Machado Dias, known for his attempts to stop the activities of PCC and for the construction of the Penitentiary Readaptation Center in Presidente Bernardes, São Paulo.In May 2006, Marcola obtained recordings of a hearing, which planned to move him and 700 prisoners to a maximum-security prison. Immediately, Marcola contacted PCC leaders through cellphones and organized strategic attacks on Brazilian police, which led to the PCC orchestrating the São Paulo violence outbreak\n, resulting in the deaths of over 150 people. The violence led to Marcola's transfer to the Mauricio Henrique Guimaraes Pereira Penitentiary, a maximum-security prison in Presidente Venceslau, where he is currently stationed. Former President of Brazil Lula da Silva condemned the violence as narco-terrorism.On June 8, 2006, Marcola testified in court that he was the official leader of the PCC and described the PCC as organized “like a web made up of a comprehensible organized hierarchy”. He continues to have contact with PCC leaders through telephone calls from inside prison and said in an interview \"It is you who are afraid of dying, not me. As a matter of fact, here in jail you cannot come in and kill me...but I can order to kill you out there\".In 2016, Alejandro Camacho Jr., Marcola's brother, was arrested in Fortaleza during a police raid, along with 36 arrests, where half a ton of cocaine and 26 tons of marijuana were seized.Marcola is currently serving his sentence at the Brasília Federal Penitentiary, which was inaugurated in 2018 to isolate the country’s most dangerous inmates.\n\n\n== See also ==\nPrimeiro Comando da Capital\n2006 São Paulo violence outbreak\nCrime in Brazil\n\n\n== References ==",
    "links": [
        "2006 São Paulo violence outbreak",
        "Bolivia",
        "Brazil",
        "Brazilian real",
        "Crime in Brazil",
        "Dante Alighieri",
        "Drug lord",
        "Federal Police of Brazil",
        "Fortaleza",
        "Luiz Inácio Lula da Silva",
        "Narco-terrorism",
        "Osasco, Brazil",
        "PBS",
        "Presidente Bernardes, São Paulo",
        "Presidente Venceslau",
        "Primeiro Comando da Capital",
        "São Paulo (state)"
    ]
}