{"url": "https://en.wikipedia.org/wiki/Marion,_Mississippi", "title": "Marion, Mississippi", "summary": "Marion is a town in Lauderdale County, Mississippi, United States. It is a northeastern suburb of Meridian, the county seat. The population of Marion was 1,479 at the 2010 census.", "content": "Marion is a town in Lauderdale County, Mississippi, United States. It is a northeastern suburb of Meridian, the county seat. The population of Marion was 1,479 at the 2010 census.\n\n\n== History ==\nThe town was named for Francis Marion, a military leader known as the \"Swamp Fox\". Marion was Lauderdale County's seat from its founding to Reconstruction. Prior to the war, Marion was a prosperous town inhabited by numerous planters and enslaved African Americans. In 1840, it had a drugstore, two blacksmith shops, six dry goods stores, and two academies (one for girls and another for boys). It also had at least one newspaper, the Lauderdale Republican.In 1850, Congress donated land to Alabama and Mississippi in order to build the Mobile & Ohio Railroad, which bypassed Marion and constructed a station two miles to the southwest in a village called McLemore's Old Field (now the city of Meridian). During the 1850s, land values in Lauderdale County increased by 176 percent, which allowed many non-slaveholding whites to purchase slaves to grow cotton, build roads, and clear the surrounding forests for cultivation. By 1860, Lauderdale County's enslaved population had more than doubled—a fact that fed support for secessionism after the election of Abraham Lincoln. On February 16, 1864, U.S. Army forces commanded by General William T. Sherman raided Marion and destroyed the railroad connecting it to Meridian. In 1870, voters opted to move the county seat from Marion to Meridian, which had expanded rapidly since the end of the Civil War.\n\n\n== Geography ==\nMarion is located in central Lauderdale County at 32°25′20″N 88°38′50″W (32.422182, -88.647323). It is bordered to the north, west, and south by the city of Meridian. Downtown Meridian is 5 miles (8 km) to the southwest via Dale Drive. U.S. Route 45 passes through the east side of Marion on a four-lane bypass that continues south around Meridian. The bypass ends at the northeast corner of Marion, and US 45 continues north-northeast from there 83 miles (134 km) to Columbus. \nAccording to the United States Census Bureau, the town has a total area of 2.9 square miles (7.6 km2), of which 0.01 square miles (0.02 km2), or 0.27%, are water. Sowashee Creek forms the eastern boundary of the town and flows southwest through Meridian to join Okatibbee Creek, part of the Chickasawhay River and ultimately the Pascagoula River watershed.\n\n\n== Demographics ==\n\n\n=== 2020 census ===\nAs of the 2020 United States Census, there were 1,751 people, 667 households, and 436 families residing in the town.\n\n\n=== 2000 census ===\nAs of the census of 2000, there were 1,305 people, 468 households, and 324 families residing in the town. The population density was 448.7 people per square mile (173.1/km2). There were 555 housing units at an average density of 190.8 per square mile (73.6/km2). The racial makeup of the town was 52.87% White, 45.82% African American, 0.23% Native American, 0.31% Asian, 0.15% from other races, and 0.61% from two or more races. Hispanic or Latino of any race were 1.69% of the population.\nThere were 468 households, out of which 42.3% had children under the age of 18 living with them, 37.2% were married couples living together, 28.0% had a female householder with no husband present, and 30.6% were non-families. 25.0% of all households were made up of individuals, and 6.4% had someone living alone who was 65 years of age or older. The average household size was 2.50 and the average family size was 3.00.\nIn the town, the population was spread out, with 28.4% under the age of 18, 11.3% from 18 to 24, 27.4% from 25 to 44, 16.6% from 45 to 64, and 16.4% who were 65 years of age or older. The median age was 31 years. For every 100 females, there were 70.1 males. For every 100 females age 18 and over, there were 62.3 males.\nThe median income for a household in the town was $26,413, and the median income for a family was $28,438. Males had a median income of $27,778 versus $17,303 for females. The per capita income for the town was $10,504. About 30.5% of families and 32.8% of the population were below the poverty line, including 50.1% of those under age 18 and 20.5% of those age 65 or over.\n\n\n== Climate ==\nThe climate in this area is characterized by hot, humid summers and generally mild to cool winters.  According to the Köppen Climate Classification system, Marion has a humid subtropical climate, abbreviated \"Cfa\" on climate maps.\n\n\n== References ==\n\n\n== External links ==\nOfficial website", "links": ["1880 United States census", "1980 United States census", "1990 United States census", "2000 United States census", "2010 United States Census", "2010 United States census", "2020 United States Census", "Abraham Lincoln", "African American (U.S. Census)", "Alamucha, Mississippi", "Area code 601", "Asian (U.S. Census)", "Bailey, Mississippi", "Causeyville Historic District", "Census", "Census-designated place", "Chickasawhay River", "City", "Collinsville, Mississippi", "Columbus, Mississippi", "Confederate States of America", "County seat", "Daleville, Mississippi", "Daylight saving time", "EPodunk", "Federal Information Processing Standard", "Francis Marion", "Geographic Names Information System", "Geographic coordinate system", "Hispanic (U.S. Census)", "Humid subtropical climate", "ISBN (identifier)", "Kewanee, Mississippi", "Köppen Climate Classification", "Latino (U.S. Census)", "Lauderdale, Mississippi", "Lauderdale County, Mississippi", "List of counties in Mississippi", "List of sovereign states", "Lizelia, Mississippi", "Marion County, Mississippi", "Marriage", "Meehan, Mississippi", "Meridian, Mississippi", "Meridian Station, Mississippi", "Mississippi", "Mobile and Ohio Railroad", "Native American (U.S. Census)", "Nellieburg, Mississippi", "North American Central Time Zone", "Okatibbee Creek", "Pacific Islander (U.S. Census)", "Pascagoula River", "Per capita income", "Point, Mississippi", "Population density", "Poverty line", "Race (United States Census)", "Reconstruction Era", "Russell, Mississippi", "Savoy, Mississippi", "Sowashee Creek", "Telephone numbering plan", "Time zone", "Toomsuba, Mississippi", "Town", "U.S. Route 45", "U.S. state", "UTC-5", "UTC-6", "Unincorporated area", "United States Census Bureau", "White (U.S. Census)", "Whynot, Mississippi", "William Tecumseh Sherman", "ZIP code", "Zero, Mississippi"]}