{
    "url": "https://en.wikipedia.org/wiki/Maria_Lvovna_Dillon",
    "title": "Maria Lvovna Dillon",
    "summary": "Maria Lvovna Dillon (1858−1932) was a Russian sculptor. She is known for her allegorical, genre, memorial, and portrait sculpture. Dillon is acknowledged as the first Russian female professional sculptor.",
    "content": "Maria Lvovna Dillon (1858−1932) was a Russian sculptor. She is known for her allegorical, genre, memorial, and portrait sculpture. Dillon is acknowledged as the first Russian female professional sculptor.\n\n\n== Biography ==\nDillon was born in Ponevezh, Lithuania on October 27, 1858. She studied at the Imperial Academy of Arts in St. Petersburg where she was taught by Alexander von Bock, Nikolay Laveretsky, and Ivan Podozerov . She won multiple awards while at the Academy.She traveled to Paris, and then to Italy, after she completed her studies at the Academy.Dillon exhibited her work in the Palace of Fine Arts at the 1893 World's Columbian Exposition in Chicago, Illinois.Her works are included in the collections of the Russian Museum in St. Petersburg, the State Museum of Urban Sculpture in St. Petersburg, the State Tretyakov Gallery in Moscow, Pushkin House in St. Petersburg, and the State Gornyi Institute in Kamchatka.In the 1890s to the 1910s, Dillon created a number of memorial tombs, including those for the actress Vera Komissarzhevskaya, the composer Anton Arensky, and the painter Luigi Premazzi. She also sculpted a monument to the mathematician Nikolai Lobachevsky in Kazan.Her husband was the Russian painter Fyodor Buchholz. She died in Leningrad on June 14, 1932.\n\n\n== Legacy ==\nAn exhibition to celebrate the 150th anniversary of Dillon's birth was held at St Michael's Castle, part of the State Russian Museum, in 2010.\n\n\n== References ==\n\n\n== External links ==\nimages of Maria Lvovna Dillon work on \"International Women Sculptors 1893 Chicago World's Fair and Exposition\"",
    "links": [
        "Alexander von Bock",
        "Anton Arensky",
        "Fyodor Buchholz",
        "Gorny Institute",
        "ISNI (identifier)",
        "Imperial Academy of Arts",
        "Ivan Podozerov",
        "Luigi Premazzi",
        "Museum of Science and Industry (Chicago)",
        "Nikolai Lobachevsky",
        "Nikolay Laveretsky",
        "Panevėžys",
        "Pushkin House",
        "Sculpture",
        "Tretyakov Gallery",
        "VIAF (identifier)",
        "Vera Komissarzhevskaya",
        "World's Columbian Exposition"
    ]
}