{"url": "https://en.wikipedia.org/wiki/Maria_Ho", "title": "Maria Ho", "summary": "Maria Ho (born March 6, 1983 in Taipei, Taiwan) is a Taiwanese-American poker player and television host/commentator. One of the top ranked female poker players in the world, and a Women in Poker Hall of Fame inductee, she has over $5,000,000 in live tournament winnings.\nHo's live tournament poker record includes 63 WSOP cashes, 5 World Series of Poker final tables (including 1 WSOP Europe final table), 13 World Poker Tour cashes, 4 WPT final tables (including 1 WPT title), and numerous additional final tables on the professional poker circuit.Outside of poker, she has been seen on many primetime television shows; making it to \"Hollywood Week\" on season 3 of American Idol, competing  on the fifteenth season of The Amazing Race and appearing as a celebrity guest on Deal or No Deal in January 2019.", "content": "Maria Ho (born March 6, 1983 in Taipei, Taiwan) is a Taiwanese-American poker player and television host/commentator. One of the top ranked female poker players in the world, and a Women in Poker Hall of Fame inductee, she has over $5,000,000 in live tournament winnings.\nHo's live tournament poker record includes 63 WSOP cashes, 5 World Series of Poker final tables (including 1 WSOP Europe final table), 13 World Poker Tour cashes, 4 WPT final tables (including 1 WPT title), and numerous additional final tables on the professional poker circuit.Outside of poker, she has been seen on many primetime television shows; making it to \"Hollywood Week\" on season 3 of American Idol, competing  on the fifteenth season of The Amazing Race and appearing as a celebrity guest on Deal or No Deal in January 2019.\n\n\n== Early life ==\nFluent in Mandarin and born into a traditional Taiwanese family, Maria grew up just outside Los Angeles in Arcadia, California, after her family moved from Taiwan to the United States when she was four-years-old. Maria's older sister is a media personality and psychologist Judy Ho, who is known for hosting the CBS syndicated talk show Face The Truth.Ho started playing poker in college. She was drawn to the psychology and competitive spirit of the game and soon went from playing games with college friends to playing limit cash games at nearby Indian casinos. When Maria graduated from UCSD in 2005, with a major in communications and a minor in law, she had gone from playing low limits to high-stakes cash games and had grown her poker bankroll to the point that she felt confident to embark on a career as a professional poker player.\n\n\n== Career ==\n\n\n=== World Series of Poker ===\n\nHo's first major tournament success came at the 2007 World Series of Poker where she was the last woman remaining in the Championship Event, placing 38th out of 6,358 players and earning a $237,865 payday. She repeated this accomplishment in 2014, when she came in 77th place out of 6,683 players. Her 27th place \"Last Woman Standing\" finish at the 2011 World Series of Poker Europe Main Event along with a 2017 6th place final table finish makes Maria the only player to ever hold the title Last Woman Standing four times over and at both the WSOP and WSOPE Main Events.\nAt the 2012 World Series of Poker, Ho was the Most-Cashing Female of the series, with six individual tournament cashes. She repeated this feat at the 2014 WSOP with a total of eight cashes.\n\n\n=== World Poker Tour ===\nIn March 2019, for a second year in a row, she final tabled the LA Poker Classic $25,000 High Roller tournament and earned 1st place, earning her second highest live tournament score of $276,690. The following month she made the 6-handed TV final table of the WPT Seminole Hard Rock Poker Showdown Main Event and placed 3rd for $344,960, which was the second highest cash of her tournament career.\n\n\n=== Host and Commentator ===\nHo has been the celebrity spokesperson for the WinStar World Casino since 2011.\nIn 2013, she joined the Heartland Poker Tour season 9 broadcast team as a co-host and strategic commentator. She was the first female in history to be hired to a poker television broadcast as the resident strategic commentator, and remained with the production for two years until she signed on as co-host and commentator of CBS Sports The Final Table.Since then she has been seen as a host and commentator on Amazon eSports Mobile Masters Invitational series, Battle of Malta, and as a break desk commentator on ESPN's coverage of the World Series of Poker Main Event from 2017 to 2021.\nHo also works as a break desk commentator for PokerGO during High Roller Triple Crown, US Poker Open, Super High Roller Bowl, and World Series of Poker events. In 2019, Ho won the Global Poker Award for Broadcaster of the Year.She has also contributed her expertise to several print publications, and authored a chapter in the book Winning Women of Poker: Secret Strategies Revealed.\n\n\n=== Invitationals ===\nHo has received invitations to play in various types of games all over the world. In 2008, she traveled to Hong Kong to play in the World Mahjong Tour, going head to head with various Chinese and Taiwanese celebrities and professional Mahjong players.For two consecutive years, she participated in the Inaugural World Team Poker Invitational, as a member of Team China, helping her team secure a 1st Place victory in 2010.In 2016, Ho was named one of 12 Team Managers (for Team LA Sunsets) in the inaugural season of the Global Poker League, notably drafting Emmy winning actor Aaron Paul as one of her Wild Card picks, as well as coaching her team to the championship match.\n\n\n=== Awards and accolades ===\nNotable accolades include a 2019 Global Poker Award for Broadcaster of the Year (and a 2020 Global Poker Award nomination for the same category), being inducted into the Women In Poker Hall of Fame the very first year she was eligible and nominated (in 2018), three consecutive nominations as Favorite Female Poker Player by the Bluff Reader's Choice Awards, and on seasons 9 and 10 of the World Poker Tour she was named as one of WPT's \"Ones to Watch\".\n\n\n=== YouTube ===\nOn February 22, a video featuring Maria Ho was published on the YouTube Channel \"The Try Guys\", quickly getting recognition with over 5 million views. When asked in an interview about this experience and her views on video content, Maria Ho declared that she would like to do more videos of that kind in the future, aimed at beginners and amateurs.\n\n\n== Personal life ==\nIn an interview done in April 2020, Maria Ho declared that she likes watching documentaries on Netflix such as \"Inside Bill’s Brain\", the series on Bill Gates, while her two favorite shows are The Voice and Survivor.\n\n\n== References ==\n\n\n== External links ==\nMaria Ho's Official site\nMaria Ho Interview", "links": ["2007 World Series of Poker", "2012 World Series of Poker", "2020 World Series of Poker", "Aaron Paul", "American Idol", "Arcadia, California", "Battle of Malta poker tournament", "Bill Gates", "Bluff (magazine)", "CBS", "CBS Sports", "Deal or No Deal (U.S. game show)", "Glossary of poker terms", "Heartland Poker Tour", "Inside Bill's Brain: Decoding Bill Gates", "Judy Ho", "Poker Hall of Fame", "Poker player", "Psychologist", "Survivor (American TV series)", "Taipei", "Taipei, Taiwan", "Taiwanese Americans", "Television presenter", "The Amazing Race 15", "The Try Guys", "The Voice (American TV series)", "University of California, San Diego", "WinStar World Casino", "World Poker Tour", "World Series of Poker", "World Series of Poker bracelet"]}