{
    "url": "https://en.wikipedia.org/wiki/Mark_McKeever",
    "title": "Mark McKeever",
    "summary": "Mark McKeever (born 16 November 1978) is a former professional and semi-professional football player who last played for Conference South club Weston-super-Mare.",
    "content": "Mark McKeever (born 16 November 1978) is a former professional and semi-professional football player who last played for Conference South club Weston-super-Mare.\n\n\n== Background ==\nMcKeever began his football career with Norwich City as a youth team player. He was eventually released and moved on to Peterborough United with ex-Canaries coach Kit Carson. McKeever became a trainee with the club, but after only three appearances he was transferred to Sheffield Wednesday in April 1997 with David Billington for £1,000,000.\nMcKeever made three appearances in the Premier League and was looking to break into the first team before a foot injury prematurely ended his season. He was subsequently sent on loan to Bristol Rovers and later Reading. During his stint with the Royals he played in a 4–0 away victory over Stoke City. However, over the following weeks, Stoke full-back Jason Kavanagh made a full catalogue of Division Two wingers look like Best at his peak.McKeever made his sixth appearance for Wednesday in an FA Cup tie against Bristol City in December 1999. A year later, McKeever was linked with a return to Bristol Rovers after they had supposedly tabled a £100,000 bid for him. But the permanent move did not materialise.McKeever moved to Bristol Rovers on loan for two months in 2001. In March 2001, the move was made permanent, with McKeever moving south on a free transfer. He spent two years with Rovers before being released in May 2003. He then joined Weston-super-Mare in August 2003, for whom he played for a period of three years before signing for Bath City in May 2006. It was here that he won a Southern League winners medal in 2007.Bath City sent McKeever on loan in January 2008 to Mangotsfield United, but he was soon transferred to fellow Conference South club Weston-super-Mare in March 2008 for his second stint with the club.On 18 August 2009 he was forced to retire following injury.He has been capped by the Republic of Ireland at Under-18 level (12 caps) and by their Under-21s (4 caps). McKeever played for the Republic of Ireland national under-19 football team in the 1997 UEFA European Under-18 Football Championship finals in Iceland.\n\n\n== External links ==\nMark McKeever at Soccerbase \nMark McKeever history at nonleaguedaily.com\nExcanaries.com\n\n\n== References ==",
    "links": [
        "1997 UEFA European Under-18 Football Championship",
        "1999-00 in English football",
        "2002-03 in English football",
        "Association footballer",
        "Bath City F.C.",
        "Bristol City F.C.",
        "Bristol Rovers F.C.",
        "Conference South",
        "David Billington (footballer)",
        "Derry",
        "FA Cup",
        "Football League One",
        "Gloucester City A.F.C.",
        "Jason Kavanagh",
        "Mangotsfield United",
        "Midfielder",
        "Norwich City F.C.",
        "Peterborough United F.C.",
        "Premier League",
        "Reading F.C.",
        "Republic of Ireland national under-19 football team",
        "Republic of Ireland national under-21 football team",
        "Sheffield Wednesday F.C.",
        "Stoke City F.C.",
        "Weston-super-Mare A.F.C."
    ]
}