{
    "url": "https://en.wikipedia.org/wiki/Martine_Ouellet",
    "title": "Martine Ouellet",
    "summary": "Martine Ouellet (born April 8, 1969) is a Canadian politician who served as leader of the Bloc Québécois from 2017 to 2018. She was the Minister of Natural Resources in the Quebec government from 2012 to 2014.\nOuellet was first elected to the National Assembly of Quebec in a by-election on July 5, 2010, representing the electoral district of Vachon, standing as a candidate for Parti Québécois.On May 14, 2021, Ouellet announced her return to politics by creating a new provincial party: Climat Québec.",
    "content": "Martine Ouellet (born April 8, 1969) is a Canadian politician who served as leader of the Bloc Québécois from 2017 to 2018. She was the Minister of Natural Resources in the Quebec government from 2012 to 2014.\nOuellet was first elected to the National Assembly of Quebec in a by-election on July 5, 2010, representing the electoral district of Vachon, standing as a candidate for Parti Québécois.On May 14, 2021, Ouellet announced her return to politics by creating a new provincial party: Climat Québec.\n\n\n== Early life and education ==\nOuellet graduated with a degree in mechanical engineering from McGill University in 1992 and received an M.B.A from the HEC Montreal. Prior to her first election, Ouellet worked as an engineer for Hydro-Québec.\n\n\n== Political career ==\n\n\n=== Provincial ===\nOuellet was elected to the National Assembly of Quebec in a by-election on July 5, 2010, representing the electoral district of Vachon, standing as a candidate for Parti Québécois.After the Parti Québécois won the 2012 election, she was appointed as Minister of Natural Resources in the Marois government. She held the position until the government's defeat in the 2014 election. Ouellet contested the leadership of the Parti Québécois in 2015 and in 2016, placing third both times.\n\n\n=== Federal ===\nOn February 5, 2017, Ouellet announced her candidacy in the 2017 Bloc Québécois leadership election. At the same time, she resigned from the Parti Québécois and sat in the National Assembly of Quebec as an independent. She stated that she will not seek to enter the federal House of Commons via a by-election, saying that she wants to \"have a foot\" in both Quebec City and Ottawa. After being the only candidate in the race at the end of the nomination period, she was officially acclaimed as leader on March 18, 2017.In June 2017, she faced a caucus revolt after her chief of staff, Louis-Philippe Dubois, leaked information to the media in an effort to discredit former interim leader Rhéal Fortin. Members of caucus suspected he had leaked the information on Ouellet's instructions. Ouellet resolved the conflict by firing Dubois and apologising to Fortin.On February 26, 2018, Gabriel Ste-Marie resigned as the Bloc's House Leader due to conflicts with Ouellet. In a tumultuous caucus meeting, seven of the Bloc's 10 MPs voiced their opposition to Ouellet's leadership, accusing her of having an authoritarian style and boycotted Question Period in order to express their dissent.The previous week, Ouellet had given a speech to the Bloc's general council in which she complained that she had felt resistance to her leadership from caucus since becoming leader in 2017 and also argued that the Bloc needs to emphasize Quebec independence rather than soft-pedal it.Fortin criticised her speech saying: \"A leader who opens a general council by posing as a victim, then saying that she is a victim of leaks and resistance. For me, it’s not a speech worthy of a leader.\"The party's general council also approved paying Ouellet a salary of $95,000 as, without a seat in the House of Commons, she was not eligible for a parliamentary leader's salary. It also approved a supplementary payment, which would have resulted in a total salary of $200,000 once her term as a member of the Quebec National Assembly ends with the 2018 provincial election.Opposition to Ouellet came to a breaking point on February 28, 2018 when seven MPs quit the caucus to sit as independents, citing Ouellet's alleged authoritarianism as their reason for leaving. The defections left the Bloc with a caucus of three MPs. More than 20 ex-Bloc MPs, including former leader Gilles Duceppe, issued an open letter supporting the seven current MPs who had resigned from caucus and demanding Ouellet's resignation. Nevertheless, after a lengthy meeting, the party's executive issued a statement supporting Ouellet's leadership but also stating that the seven rebels could keep their Bloc Québécois memberships and would not be expelled from the party for quitting the caucus, inviting them to return to the caucus in the future. However, on May 1, the seven MPs announced that they were severing all ties with the BQ and considering founding a new political party: Québec debout.On June 3, 2018, Ouellet was defeated in a leadership review, with 32% of members voting in favour of her continued leadership and 67% opposed. In a media conference held the day after the results were announced, Ouellet blamed party president and MP Mario Beaulieu, Gilles Duceppe, and the party's old guard for her defeat, accusing them of campaigning against her, and announced that she was resigning as party leader effective June 11, 2018. By September 17, 2018, all seven members of Québec debout had rejoined the Bloc Québécois caucus.\n\n\n=== Return to provincial politics ===\nOn May 14, 2021, Ouellet announced her return to politics by creating a new provincial party: Climat Québec.\n\n\n== Electoral record ==\n\nSource: Official Results, Le Directeur général des élections du Québec.\n\n\n== References ==\n\n\n== External links ==\n\"Biography\". Dictionnaire des parlementaires du Québec de 1792 à nos jours (in French). National Assembly of Quebec.\nMartine Ouellet (in French)",
    "links": [
        "2012 Quebec general election",
        "2014 Quebec general election",
        "2015 Parti Québécois leadership election",
        "2016 Parti Québécois leadership election",
        "2017 Bloc Québécois leadership election",
        "2018 Quebec general election",
        "Action démocratique du Québec",
        "Agnès Maltais",
        "Alex Tyrrell",
        "Alexandre Cloutier",
        "Anne Casabonne",
        "Bernard Drainville",
        "Bertrand St-Arnaud",
        "Bloc Québécois",
        "By-election",
        "CBC News",
        "CTV News",
        "Camil Bouchard",
        "Canadians",
        "Catherine Fournier",
        "Caucus revolt",
        "Chief of staff",
        "Climat Québec",
        "Coalition Avenir Québec",
        "Conservative Party of Quebec (2009–present)",
        "Daniel Breton",
        "Daniel Paillé",
        "Diane De Courcy",
        "Engineer",
        "Executive Council of Quebec",
        "François Gendron",
        "Gabriel Ste-Marie",
        "Gaétan Lelièvre",
        "Gilles Duceppe",
        "Green Party of Quebec",
        "HEC Montreal",
        "House Leader",
        "House of Commons of Canada",
        "Hydro-Québec",
        "Ian Lafrenière",
        "Incumbent",
        "Independent politician",
        "Jean-François Lisée",
        "Leadership review",
        "List of Quebec by-elections",
        "Longueuil, Quebec",
        "Lucien Bouchard",
        "Maka Kotto",
        "Marie-Victorin (electoral district)",
        "Marie Malavoy",
        "Mario Beaulieu",
        "Marjolain Dufour",
        "Marois government",
        "McGill University",
        "Michel Gauthier",
        "National Assembly of Quebec",
        "Nicolas Marceau",
        "Nicole Léger",
        "Open letter",
        "Parti Québécois",
        "Pascal Bérubé",
        "Pauline Marois",
        "Pierre Duchesne",
        "Pierre Nantel",
        "Politician",
        "Premier of Quebec",
        "Quebec Liberal Party",
        "Quebec independence",
        "Question Period",
        "Québec debout",
        "Québec solidaire",
        "Rhéal Fortin",
        "Réjean Hébert",
        "Shirley Dorismond",
        "Simon-Pierre Diamond",
        "Stéphane Bergeron",
        "Stéphane Bédard",
        "Swing (politics)",
        "Sylvain Gaudreault",
        "Sylvain Pagé",
        "Union Nationale (Quebec)",
        "VIAF (identifier)",
        "Vachon (electoral district)",
        "Vivian Barbot",
        "Véronique Hivon",
        "Winnipeg Free Press",
        "Yves-François Blanchet",
        "Élaine Zakaïb",
        "Élections Québec",
        "Élizabeth Larouche",
        "Équipe autonomiste"
    ]
}