{
    "url": "https://en.wikipedia.org/wiki/Mary_Malcolm",
    "title": "Mary Malcolm",
    "summary": "Helen Mary Malcolm (15 March 1918 – 13 October 2010) was one of the first two regular female announcers on BBC Television after World War II, and was a household name in the United Kingdom during the 1950s.",
    "content": "Helen Mary Malcolm (15 March 1918 – 13 October 2010) was one of the first two regular female announcers on BBC Television after World War II, and was a household name in the United Kingdom during the 1950s.\n\n\n== Biography ==\nThe daughter of Sir Ian Malcolm and Jeanne Langtry (1881–1964) and granddaughter of Victorian socialite actress Lillie Langtry, who was the mistress of King Edward VII of the United Kingdom, Mary was brought up in Poltalloch, Argyll, Scotland. Until the age of 16, she attended the Lycée Français Charles de Gaulle in South Kensington, London. She began her television career in 1948, having gained broadcasting experience on the radio during World War II. As more and more men were called up to fight, women became increasingly in demand to fill posts at the BBC. Mary Malcolm was taken on and worked for the Home Service as a continuity announcer from March 1942. With the relaunch of the BBC's television service after the war, she worked alongside Sylvia Peters and McDonald Hobley, with the trio averaging ten days' work a month each.At this time, all television programmes were introduced by an in-vision host or hostess and broadcasts were normally live. Malcolm received no training and became known for her spoonerisms: \"By the end of the day I was tired, and when I came to the weather forecast I just read it out without really trying. My biggest fear was 'drain and rizzle', which I said more than once.\" With the advent of commercial rival ITV in 1955, the BBC’s reliance on announcers diminished. Commercial breaks quickly became popular and the BBC decided audiences no longer needed a hostess to soothe them. Malcolm left the BBC in 1956 although she continued to appear as a guest on various programmes including an episode of the comedy series The Goodies. Her autobiography, Me, was published in 1956.\n\n\n== Selected filmography ==\nDesign for Loving (1962)\n\n\n== References ==",
    "links": [
        "Argyll",
        "BBC",
        "BBC Home Service",
        "Basil Bartlett",
        "Design for Loving",
        "Edward VII",
        "ITV Network",
        "Ian Malcolm (politician)",
        "Jeanne Langtry",
        "Lillie Langtry",
        "Lycée Français Charles de Gaulle",
        "McDonald Hobley",
        "Radio",
        "Spoonerism",
        "Sylvia Peters",
        "The Daily Telegraph",
        "The Goodies",
        "The Guardian",
        "Victorian era",
        "World War II"
    ]
}