{"url": "https://en.wikipedia.org/wiki/Mary_Ann_McLaughlin", "title": "Mary Ann McLaughlin", "summary": "Mary Ann McLaughlin (born 1968) is an American cardiologist, the author of multiple book chapters and an associate professor at Mount Sinai Medical Center in New York City.\nHer research – funded with grants from the Agency for Healthcare Research and Quality, the National Institutes of Health, the American Heart Association, the American College of Cardiology and the New York Academy of Medicine – focuses on the improvement of cardiovascular care for women, the elderly and minorities.", "content": "Mary Ann McLaughlin (born 1968) is an American cardiologist, the author of multiple book chapters and an associate professor at Mount Sinai Medical Center in New York City.\nHer research – funded with grants from the Agency for Healthcare Research and Quality, the National Institutes of Health, the American Heart Association, the American College of Cardiology and the New York Academy of Medicine – focuses on the improvement of cardiovascular care for women, the elderly and minorities.\n\n\n== Biography ==\nMcLaughlin received her B.A. in Biology from the University of Virginia in 1984 and graduated from Georgetown University School of Medicine in 1990 as member of the Alpha Omega Alpha Medical Honor Society. She completed both an internship and residency at NewYork-Presbyterian Hospital in 1993 and received her Master's in Public Health from Columbia University School of Public Health in 1996.\nShe is co-founder of the Women's Cardiac Assessment and Risk Evaluation Program at the Mount Sinai Medical Center, serves on the editorial board of Focus on Healthy Aging and, as of July 2008, is a member of the American Heart Association's Boards of Directors (East Coast region).\n\n\n== Awards and honors ==\nAmerican College of Cardiology/Merck Fellowship Award\nC. Richard Bowman Award (awarded to the New York Hospital house officer demonstrating human warmth, scientific endeavor, and dedication to medicine)\nMary and David Hoar Fellowship of the New York Academy of Medicine\nSmithKline Beecham Development Partners Junior Faculty Award in Cardiology\nArthur Ross Foundation Award\nB. Chaus Scholar Cardiology Award, Mount Sinai Medical Center\n\n\n== Memberships ==\nPresident, American Heart Association, NYC Board\nAmerican Heart Association, Board of Directors, Northeast Region  July 2008 – present\nAmerican Heart Association, Member  1997–present\nAmerican Heart Association, Invited National Spokesperson 2004-2005\nMount Sinai Cardiovascular Institute Compliance Committee  January 2007 – present\nMount Sinai School of Medicine Alumni Association Executive Committee, January 2007 – present\nNational Institutes of Health, National Center on Minority Health and Health Disparities, Grant Review Committee, June 2005\nWomen with Heart, Executive Committee 2004–present\nAmerican College of Cardiology, Fellow, inducted 1999\nEditorial Board, Focus on Healthy Aging, A Belvoir Publications, Mahopac, NY. 2002–present\nMount Sinai School of Medicine Re-Engineering Electronic Medical Records Committee, 1998-1999\nMount Sinai School of Medicine Quality Assurance Subcommittee 1999\nMount Sinai School of Medicine Cardiothoracic Chair Search Committee, 1999-2000\n\n\n== Publications ==\nPartial list:\n\nMennell JS, Cesarman GM, Jacovina AT, Mclaughlin M, Lev EA, Hajjar KA. Annexin II and bleeding in acute promyelocytic leukemia. N Engl J Med 1991; 340: 994-1004.\nMclaughlin M, Fuster V. Three mechanisms for coronary artery disease progression; insights into future management. Mount Sinai Journal of Medicine 1995; 62(4): 265-274.\nMclaughlin M, Phillips RA, Patel TN, Siu AL, David O, Buckley S, Mara T, Goldman ME. Prevalence and treatment patterns of diastolic filling abnormalities in the elderly. Journal of Heart Failure 1997; 4(1): 110.\nGersony DR, Mclaughlin M, Sacks HS, Fuster V, Gersony WM. Effect of beta blocker therapy on clinical outcome in patients with Marfans syndrome: Meta-analysis of data from 802 patients. JACC 1999; 33(2): 243.\nLala A, McLaughlin MA. Do all ACE inhibitors provide the same outcomes benefits in high-risk cardiovascular patients? Curr Hypertens Rep. 2008Aug;10(4):286-92. PMID 18625157\nChoi BG, McLaughlin MA. Why men’s hearts break:  cardiovascular effects of sex steroids.  Endocrinol Metab Clin North Am. 2007 June;36(2):365-77. PMID 17543724\nKhan RA, Moskowitz DM, Marin ML, Hollier LH, Parsons R, Teodorescu V, McLaughlin MA, Safety and Efficacy of High Dose Adenosine–induced A Systole During Endovascular AAA Repair. J Endovasc Ther 2000; 7:292-296.\nHebert, PL, Sisk JE, Wang, J, Horowitz, CR, Chassin MR, McLaughlin, MA. Cost-effectiveness of nurse-led disease management for heart failure in a racially diverse urban community. Annals of Internal Medicine, Accepted for publication 8/13/08.\n\n\n== References ==", "links": ["Agency for Healthcare Research and Quality", "Alpha Omega Alpha Medical Honor Society", "American College of Cardiology", "American Heart Association", "Bachelor of Arts", "Cardiologist", "Cardiology", "Columbia University", "Doctor of Medicine", "Doi (identifier)", "Georgetown University School of Medicine", "GlaxoSmithKline", "ISBN (identifier)", "ISNI (identifier)", "ISSN (identifier)", "Master of Public Health", "Master of public health", "Merck & Co.", "Michael L. Marin", "Mount Sinai Journal of Medicine", "Mount Sinai Medical Center", "National Institutes of Health", "NewYork-Presbyterian Hospital", "New England Journal of Medicine", "New York Academy of Medicine", "New York City", "PMID (identifier)", "University of Virginia", "VIAF (identifier)", "Valentín Fuster"]}