{"url": "https://en.wikipedia.org/wiki/Maryland_Route_702", "title": "Maryland Route 702", "summary": "Maryland Route 702 (MD 702) is a state highway in the U.S. state of Maryland.  Known as Southeast Boulevard, the state highway runs 4.17 miles (6.71 km) from Interstate 695 (I-695) in Rosedale east to Back River Neck Road near Essex.  MD 702 is a controlled-access spur that serves Essex in southeastern Baltimore County.  The state highway was constructed as a freeway from I-695 to Old Eastern Avenue east of MD 150 in the early 1970s.  MD 702 was extended as a divided highway to its present terminus around 1990. Documentation from the Maryland State Highway Administration depict the highway as following an east–west alignment, but all signage indicates a north–south road.", "content": "Maryland Route 702 (MD 702) is a state highway in the U.S. state of Maryland.  Known as Southeast Boulevard, the state highway runs 4.17 miles (6.71 km) from Interstate 695 (I-695) in Rosedale east to Back River Neck Road near Essex.  MD 702 is a controlled-access spur that serves Essex in southeastern Baltimore County.  The state highway was constructed as a freeway from I-695 to Old Eastern Avenue east of MD 150 in the early 1970s.  MD 702 was extended as a divided highway to its present terminus around 1990. Documentation from the Maryland State Highway Administration depict the highway as following an east–west alignment, but all signage indicates a north–south road.\n\n\n== Route description ==\n\nMD 702 begins at a directional-T interchange with I-695 (Baltimore Beltway) near Rosedale.  I-695 toward Towson and MD 702 toward Essex form the mainline of the interchange while I-695 toward Glen Burnie forms the stem of the T.  Within the interchange, MD 702 crosses over Amtrak's Northeast Corridor and Northeast Creek, a tributary of the Back River that receives Stemmers Run.  The state highway heads southeast into Essex as a four-lane freeway through a partial cloverleaf interchange with MD 150 (Eastern Boulevard).  There is no direct access from northbound MD 702 to MD 150 or from MD 150 to southbound MD 702.  The missing movements are made via MD 702's intersection with Old Eastern Avenue, where the freeway ends.\n\nMD 702 continues southeast as a six-lane controlled-access boulevard on which trucks heavier than 5 short tons (4,500 kg) are prohibited.  The state highway passes between residential subdivisions, crosses Deep Creek, and passes under a pedestrian walkway before reaching Middleborough Road, where the highway reduces to four lanes.  MD 702 meets Hyde Park Road at a roundabout and intersects Turkey Point Road before reaching its eastern terminus.  The roadway continues south as Back River Neck Road, a two-lane undivided county road that leads through a forested area to Rocky Point Park and Essex Skypark at the southern end of Back River Neck.  Back River Neck Road splits from the highway in the other direction back toward the center of Essex.MD 702 is a part of the National Highway System as a principal arterial for its entire length.\n\n\n== History ==\nMuch of MD 702 parallels Back River Neck Road, which was originally the north–south portion of the Back River Neck Turnpike; the east–west segment followed Eastern Avenue from the Back River to the Middle River.  The MD 702 designation was originally applied to Jones Bridge Road from U.S. Route 240 (US 240, now MD 355) east along the southern edge of the National Naval Medical Center complex in Bethesda by 1946 and removed by 1958.  The Southeast Freeway was one of three freeways—with the Windlass Freeway and Patapsco Freeway—planned to be built in southeastern Baltimore County as extensions or supplements to the Baltimore Beltway.  The Southeast Freeway would head southeast from the Beltway's terminus at US 40 in Rosedale through Essex; the freeway would intersect the Windlass Freeway at what is today MD 702's junction with I-695.  By 1972, MD 702 was assigned to the Southeast Freeway, which was under construction from the Windlass Freeway to Old Eastern Avenue.  MD 702 was completed in 1974 from the Windlass Freeway east to Old Eastern Avenue.  MD 702's interchange with the Beltway was planned to accommodate an eastward extension of the Windlass Freeway as late as 1981.  Construction on MD 702's boulevard extension was underway in 1989 and completed in January 1990.  The state highway's roundabout at Hyde Park Road was installed in 2005.\n\n\n== Junction list ==\nThe entire route is in Baltimore County.\n\n\n== See also ==\n Maryland Roads portal\n\n\n== References ==\n\n\n== External links ==\n\nMDRoads: MD 702\nMD 702 at AARoads.com\nMaryland Roads - MD 702\nSteve Anderson's DCRoads.net: Southeast Boulevard (MD 702)", "links": ["Amtrak", "Back River (Maryland)", "Baltimore County, Maryland", "Bethesda, Maryland", "Chase, Maryland", "Directional-T interchange", "Divided highway", "Essex, Maryland", "Freeway", "Glen Burnie, Maryland", "Google", "Google Maps", "Interstate 695 (Maryland)", "List of Interstate Highways in Maryland", "List of U.S. Highways in Maryland", "List of state highways in Maryland", "Maryland", "Maryland Route 150", "Maryland Route 355", "Maryland Route 701", "Maryland Route 703", "Maryland Scenic Byways", "Maryland State Highway Administration", "Maryland highway system", "Middle River (Maryland)", "National Highway System (United States)", "National Naval Medical Center", "Northeast Corridor", "Partial cloverleaf interchange", "Rosedale, Maryland", "Roundabout", "State highway", "Towson, Maryland", "U.S. Route 240", "U.S. Route 40 in Maryland", "United States"]}