{
    "url": "https://en.wikipedia.org/wiki/Matchmaker.com",
    "title": "Matchmaker.com",
    "summary": "Matchmaker.com was the first online dating service. It was founded in 1986 and first operated via a bulletin board system.\nMembers completed a questionnaire that enabled the platform to rank potential matches based on compatibility.",
    "content": "Matchmaker.com was the first online dating service. It was founded in 1986 and first operated via a bulletin board system.\nMembers completed a questionnaire that enabled the platform to rank potential matches based on compatibility.\n\n\n== History ==\nMatchmaker.com originated from a bulletin board system created by Gregory Scott Smith in San Antonio, Texas in March 1983. It began as a dial-up system running on a single Apple II+ with a modem. Shortly afterwards, it was ported to a Microsoft Xenix–based Tandy 6000 microcomputer and re-written in MBASIC, and then re-written again in C by programmer Jon Boede. It was originally conceived as a pen-pal network for everyone. There were no membership fees and the system operated on user donations.\nIn 1985, the system was relocated to Houston, Texas and operated on four dial-up lines. The following year, two other systems were networked and allowed users in San Antonio, Texas and San Jose, California to join the \"date-a-base\".\nThe original site started in 1986 was in the form of a bulletin board system. Each system catered to a geographic area (code) allowing users to find like interests. The original BBS based system only catered to local computer savvy users within a local telephone area code. However, exchange of email between systems and profiles was later implemented using sendmail and uuencoding making uucp and, ultimately the internet, the Matchmaker network backbone. The Matchmaker network was featured in the first edition of \"!%@:: a directory of electronic mail addressing and networks\" as one of the larger email networks prior to the rise of the Internet.\nIn 1987, the software became available to franchise from the programmer, Jon Boede. The number of local systems grew to about a dozen, and became funded by user subscriptions. This business model allowed for each system to be moved into a commercial office environment for stability.\nIn late 1992, the ASCII BBS style was extended to also be a telnet-based service, allowing access from anywhere in the world without the need for telephone long distance charges. A year later, the web-based front end was created. The first Matchmaker system to receive the new version was the largest of the communities at the time, \"Christie's Matchmaker\" (see below). Other Matchmaker franchises quickly also adopted the web based front-end.\nThe site went online in 1996. Phil Moerschell, a founder and owner of multiple matchmaker franchises at the time, acquired the domain 'matchmaker.com' and began using it to link to the 15 matchmaker sites he was running.\n\nIn 1998, each of the franchisees agreed to consolidate, centralize, and combine their resources. Matchmaker incorporated and relocated all of the Matchmaker servers to Bedford, Texas. In September 1998, the system became burdened by having to provide direct dial-in over modems and a decision was made to move to the Internet exclusively. At the height of the distributed franchise model in 1998, the number of national systems exceeded 60. An agreement was reached to centralize in Bedford, Texas and incorporate with the name Matchmaker.com. Private stock was issued and there were approximately 12 administrators and employees. Patrick M. O'Leary became the company's president.\nIn 2000, Matchmaker was acquired by Lycos for $44.5 million cash. The site had 4 million users at that time.In February 2006, the site was purchased by Avalanche, LLC.In 2016, the site was shut down.\n\n\n== See also ==\nCarafano v. Metrosplash.com\n\n\n== References ==",
    "links": [
        "ASCII",
        "American City Business Journals",
        "Angelfire",
        "Apple II+",
        "Associated Press",
        "Bedford, Texas",
        "Brightcom Group",
        "Bulletin board system",
        "CNET",
        "C (programming language)",
        "Carafano v. Metrosplash.com",
        "Carnegie Mellon University",
        "Gamesville",
        "HotBot",
        "Houston, Texas",
        "Lycos",
        "MBASIC",
        "New York Times",
        "Online dating service",
        "Organizational founder",
        "POV (TV series)",
        "PR Newswire",
        "Quote.com",
        "San Antonio, Texas",
        "San Jose, California",
        "Sendmail",
        "Telnet",
        "Tripod (web hosting)",
        "Uucp",
        "Uuencoding",
        "Weather Zombie",
        "Webmonkey",
        "Wired News",
        "Xenix"
    ]
}