{
    "url": "https://en.wikipedia.org/wiki/Matthieu_Paley",
    "title": "Matthieu Paley",
    "summary": "Matthieu Paley (born May 18, 1973 in Rouen, France) is a French photographer and regular contributor for National Geographic. He is best known for his work documenting communities in the western region of the greater Himalaya: the Karakoram, the Hindukush, and the Pamir Mountains. He is most interested in documenting communities that are misrepresented and misunderstood with a particular focus on those that are isolated within geopolitically sensitive areas. More recently, he has been working on stories relating to the environment and pollution.Paley has received numerous awards, which have recently included a 2017 World Press Photo award and Pictures of the Year International award (2016). Additionally, he is a National Geographic Explorer (2020) and was accordingly awarded a grant by the National Geographic Society to document issues surrounding water pollution and spirituality in South Asia.He has lived in many countries, including his birth country of France, Asia (Hong Kong, Pakistan, Turkey), Germany, the United States, and Portugal, where he moved in 2018 with his wife, Mareile, and two sons Iluka and Timoté. He speaks fluently in French, English, and German as well as conversationally in Urdu (Hindi), Turkish and Wakhi.",
    "content": "Matthieu Paley (born May 18, 1973 in Rouen, France) is a French photographer and regular contributor for National Geographic. He is best known for his work documenting communities in the western region of the greater Himalaya: the Karakoram, the Hindukush, and the Pamir Mountains. He is most interested in documenting communities that are misrepresented and misunderstood with a particular focus on those that are isolated within geopolitically sensitive areas. More recently, he has been working on stories relating to the environment and pollution.Paley has received numerous awards, which have recently included a 2017 World Press Photo award and Pictures of the Year International award (2016). Additionally, he is a National Geographic Explorer (2020) and was accordingly awarded a grant by the National Geographic Society to document issues surrounding water pollution and spirituality in South Asia.He has lived in many countries, including his birth country of France, Asia (Hong Kong, Pakistan, Turkey), Germany, the United States, and Portugal, where he moved in 2018 with his wife, Mareile, and two sons Iluka and Timoté. He speaks fluently in French, English, and German as well as conversationally in Urdu (Hindi), Turkish and Wakhi.\n\n\n== Personal life ==\nAfter graduating from high school, Paley went to live abroad for one year in Massachusetts in the United States as an exchange student. It was during this time abroad that Paley first experimented with taking and developing his own images.After Paley's year in the United States, he returned to France to obtain a bachelor's degree in international business with a focus on Asian affairs at the University of Le Havre. As part of his degree, he completed an internship in Jakarta, Indonesia. It was during this time that he realized international business was not what he wanted to pursue. In 1997, Paley changed course and enrolled in an associate degree program at Parsons School of Design in New York City to study photography.In 1999, Paley left for his first photography expedition – a self-directed, three-month long trip to Mongolia. The resulting work was published in the book Mongolie, la route de l'horizon, in 2010.In 2000, Paley settled in Skardu, a town situated in the mountains of northern Pakistan where he taught English and worked on various media projects for the Aga Khan Foundation related to education, tourism, and culture. In 2002, Paley moved to Hong Kong, where he had his first son Iluka. In 2011, Paley moved to Turkey, where his youngest son Timoté was born. His family moved to Portugal in 2018, where they currently reside.\n\n\n== Photographic career ==\nIn 2001, while exploring an old branch of the Silk Road on the Afghanistan-Pakistan border, Paley encountered Afghan Kyrgyz traders and their yak caravan. In 2008, he was the first foreigner to visit the Afghan Pamir in winter, since the 1972 expedition of photographers Roland and Sabrina Michaud. He subsequently returned two times in 2011 and 2012. In 2012, Paley led two expeditions to the Afghan Pamir on his first assignment for National Geographic Magazine. The story was published in a 2013 in an article titled Stranded on the Roof of the World.In 2014, Paley worked on the project The Evolution of Diet for National Geographic Magazine, during which he visited seven self-sufficient communities to document their long-endured diets and the geographic environments that support them. This project also resulted in a seven-part Nat Geo Live video series, We Are What We Eat.In 2017, he traveled with writer Paul Salopek and guided him for five weeks on his Out of Eden Walk. Together, they crossed the Wakhan Corridor in Afghanistan to enter Pakistan's Karakoram mountains.Since 2016, Paley's work has begun to cover the topic of air and water pollution, specifically in South Asia. Paley was recently awarded a 2020 National Geographic Explorer grant to continue to document the water crisis and spirituality in south Asia.\n\n\n== Awards ==\n2017: World Press Photo, Daily Life, Singles, 3rd prize\n2016: Picture of the Year International (POYi), Feature Picture Story, Third place\n2014: The Museum Photo Prize: Professional Scholarship \n2011: Winner of the \"Festival de la mer\" professional grant for his project on Nauru, the smallest republic in the world.\n2009: Banff Mountain Photography Competition\nNew York Photo Festival, Editorial Photographic Series, Honorable mention\n2009: Photo District News, 30 Under 30\n2009: Society of Publishers in Asia, Excellence in Photography\n2005: Pacific Asia Travel Association (PATA) Gold Award\n2002: Banff Mountain Photography Competition (Canada), Best Landscape\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nPaley Prints\nNational Geographic Mathieu Paley contributor\nNational Geographic Matthieu Paley Expert",
    "links": [
        "Aga Khan Foundation",
        "Associate degree",
        "Himalaya",
        "Hindukush",
        "Karakoram",
        "Kyrgyz people",
        "Massachusetts",
        "Mongolia",
        "National Geographic",
        "National Geographic Society",
        "Pakistan",
        "Pamir Mountains",
        "Parsons School of Design",
        "Paul Salopek",
        "Pictures of the Year International",
        "Portugal",
        "Rouen",
        "SUDOC (identifier)",
        "Silk Road",
        "Turkey",
        "Turkish language",
        "University of Le Havre",
        "Urdu",
        "VIAF (identifier)",
        "Wakhan Corridor",
        "Wakhi language",
        "World Press Photo",
        "Yak"
    ]
}