{
    "url": "https://en.wikipedia.org/wiki/Matthew_Oram",
    "title": "Matthew Oram",
    "summary": "Sir Matthew Henry Oram  (2 June 1885 – 22 January 1969) was a New Zealand politician of the National Party. He was the 13th Speaker of the House of Representatives, from 1950 to 1957.\n\n",
    "content": "Sir Matthew Henry Oram  (2 June 1885 – 22 January 1969) was a New Zealand politician of the National Party. He was the 13th Speaker of the House of Representatives, from 1950 to 1957.\n\n\n== Early life ==\nOram was born in 1885 at Christchurch. His mother was May Eltham, originally from Hobart in Tasmania. His father, Matthew Henry Oram, died three months before Matthew Oram's birth.  His formal education started at age 12, as he went to live with his aunt in Wellington after his mother's death. He attended Wellington College (1898–1904), followed by Victoria University of Wellington (1905–1911). He graduated BA (1908) and received a Sir George Grey Scholarship (he came equal in the examinations with Miss Barkas, but as she had also won and accepted another scholarship, Oram was given the Sir George Grey Scholarship), and then graduated MA (Hons) (maths and physics, 1909) and LLB (1912). During his education, he competed in athletics. He belonged to Victoria's debating society and won prizes (Plunket Medal for Oratory and the Joint Challenge Scroll and Union Prize). He was also a member of the Territorial Force.\nHe formed a partnership with John Mason and practised law in Palmerston North from 1912 or 1913. He also lectured in law at Victoria.On 5 March 1913, he married Margarette Ann Florence Johnson at St John's Church, Wellington. She was the daughter of Captain Johnson, the harbour master; John Mason was best man. When New Zealand declared war against Germany in 1914, Oram sold his law practice and joined the army. He was declared unfit for overseas service and served first in Palmerston North, and then at Base Records in Wellington, where he attained the rank of captain. He was awarded an MBE (military) in 1919.\n\n\n== Life post World War I ==\nAfter the war, he returned to practising law in Palmerston North. He also owned a farm in the Manawatu.Oram was instrumental in the establishment of Palmerston North as a flying hub for the North Island. He obtained his pilot's licence in the 1920s and became the first president of the Manawatu Aero Club. He promoted that the club compete in the handicap section of the MacRobertson Air Race and paid half the entry fee, but ceased to support the event when his nominated pilot was not chosen.Oram supported multiple groups. He was involved in setting up the Palmerston North branch of YMCA and was their chairman for seven years. He was involved in establishing the local debating club, and helped form the competitions society. He helped establish the Manawatu Repertory Society and was involved in their annual productions for two decades. He chaired this group for five years (1935–1940) and was later chairman of the New Zealand Players board. One of his main interests was in education. He was on the board of Palmerston North Boys' High School for 29 years, 14 years of that as chairman. He served on the Wanganui Education Board for over a decade. In 1937, he was appointed to the Victoria University College Council and a year later, he joined the Massey Agricultural College council; he held both positions until 1950.  He was chairman of the Chamber of Commerce in Palmerston North.Oram owned race horses, and in 1955, Golden Galleon won the Wellington Cup.\n\n\n== Political career ==\n\nOram was on the Palmerston North Borough Council (1920–1927). In the 1935 election, he was a candidate of the anti-Labour Democrat Party in the Manawatu electorate.  The Democrats stood 50 candidates in the 1935 election, but none of them were successful. Their main effect was to split the vote on the right, resulting in several electorates going to Labour. This may well have happened in Manawatu, where Labour's Lorrie Hunter unseated Reform's Joseph Linklater by a margin of just 30 votes (2,962 votes versus 2,932), with Oram coming fourth (673 votes). In 1936, the Democrats merged with other parties to form the National Party, contributing the most conservative perspective.Oram did not stand in the 1938 election.When John Cobbe retired from Parliament in 1943, Oram won National's nomination for the Manawatu electorate. He beat Labour's candidate, Corporal W. H. Oliver, by a considerable margin (6,194 votes versus 3,883), with an Independent coming a distant third. Oram held the Manawatu electorate until his retirement in 1957. During his first two parliamentary terms, when the Labour Party was in government, Oram was a frequent debater and advocated for better education.When National came to power in the 1949 election, many expected Oram to become Minister of Education.  However, the portfolio was given to Ronald Algie, who held it until 1957. Oram had a strained relationship with Sidney Holland, the Prime Minister, was considered too conservative and together with a sometimes difficult personality, these factors may not have worked in his favour.When Parliament first assembled after the election in June 1950, Oram was elected Speaker of the House. He held the role of Speaker until his retirement from Parliament on 29 October 1957. He executed the role in a fair and effective way. In the 1952 Queen's Birthday Honours, during his time as Speaker, he was appointed a Knight Bachelor.\n\n\n== Later life ==\nOram was president of the Constitutional Society. Their aims were for more open government, tax reform, the re-establishment on an upper house, and a written constitution. None of these campaigns had much success, and he retired from the society in 1968.  Oram died on 22 January 1969 at Palmerston North, survived by his wife, two daughters, and two sons. His son, also Matthew Oram, went to England in 1938 to study actuarial science. His grandson, also named Matthew Oram and based in Hong Kong, shares his hobby and has racehorses.\n\n\n== Notes ==\n\n\n== References ==\nGustafson, Barry (1986). The First 50 Years : A History of the New Zealand National Party. Auckland: Reed Methuen. ISBN 0-474-00177-6.\nWilson, James Oakley (1985) [First ed. published 1913]. New Zealand Parliamentary Record, 1840–1984 (4th ed.). Wellington: V.R. Ward, Govt. Printer. OCLC 154283103.\nWho's Who in New Zealand, 7th Edition 1961\n\n\n== External links ==\nBiographies of Former and Current Speakers of the New Zealand House of Representatives\nVideo clip of the unveiling of a parliamentary centenary plaque, 1956, at the original site in Auckland.",
    "links": [
        "1935 New Zealand general election",
        "1938 New Zealand general election",
        "1943 New Zealand general election",
        "1946 New Zealand general election",
        "1949 New Zealand general election",
        "1951 New Zealand general election",
        "1952 Birthday Honours (New Zealand)",
        "1954 New Zealand general election",
        "27th New Zealand Parliament",
        "28th New Zealand Parliament",
        "29th New Zealand Parliament",
        "30th New Zealand Parliament",
        "31st New Zealand Parliament",
        "Actuarial science",
        "Bachelor of Arts",
        "Bachelor of Laws",
        "Barry Gustafson",
        "Blair Tennent",
        "Ceremonial mace",
        "Christchurch",
        "Constitution of New Zealand",
        "Dictionary of New Zealand Biography",
        "First Labour Government of New Zealand",
        "First National Government of New Zealand",
        "Hobart",
        "Hong Kong",
        "ISBN (identifier)",
        "ISNI (identifier)",
        "John Cobbe",
        "John Mason (New Zealand politician)",
        "Joseph Linklater",
        "Keith Holyoake",
        "Knight Bachelor",
        "Lorrie Hunter",
        "MacRobertson Air Race",
        "Manawatu (New Zealand electorate)",
        "Manawatu District",
        "Massey University",
        "Master of Arts",
        "Member of The Most Excellent Order of the British Empire",
        "Minister of Education (New Zealand)",
        "Ministry for Culture and Heritage",
        "New Zealand Democrat Party (1934)",
        "New Zealand Labour Party",
        "New Zealand Legislative Council",
        "New Zealand National Party",
        "New Zealand Parliament",
        "OCLC (identifier)",
        "Order of the British Empire",
        "Palmerston North",
        "Palmerston North Boys' High School",
        "Prime Minister of New Zealand",
        "Reed Methuen",
        "Reform Party (New Zealand)",
        "Robert Macfarlane (New Zealand politician)",
        "Robert McKeen",
        "Ronald Algie",
        "Serjeant-at-Arms",
        "Sidney Holland",
        "Speaker of the New Zealand House of Representatives",
        "St John's Church, Wellington",
        "Tasmania",
        "The Evening Post (New Zealand)",
        "The Honourable",
        "Trove (identifier)",
        "VIAF (identifier)",
        "Victoria University of Wellington",
        "Wellington",
        "Wellington College (New Zealand)",
        "Wellington Cup",
        "YMCA"
    ]
}