{"url": "https://en.wikipedia.org/wiki/Matthiessen_and_Hegeler_Zinc_Company", "title": "Matthiessen and Hegeler Zinc Company", "summary": "At one time, the family-owned Mattheissen and Hegeler (M&H) Zinc Company was the largest zinc manufacturing plant in the United States. The company brought zinc ore from Wisconsin and Missouri to the coal fields of Northern Illinois. The company and its founders had a large influence in the development of LaSalle & Peru, Illinois.\n\n", "content": "At one time, the family-owned Mattheissen and Hegeler (M&H) Zinc Company was the largest zinc manufacturing plant in the United States. The company brought zinc ore from Wisconsin and Missouri to the coal fields of Northern Illinois. The company and its founders had a large influence in the development of LaSalle & Peru, Illinois.\n\n\n== History ==\nFrederick Matthiessen and Edward Hegeler met while studying at the School of Mines in Freiberg, Saxony. They identified that the United States did not have a strong zinc industry and felt it was an opportunity. They were also interested in iron, coal, and zinc exporting. The pair sailed from Germany to Boston in 1856 and studied several sites in Pennsylvania, Missouri, and Wisconsin.Zinc ore had been discovered at Mineral Point, Wisconsin and they selected LaSalle, Illinois as the location for their plant due to its coal fields, since it required about two tons of coal to smelt one ton of zinc ore. LaSalle was also connected to the zinc mining region of Wisconsin by the Illinois Central Railroad. LaSalle's mayor, Alexander Campbell, encouraged the enterprise and helped them get a deal with the railroad. The plant started in 1858 and occupied a broad flat site above the Little Vermilion River. The Civil War interrupted production, but by 1863, they began supplying zinc for arms and cartridges.  They started with zinc smelting and added a rolling mill in 1866.The company incorporated in 1871. While not the only US Zinc producer, M&H commanded a large part of the early market. Between 1881 and 1910, M&H solidified their position as the largest spelter producer in the nation and perhaps the world. In 1880, the Census of Manufacturing recorded 570 employees. Competition increased during this period, especially in LaSalle-Peru, with the arrival of Illinois Zinc Company in Peru, the Mineral Point Zinc Company in DePue, and the Collinsville Zinc Company near St. Louis. Lanyon and Company and Thomas Kinsman also ran small smelters in LaSalle. The zinc industry in LaSalle-Peru created related businesses such as sheetmetal, zinc dipping, and weather stripping companies.Natural gas discovered in Kansas near sources of zinc ore in 1896 made Kansas and Oklahoma attractive to the zinc industry and signaled the beginning of the end for M&H. They held out through diligent work and technical expertise. In 1913 they built a zinc smelter in Joplin, Missouri. By the 1950s they had subsidiary interests throughout eastern North America.Edward's daughter, Mary Hegeler Carus, ran the company from 1903 until her death in 1936. She was one of the first female students at the University of Michigan, and in 1882 the first woman engineering graduate. In 1885 -1886 she studied at the Bergakademie Freiberg in Germany, the first woman to be legally registered as a student there. She was ahead of her time in running a company. In 1924, the Hegeler-Carus family bought out the Matthiessen family interests in the company.  Around the early 1900s, Julius and Herman Hegeler left to start their own zinc works in Danville, Illinois.Coal mining stopped in 1936. In 1950, the company purchased Meadowbrook Corporation, a zinc smelter near Clarksburg, West Virginia, and New Castle Chemical Company near Pittsburgh from Dow Chemicals. They gave M&H problems in the 1960s due to strikes and inefficient production.  The company stopped smelting zinc in 1961. Sulfuric acid discontinued in 1968 and only rolling operations remained. Today the LaSalle factory's location is a superfund site.\n\n\n=== Hegeler furnace ===\nThey improved upon the Belgian and Silesian furnaces and patented the new Hegleler furnace in 1881. It decreased coal usage and increased ore efficiency, eliminated some expensive labor, and created a marketable residual product, sulfuric acid. The furnace gave them an advantage over other zinc producers.\n\n\n=== Employee relations ===\nM&H had an good relationship with their employees well into the 1920s. The company was noted for its safety records and employee involvement. It had low wages and reduced the daily work day to eight hours in 1885, nearly a decade before it became law. It gave loans to employees for the purpose of buying homes and was structured in a way to give its workers a significant voice. From the 1880s to 1910s when mines and factories throughout America experienced labor unrest, M&H did not have a single strike. After Matthiessen's death in 1918, contact with employees decreased. A union formed and the company had its first strike in 1936.\n\n\n=== Zinc uses ===\nDuring WWI, zinc was used for ammunition, weapons, sheet metal, and boiler plates. After WWI, zinc was used for auto parts, brass, linoleum, batteries, semiconductors, pharmaceuticals, and rubber tires.\n\n\n=== Subsidiaries ===\nM&H had a number of subsidiaries over the years:\nZinc Roofing and Ornament Company in Chicago, ended 1874.\nLaSalle and Bureau County Railroad, started in 1876 was a six mile line connecting the zinc plant to a major railway junction.\nBarnes Zinc Products, started in 1919 by the Caruses. It was bought by M&H in 1928. Renamed Barnes Metal Products Company, it produced various kinds of tools for Sears and Ace Hardware in the 1960s.\nApollo Metal Products, 1920s. Moved to Chicago by the 1940s.\nThe Sherbrooke Corporation, 1959-1971. Phosphoric acid manufacturing plant sold to the Electric Reduction Company in 1971.\nWalker Metal Products Company, 1968-1972.\n\n\n=== Family impact ===\nFrederick Matthiessen became mayor of LaSalle and focused on civic improvements, helping bring about the LaSalle-Peru Horse and Dummy Railway and personally paying for the city waterworks, electrical light station, first library, high school buildings, and hygienic institute. He eventually donated his Deer Park estate as a public park, today Matthiessen State Park. He had interests in the LaSalle Pressed Brick Company, the LaSalle Machine and Tool Company, and re-organized a bankrupt Clock Company to become the Western Clock Manufacturing Company, also known as Westclox. His children donated funds for the Matthiessen Memorial Auditorium at the highschool in 1918.Edward Hegeler interest in philosophy led him to establish the Open Court Press, which was instrumental in popularizing philosophy within the United States, particularly in translating Eastern religious works. He also had an interest in the DeSteiger Glass Works in LaSalle. He completed his home in 1876, now the Hegeler-Carus Mansion, a National Historic Landmark. He also donated four parks to the City of LaSalle.Across the street from the Hegeler-Carus Mansion is the Julius W. Hegeler Mansion. \nEdward Hegeler's grandson, Edward Carus founded the Carus Chemical Company in 1916, independent of M&H. It still exists today. \n\n\n== Notable employees ==\nFritz von Frantzius, bookkeeper\nC. Bai Lihme, Edward Hegeler's son in law, President of the Company\nWilliam Donald Scherzer, Engineer\n\n\n== References ==", "links": ["Alexander Campbell (Illinois politician)", "Bergakademie Freiberg", "C. Bai Lihme", "Clarksburg, West Virginia", "Danville, Illinois", "DePue, Illinois", "Edward C. Hegeler", "Frederick William Matthiessen", "Freiberg University of Mining and Technology", "Fritz von Frantzius", "Hegeler Carus Mansion", "Illinois Central Railroad", "Julius W. Hegeler I House", "LaSalle, Illinois", "Little Vermilion River (Illinois River)", "Mary Hegeler Carus", "Matthiessen State Park", "Mineral Point, Wisconsin", "Open Court Publishing Company", "Peru, Illinois", "Pittsburgh", "Sulfuric acid", "University of Michigan", "Westclox", "William Donald Scherzer"]}