{"url": "https://en.wikipedia.org/wiki/Melissa_Murray_(academic)", "title": "Melissa Murray (academic)", "summary": "Melissa Erica Murray (born 1975) is an academic and legal scholar who is the Frederick I. and Grace Stokes Professor of Law at New York University. Murray was previously the interim dean of the UC Berkeley School of Law.", "content": "Melissa Erica Murray (born 1975) is an academic and legal scholar who is the Frederick I. and Grace Stokes Professor of Law at New York University. Murray was previously the interim dean of the UC Berkeley School of Law.\n\n\n== Early life and education ==\nMurray (born 1975) was born in Brooklyn, New York & raised in Florida. Her mother worked as a nurse and her late father was a dentist. Murray graduated from Lincoln Park Academy High School in Fort Pierce, Florida, in 1993. She earned her Bachelor of Arts degree from the University of Virginia in 1997, where she was a university guide service historian, member of the Washington Literary Society and Debating Union, co-chair of the College Bowl, fundraising chair of the Colonnade Ball Committee, and volunteered at the Learning Needs and Evaluation Center. Murray then earned her Juris Doctor from Yale Law School in 2002, where she was the notes editor of the Yale Law Journal.\n\n\n== Career ==\nFollowing law school, Murray clerked for Sonia Sotomayor (then sitting on the Second Circuit) and Stefan R. Underhill of the United States District Court for the District of Connecticut. She was the only African-American clerk at the United States Court of Appeals for the Second Circuit.Murray joined the faculty at UC Berkeley School of Law in 2006 and was granted tenure in 2011. As an assistant professor, she was the co-winner of the Association of American Law Schools 2012 Scholarly Papers Competition with Ashira Ostrow for her article \"Marriage as Punishment.\" In her paper, Murray describes how \"marriage has played a critical role in the operation of the criminal justice system, including serving as a defense to crime and as a form of punishment\". The following year, her article \"What's So New About the New Illegitimacy?\" was awarded the Dukeminier Awards' Michael Cunningham Prize as one of the best sexual orientation and gender identity law review articles of 2012.As a full professor at UC Berkeley, Murray was the recipient of the 2014 Rutter Award for Teaching Distinction which \"honors a professor who has shown an outstanding commitment to teaching and who is an inspiration to students.\" The following year, she was appointed faculty director of the Center on Reproductive Rights and Justice (CRRJ), the United States' first law school think tank to focus on reproductive rights and justice issues. She also became the co-author of \"Cases on Reproductive Rights and Justice,\" the first reproductive rights and justice casebook. On March 22, 2016, Murray was named interim dean of the UC Berkeley School of Law following the resignation of former dean Sujit Choudhry.On June 11, 2018, Murray left UC Berkeley to accept a position as a tenured faculty member at New York University and become the co-faculty director of the Birnbaum Women's Leadership Network. In the same year as her faculty appointment, Murray testified at Brett Kavanaugh's Supreme Court confirmation hearing where she cautioned the United States Senate Committee on the Judiciary that he would overturn Roe v. Wade. Murray is on the board of directors of the American Constitution Society. She is considered to be in contention for a federal judgeship under the Biden administration.Since 2019, Murray has co-hosted the podcast Strict Scrutiny with fellow legal academics Kate Shaw and Leah Litman. In 2022, the podcast joined the Crooked Media network.\n\n\n== Personal life ==\nMurray married Joshua Hill Jr. in 2004.\n\n\n== Selected publications ==\nReproductive Rights and Justice Stories (Foundation Press, 2019) (with K. Shaw & R. Siegel).\nCases on Reproductive Rights and Justice (Foundation Press, 2014)\n\n\n== See also ==\nJoe Biden Supreme Court candidates\n\n\n== References ==\n\n\n== External links ==\nAppearances on C-SPAN", "links": ["American Constitution Society", "American Law Institute", "Appellate court", "Association of American Law Schools", "Bachelor of Arts", "Brett Kavanaugh Supreme Court nomination", "Brooklyn", "C-SPAN", "College Bowl", "Crooked Media", "Florida", "Full professor", "Joe Biden Supreme Court candidates", "Juris Doctor", "Lincoln Park Academy", "Melissa Murray (disambiguation)", "New York (state)", "New York University", "Podcast", "Presidency of Joe Biden", "Roe v. Wade", "Sonia Sotomayor", "Stefan R. Underhill", "Strict Scrutiny", "Sujit Choudhry", "The New York Times", "UC Berkeley School of Law", "United States Court of Appeals for the Second Circuit", "United States District Court for the District of Connecticut", "United States Senate Committee on the Judiciary", "University of Virginia", "VIAF (identifier)", "Washington Literary Society and Debating Union", "Yale Law Journal", "Yale Law School"]}