{"url": "https://en.wikipedia.org/wiki/Micellar_solubilization", "title": "Micellar solubilization", "summary": "Micellar solubilization (solubilization) is the process of incorporating the solubilizate (the component that undergoes solublization) into or onto micelles. Solublization may occur in a system consisting of a solvent, an association colloid (a colloid that forms micelles), and at least one other solubilizate.", "content": "Micellar solubilization (solubilization) is the process of incorporating the solubilizate (the component that undergoes solublization) into or onto micelles. Solublization may occur in a system consisting of a solvent, an association colloid (a colloid that forms micelles), and at least one other solubilizate.\n\n\n== Usage of the term ==\nSolubilization is distinct from dissolution because the resulting fluid is a colloidal dispersion involving an association colloid. This suspension is distinct from a true solution, and the amount of the solubilizate in the micellar system can be different (often higher) than the regular solubility of the solubilizate in the solvent.\nIn non-chemical literature and in everyday language, the term \"solubilization\" is sometimes used in a broader meaning as \"to bring to a solution or (non-sedimenting) suspension\" by any means, e.g., leaching by a reaction with an acid.\n\n\n== Application ==\nMicellar solubilization is widely utilized, e.g. in laundry washing using detergents, in the pharmaceutical industry, for formulations of poorly soluble drugs in solution form, and in cleanup of oil spills using dispersants.\n\n\n== Mechanism ==\nLiterature distinguishes two major mechanisms of solubilization process of oil by surfactant micelles, affecting the kinetics of solubilization: surface reaction, i.e., by transient adsorption of micelles at the water-oil interface, and bulk reaction, whereby the surfactant micelles capture dissolved oil molecules.\n\n\n== See also ==\nHydrotrope\n\n\n== References ==\n\n\n== External links ==\nSolubilization of Homopolymers by Block Copolymer Micelles in Dilute Solutions, J. Phys. Chem., 1995, 99 (11), pp 3723–3731, Jose R. Quintana, Ramiro A. Salazar, Issa Katime", "links": ["Colloid", "Detergent", "Dispersant", "Dissolution (chemistry)", "Doi (identifier)", "Hydrotrope", "Laundry", "Leaching (chemistry)", "Micelle", "Oil spill", "Sedimentation", "Solubility", "Solution (chemistry)", "Solvent", "Washing"]}