{"url": "https://en.wikipedia.org/wiki/Michael_Paul_Fleischer", "title": "Michael Paul Fleischer", "summary": "Michael Paul Fleischer is a United States businessman from the state of New Jersey.", "content": "Michael Paul Fleischer is a United States businessman from the state of New Jersey.\n\n\n== Career ==\nOn March 13, 2004 Fleischer was appointed to the post of Director of Private Sector Development for the Coalition Provisional Authority in Iraq. He had been a deputy in the Office of Private Sector Development since November 2003.\nHe took leave from Bogen Communications International, Inc., where he was president and a member of the Board of Directors, in order to serve in Iraq.  He has since returned to Bogen. He is the brother of former White House press secretary Ari Fleischer. \n\n\n=== Criticism in Iraq ===\nThe Private Sector Development run by Fleischer came under criticism by many military and civilian analysts for removing Iraqi government subsidies to state owned businesses. This, it was argued, threw thousands out of work thereby giving the insurgency a disaffected pool of recruits. In the area under British control the subsidies were continued.In an article printed in the New York Review of Books Peter W. Galbraith, a former US Ambassador to Croatia commented on the policy of not supporting Iraqi state-owned enterprises; 'The privatizing of Iraq's economy was handled at first by Thomas C. Foley, a top Bush fund-raiser, and then by Michael Fleisher, brother of President Bush's first press secretary. ...he told the Chicago-Tribune...that the Americans were going to teach the Iraqis a new way of doing business. \"The only paradigm they know is cronyism.\"'\n\n\n== References ==\n\n\n== External links ==\nInsiders Shape Postwar Iraq, by Andrew Zajac\nMichael Fleisher\nMichael Fleisher", "links": ["Ari Fleischer", "Chicago-Tribune", "Coalition Provisional Authority", "Croatia", "ISBN (identifier)", "Iraq", "Naomi Klein", "New Jersey", "New York Review of Books", "Press secretary", "Thomas C. Foley", "Thomas E. Ricks (journalist)", "United States", "White House"]}