{"url": "https://en.wikipedia.org/wiki/Mike_Gallagher_(political_commentator)", "title": "Mike Gallagher (political commentator)", "summary": "Mike Gallagher (born April 7, 1960) is an American radio host and conservative political commentator. He is the host of The Mike Gallagher Show, a nationally syndicated radio program that airs throughout the United States on Salem Radio Network and is also a FOX News Channel Contributor and guest host. According to Talkers magazine, Gallagher is the ninth most-listened-to radio talk show host in the United States.", "content": "Mike Gallagher (born April 7, 1960) is an American radio host and conservative political commentator. He is the host of The Mike Gallagher Show, a nationally syndicated radio program that airs throughout the United States on Salem Radio Network and is also a FOX News Channel Contributor and guest host. According to Talkers magazine, Gallagher is the ninth most-listened-to radio talk show host in the United States.\n\n\n== Career ==\n\n\n=== Radio ===\n\nAs a 17-year-old high school senior in Dayton, Ohio, Gallagher talked his way into an on-air shift at WAVI-AM. From there he joined WFBC-AM in Greenville, South Carolina, eventually becoming station manager. He then became an on-air host in Albany, New York, on WGY-AM. Gallagher went on to New York City, where he spent two years as morning drive host on WABC-AM.In 1998, The Mike Gallagher Show was launched nationally with 12 radio stations. As of early 2011, Gallagher was the sixth most listened-to talk radio host in America with over four million weekly listeners. He is heard daily in New York City, Los Angeles, Chicago, Dallas, Houston, Detroit, Atlanta, and Philadelphia as well as in small, medium and major markets all over the country. According to the Benchmark Company, he is the 8th most-recognized talk radio personality in America. Gallagher has also been featured in numerous magazines and newspapers including The New York Times, The Wall Street Journal, Time, and Forbes. Talkers Magazine has named Gallagher one of the 100 most influential talk hosts in America for eleven consecutive years.Gallagher's show hosts many high-profile politicians as guests, including former Speaker of the House Newt Gingrich, former US President George W. Bush, Speaker of the House John Boehner, Republican presidential candidate John McCain during his 2008 electoral run, Vice President Dick Cheney while in office, and then-Secretary of Defense Donald Rumsfeld.\n\n\n=== Television ===\nGallagher co-hosted a morning news program with Dawn Meadows on Dayton's then-NBC affiliate WKEF in 1983. He is a Fox News Channel contributor and sometimes co-host, making frequent appearances on many Fox News Channel shows.\n\n\n=== Writing ===\nIn the summer of 2005, he authored Surrounded by Idiots:  Fighting Liberal Lunacy in America (2005, William Morrow; ISBN 0-06-073798-0), which became a New York Times bestseller (#27 on the extended bestseller list). The Times reviewed the book writing, \"You might disagree with the man's politics, but dang, you gotta love a guy who slaughters a steer live on the radio just to annoy the ideologues at People for the Ethical Treatment of Animals, then gives the meat to the poor. Checkmate. Fans of Gallagher will love the book, and even those liberal loons might enjoy reading it just to play Spot the Inconsistencies.\" On his radio show, he announced he was writing a book called 50 Things Liberals Love to Hate which was released August 28, 2012. The book was reviewed by former Speaker Newt Gingrich, who said of the book that it, \"is smart, funny, and uses satire and wit to take apart the left. If Jon Stewart had writers who were conservative, they'd write a book like this.\" On September 10, 2012 Gallagher gave a reading of his new book at the Richard Nixon Presidential Library.\n\n\n== Philanthropy and causes ==\nOn May 8, 2006 Gallagher used his show to raise money for the creation of homes in poverty-stricken areas of Jamaica in conjunction with Food for the Poor, during a live broadcast in the Jamaican national capital. Gallagher is also the namesake of his main charity, Gallagher's Army: The Mike Gallagher Show Charitable Foundation, which he founded in 2005 after he began asking his listeners and others to support the families of American military families. In 2008 Gallagher expanded his efforts by founding the Gallagher's Army: Fallen Officer Fund, which gathers funds from his listeners and others to support the families of police officers who have fallen in the line of duty.Gallagher has made his views on the protesting of American war dead upon their return from theatres of war, using his air time to try and prevent such protests from taking place. On October 6, 2006, Gallagher convinced the controversial Topeka, Kansas-based Westboro Baptist Church to appear on air with an hour of air time in exchange for not picketing a funeral for victims from the West Nickel Mines School shooting near Nickel Mines, Pennsylvania. Initially, Gallagher offered the organization money not to picket the funeral. With this gesture being accused of being blood money, the syndicated radio host gave the church an hour to appear on air. The Amish funerals went on peacefully after the contract signed with WBC stipulated a $500,000 fine if there were picketers anywhere near the funerals.\nFollowing plans by the Westboro Baptist Church to protest funerals of victims of the Virginia Tech massacre, Gallagher offered the group three hours of airtime in exchange for an agreement not to protest these funerals. The WBC was the in-studio guests of Gallagher's program for its entirety on April 24, 2007.  He has made a similar agreement with Westboro concerning possible protests at the funerals of those killed in Tucson, Arizona on January 8, 2011, despite the fact that emergency legislation passed on January 12, 2011 makes such protests illegal in Arizona.\n\n\n== Controversy ==\nIn December 2006 Gallagher made a controversial comment on Fox News, in response to a discussion of whether film actors and television personalities should be held to account for public statements they make against the government in a time of war, specifically Joy Behar's comparison of then Secretary of Defense Donald Rumsfeld to Adolf Hitler. Gallagher stated that, \"I think we should round up all of these folks. Round up Joy Behar. Round up Matt Damon, who last night on MSNBC attacked George Bush and Dick Cheney. Round up [Keith] Olbermann. Take the whole bunch of them and put them in a detention camp until this war is over because they're a bunch of traitors.\"Gallagher has come under fire of accusations of racism and Islamophobia after stating that airports ought to have a \"Muslims Only\" line in the wake of the 9/11 attacks, saying \"It's time to have a Muslims check-point line in America's airports and have Muslims be scrutinized. You better believe it, it's time.\"\n\n\n== Personal life ==\nGallagher was born in Dayton, Ohio. He attended Chaminade-Julienne High School in downtown Dayton (graduating in 1978), where he was active in the school radio and TV station, theater (he had lead roles during all four years of school), the school band and chorus. Gallagher is of Irish descent. In 2008, his wife Denise died one day shy of her 52nd birthday, from endometrial cancer.From September 6 to 11, 2011 Gallagher made a week-long cameo in the Broadway show Memphis, stating it was the culmination of a lifelong dream.\n\n\n== References ==\n\n\n== External links ==\nGallagher's official website\nGallagher 2002 CNN interview transcript\nAppearances on C-SPAN", "links": ["Abby Huntsman", "Adolf Hitler", "Ainsley Earhardt", "Aishah Hasnie", "Alan Colmes", "Albany, New York", "Alisyn Camerota", "Allen West (politician)", "Andrea Tantaros", "Andrew Breitbart", "Andrew Napolitano", "Angela McGlowan", "Arizona Daily Star", "Arnon Mishkin", "Arthel Neville", "Atlanta", "Ben Carson", "Ben Domenech", "Bernard Goldberg", "Bill Hemmer", "Bill Kristol", "Bill O'Reilly (political commentator)", "Bob Beckel", "Bret Baier", "Brian Kilmeade", "Brit Hume", "Bryan Llenas", "Byron York", "C-SPAN", "Candace Owens", "Capri Cafaro", "Carl Cameron", "Casey Stegall", "Catherine Herridge", "Chaminade-Julienne High School", "Charles Krauthammer", "Charles Lane (journalist)", "Chris Wallace", "Claudia Cowan", "Clayton Morris", "Conservatism in the United States", "Dagen McDowell", "Dallas", "Dan Bongino", "Dana Perino", "Dave Briggs (journalist)", "Dayton, Ohio", "Dayton Daily News", "Dennis Kucinich", "Dick Cheney", "Dick Morris", "Donald Rumsfeld", "Doug McKelway", "Douglas Harriman Kennedy", "Douglas Schoen", "E. D. Hill", "Ed Henry", "Ellis Henican", "Ellison Barber", "Emily Compagno", "Endometrial cancer", "Eric Bolling", "Eric Shawn", "Food for the Poor", "Forbes", "Fox News", "Fox News Channel", "Fred Barnes (journalist)", "Gavin McInnes", "George W. Bush", "George Will", "Geraldo Rivera", "Glenn Beck", "Greenville, South Carolina", "Greg Gutfeld", "Greg Kelly", "Greta Van Susteren", "Gretchen Carlson", "Griff Jenkins", "Harold Ford Jr.", "Harris Faulkner", "Harvey Levin", "Heather Childers", "Houston", "Howard Kurtz", "ISBN (identifier)", "Irish people", "Islamophobia", "Jamaica Gleaner", "James Rosen (journalist)", "Jane Skinner", "Janice Dean", "Jeanine Pirro", "Jennifer Griffin", "Jesse Watters", "Jillian Mele", "Jim Angle", "John Boehner", "John Kasich", "John Layfield", "John Roberts (journalist)", "John Stossel", "Jon Scott", "Jon Stewart", "Jonah Goldberg", "Jonathan Morris (commentator)", "Joseph A. Cafasso", "Joy Behar", "Juan Williams", "Judith Miller", "Julie Banderas", "Juliet Huddy", "Karl Rove", "Kat Timpf", "Katie Pavlich", "Kayleigh McEnany", "Keith Olbermann", "Kennedy (commentator)", "Kevin Corke", "Kimberly Guilfoyle", "Kiran Chetry", "Kirsten Powers", "Kristin Fisher", "Larry Kudlow", "Laura Ingle", "Laura Ingraham", "Lauren Green", "Lawrence B. Jones", "Lea Gabrielle", "Leland Vittert", "Leo Terrell", "Leslie Marshall (journalist)", "Lis Wiehl", "Liz Cheney", "Major Garrett", "Marc Siegel", "Margaret Hoover", "Maria Bartiromo", "Marianne Rafferty", "Mark Levin", "Martha MacCallum", "Mary Katharine Ham", "Matt Damon", "Meghan McCain", "Megyn Kelly", "Memphis (musical)", "Michael Gallagher (disambiguation)", "Michael Gallagher (political advisor)", "Mike Baker (CIA officer)", "Mike Emanuel", "Mike Gallagher (U.S. legislator)", "Molly Henneberg", "Molly Line", "Neil Cavuto", "New York Times", "Newt Gingrich", "Oliver North", "Patrick Caddell", "Paula Zahn", "Pete Hegseth", "Peter Doocy", "Phil Keating", "Philadelphia", "Rachel Campos-Duffy", "Racism", "Radio syndication", "Ralph Peters", "Rich Edson", "Rich Lowry", "Richard Nixon Presidential Library", "Rick Leventhal", "Rick Reichmuth", "Rob Schmitt", "S. E. Cupp", "Salem Radio Network", "Salem Radio Networks", "Sandra Smith (reporter)", "Sarah Palin", "Sarah Sanders", "Scott Brown (politician)", "Sean Hannity", "Shannon Bream", "Shepard Smith", "Speaker of the United States House of Representatives", "Stacey Dash", "Stephen F. Hayes", "Steve Doocy", "Steve Harrigan", "Steve Hilton", "Steven Crowder", "Talk radio", "Talkers", "Tammy Bruce", "The Huffington Post", "The New York Times", "The Wall Street Journal", "Time (magazine)", "Tomi Lahren", "Townhall.com", "Trace Gallagher", "Trey Gowdy", "Tucker Carlson", "Tyrus (wrestler)", "University of Dayton", "VIAF (identifier)", "WABC-AM", "WGY-AM", "WKEF", "WORD-AM", "Wayback Machine", "Wendell Goler", "Wesley Clark", "Will Cain", "Wright State University"]}