{
    "url": "https://en.wikipedia.org/wiki/Mohsen_Rafighdoost",
    "title": "Mohsen Rafighdoost",
    "summary": "Mohsen Rafighdoust (also Rafiqdoust, Persian: محسن رفیقدوست) is an Iranian multi-billionaire Revolutionary Guards military officer and conservative politician. He is a member of the Islamic Coalition Party.",
    "content": "Mohsen Rafighdoust (also Rafiqdoust, Persian: محسن رفیقدوست) is an Iranian multi-billionaire Revolutionary Guards military officer and conservative politician. He is a member of the Islamic Coalition Party.\n\n\n== Background ==\nRafighdoost's background is that of a bazaari, the traditional class of people who work in the bazaar. His father was a fruit and vegetable merchant at the Tehran bazaar.\n\n\n== Military career ==\nMohsen Rafighdoost was the chief of Ruhollah Khomeini's security detail in 1979 during the Iranian Revolution, and helped found the Revolutionary Guards who helped eliminate opposition to theocratic rule in the Islamic Republic.\nHe is noted for having driven Ruhollah Khomeini, the leader of the Revolution, from the Tehran international airport into Tehran, during Khomeini's triumphant return to Iran from France, while hundreds of Iranians crowded the road to welcome Khomeini back. He has told journalists this was the most important day of his life and \"crowds were all over the car, touching and hanging on to it.\"He served from 1982 to 1989 as Minister of the Revolutionary Guards where he quashed internal dissent and obtained weapons from abroad for the Iran–Iraq War.\nRafighdoost said in a 2014 interview that he twice suggested to Khomeini that Iran develop weapons of mass destruction to counter their use by Saddam Hussein. Rafighdoost claimed that both times Khomeini rejected the idea, reasoning that it would be against Islam.\n\n\n== Business career ==\nIn 1989 he was appointed head of the Mostazafan Foundation or Bonyad-e Mostazafen va Janbazan (Foundation of the Oppressed), \"the second-largest commercial enterprise\" in Iran behind the state-owned National Iranian Oil Company where he remained until 1999.\nSince 1999, Mohsen Rafighdoost has been the Director of the Noor Foundation. The Foundation reportedly owns apartment blocks and \"makes an estimated $200 million importing pharmaceuticals, sugar and construction materials.\"\n\n\n== Controversy ==\nIn 1995, Mohsen Rafighdoost's brother, Morteza Rafighdoost, was sentenced to ten years imprisonment for bank fraud. After this, Supreme Leader Ali Khamenei appointed a board of trustees and made the Bonyad-e Mostazafen va Janbazan subject to parliamentary scrutiny.Rafighdoost's personal fortune is said to be worth the equivalent of many millions of dollars. When asked about his personal wealth, Rafighdoost has responded: \"I am just a normal person, with normal wealth, but if Islam is threatened, I will become big again.\"\n\n\n== References ==\n\n\n=== Bibliography ===\nA Bazaari's World by Robert D. Kaplan March 1996 Atlantic accessed 15-May-2009, also in (with minor changes) Kaplan, Robert, The Ends of the Earth: A Journey at the Dawn of the 21st Century, Random House, New York, 1996",
    "links": [
        "Ali Khamenei",
        "Ali Shamkhani",
        "Alinaghi Khamoushi",
        "Bazaar",
        "Bazaari",
        "Bonyad-e Mostazafen va Janbazan",
        "Brigadier general",
        "Conservative",
        "Consolidation of the Iranian Revolution",
        "Encyclopædia Iranica",
        "France",
        "Iran",
        "Iranian Revolution",
        "Iran–Iraq War",
        "Iraqi chemical weapons program",
        "Islamic Coalition Party",
        "Islamic Republic",
        "Islamic Revolutionary Guard Corps",
        "Majlis",
        "Ministry of Revolutionary Guards",
        "Mir-Hossein Mousavi",
        "Mohammad-Ali Rajai",
        "Mohammad Forouzandeh",
        "Mohammad Saeedikia",
        "Mostazafan Foundation",
        "National Iranian Oil Company",
        "Order of Nasr",
        "Parviz Fattah",
        "Persian language",
        "Ruhollah Khomeini",
        "Sardar (Islamic Revolutionary Guard Corps)",
        "Tehran",
        "VIAF (identifier)",
        "Wayback Machine",
        "Weapons of mass destruction"
    ]
}