{"url": "https://en.wikipedia.org/wiki/Mona_Lisa_(Hermitage)", "title": "Mona Lisa (Hermitage)", "summary": "Hermitage Mona Lisa is a painting on canvas, which was made by unknown painter in the mid-16th century and it is located in Hermitage Museum of Saint Peterburg. It was transferred from the Antikvariat All-Union Association and entered the Hermitage in 1931.", "content": "Hermitage Mona Lisa is a painting on canvas, which was made by unknown painter in the mid-16th century and it is located in Hermitage Museum of Saint Peterburg. It was transferred from the Antikvariat All-Union Association and entered the Hermitage in 1931.\n\n\n== Description ==\nThis portrait is an image of Lisa Gherardini, best known as Mona Lisa or Gioconda, and it is a blatant copy of original Gioconda: it is very different from the authentic Mona Lisa of Louvre in Paris. The good workmanship, legibility and expressiveness emanating from the work were  pointed out, the execution of portrait is presumably of Nordic Europe derivation, in particular German-Flemish. The face of model is different, it is younger than version of Leonardo da Vinci, but also rear panorama presents two columnes, which are absents in the original, and many people call this picture using definition Gioconda with columnes. Two columnes stay in other copies such as Gioconda of Oslo in National Museum of Art, Architecture and Design, Gioconda of Baltimore in Walters Art Museum and Gioconda of Reynolds in Dulwich Picture Gallery.\n\n\n== Analysis ==\nScientific analyzes were carried out on this canvas and baryte, called barium sulphate in chemistry, was found. It is a mineral used for the preparation of the support, especially in the years ranging from 1620 to 1680, but when this substance was used, Leonardo had been dead for more than a century.\n\n\n== See also ==\nMona Lisa (Prado)\nIsleworth Mona Lisa\nMona Lisa replicas and reinterpretations\n\n\n== Notes ==", "links": ["Barium sulphate", "Baryte", "Canvas", "Chemistry", "Dulwich Picture Gallery", "Hermitage Museum", "Isleworth Mona Lisa", "Leonardo da Vinci", "Lisa Gherardini", "Louvre", "Mona Lisa", "Mona Lisa (Prado)", "Mona Lisa replicas and reinterpretations", "National Museum of Art, Architecture and Design", "Oil painting", "Painter", "Paris", "Peterburg", "Portrait", "Saint Peterburg", "Walters Art Museum"]}