{"url": "https://en.wikipedia.org/wiki/Museum_of_Natural_Sciences", "title": "Museum of Natural Sciences", "summary": "The Museum of Natural Sciences of Belgium (French: Muséum des sciences naturelles de Belgique, Dutch: Museum voor Natuurwetenschappen van België) is a museum dedicated to natural history, located in Brussels, Belgium. The museum is a part of the Royal Belgian Institute of Natural Sciences. Its most important pieces are 30 fossilised Iguanodon skeletons, which were discovered in 1878 in Bernissart, Belgium.\nThe Dinosaur Hall of the museum is the world's largest museum hall completely dedicated to dinosaurs. Another famous piece is the Ishango bone, which was discovered in 1960 by Jean de Heinzelin de Braucourt in the Belgian Congo. The museum also houses a research department and a public exhibit department.", "content": "The Museum of Natural Sciences of Belgium (French: Muséum des sciences naturelles de Belgique, Dutch: Museum voor Natuurwetenschappen van België) is a museum dedicated to natural history, located in Brussels, Belgium. The museum is a part of the Royal Belgian Institute of Natural Sciences. Its most important pieces are 30 fossilised Iguanodon skeletons, which were discovered in 1878 in Bernissart, Belgium.\nThe Dinosaur Hall of the museum is the world's largest museum hall completely dedicated to dinosaurs. Another famous piece is the Ishango bone, which was discovered in 1960 by Jean de Heinzelin de Braucourt in the Belgian Congo. The museum also houses a research department and a public exhibit department.\n\n\n== History ==\nThe Museum of Natural Sciences was founded on 31 March 1846, as a descendant of the Musée de Bruxelles of 1802. It was based on the collection established by Prince Charles Alexander of Lorraine, dating from the 18th century. The scientist and politician Bernard du Bus de Gisignies became the first director of the museum in 1846, and on this occasion, he donated 2,474 birds from his own collection to the museum.\n\nIn 1860, during the construction of new fortifications around Antwerp, several fossils were found, mainly of whales, and they were acquired by the museum. The museum also obtained the skeletons of a bowhead whale (Balaena mysticetus) and a young blue whale (Balaenoptera musculus), which are still on display today. The same year, the skeleton of a mammoth was unearthed near Lier, in Antwerp, Belgium, and due to the prompt action of the archaeologist François-Joseph Scohy, it was preserved and brought to the museum, where it has been exhibited since 1869. At that time, the only other skeleton of a mammoth on display was in the museum of Saint Petersburg in Russia.\nIn 1878, the largest find of Iguanodon fossils to date occurred in a coal mine at Bernissart, in Hainaut, Belgium. At least 38 Iguanodon (Iguanodon bernissartensis) skeletons were uncovered, at a depth of 322 metres (1,056 ft), of which 30 were brought back to the museum and put on display. They were mounted by Louis Dollo and set the standard that was followed for over a century. Found alongside the Iguanodon skeletons were the remains of plants, fish, and other reptiles, including the crocodyliform Bernissartia.Between 1889 and 1891, the museum moved from its original home at the Palace of Charles of Lorraine into a former convent located on the heights of the park. The building quickly became too narrow and the director of the time, Edward Dupont, entrusted the architect Charles-Emile Janlet the construction of a new southern wing. Work began in 1898 and ended in October 1905. The new rooms were specially designed to accommodate the new collections.\nIn 1950, several modern buildings were added to house new exhibition and storage rooms, as well as premises for the Royal Belgian Institute of Natural Sciences, the research centre of which the museum is now part.\nSince 2007, the completely renovated and enlarged Dinosaur Hall (the Janlet wing) of 4,580 m2 (49,300 sq ft) has been the largest dinosaur hall in the world.\n\n\n== Permanent exhibitions ==\n\nThe Dinosaur Hall: with the world-famous Iguanodon skeletons (30 almost complete skeletons)\nOf Men and Mammoths: about the evolution of man and about the last ice age in Western Europe.\nThe Mammal Gallery: recent and extinct mammals, including a thylacine.\nThe North and South Pole: a view of two different worlds in a (plexi)glass tunnel.\nThe Whale Hall: skeletons of whales, dolphins, walruses, sirenians, and seals. A small part of the hall is devoted to the whales' role in the economy and their sacrifices to it.\nThe Shell Gallery houses a tropical aquarium and a complete survey of the lower classes of invertebrates. The nearby North Sea Discovery Room takes visitors on an interactive tour around beach and sea life at the Belgian coast. The entire collection consists of 9,000,000 specimens and is one of the three biggest shell collections in the world. A great deal was collected by Philippe Dautzenberg.\nThe Insect Gallery: insects, spiders, crustaceans and other arthropods, including a vivarium with living specimens. The collection consists of 15,000,000 specimens of which ten thousands are holotypes of great scientific value.\nThe Mineral Gallery: crystals, cut gems, meteorites and precious bits of moon rock.\nThe Ishango bone, a prehistoric bone counting tool.In addition to these permanent exhibitions, there are also temporary exhibitions which are always highly interactive.\n\n\t\t\n\t\t\n\n\n== See also ==\nBelgian Federal Science Policy Office (BELSPO)\nGeological Survey of Belgium\nEdmond de Sélys Longchamps\nHistory of Brussels\nBelgium in \"the long nineteenth century\"\n\n\n== References ==\n\n\n=== Notes ===\n\n\n== External links ==\n\nThe museum's official website\nRoyal Belgian Institute of Natural Sciences on Google Cultural Institute\nVisiting Dinosaurs at the Museum of Natural Sciences, Brussels, Belgium", "links": ["Antwerp", "Antwerp Province", "Archaeology", "Arthropod", "BELSPO", "Belgian Congo", "Belgium", "Belgium in \"the long nineteenth century\"", "Bernard du Bus de Gisignies", "Bernissart", "Bernissartia", "Blue whale", "Bowhead whale", "Brussels", "Brussels-Capital Region", "City of Brussels", "Crocodyliformes", "Crustacean", "Crystal", "Cut (gems)", "Dutch language", "Edmond de Sélys Longchamps", "Fossil", "François-Joseph Scohy", "French language", "Geographic coordinate system", "Geological Survey of Belgium", "Hainaut (province)", "History of Brussels", "Holotype", "ISBN (identifier)", "ISNI (identifier)", "Ice age", "Iguanodon", "Invertebrate", "Ishango bone", "Jean de Heinzelin de Braucourt", "Lier, Belgium", "Lier mammoth", "Louis Dollo", "Meteorite", "Moon rock", "Museum", "Natural history", "Palace of Charles of Lorraine", "Philippe Dautzenberg", "Prince Charles Alexander of Lorraine", "SUDOC (identifier)", "Saint Petersburg", "Sirenia", "Thylacine", "VIAF (identifier)", "Vivarium"]}