{"url": "https://en.wikipedia.org/wiki/Music_of_Kurogane_Communication", "title": "Music of Kurogane Communication", "summary": "Below are single albums pertaining to the anime series, Kurogane Communication.", "content": "Below are single albums pertaining to the anime series, Kurogane Communication.\n\n\n== my best friend ==\nmy best friend is Yui Horie's first single album under her name as well as the first single album released under Pony Canyon. It was released on 18 March, 1999. They were used as the opening song and the ending song in the anime series, Kurogane Communication. In addition, both songs were re-released in her 2003 complication album, Ho?: Horie Yui Character Best Album.\n\n\n=== In other media ===\nYui Horie humorously mentioned the song, my best friend, in her radio show, Horie Yui no Tenshi no Tamago, about the selection of songs to sing in a karaoke.\n\n\n=== Track listing ===\n\n\n== brand-new communication ==\nbrand-new communication (brand-new コミュニケイション) is Yui Horie's second single album. It was released on 17 March, 1999. The specific word in the Japanese title, communication, is unique that it does not use chōonpu (i.e. コミュニケーション) as with the Japanese title of the related anime series. It is the final album released under the Pony Canyon label in Yui Horie's name. The song, Hanagara no One Piece, is included in the separately-released Kurogane Communication original soundtrack.\n\n\n=== Track listing ===\n\n\n== References ==", "links": ["A-side and B-side", "Aice5", "Brand-new communication", "Chōonpu", "Darling (Yui Horie album)", "Himitsu (Yui Horie album)", "Ho?: Horie Yui Character Best Album", "Honey Jet!!", "I'm Enterprise", "J-pop", "Kurogane Communication", "Kuroneko to Tsuki Kikyū o Meguru Bōken", "Love Destiny (Single Album)", "Love Destiny (song)", "Mizutamari ni Utsuru Sekai", "Music genre", "My best friend (Single Album)", "Pony Canyon", "Rakuen (album)", "Record label", "Single (music)", "Sky (Yui Horie album)", "Songwriter", "Starchild (label)", "Usotsuki Alice to Kujiragō o Meguru Bōken", "World End no Niwa", "Yui Horie"]}