{
    "url": "https://en.wikipedia.org/wiki/Myron_Henry_Phelps",
    "title": "Myron Henry Phelps",
    "summary": "Myron Henry Phelps (Lewiston, Fulton County, Illinois, 2 April 1856 - Bombay, 29 December 1916) was a New York lawyer and religious writer. He was known for his interest in Buddhism, and studied and wrote about the Baháʼí Faith and the Radha Soami movement. He traveled to eastern Asia and supported the India House in Manhattan.",
    "content": "Myron Henry Phelps (Lewiston, Fulton County, Illinois, 2 April 1856 - Bombay, 29 December 1916) was a New York lawyer and religious writer. He was known for his interest in Buddhism, and studied and wrote about the Baháʼí Faith and the Radha Soami movement. He traveled to eastern Asia and supported the India House in Manhattan.\n\n\n== Interest in Buddhism ==\nPhelps was interested in Buddhism. He had a secret \"spiritual marriage\" to Miranda de Souza Canavarro (Sister Sanghamitta) (1849-1933), a wealthy American socialite married to the Portuguese ambassador to the Sandwich Islands. She was the first woman  to convert to Buddhism in the US in 1897.\n\n\n== Indian Independence ==\nPhelps began to sympathize with the Indian position and helped organize support for Indian rule as well as for Indian students in the US. He organized the Indo-American National Association in Maine and another Society for the Advancement of India in New York in 1907 with branches in Detroit and Chicago opened in 1908. In 1909 he travelled to England where he was expelled from the Waldorf Hotel for being a political agitator. He reached India in 1910 and met many Indian leaders. In 1912 he met Rabindranath Tagore. He attempted a translation of the Bhagwad Gita and was impressed by the Arya Samaj, the Ramakrishna Mission and particularly the Radhasoami cult.\n\n\n== Visit to ʻAbdu'l-Bahá ==\nPhelps and Sanghamitta visited ʻAbdu'l-Bahá in ‘Akkā and stayed with \"the Master\" for over a month, questioning him extensively about the Baha'i faith.  The visit was largely cordial and fruitful. \nPhelps wrote and published a biography of ʻAbdu'l-Bahá (dedicated to M.A. de S. Canavarro, or Sister Sanghamitta).  {{citation needed span|date=October 2020. The work has been well-known among Baháʼís for nearly a century, and is especially popular for its documentation of recollections by ʻAbdu'l-Bahá's sister.\n\n\n== Works ==\n1903, 1912, Life and Teachings of Abbas Effendi, New York & London: G.P. Putnam's Sons, 1903, 1904, 1912; University of California Libraries, 1912; McMaster, 2007; Kessinger, 2007, 2008, 2010; BiblioBazaar, 2009; Nabu, 2011; HardPress, 2012; Forgotten, 2012. ISBN 1113802219. ISBN 978-1113802217. ISBN 9781164335450. ISBN 9781113802255. ISBN 9781436585514.\nMaster in ‘Akká, including the recollections of the Greatest Holy Leaf, revised and annotated by Marzieh Gail, Los Angeles: Kalimát, 1985. ISBN 0933770499. ISBN 978-0933770492.\nPhelps’ Notes of discourses on Radhasoami Faith delivered by Babuji Maharaj in 1913-14 (alternate link), Soami Bagh, Agra: Radhasoami Satsang.\nThe Gurukula Through European Eyes, Kangri, 1917.\nHindu Ideals and Their Preservation. [3]\nThe Value of Hinduism for Hindus.\nDie wirkliche Natur der Baháʼí-Religion, Stuttgart: Weltunion fuer universale Religion und universalen Frieden, 1961.\n\n\n== References ==",
    "links": [
        "Acre, Israel",
        "Baháʼí Faith",
        "Bombay",
        "Fulton County, Illinois",
        "ISBN (identifier)",
        "ISNI (identifier)",
        "ISSN (identifier)",
        "Kessinger Publishing",
        "Marzieh Gail",
        "Miranda de Souza Canavarro",
        "Radha Soami",
        "SUDOC (identifier)",
        "VIAF (identifier)",
        "ʻAbdu'l-Bahá"
    ]
}