{
    "url": "https://en.wikipedia.org/wiki/Nearer,_My_God,_to_Thee",
    "title": "Nearer, My God, to Thee",
    "summary": "\"Nearer, My God, to Thee\" is a 19th-century Christian hymn by Sarah Flower Adams, which retells the story of Jacob's dream. Genesis 28:11–12 can be translated as follows: \"So he came to a certain place and stayed there all night, because the sun had set. And he took one of the stones of that place and put it at his head, and he lay down in that place to sleep. Then he dreamed, and behold, a ladder was set up on the earth, and its top reached to heaven; and there the angels of God were ascending and descending on it...\"\nThe hymn is well known, among other uses, as the alleged last song the band on RMS Titanic played before the ship sank and was sung by the crew and passengers of the SS Valencia as it sank off the Canadian coast in 1906.",
    "content": "\"Nearer, My God, to Thee\" is a 19th-century Christian hymn by Sarah Flower Adams, which retells the story of Jacob's dream. Genesis 28:11–12 can be translated as follows: \"So he came to a certain place and stayed there all night, because the sun had set. And he took one of the stones of that place and put it at his head, and he lay down in that place to sleep. Then he dreamed, and behold, a ladder was set up on the earth, and its top reached to heaven; and there the angels of God were ascending and descending on it...\"\nThe hymn is well known, among other uses, as the alleged last song the band on RMS Titanic played before the ship sank and was sung by the crew and passengers of the SS Valencia as it sank off the Canadian coast in 1906.\n\n\n== Lyrics ==\nThe lyrics to the hymn are as follows:\n\nNearer, my God, to Thee, nearer to Thee!\nE'en though it be a cross that raiseth me;\nStill all my song shall be nearer, my God, to Thee,\nChorus: Nearer, my God, to Thee, nearer to Thee!Though like the wanderer, the sun gone down,\nDarkness be over me, my rest a stone;\nYet in my dreams I'd be nearer, my God, to Thee,\nNearer, my God, to Thee, nearer to Thee!There let the way appear steps unto heav'n;\nAll that Thou sendest me in mercy giv'n;\nAngels to beckon me nearer, my God, to Thee,\nNearer, my God, to Thee, nearer to Thee!Then with my waking thoughts bright with Thy praise,\nOut of my stony griefs Bethel I'll raise;\nSo by my woes to be nearer, my God, to Thee,\nNearer, my God, to Thee, nearer to Thee!Or if on joyful wing, cleaving the sky,\nSun, moon, and stars forgot, upwards I fly,\nStill all my song shall be, nearer, my God, to Thee,\nNearer, my God, to Thee, nearer to Thee!A sixth verse was later added to the hymn by Edward Henry Bickersteth Jr. as follows:\nThere in my Father's home, safe and at rest,\nThere in my Saviour's love, perfectly blest;\nAge after age to be, nearer my God to Thee,\nNearer, my God, to Thee, nearer to Thee!\n\n\n== Text and music ==\n\nThe verse was written by the English poet and Unitarian hymn writer Sarah Flower Adams at her home \"Sunnybank\", in Loughton, Essex, England, in 1841.  It was first set to music by Adams's sister, the composer Eliza Flower, for William Johnson Fox's collection Hymns and Anthems.In the United Kingdom, the hymn is usually associated with the 1861 hymn tune \"Horbury\" by John Bacchus Dykes, named for a village near Wakefield, England, where Dykes had found \"peace and comfort\". In the rest of the world, the hymn is usually sung to the 1856 tune \"Bethany\" by Lowell Mason.  British Methodists prefer the tune \"Propior Deo\" (Nearer to God), written by Arthur Sullivan (of Gilbert and Sullivan) in 1872. Sullivan wrote a second setting of the hymn to a tune referred to as \"St. Edmund\". Mason's tune has also penetrated the British repertoire.The Methodist Hymn Book of 1933 includes Horbury and two other tunes, \"Nearer To Thee\" (American) and \"Nearer, My God, To Thee\" (T C Gregory, 1901–?), while its successor Hymns and Psalms of 1983 uses Horbury and \"Wilmington\" by Erik Routley. Songs of Praise includes Horbury, \"Rothwell\" (Geoffrey Shaw) and \"Liverpool\" (John Roberts/Ieuan Gwyllt, 1822–1877) Liverpool also features in the BBC Hymn Book of 1951 and the Baptist Hymn Book of 1962 (with Propior Deo) The original English Hymnal includes the hymn set to Horbury, while its replacement New English Hymnal drops the hymn. Hymns Ancient and Modern included Horbury and \"Communion\" (S S Wesley), although later versions, including Common Praise, standardise on Horbury.Other 19th century settings include those by the Rev. N. S. Godfrey, W. H. Longhurst, Herbert Columbine, Frederic N. Löhr, Thomas Adams, Stephen Glover, Henry Tucker, John Rogers Thomas, and one composed jointly by William Sterndale Bennett and Otto Goldschmidt. In 1955, the English composer and musicologist Sir Jack Westrup composed a setting in the form of an anthem for four soloists with organ accompaniment.\n\n\n== RMS Titanic and SS Valencia ==\n\n\"Nearer, My God, to Thee\" is associated with the sinking of the RMS Titanic, as some survivors later reported that the ship's string ensemble played the hymn as the vessel sank. For example, Violet Jessop said in her 1934 account of the disaster that she had heard the hymn being played; Archibald Gracie IV, however, emphatically denied it in his own account, written soon after the sinking, and wireless operator Harold Bride said that he had heard \"Autumn\", by which he may have meant Archibald Joyce's then-popular waltz \"Songe d'Automne\" (Autumn Dream). Feature films based on the Titanic disaster depict the band playing various versions of the hymn or other music. The 1929 film Atlantic, and the 1943, 1953, and 1997 films titled Titanic all used the \"Bethany\" version. The 1996 miniseries Titanic also features the hymn. The 1979 miniseries  S. O. S. Titanic featured \"Autumn\" instead. The 1958 film A Night to Remember used the \"Horbury\" version.Wallace Hartley, the ship's band leader, who died when the ship sank (as did all other musicians on board), liked the hymn and had wished to have it performed at his funeral. As a Methodist Briton, he was familiar with both the \"Horbury\" and \"Propior Deo\" versions but would not likely have used \"Bethany\". His father, a Methodist choirmaster, used the \"Propior Deo\" version at church. His family were certain that he would have used the \"Propior Deo\" version, and it is this tune's opening notes that appear on Hartley's memorial and that were played at his funeral. However, a record slip for a 1913 Edison cylinder recording of \"Nearer, My God, to Thee\", featuring the \"Bethany\" version, states that \"When the great steamship 'Titanic' sank in mid-ocean in April 1912, it was being played by the band and sung by the doomed passengers, even as the boat took her final plunge.\" George Orrell, the bandmaster of the rescue ship, RMS Carpathia, who spoke with survivors, related: \"The ship's band in any emergency is expected to play to calm the passengers. After the Titanic struck the iceberg the band began to play bright music, dance music, comic songs – anything that would prevent the passengers from becoming panic-stricken... various awe-stricken passengers began to think of the death that faced them and asked the bandmaster to play hymns. The one which appealed to all was 'Nearer My God to Thee'.\"\"Nearer, My God, to Thee\" was sung by the doomed crew and passengers of the SS Valencia as it sank off the Canadian coast in 1906, which may be the source of the Titanic legend.\n\n\n== Quotations in musical compositions ==\nA dramatic paraphrase of the hymn tune was written for wind band by the Danish composer, Carl Nielsen. His version includes a musical rendition of the collision between boat and iceberg. The composer Sigfrid Karg-Elert, moved by the Titanic tragedy, wrote six works based on the \"Bethany\" setting, including an organ fantasia. \"Bethany\" is also quoted in Charles Ives's Symphony No. 4. The French organist Joseph Bonnet wrote \"In Memoriam – Titanic\", the first of his Douze Pièces, Op. 10, based on the tune Horbury. It was published the year after the Titanic sank.The hymn even made its way briefly onto the operatic stage. The singer Emma Abbott, prompted by \"her uncompromising and grotesque puritanism\" rewrote La traviata so that Violetta expired singing not Verdi's Addio del passato, but \"Nearer My God to Thee\".\n\n\n== Other uses ==\nAnother tale, surrounding the death of President William McKinley in September 1901, quotes his dying words as being the first few lines of the hymn.  At 3:30 pm, in the afternoon of 14 September 1901, after five minutes of silence across the nation, numerous bands across the United States played the hymn, McKinley's favorite, in his memory. It was also played by the Marine Band on Pennsylvania Avenue during the funeral procession through Washington and at the end of the funeral service itself, and at a memorial service for him in Westminster Abbey, London. The hymn was also played as the body of assassinated American President James Garfield was interred at Lakeview Cemetery in Cleveland, Ohio, and at the funerals of former U.S. Presidents Warren G. Harding and Gerald R. Ford, and Prince Bernhard of the Netherlands\nThe Confederate army band played this song as the survivors of the disastrous Pickett's Charge (in the Battle of Gettysburg) returned from their failed infantry assault. The Rough Riders sang the hymn at the burial of their slain comrades after the Battle of Las Guasimas. A film called Nearer My God to Thee was made in 1917 in the UK. \"Nearer, My God, to Thee\" is sung at the end of the 1936 movie San Francisco. In the Max Ophüls 1952 film, Le Plaisir, the French version of the hymn, 'Plus près de toi, mon Dieu,' is sung to the Bethany tune at a first communion service in a country church, causing  a group of prostitutes in the congregation to collapse in tears over their lost innocence. The title of the hymn is also the title of a painting by physician Jack Kevorkian. William F. Buckley mentions in the introduction to his 1998 book, Nearer, My God: An Autobiography of Faith, that the title was inspired by \"Nearer My God to Thee\".CNN co-founder Ted Turner, at the launch of the channel in 1980, promised: \"We won't be signing off until the world ends. ... We'll be ... covering it live. ... [And] when the end of the world comes, we'll play 'Nearer My God to Thee' before we sign off.\" Turner commissioned a video recording of the hymn for this purpose, played by a military marching band, which he sometimes played for reporters. In 2015, the video, tagged in CNN's database as \"[Hold for release] till end of world confirmed\", was leaked on the Internet.Among other recordings, Doris Day included the song on her 1962 album You'll Never Walk Alone. A season 3 episode of Homicide: Life on the Street is entitled \"Nearer My God to Thee\". The song is also played in episodes of the TV series Orphan Black and sung in the TV miniseries Midnight Mass during the final scene of Episode 7, along with a piano arrangement heard throughout the series.\n\n\n== Notes ==\n\n\n== References ==\nBuckley, William F. Nearer, My God: An Autobiography of Faith, Introduction. Harvest Books, 1998 ISBN 0-15-600618-9\nHowells, Richard Parton (1999). The Myth of the Titanic. New York: Palgrave Macmillan. ISBN 978-0-312-22148-5.\nLanning, Michael (2007). The Civil War 100. Sourcebooks, Inc. ISBN 978-1-4022-1040-2.\nRichards, Jeffrey (2001). Imperialism and Music: Britain, 1876–1953. Manchester, UK: Manchester University Press. ISBN 978-0-7190-6143-1.\nTaylor & Francis Group (2003). A Historical Dictionary of British Women. Routledge. ISBN 1-85743-228-2.\nTurner, Steve (2011). The Band that Played On. Nashville, TN: Thomas Nelson. ISBN 978-1-59555-219-8.\n\n\n== External links ==\nGenesis 28:11-12 (American Standard Version)\nLinks to midi files and sheet music\n\"Nearer, My God, to Thee\" mp3 (Bethany)\nHorbury at Hymnary.org\n\"Nearer, My God, to Thee\" mp3 (Propior Deo)\nInformation about the 1917 film at the IMDB database\nFantasia on Nearer, My God, to Thee (Warren, Charles): Scores at the International Music Score Library Project\nSheet music to Propior Deo\nSheet music for \"Nearer, My God, to Thee\" from Project Gutenberg (White arrangement)\nSheet Music for \"Nearer, My God, to Thee\", McKinley Music Co., 1909 (Sawyer/Turner arrangement)",
    "links": [
        "A Night to Remember (1958 film)",
        "Abilene Christian University",
        "Archibald Gracie IV",
        "Archibald Joyce",
        "Arthur Sullivan",
        "Atlantic (film)",
        "Battle of Gettysburg",
        "Battle of Las Guasimas",
        "Bethany (song)",
        "Book of Genesis",
        "Broken Hill",
        "CNN",
        "Carl Nielsen",
        "Charles Ives",
        "Cleveland, Ohio",
        "Common Praise",
        "Denmark",
        "Doris Day",
        "E. W. Scripps Company",
        "Edward Bickersteth (bishop of Exeter)",
        "Eliza Flower",
        "Emma Abbott",
        "English Hymnal",
        "Erik Routley",
        "Essex",
        "First communion",
        "Geoffrey Shaw (composer)",
        "Gerald R. Ford",
        "Gilbert and Sullivan",
        "Giuseppe Verdi",
        "Harold Bride",
        "Homicide: Life on the Street",
        "Horbury",
        "Horbury (song)",
        "Hymn",
        "Hymn tune",
        "Hymns Ancient and Modern",
        "Hymns and Psalms",
        "ISBN (identifier)",
        "Ian Bradley",
        "International Music Score Library Project",
        "Jack Kevorkian",
        "Jack Westrup",
        "Jacob's Ladder (Bible)",
        "James Garfield",
        "John Bacchus Dykes",
        "John Rogers Thomas",
        "Joseph Bonnet",
        "La traviata",
        "Le Plaisir",
        "Loughton",
        "Lowell Mason",
        "MBW (identifier)",
        "Max Ophüls",
        "Methodism",
        "Midnight Mass (TV series)",
        "Musicians of the RMS Titanic",
        "Musicologist",
        "Nearer My God to Thee (Homicide: Life on the Street)",
        "Nearer My God to Thee (disambiguation)",
        "New English Hymnal",
        "Orphan Black",
        "Otto Goldschmidt",
        "Pennsylvania Avenue (Washington, D.C.)",
        "Pickett's Charge",
        "President of the United States",
        "Prince Bernhard of Lippe-Biesterfeld",
        "Project Gutenberg",
        "Propior Deo (song)",
        "RMS Carpathia",
        "RMS Titanic",
        "Rough Riders",
        "Routledge",
        "S. O. S. Titanic",
        "SS Valencia",
        "Samuel Sebastian Wesley",
        "San Francisco (1936 film)",
        "Sarah Flower Adams",
        "Sarah Fuller Flower Adams",
        "Sigfrid Karg-Elert",
        "Sinking of the RMS Titanic",
        "Songs of Praise (hymnal)",
        "Stephen Glover (composer)",
        "Symphony No. 4 (Ives)",
        "Ted Turner",
        "The A.V. Club",
        "The Musical Times",
        "The Pacific Monthly",
        "Titanic (1943 film)",
        "Titanic (1953 film)",
        "Titanic (1996 miniseries)",
        "Titanic (1997 film)",
        "Turner Doomsday Video",
        "Unitarianism",
        "United States Air Force Band",
        "Vera Dick",
        "Violet Jessop",
        "Wakefield",
        "Wallace Hartley",
        "Warren G. Harding",
        "Wayback Machine",
        "Westminster Abbey",
        "William F. Buckley",
        "William Johnson Fox",
        "William McKinley",
        "William Sterndale Bennett",
        "Wind band",
        "You'll Never Walk Alone (Doris Day album)",
        "YouTube"
    ]
}