{
    "url": "https://en.wikipedia.org/wiki/Nemophila_menziesii",
    "title": "Nemophila menziesii",
    "summary": "Nemophila menziesii, known commonly as baby blue eyes or baby's-blue-eyes, is an annual herb, native to western North America.",
    "content": "Nemophila menziesii, known commonly as baby blue eyes or baby's-blue-eyes, is an annual herb, native to western North America.\n\n\n== Distribution ==\nThe plant is native to California, Baja California, and Oregon.It grows virtually throughout California at elevations from sea level up to almost 6,500 feet (2,000 m). It grows in many types of habitats, including chaparral, valley grasslands, and montane locales.\n\n\n== Description ==\nNemophila menziesii is variable in appearance. Lower leaves are stalked, lobed and oppositely arranged, 10–50 millimetres (0.4–2.0 in) with five to thirteen lobes, each entire or with one to three teeth. Upper leaves are more or less sessile and less lobed than lower. The stalk of the inflorescence is 20–60 millimetres (0.8–2.4 in). Calyx lobes are 4–8 millimetres (0.2–0.3 in). The flower is blue with a white center or all white, usually with blue veins and black dots near the center. It is 6–40 millimetres (0.2–1.6 in) wide. The tube is less than or equal to the filaments.\n\n\n=== Varieties ===\nThe species includes three varieties:\nNemophila menziesii var. atomaria has white flowers with black dots, often with a faint blue tint or blue veins in the corolla. It is found on coastal bluffs or grassy slopes in Oregon, Northwestern California, the Central Coast of California, and the San Francisco Bay Area.\nNemophila menziesii var. integrifolia has blue flowers, with black dots at the center and deep blue veins.  It is found in grasslands, canyons, woodlands, and slopes in the Central Coast, southern Coast Ranges, southwestern California, east of the Sierra Nevada range, and into the Mojave Desert and Baja California\nNemophila menziesii var. menziesii has bright blue flowers with white centers that are generally dotted with black.  It is found virtually throughout California, in meadows, grasslands, chaparral, woodlands, slopes, and desert washes, but it does not occur above 5200 feet (1600 meters).\n\n\n== Cultivation ==\nIt is also cultivated as an ornamental plant, as annual wildflower in native plant, water conserving, traditional, and wildlife gardens.\nIt can occasionally be found outside its native range as an introduced species, such as in Alaska.\n\n\n== Gallery ==\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== References ==\n\n\n== External links ==\n Media related to Nemophila menziesii at Wikimedia Commons\nCalflora Database: Nemophila menziesii (baby blue eyes)\nCalPhotos - Nemophila menziesii",
    "links": [
        "Alaska",
        "Asterids",
        "Baja California",
        "Binomial nomenclature",
        "Boraginaceae",
        "Boraginales",
        "Botanical Society of Britain and Ireland",
        "California",
        "Chaparral",
        "EPPO Code",
        "Encyclopedia of Life",
        "Eudicots",
        "European Nature Information System",
        "Flowering plant",
        "George Arnott Walker-Arnott",
        "Germplasm Resources Information Network",
        "Global Biodiversity Information Facility",
        "Habitat",
        "INaturalist",
        "Integrated Taxonomic Information System",
        "Interim Register of Marine and Nonmarine Genera",
        "International Plant Names Index",
        "Introduced species",
        "Invasive Species Compendium",
        "Missouri Botanical Garden",
        "Mojave Desert",
        "National Biodiversity Network",
        "National Center for Biotechnology Information",
        "Native plant",
        "Natural Resources Conservation Service",
        "Nemophila",
        "New Zealand Plant Conservation Network",
        "North America",
        "Oregon",
        "Ornamental plant",
        "Plant",
        "Plants of the World Online",
        "Rancho Santa Ana Botanic Garden",
        "San Francisco Bay Area",
        "Sierra Nevada (U.S.)",
        "Taxonomy (biology)",
        "The Plant List",
        "Tropicos",
        "Variety (biology)",
        "Vascular plant",
        "Wikidata",
        "Wikispecies",
        "Wildlife garden",
        "William Jackson Hooker",
        "World Flora Online",
        "Xeriscape"
    ]
}