{"url": "https://en.wikipedia.org/wiki/New_York_Society_for_the_Suppression_of_Vice", "title": "New York Society for the Suppression of Vice", "summary": "The New York Society for the Suppression of Vice (NYSSV or SSV) was an institution dedicated to supervising the morality of the public, founded in 1873. Its specific mission was to monitor compliance with state laws and work with the courts and district attorneys in bringing offenders to justice. It and its members also pushed for additional laws against perceived immoral conduct. While the NYSSV is better remembered for its opposition to literary works, it also closely monitored the newsstands, commonly found on city sidewalks and in transportation terminals, which sold the popular newspapers and periodicals of the day.\nThe NYSSV was founded by Anthony Comstock and his supporters in the Young Men's Christian Association.  It was chartered by the New York state legislature, which granted its agents powers of search, seizure and arrest, and awarded the society 50% of all fines levied in resulting cases. After his death in 1915, Comstock was succeeded by John S. Sumner. In 1947, the organization's name was changed to the Society to Maintain Public Decency. After Sumner's retirement in 1950, the organization was dissolved. The New York Society for the Suppression of Vice is not to be confused with its namesake, the earlier, 19th-century Society for the Suppression of Vice.", "content": "The New York Society for the Suppression of Vice (NYSSV or SSV) was an institution dedicated to supervising the morality of the public, founded in 1873. Its specific mission was to monitor compliance with state laws and work with the courts and district attorneys in bringing offenders to justice. It and its members also pushed for additional laws against perceived immoral conduct. While the NYSSV is better remembered for its opposition to literary works, it also closely monitored the newsstands, commonly found on city sidewalks and in transportation terminals, which sold the popular newspapers and periodicals of the day.\nThe NYSSV was founded by Anthony Comstock and his supporters in the Young Men's Christian Association.  It was chartered by the New York state legislature, which granted its agents powers of search, seizure and arrest, and awarded the society 50% of all fines levied in resulting cases. After his death in 1915, Comstock was succeeded by John S. Sumner. In 1947, the organization's name was changed to the Society to Maintain Public Decency. After Sumner's retirement in 1950, the organization was dissolved. The New York Society for the Suppression of Vice is not to be confused with its namesake, the earlier, 19th-century Society for the Suppression of Vice.\n\n\n== Actions pursued by the NYSSV ==\n1900: Encouraged authorities to arrest Olga Nethersole and others for \"violating public decency\" in Clyde Fitch's Broadway play Sapho. All were found innocent at trial.\n1915: Forced off the market Stanisław Przybyszewski's Homo sapiens\n1916: Forced off the market Theodore Dreiser's The Genius.\n1916: Opposed Margaret Sanger and publishers of birth control books.\n1919: At its urging a police raid at the Everard Baths resulted in nine arrests.\n1920: Seized the printing plates and all pages to Jurgen: A Comedy of Justice by James Branch Cabell. Charges were dismissed two years later, but banning the book boosted its sales.\n1920: After the magazine The Little Review serialized a passage of the book Ulysses dealing with the main character masturbating, the NYSSV, who objected to the book's content, took action to attempt to keep the book out of the United States. At a trial in 1921 the magazine was declared obscene and as a result Ulysses was banned in the United States.\n1922: Encouraged the arrest of bookstore employee Raymond D. Halsey for  selling the \"obscene\" novel Mademoiselle de Maupin by Théophile Gautier, which depicted adultery and homosexuality.  Halsey was acquitted, and successfully sued the Society for false arrest and malicious prosecution. This case established that literary experts could offer testimony in support of a book to guide the judge's opinion.\n1922: Unsuccessful lawsuit against the publishing house Thomas Seltzer for publishing Casanova’s Homecoming by Arthur Schnitzler and A Young Girl‘s Diary (with foreword by Sigmund Freud) by Hermine Hug-Hellmuth.\n1920s and '30s: Prosecuted a long war against the so-called \"girlie pulps,\" which featured titillating fiction, sometimes accompanied with nude photography.\n1925: Attacked as indecent the magazines Artists and Models and Art Lovers' Magazine.\n1927: Attacked publisher Bernarr Macfadden's newspaper, the New York Graphic.\n1927: Shut down Mae West's first starring role on Broadway, the play Sex. West spent ten days in jail.\n1929: Seized 3,000 books from three book dealers; titles included Ulysses, Lady Chatterley's Lover, and novels by Oscar Wilde, Frank Harris and Clement Wood.\n1930: Forced pulp publisher Harold Hersey to suppress the depiction of violence and lawlessness in his new line of gang pulps, which included Gangster Stories and Racketeer Stories.\n1932: Falsely arrested a bookseller for displaying a book on nudism in his store's window. John S. Sumner, secretary of the society, was ordered to pay the bookseller $500 in restitution.\n1933: Wins conviction resulting in a $200 fine over distribution of the book \"The Man In The Monkey Suit\" by Frances W. King.\n1933: Lost fight to have Erskine Caldwell's novel God's Little Acre declared obscene.\n1934: Raided magazine \"back-number\" shops to confiscate four new magazines with the titles Real Boudoir Tales, Real Temptation Tales, Real Forbidden Sweets, and Real French Capers.\n1935: Charged that Jim Tully's novel Ladies in the Parlor was indecent and emphasized \"dirt in the raw.\"\n1937: Attempted to block circulation of James T. Farrell's novel A World I Never Made for using obscene language.\n1946: Charged Edmund Wilson's Memoirs of Hecate County with obscenity.\n\n\n== See also ==\n\nComstock laws\nVice\nCensorship\nJurgen, A Comedy of Justice\nBook burning\n\n\n== References ==\n\n\n== Further reading ==\nGertzman, Jay A. Bookleggers and Smuthounds: The Trade in Erotica, 1920-1940, University of Pennsylvania Press, 1999. ISBN 0-8122-1798-5", "links": ["A World I Never Made", "Alfred Kreymborg", "American Experience", "Anthony Comstock", "Art Lovers' Magazine", "Arthur Schnitzler", "Artists and Models (magazine)", "Bernarr Macfadden", "Birth control", "Book burning", "Broadway theatre", "Censorship", "Clement Wood", "Clyde Fitch", "Comstock laws", "Edmund Wilson", "Erskine Caldwell", "Everard Baths", "Frank Harris", "Gangster Stories", "God's Little Acre", "Harold Hersey", "Hermine Hug-Hellmuth", "Homo sapiens (novel)", "ISBN (identifier)", "James Branch Cabell", "James T. Farrell", "Jim Tully", "John S. Sumner", "Jurgen, A Comedy of Justice", "Ladies in the Parlor", "Lady Chatterley's Lover", "Leopold Bloom", "Mae West", "Margaret Sanger", "Memoirs of Hecate County", "New York Graphic", "Nudism", "Obscenity trial of Ulysses in The Little Review", "Olga Nethersole", "Oscar Wilde", "Public morality", "Pulp magazine", "Racketeer Stories", "Real Boudoir Tales", "Real Forbidden Sweets", "Real French Capers", "Real Temptation Tales", "Sapho (play)", "Sex (play)", "Sigmund Freud", "Society for the Suppression of Vice", "Stanisław Przybyszewski", "The \"Genius\" (novel)", "The Little Review", "Theodore Dreiser", "Théophile Gautier", "Ulysses (novel)", "Vice", "Young Men's Christian Association"]}