{
    "url": "https://en.wikipedia.org/wiki/Nomfusi",
    "title": "Nomfusi",
    "summary": "Nomfusi Gotyana, known mononymously as Nomfusi, is a South African singer and performer of Afro-Soul music. She was born in the township of KwaZhakele in the Eastern Cape. Her mother Kwazibani (\"Who Knows?\" in English) raised her while her father languished in jail for 21 years. A domestic worker by day, Kwazibani was a sangoma (African medicine woman) with a gift for music. Nomfusi accompanied her mother to the weekly sangoma rituals (\"Intlombe\") where Nomfusi developed her musicality. She is a two-time SAMA nominee, Metro FM Award nominee and performed on multiple local and international tours.",
    "content": "Nomfusi Gotyana, known mononymously as Nomfusi, is a South African singer and performer of Afro-Soul music. She was born in the township of KwaZhakele in the Eastern Cape. Her mother Kwazibani (\"Who Knows?\" in English) raised her while her father languished in jail for 21 years. A domestic worker by day, Kwazibani was a sangoma (African medicine woman) with a gift for music. Nomfusi accompanied her mother to the weekly sangoma rituals (\"Intlombe\") where Nomfusi developed her musicality. She is a two-time SAMA nominee, Metro FM Award nominee and performed on multiple local and international tours.\n\n\n== Career ==\n\nSince launching her singing career in 2009, Nomfusi appeared at festivals including WOMAD in England, FMM Sines in Portugal. Her performances have been described by critics locally and overseas as \"an absolute riot to watch and hear\", \"a refreshing blast of energy\". The Swazi Observer named her \"best artist in the overall line-up\" at the 2011 Bushfire Festival.She has been profiled on television and in the press. She performed live on \"LIVE AMP\" (SABC1), AFROCAFE, MORNING LIVE, with feature articles in Drum, True Love, Destiny, 'Fair Lady, and Cosmopolitan.\n\n\n== Actor ==\nNomfusi was cast to play Miriam Makeba in the movie about Nelson Mandela called Mandela: Long Walk to Freedom. Producer Anant Singh claimed that the 2014 film would be \"the largest South African production ever mounted.\"\n\n\n== Albums ==\nChris Blackwell, the founder of Island Records, who discovered Bob Marley, Angelique Kidjo and US, said of Nomfusi, \"What a terrific young artist, her genuine concern for her community and beyond comes through SO strongly. She could go all the way.\"\n\n\n=== Kwazibani ===\nIn 2009 Nomfusi released her debut album Kwazibani with her then band \"The Lucky Charms\". Kwazibani featured two singles that gained her audience both locally and internationally. The song \"Nontsokolo\" earned her her first SAMA nomination. The album earned Nomfusi Metro FM Award Nominations for Best Female Singer and Best Album.\n\n\n=== Take Me Home ===\nShe released her second album in 2012, Take Me Home, targeting a Mzansi audience. The album spawned singles \"Uthando Lwam\" (\"Qam Qam\") and a duet with Ringo, \"Kunjalo\" that charted with multiple radio stations. Ringo Madlingozi co-wrote and produced the bulk of the album, while M'Jakes, Robbie Malinga and DJ Clock were collectively responsible for six more tracks. The album garnered another SAMA nomination, for Best Adult African category.\n\n\n== Discography ==\n\n\n=== Albums ===\nKwazibani (Universal Music, 2009)\nTake Me Home (Universal Music, 2012)\nAfrican Day (Delicious Tunes, 2017)\n\n\n=== Singles ===\n\"Uthando Lwam (Qam Qam)\" (2008)\n\"Nontsokolo\"  (2009)\n\"Kwazibni\" (2009)\n\"Kunjalo\" (2012)\n\n\n== Awards ==\n\n\n== References ==\n\n\n== External links ==\nNomfusi – PE’s Lucky Charm\nNomfusi's Facebook page",
    "links": [
        "Afro Soul",
        "Angelique Kidjo",
        "Bardentreffen",
        "Bob Marley",
        "Chris Blackwell",
        "Domestic worker",
        "Eastern Cape",
        "Johannesburg",
        "KwaZhakele",
        "MBA (identifier)",
        "Mandela: Long Walk to Freedom",
        "Miriam Makeba",
        "Nelson Mandela",
        "Nuremberg",
        "Sangoma",
        "South African Music Awards",
        "U2 (band)",
        "Universal Music",
        "VIAF (identifier)",
        "World Music",
        "YouTube"
    ]
}