{
    "url": "https://en.wikipedia.org/wiki/North_and_South_Wheatley",
    "title": "North and South Wheatley",
    "summary": "North and South Wheatley is a civil parish in the Bassetlaw district, in the county of Nottinghamshire, England. The parish includes the villages of North Wheatley and South Wheatley. In 2011 North Wheatley parish had a population of 509. It is 130 miles north of London, 30 miles north east of the county town of Nottingham, and 5 miles north east of the Nottinghamshire town of Retford. The parish touches Bole, Clarborough and Welham, Clayworth, Hayton, Saundby, Sturton Le Steeple and West Burton. There are 18 listed buildings in North and South Wheatley.",
    "content": "North and South Wheatley is a civil parish in the Bassetlaw district, in the county of Nottinghamshire, England. The parish includes the villages of North Wheatley and South Wheatley. In 2011 North Wheatley parish had a population of 509. It is 130 miles north of London, 30 miles north east of the county town of Nottingham, and 5 miles north east of the Nottinghamshire town of Retford. The parish touches Bole, Clarborough and Welham, Clayworth, Hayton, Saundby, Sturton Le Steeple and West Burton. There are 18 listed buildings in North and South Wheatley.\n\n\n== Geography ==\n\n\n=== Location ===\nNorth and South Wheatley lay in the north of the county, and the east of the district.\nIt is surrounded by the following local villages:\n\nGringley-on-the-Hill and Beckingham to the north\nClarborough to the south\nBole, Saundby, Sturton Le Steeple and West Burton to the east\nClayworth and Hayton to the west.The parish is approximately 2 miles in width, by 3 miles.\n\n\n=== Settlements ===\nThe parish consists of one urban area divided into two distinct villages:\nNorth Wheatley\nSouth Wheatley\n\n\n==== North Wheatley ====\n\nThis lies north of the Wheatley Beck stream, with the A620 Wheatley Bypass road providing a northern boundary for the village. This is the larger settlement and maintains most of the housing in the parish and church.\n\n\n==== South Wheatley ====\n\nThis is south of the Wheatley Beck stream. Much smaller but mainly residential, it maintains amenities such as a primary school, village hall and some leisure facilities.\n\n\n=== Landscape ===\nPredominantly, many of the parish residents are clustered around the urban area formed by the two villages. Outside of this is a light scattering of farms, farmhouses, auxiliary buildings and cottages amongst a wider mainly farmland setting. A few small wooded areas exist throughout the parish.\n\n\n==== Water features ====\nThe Wheatley Beck stream flows west to east through the parish and separates the two villages, before eventually draining into the River Trent.\nThe Oswald Beck feeds into the Wheatley Beck east of the parish, but forms a portion of the lower east and south boundary.\n\n\n==== Topography ====\nThe parish overall is low-lying, at approximately 15 metres (49 ft) in the east. The village areas ranges from 23–32 metres (75–105 ft), with the ground rising in the far west and south of the parish to 50–60 metres (160–200 ft). The peak of the parish is at Wheatley Grange farm 1+1⁄3 miles (2.13 km) north of the villages, with a land elevation there of 65 m (213 feet).\n\n\n== Governance and demography ==\nThe two settlements North Wheatley and South Wheatley are combined as North and South Wheatley parish for administrative identity.\nIt is managed at the first level of public administration by North and South Wheatley Parish Council.\nIn 2011 North Wheatley parish reported a population of 509. South Wheatley last provided a population count in 2001 of 102 residents.At district level, the wider area is managed by Bassetlaw District Council.\nNottinghamshire County Council provides the highest level strategic services locally.\n\n\n== History ==\n\n\n=== Toponymy ===\nWheatley was recorded in the Domesday Book as Watelaie. The parish was formed in 2014 from the then independent parishes of \"North Wheatley\" and \"South Wheatley\".\n\n\n=== Roman period and later ===\nThe villages dates back to Romans times and prior. The Roman Road from Lincoln crosses the River Trent at Littleborough and goes through Wheatley before reaching Doncaster. Roman coins were found in the village. There is proof of Roman soldiers being in Wheatley, as a Roman centurion's tombstone was discovered under the foundation of the present church in North Wheatley church tower when major restoration work was being carried out during the 1930s. Part of this tombstone is presently being displayed in the church.There are numerous theories about a Roman settlement in Wheatley, a possible Roman villa on the playing field, but no hard evidence. An 1899 OS map of Wheatley shows a Roman pitchment, situated on Low Street as the road forks into Top Street, the term pitchment can mean both a road and the floor area of a dwelling, of which it could have been either, but more likely it was the road.\nNumerous coins and fragments of pottery from the Roman period have been found around Wheatley, mainly from Wheatley Grange and Wheatley Wood when excavations took place to create a large pond for drainage purposes, this high point could have been the site of a look-out post. The fragments of pottery are mainly Samian ware, a red glazed decorated ware imported by the Romans from northern France. Roman coins have also been found on Chapel field, situated alongside the road. A Roman fantail bow brooch with pin and catchplate were also found in South Wheatley, as well as coins and a love token in the chapel field. These items are now in the Bassetlaw Museum in Retford.Around the time of Domesday (1086), Wheatley is recorded of having come under part ownership of the Archbishop of York. The rest came under the tenure of Roger de Busli. Landowners in later centuries became fragmented, they included the Markham family, the Earl of Shrewsbury, Lord Middleton and Marquess of Dorchester.The Grade II* listed Old Hall at North Wheatley has over the door the arms of Thomas Cartwright, and dates from 1673, possibly being the oldest dormitory building in the village. It is unclear if this Cartwright family were related to the Marnham family of the same name, due to the different coat of arms in use by both. Many of the heritage residences were primarily farmhouses for housing agricultural workers as the parish was mainly rural, with much of the surrounding land used for that purpose.\n\n\n== Community & leisure ==\nA village hall is at South Wheatley.There is one public house, The Sun Inn, in North Wheatley.The Recreation Ground in South Wheatley lends itself to multi-use community events and sport activities, along with a children's playground.The Trent Valley Way long-distance path runs through the parish and villages.\n\n\n== Landmarks ==\n\n\n=== Development protection area ===\nThere is a conservation area defined for much of North Wheatley, along with a portion of South Wheatley.\n\n\n=== Listed buildings ===\nThere are 18 listed buildings, including:\nRemains of Church of St Helen, Grade I and scheduled monument, South Wheatley\nChurch of St Peter and St Paul, Grade II*, North Wheatley\nNorth and South Wheatley War Memorial in the North Wheatley church grounds, Grade II\nThe Old Hall, Grade II*, North Wheatley\n\n\n== Religious sites ==\n\n\n=== North Wheatley ===\nThe North Wheatley churches are now shared amongst one congregation worshipping alternatively in the two buildings. It is a local ecumenical partnership of Anglican and Methodist churches.\n\n\n==== Church of St Peter and St Paul ====\n\nThe church was built in the 13th century, and is dedicated to St Peter and St Paul. It has a tower with 5 bells, but the Chancel was rebuilt in 1824. In 1967 it was registered as a Grade II* listed building. It is still in use with a church service on most Sundays at 10:30 am in either Church or Chapel.The churchyard contains a Calvary Cross (Grade II listed) that commemorates the men of North and South Wheatley who died in World War I.\n\n\n==== North Wheatley Methodist Chapel ====\nThis is located on Low Street. It was built in 1891 for Wesleyan worshippers.\n\n\n=== South Wheatley ===\n\n\n==== Church of St Helen ====\n\nThe church was thought to have been built in the 11th century, the surviving ruins of St Helen's consist only of an arch and its tower. The church was declared redundant in 1883 and subsequently demolished, its walls pulled down by traction engines. The stone from the church was used to repair walls in the village, with the altar being taken to St Peter and St Paul church in North Wheatley.\n\n\n== Education ==\nNorth Wheatley Church of England primary school is in South Wheatley.\n\n\n== Sport ==\nSeveral group activities take place primarily in South Wheatley on the multi-use Recreation Ground:\nCricket\nFootball pitches\nTennis courtsBowls takes place on its own dedicated field with a local club.\n\n\n== References ==\n\n\n== External links ==\nParish council",
    "links": [
        "2001 United Kingdom census",
        "Anglicanism",
        "Archbishop of York",
        "Bassetlaw District",
        "Bassetlaw Museum",
        "Beckingham, Nottinghamshire",
        "Bole, Nottinghamshire",
        "Brooch",
        "Centurion",
        "Chancel",
        "Civil parish",
        "Clarborough and Welham",
        "Clayworth",
        "Coat of arms",
        "Conservation area (United Kingdom)",
        "Cottage",
        "Domesday Book",
        "Doncaster",
        "Earl of Shrewsbury",
        "East Midlands",
        "Geographic coordinate system",
        "Grade II* listed",
        "Gringley on the Hill",
        "Hayton, Nottinghamshire",
        "Listed building",
        "Littleborough, Nottinghamshire",
        "Local Government Boundary Commission for England",
        "Local ecumenical partnership",
        "London",
        "Marnham, Nottinghamshire",
        "Marquess of Dorchester",
        "Methodism",
        "North Wheatley",
        "Nottingham",
        "Nottinghamshire",
        "Nottinghamshire County Council",
        "Office for National Statistics",
        "Ordnance Survey",
        "Retford",
        "Roger de Busli",
        "Roman Empire",
        "Samian ware",
        "Saundby",
        "Scheduled monument",
        "South Wheatley, Nottinghamshire",
        "St Peter and St Paul's Church, North Wheatley",
        "Sturton Le Steeple",
        "Thomas Willoughby, 1st Baron Middleton",
        "Trent Valley Way",
        "Wesleyan Church",
        "West Burton, Nottinghamshire",
        "World War I"
    ]
}