{
    "url": "https://en.wikipedia.org/wiki/NVI_F.K.35",
    "title": "NVI F.K.35",
    "summary": "The NVI F.K.35 or Koolhoven F.K.35 was a two-seat fighter aircraft built in the Netherlands during 1926.  It was completed and exhibited but, through a combination of ground accident and financial problems, never flown.",
    "content": "The NVI F.K.35 or Koolhoven F.K.35 was a two-seat fighter aircraft built in the Netherlands during 1926.  It was completed and exhibited but, through a combination of ground accident and financial problems, never flown.\n\n\n== Design and development ==\nThe F.K.35 was the last of Frederick Koolhoven's designs for Nationale Vliegtuig Industrie (NVI) before its financial collapse in early 1927.  It was a two-seat, single engine fighter aircraft, unusual in being configurable either as a monoplane or as a biplane. The thinking was that most air forces would fly the faster monoplane but small countries might prefer the more economical biplane. Completed before the Paris Aero Show of 1926, it was severely damaged whilst transporting it there for exhibition.  Though its fuselage was hastily replaced in time for the show, it never flew.In its monoplane configuration the K.K.35 was a low wing aircraft. Its wing was an all wood, single piece structure covered in plywood. It had constant chord, rounded tips and significant dihedral and was braced from above with two parallel struts on each side to the upper fuselage longerons.  In biplane mode the upper wing was mounted with no stagger, braced by N-form interplane struts; there were neither dihedral or ailerons on this wing. The empennage was conventional, with a straight tapered horizontal tail set on the top of the fuselage well forward of the vertical, narrow fin which, like with the rudder were also straight edged.The fuselage was a flat sided tubular steel structure, deep at the rear but sloping down to the nose from about mid-chord.  Since the pilot's open cockpit was well forward, it was lower than that of the gunner in the rear cockpit making forward fire safer.  The gunner's seat, twin Lewis machine gun and ammunition were contained within a novel turret, a vertical axis cylinder which could be power rotated in any direction under lever control.  The power was provided by a flywheel which the gunner spun up through a pedal mechanism.  It was claimed that once up to full speed the wheel stored enough energy to power the turret over one or two minute of engagement.  One of these turrets had already been fitted to the F.K.35 but there was not enough time to remount it in the new fuselage for the Paris Show.The F.K.35 was powered by a 600 hp (444 kW) Bristol Pegasus VI nine cylinder radial engine driving a two blade propeller.  Its fuel was held in lower wing tanks, which could be jettisoned in an emergency. Its fixed undercarriage was conventional, with a wide track. The mainwheels were mounted on bent axles hinged on the central fuselage bottom, forming a central transverse inverted V; the outer ends of the axles were supported by a vertical oleo strut and an oblique strut, together forming a V attached to the wing underside beneath the ends of the wing struts.\n\n\n== Specifications ==\n\nData from Flight 2 December 1926General characteristics\nCrew: Two\nLength: 8.60 m (28 ft 3 in)\nWingspan: 10.50 m (34 ft 5 in)\nEmpty weight: 896 kg (1,975 lb)\nGross weight: 1,568 kg (3,457 lb)\nPowerplant: 1 × Bristol Jupiter VI 9-cylinder radial, 450 kW (600 hp)\nPropellers: 2-bladedPerformance\n\nMaximum speed: 260 km/h (160 mph, 140 kn) at 3,000 m (9, 840 ft) This and other performance figures is an estimate.\nTime to altitude: 14 min to 5,000 m (16,400)\nLanding speed: 88.5 km/h (55 mph)Armament\nTwo Lewis machine guns\nTwo Vickers machine guns on Koolhoven mounting in rear cockpit\n\n\n== References ==",
    "links": [
        "Ailerons",
        "Armstrong Whitworth",
        "Armstrong Whitworth F.K.10",
        "Armstrong Whitworth F.K.3",
        "Armstrong Whitworth F.K.4",
        "Armstrong Whitworth F.K.6",
        "Armstrong Whitworth F.K.8",
        "Armstrong Whitworth Sissit",
        "BAT Baboon",
        "BAT Bantam",
        "BAT Basilisk",
        "BAT Crow",
        "BAT F.K.26",
        "BAT F.K.27",
        "Biplane",
        "Bristol Jupiter",
        "Bristol Pegasus",
        "British Aerial Transport",
        "Chord (aircraft)",
        "Cockpit",
        "Conventional undercarriage",
        "Desoutter Mk.II",
        "Dihedral (aircraft)",
        "Empennage",
        "Fighter aircraft",
        "Fin",
        "Flight International",
        "Flywheel",
        "Frederick Koolhoven",
        "Fuselage",
        "ISBN (identifier)",
        "Interplane strut",
        "Koolhoven F.K.30",
        "Koolhoven F.K.36",
        "Koolhoven F.K.40",
        "Koolhoven F.K.42",
        "Koolhoven F.K.43",
        "Koolhoven F.K.44",
        "Koolhoven F.K.45",
        "Koolhoven F.K.46",
        "Koolhoven F.K.48",
        "Koolhoven F.K.49",
        "Koolhoven F.K.50",
        "Koolhoven F.K.51",
        "Koolhoven F.K.52",
        "Koolhoven F.K.53",
        "Koolhoven F.K.54",
        "Koolhoven F.K.55",
        "Koolhoven F.K.56",
        "Koolhoven F.K.57",
        "Koolhoven F.K.58",
        "Koolhoven F.K.59",
        "Koolhoven FK.47",
        "Koolhoven Heidevogel",
        "Lewis machine gun",
        "Monoplane",
        "NVI F.K.29",
        "NVI F.K.31",
        "NVI F.K.32",
        "NVI F.K.33",
        "NVI F.K.34",
        "Netherlands",
        "Oleo strut",
        "Paris Air Show",
        "Plywood",
        "Radial engine",
        "Rudder",
        "Stagger (aviation)",
        "Strut",
        "Vickers machine gun",
        "Wing tip"
    ]
}