{"url": "https://en.wikipedia.org/wiki/Ole_J%C3%B8rn_Myklebust", "title": "Ole Jørn Myklebust", "summary": "Ole Jørn Myklebust (born 30 April 1977 in Eidsdal, Norway) is a Norwegian Jazz musician (trumpet, flugelhorn and vocals), educated at the Norges Musikkhøgskole. Known for performing in Subtonic, Køhn/Johansen Sextet, Geir Lysne Listening Ensemble, Østenfor Sol and Dixi, Myklebust has collaborated with Mari Boine and Unni Wilhelmsen.", "content": "Ole Jørn Myklebust (born 30 April 1977 in Eidsdal, Norway) is a Norwegian Jazz musician (trumpet, flugelhorn and vocals), educated at the Norges Musikkhøgskole. Known for performing in Subtonic, Køhn/Johansen Sextet, Geir Lysne Listening Ensemble, Østenfor Sol and Dixi, Myklebust has collaborated with Mari Boine and Unni Wilhelmsen.\n\n\n== Career ==\nMyklebust was voted \"The Best Young Jazz Musicians in Norway\" in 2000. He has also played with the band Østenfor Sol, in addition to Mari Boine's and Unni Wilhelmsen's bands. Myklebust also works as composer, musical arranger and producer. He has composed music for TV, film, and documentaries. He came in as a substitute on the trumpet with Mike del Ferro Quintet, with among others Anne Paceo (drums), on their Norway tour in January 2012.\n\n\n== Discography ==\nFrom Groove.no & Discogs.com\n\n\n=== As band leader ===\nWith \"Østenfor Sol\"1998: Syng, Dovre (MajorStudio)\n2001: Troillspel (MajorStudio)With \"Subtonic\"2004: In This House (Aim Records)\n2006: Oslo Jazzfestival 20 År (Oslo Jazzfestival), various artists live – on the track \"Subtonic»\n\n\n=== As sideman ===\nWith Geir Lysne2002: Aurora Borealis – Nordic Lights (ACT Records), Suite For Jazz Orchestra\n2003: Korall (ACT Records), \"Geir Lysne Listening Ensemble\" feat. Sondre Bratland\n2006: Boahjenásti – The North Star (ACT Records), \"Geir Lysne Listening Ensemble\"With \"Notodden Blues Band\" & Torhild Sivertsen2003: Soul (Bluestown Records)With Køhn/Johansen2003: Angels (Real Records), on the track \"Mercurial Love»With Bugge Wesseltoft2004: New Conception of Jazz: Film Ing (Jazzland Records), on the tracks \"Hi Is?\" & \"Oh Ye»With Samsaya2004: Shedding Skin (Port Azur/Tuba)With Jaa9 & Onkl P2004: Sjåre Brymæ (C+C Records, Sonet Music)With Dum Dum Boys2006: Gravitasjon (Oh Yeah!/EMI Virgin), on the track \"Lunta Brenner»\n2009: Tidsmaskin (Oh Yeah!/EMI Virgin)With Unni Wilhelmsen2006: Til Meg (St. Cecilia Music)With Torun Eriksen2006: Your Guide to the North Sea Jazz Festival 2006, various artists – on the track \"This Is So Real\"With \"El Axel\"2007: It Is Wha It Is (Pass It Records), on the track \"Showtime (Move Your Arms)»With Paal Flaata2008: Old Angel Midnight (Pass It Records), on the track \"Ten Pretty Houses in a Row»With Brynjar Rasmussen2011: Arctic Mood (Nordnorsk Jazzsenter, Finito Bacalao Records)\n\n\n=== As arranger for Jim Stärk ===\n2002: Ten Songs and Hey Hey – (BP/Sonet)\n\n\n== References ==\n\n\n== External links ==\nOfficial website \nArtistside på Groove.no", "links": ["Anne Paceo", "Brynjar Rasmussen", "Bugge Wesseltoft", "Dixi (band)", "Dum Dum Boys", "EMI Records", "Eidsdal", "Flugelhorn", "Geir Lysne", "Geir Lysne Listening Ensemble", "Jazz", "Jazzland Recordings", "MBA (identifier)", "MajorStudio", "Mari Boine", "Mike del Ferro", "Møre og Romsdal", "Nils-Olav Johansen", "Norges Musikkhøgskole", "Norway", "Norwegians", "Oh Yeah! Records", "Oslo Jazzfestival", "Samsaya", "Sigurd Køhn", "Sondre Bratland", "Store Norske Leksikon", "Subtonic (band)", "Torun Eriksen", "Unni Wilhelmsen", "VIAF (identifier)", "Virgin Records", "Østenfor Sol"]}