{
    "url": "https://en.wikipedia.org/wiki/OliverMcMillan",
    "title": "OliverMcMillan",
    "summary": "OliverMcMillan, established in 1978, is a private real estate development firm based in San Diego, California. It creates mixed-use retail, entertainment, and residential projects, both privately and through public-private partnerships with public entities and redevelopment agencies across the U.S. OliverMcMillan has received four national industry design awards and more than 50 regional industry design awards over the past 35 years. The firm has designed and developed more than eight million square feet of projects, with a total project value exceeding $3 billion. As of 2014, OliverMcMillan has approximately $2 billion in real estate projects under development in major U.S. cities, including Houston, San Diego, Honolulu, Atlanta and Phoenix.\n\n",
    "content": "OliverMcMillan, established in 1978, is a private real estate development firm based in San Diego, California. It creates mixed-use retail, entertainment, and residential projects, both privately and through public-private partnerships with public entities and redevelopment agencies across the U.S. OliverMcMillan has received four national industry design awards and more than 50 regional industry design awards over the past 35 years. The firm has designed and developed more than eight million square feet of projects, with a total project value exceeding $3 billion. As of 2014, OliverMcMillan has approximately $2 billion in real estate projects under development in major U.S. cities, including Houston, San Diego, Honolulu, Atlanta and Phoenix.\n\n\n== History ==\nDene Oliver founded OliverMcMillan in 1978 with lifelong friend Jim McMillan when the two San Diego natives began work on what was to become an AIA award-winning portfolio of redevelopment projects in their hometown. Recent and creative photo-history is archived on Instagram.In February 2018, some of OliverMcMillan's assets were acquired by Brookfield Residential Properties Inc., a North American land developer and homebuilder.\n\n\n== Major developments ==\n\n\n=== Buckhead Atlanta ===\nBuckhead Atlanta is a 1.5 million-square-foot, eight-acre mixed-use development featuring 300,000 square feet of  retail stores, restaurants and cafes; more than 100,000 square feet of office space; and 370 high-rise residences. The development is located in the neighborhood of Buckhead in Atlanta, at the intersection of Peachtree and West Paces Ferry roads.In 2011, OliverMcMillan acquired The Streets of Buckhead two years after the project was stalled in 2009 due to a lack of financing. OliverMcMillan evolved the architecture, reengaged leasing efforts, and renamed the project Buckhead Atlanta.Under the firms’s direction, construction has been underway since August 2012 and shops are anticipated to open in mid-2014.The company provides live streaming video and still shot archive photos of the construction project from July 12, 2013 online.Oliver McMillan confirmed that twenty-eight retailers and restaurants were committed to the project by May 2014. Retailers will include a mix of local, regional, national, and international brands, including Hermès as well as Spanx’s first flagship retail store and custom-designed world headquarters.Buckhead Atlanta restaurants will include Le Bilboquet, two Consilient Hospitality locations including American F+B and a pizza concept, Lugo Caffe, Corso Coffee, Doraku Sushi, Georgetown Cupcakes as featured on TLC’s “DC Cupcakes”, Gypsy Kitchen, Southern Gentleman, and New York City’s famous Shake Shack.\n\n\n=== River Oaks District ===\nRiver Oaks District is located in the heart of Houston, Texas. The mixed-use development, located on 14 acres, will feature 650,000 square feet of customizable space, including 252,000 square feet of luxury retail, fine-dining restaurants, street-side cafes and entertainment; 92,000 square feet of creative office space; and 279 contemporary residential units. A preview of the long-awaited retail development was covered by Houston business media.iPic Entertainment has announced that River Oaks District will feature an eight screen, 560 seat luxury movie theater.\n\n\n=== Symphony Honolulu ===\nSymphony Honolulu is a 45-story, 388-unit mixed-use development located in Honolulu’s Kapiolani corridor. The building will also contain a JN Automotive Group auto galleria that will feature brands such as Ferrari, Maserati, Lamborghini, Audi, and Lotus.One, two, and three bedroom Residences will average 1,100 square feet each. 100 of the 338 units are reserved-housing units for those who meet the income requirements established by the Hawaii Community Development Authority.Construction began on Symphony Honolulu in late 2013 and is on a two-year schedule for completion; 70% of the residences were sold in the first two days of sales in early 2013.\n\n\n=== SALT ===\nSALT is a 3.69-acre site in Tempe that has been fully entitled as a four-story, 264-unit, Class A apartment building. Located on the south side of Tempe Town Lake, the site is part of the Hayden Ferry Lakeside Master Plan, near Arizona State University and the Mill Avenue Entertainment District. Construction is set to begin on the project in early 2014.\n\n\n=== The Lofts at 688 Thirteenth Street ===\nThe Lofts at 688 Thirteenth Street, currently under construction, is planned as a five-story residential building fronting 13th Street between Market and G streets in the East Village District of downtown San Diego. Covering three-quarters of a city block, the new construction includes 208 mid-rise and ground-level apartments with studio, one- and two-bedroom residences, plus two ground-level retail spaces of approximately 2,660 square feet each. Progress can viewed through the Oliver McMillan EarthCam.\n\n\n=== Pacifica Honolulu ===\nLocated in the Kakaako neighborhood of Honolulu, Pacifica Honolulu is a 46-story building featuring 489 residential condominiums as well as approximately 11,000 square feet of commercial space.\nOliverMcMillan purchased Pacifica Honolulu when the project was partially completed in 2009 and, after substantially redesigning the property, brought it to a successful completion at the end of 2011 - achieving 100% of units sold prior to finishing construction.Pacifica’s features and amenities include a 3,000 sq. ft. fitness center, a 20-seat movie theater with a 96-inch screen and a private screening room with banquette seating for smaller audiences, a hobby room that will be a playground for painters, woodworkers, photographers and other craft-handy residents, a dog park, barbecue pool cabanas, and magnificent views of the Pacific Ocean, Diamond Head and Koolau Mountains.\n\n\n=== Iowa River Landing ===\nIowa River Landing is a 180-acre mixed-use development located in Coralville, Iowa, along Interstate 80 and First Avenue on the Iowa River. The project is a public/private partnership between OliverMcMillan and the City of Coralville.\nThe development includes a 330,000-square-foot retail town center; office, residential and entertainment offerings. Iowa River Landing is home to The University of Iowa Health Care’s medical clinic, Homewood Suites Hotel, Marriott Hotel and Conference Center, Von Maur, Backpocket Brewing, Scratch Cupcakery, and ProFit Gym among others.\n\n\n=== The Glen Town Center ===\nThe Glen Town Center is mixed use development located in Glenview, Illinois, just north of Chicago. The mixed-use development features 1,150,000 square feet of retail shops, entertainment venues and restaurants in pedestrian-friendly setting. A 160,000-square- foot Von Maur department store and 10-screen Landmark movie theatre (formerly owned by Arclight Cinemas) anchor the retail portion of the Glen Town Center. Other featured tenants include Dick’s Sporting Goods, Jos. A. Bank, Carter’s, and ULTA, among others. Navy Park, the Glen's version of a town square, is located in the center of the community. Atop the Glen Town Center is a 300-unit apartment community.To develop the project, OliverMcMillan bought 45 acres from the village of Glenview for $38.6 million.  The developer only paid $21.6 million up front, with an agreement that the rest would come from revenue that it would share with the village if profits hit a certain threshold. That target was never reached, leaving $17 million outstanding from the original purchase price.After not paying a loan payment since July 2009, OliverMcMillan lost the project in a $55.6 million foreclosure suit.\n\n\n=== San Diego Lofts Portfolio ===\nOliverMcMillan completed a series of multifamily buildings in downtown San Diego which are a loft style and feature commercial and restaurant spaces. The series includes:\n\nThe Lofts at 655 Sixth Avenue\nThe Lofts at 677 Seventh Avenue\nThe Lofts at 707 Tenth Avenue\nThe Lofts at 777 Sixth Avenue\n\n\n== References ==\n\n\n== External links ==\nOliverMcMillan website\nOliverMcMillan on Curbed Atlanta\nOliverMcMillan profile on Business Week\nOliverMcMillan profile on The Business Journals",
    "links": [
        "American Institute of Architects",
        "ArcLight Hollywood",
        "Arizona State University",
        "Atlanta",
        "Audi",
        "Brookfield Residential",
        "Brookfield Residential Properties Inc.",
        "Buckhead",
        "Chicago",
        "Coralville",
        "DC Cupcakes",
        "Diamond Head, Hawaii",
        "Dick’s Sporting Goods",
        "East Village, San Diego",
        "Ferrari",
        "Georgetown Cupcake",
        "Glenview, Cook County, Illinois",
        "Hermès",
        "High-rise",
        "Homewood Suites",
        "Honolulu",
        "Houston",
        "Illinois",
        "Interstate 80",
        "Iowa",
        "Iowa River",
        "Jos. A. Bank",
        "Kakaako",
        "Koolau Mountains",
        "Lamborghini",
        "Landmark Theaters",
        "Lotus Cars",
        "Marriott Hotels & Resorts",
        "Maserati",
        "Mixed-use development",
        "Neighborhood",
        "New York City",
        "Pacific Ocean",
        "Peachtree Street",
        "Phoenix, Arizona",
        "Real estate development",
        "Restaurants",
        "Retail stores",
        "San Diego",
        "San Diego, California",
        "Shake Shack",
        "Spanx",
        "TLC (TV network)",
        "Tempe Town Lake",
        "Texas",
        "ULTA",
        "Von Maur"
    ]
}