{"url": "https://en.wikipedia.org/wiki/Orchard_MRT_station", "title": "Orchard MRT station", "summary": "Orchard MRT station is an underground Mass Rapid Transit (MRT) station on the North South Line, located on the boundaries of the Orchard and River Valley planning areas of Singapore.\nBeing the principal and one of the three MRT stations (the other two being Somerset and Dhoby Ghaut) that serve the popular shopping district along Orchard Road, Orchard station is one of the network's busiest stations. In 2022, Orchard station will become an interchange with the Thomson–East Coast Line.\nOpened in 1987, Orchard station was part of the early plans for the original MRT network since 1982. It was constructed as part of Phase I of the MRT network. Following the network's operational split, the station has been served by the North South Line since 1989.", "content": "Orchard MRT station is an underground Mass Rapid Transit (MRT) station on the North South Line, located on the boundaries of the Orchard and River Valley planning areas of Singapore.\nBeing the principal and one of the three MRT stations (the other two being Somerset and Dhoby Ghaut) that serve the popular shopping district along Orchard Road, Orchard station is one of the network's busiest stations. In 2022, Orchard station will become an interchange with the Thomson–East Coast Line.\nOpened in 1987, Orchard station was part of the early plans for the original MRT network since 1982. It was constructed as part of Phase I of the MRT network. Following the network's operational split, the station has been served by the North South Line since 1989. \n\n\n== History ==\n\nPrior to the construction of Orchard MRT station, it was named Scotts from 1967 to 1982, and then renamed to Orchard Boulevard. The station was subsequently renamed to Orchard in 1985. On 1 October 1983, the MRTC awarded the contract for the MRT tunnel from Newton to Somerset as well as Somerset MRT station to Borie SAE and Ong Chwee Kou Building Contractors Limited.On 10 May 1984, Orchard Turn, the existing slip road from Orchard Boulevard to Orchard Road, was realigned to facilitate MRT construction works. On 27 April 1985, there was a MRT construction accident at Orchard MRT station which caused 15 workers to be treated for shock.The construction of the lifts began on 19 June 2002 and completed on 20 August 2004. The lifts from the concourse to the street level existed for a short while before it was replaced by another lift in October 2007 due to ION Orchard's construction. Additionally, on 29 October 2006, the bus stop on the right side of Orchard Boulevard was shifted to Orchard Turn.\nOn 15 January 2008, Exits C and E that connects to Wisma Atria and ION Orchard were closed, and reopened on 21 July 2009 due to the building works of ION Orchard. The western concourse, linked to Exit E and ION Orchard, opened on 20 July 2009 as part of the ION Orchard development.\n\n\n=== Thomson-East Coast Line ===\n\nOn 15 August 2014, LTA announced that Orchard station would be part of the Thomson East-Coast line (TEL). The station will be constructed as part of Phase 3, consisting of 13 stations between Mount Pleasant and Gardens by the Bay.Contract T219 for the design and construction of Orchard Station and associated tunnels was awarded to Penta-Ocean Construction Co Ltd – Bachy Soletanche Singapore Pte Ltd Joint Venture at a sum of S$498 million in July 2014. Construction started that very year, with completion aimed at 2021.With restrictions imposed on construction due to the COVID-19 pandemic, the TEL 3 completion date was pushed by one year to 2022. On 9 March 2022, Transport Minister S Iswaran announced in Parliament that TEL 3 would open in the second half of that year.The linkway between the TEL and NSL platforms was constructed using the pipe-roofing method, while the mining and underpinning method was adopted to construct the new box structure underneath the existing NSL station. Special drilling machines are being used, capable of drilling in all directions in a low headroom confined space. To minimise disruptions to the current NSL operations, mining works must be carried out strictly according to the approved design, sequence and method in a safe manner without compromising the stability and serviceability of existing surrounding structures.\n\n\n== Station details ==\nDue to the station's location in the Orchard Road shopping belt, the station was intended to be the MRT system's showpiece, with S$24 million spent on aesthetic elements. The station's circular concourse has a dome 11 metres (36 ft) in diameter and an atrium design, and its floor consists of alternating granite tiles laid out in a radial arrangement. \nTo contrast with the concourse floor, burgundy red vitreous panels were installed on parts of the concourse wall, while other walls in the station concourse and at platform level were clad in polished blue granite tiles.\n\n\n== References ==\n\n\n== External links ==\n Media related to Orchard MRT Station at Wikimedia Commons\nOfficial website\nChangi Airport to Orchard MRT station train route", "links": ["2 island platforms", "Admiralty MRT station", "Ang Mo Kio MRT station", "Bayshore MRT station", "Bedok South MRT station", "Bishan Depot", "Bishan MRT station", "Braddell MRT station", "Brickland MRT station", "Bright Hill MRT station", "Bukit Batok MRT station", "Bukit Gombak MRT station", "COVID-19 pandemic in Singapore", "Caldecott MRT station", "Canberra MRT station", "Changi Airport MRT station", "Choa Chu Kang MRT/LRT station", "City Hall MRT station", "Dhoby Ghaut MRT station", "East Coast Integrated Depot", "Expo MRT station", "Founders' Memorial MRT station", "Gardens by the Bay MRT station", "Geographic coordinate system", "Great World MRT station", "Havelock MRT station", "ION Orchard", "Jurong East MRT station", "Katong Park MRT station", "Khatib MRT station", "Kranji MRT station", "Land Transport Authority", "Lentor MRT station", "List of Singapore MRT stations", "Mandai Depot", "Marina Bay MRT station", "Marina South MRT station", "Marina South Pier MRT station", "Marine Parade MRT station", "Marine Terrace MRT station", "Marsiling MRT station", "Mass Rapid Transit (Singapore)", "Maxwell MRT station", "Mayflower MRT station", "Mount Pleasant MRT station", "Napier MRT station", "Newton MRT station", "Ngee Ann City", "North South MRT line", "Novena MRT station", "Orchard, Singapore", "Orchard Boulevard", "Orchard Boulevard MRT station", "Orchard Road", "Outram Park MRT station", "Planning Areas of Singapore", "Raffles Place MRT station", "River Valley, Singapore", "SMRT Corporation", "SMRT Trains", "Sembawang MRT station", "Shenton Way MRT station", "Siglap MRT station", "Singapore", "Somerset MRT station", "Springleaf MRT station", "Stevens MRT station", "Sungei Bedok MRT station", "Sungei Kadut MRT station", "Tanah Merah MRT station", "Tangs", "Tanjong Katong MRT station", "Tanjong Rhu MRT station", "Thomson-East Coast MRT line", "Thomson–East Coast MRT line", "Toa Payoh MRT station", "Ulu Pandan Depot", "Upper Thomson MRT station", "VIAF (identifier)", "Wisma Atria", "Woodlands MRT station", "Woodlands North MRT station", "Woodlands South MRT station", "Yew Tee MRT station", "Yio Chu Kang MRT station", "Yishun MRT station"]}