{"url": "https://en.wikipedia.org/wiki/Orisinal", "title": "Orisinal", "summary": "Orisinal: Morning Sunshine is a website featuring 62 Adobe Flash games (as of January 2018).  The website was created in 2000 by Ferry Halim who resides in Clovis, California. It won the World Summit Award in 2003 in the e-entertainment category and the Webby Award in the games category in 2003. In 2004, the site jayisgames.com commended Orisinal: Morning Sunshine for Outstanding Achievement in Artistic Expression in its Best of 2004 special awards. As of November 2010, Ferry Halim has begun selling a selection of his games on the Apple App Store in remade versions for the iPhone.As of 1 January 2021, due to the discontinuation of the Flash Player by Adobe, the games are no longer accessible.", "content": "Orisinal: Morning Sunshine is a website featuring 62 Adobe Flash games (as of January 2018).  The website was created in 2000 by Ferry Halim who resides in Clovis, California. It won the World Summit Award in 2003 in the e-entertainment category and the Webby Award in the games category in 2003. In 2004, the site jayisgames.com commended Orisinal: Morning Sunshine for Outstanding Achievement in Artistic Expression in its Best of 2004 special awards. As of November 2010, Ferry Halim has begun selling a selection of his games on the Apple App Store in remade versions for the iPhone.As of 1 January 2021, due to the discontinuation of the Flash Player by Adobe, the games are no longer accessible.\n\n\n== Contents ==\nFerry Halim's games mostly contain small animals. The majority of the games are cute and have beautiful outdoor backgrounds and relaxing, ambient music (some of which composed by Steven Cravis and several from Kimagure Orange Road), with few games involving fighting and battle. The games have been considered art games.\nThe Orisinal website also includes an online store, guest book, desktop wallpaper, trailers and a special function that allows users to send and receive flowers custom-made via email services.Orisinal is also known for having very strong protection over its Flash games that has kept them from being unlawfully copied onto other websites. According to Ferry Halim, the website is \"his personal playground.\"\n\n\n== Game examples ==\nApple Season - The player must try to catch as many apples as possible.\nBubble Bees - The player must capture bees by enclosing them in soap bubbles.\nCarrot Track - This game includes a small rabbit which has to be led avoiding several puppies to gather carrots along the way.\nThe Crossing - The player controls a 'bridge' that moves back and forth to allow deer to cross.\nConstellations - The player sends jellyfish shooting to the surface of the ocean to catch fish and sea stars.\nA Dog For All Seasons - In four parallel scenes, a dog runs through landscapes depicting spring, summer, autumn, and winter. The player must help each dog avoid obstacles in its individual season.\nHigh Delivery - A balloon with a vase tied to its string floats higher and higher. The player uses a small electric fan to guide the balloon to catch falling roses in the vase. At the game's end, the vase full of roses comes to rest at the gates of Heaven.\nPocketful of Stars - A little girl stands next to a frozen pond on a starry night. While the player controls the little girl, her reflection in the pond leaps higher to capture the reflected stars.\nThe Truth is Up There - To earn points, the player must keep a flying saucer within the viewfinder of a video camera.\nSunny Day Sky - The player controls a small bear that flies using its umbrella, that must pass as many cars as possible and land perfectly.\nSnowbowling -  The player hit the ice skaters with snowballs to earn points.\nThe Way Home - The player must steer a squirrel across a cityscape, collecting food as they go.\nWinterbells - The player must steer a white rabbit up a winter night scape to earn points by leaping onto increasingly smaller white bells.\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nTrailer", "links": ["Adobe Flash", "App Store (iOS)", "Art game", "Clovis, California", "Cuteness", "English language", "IPhone", "Kimagure Orange Road", "Steven Cravis", "Video game developer", "Webby Award", "Website", "World Summit Award"]}