{"url": "https://en.wikipedia.org/wiki/Orris_E._Kelly", "title": "Orris E. Kelly", "summary": "Chaplain (Major General) Orris Eugene Kelly, USA (born July 28, 1926) is a retired American Army officer who served as the 14th Chief of Chaplains of the United States Army from 1975 to 1979.", "content": "Chaplain (Major General) Orris Eugene Kelly, USA (born July 28, 1926) is a retired American Army officer who served as the 14th Chief of Chaplains of the United States Army from 1975 to 1979.\n\n\n== Early life ==\nKelly was born in 1926 in Montrose, Kansas to attorney Herman Albertis (H.A.) \"Bert\" Kelly, a member of the Dudley-Winthrop Family of Massachusetts fame, and Theodora Viola Pacaková, the daughter of Czech immigrants from the Austro-Hungarian Empire.\nHe attended elementary and high school in Montrose.\n\n\n== World War II ==\nIn January 1944, he entered the Army Specialized Training Program to attend the University of Kansas where he hoped to become a civil engineer. In August 1944, he was sent to basic training at Camp Fannin, Texas, and then to Officer Candidate School at Fort Benning, Georgia. He was commissioned a second lieutenant, Infantry, Class 452, on May 29, 1945.\nHe served at Camp Shelby, Mississippi; Fort Hood, Texas; Camp Callan, California; Camp San Luis Obispo, California; and in the Army of Occupation in Germany. His experiences in the ruins of Dresden as an officer in the military police made him change his goal of becoming an engineer into becoming a chaplain. He left the service in 1946 as a first lieutenant to resume college.\n\n\n== Interwar years ==\nReverend Kelly completed his AB degree at Kansas Wesleyan University, Salina, Kansas in 1950 and graduated with a Bachelor of Divinity degree from the Garrett Theological Seminary (Northwestern University), Evanston, Illinois, in 1953. He was ordained as a Methodist clergyman in June 1953.\n\n\n== Second military tour ==\nImmediately after ordination, he entered on active duty at Fort Leonard Wood, Missouri. He served with the 398th Engineer Construction Battalion as housing area pastor during his first year. In 1954, he was assigned to the 8th Cavalry Regiment of the First Cavalry Division in Japan for three years, where he adopted several Japanese orphans along with his wife Phyllis Goodenow-Kelly. After returning to the United States, Reverend Kelly was stationed at Fort Riley, Kansas, from 1957 to 1961. During this period, he attended the Associate Command and General Staff College, graduating in 1959. In 1961, he was assigned to an overseas replacement battle group and transferred to the Seventh Infantry Division in Korea\nFrom 1962 to 1966, he served on the staff of the US Army Chaplain School, Fort Hamilton, New York. During the period from 1966 to 1969, he was assigned as Director, US Forces Religious Retreat Center, Berchtesgaden, Germany. In 1969, he was transferred to Vietnam in July to serve as Division Chaplain of the Fourth Infantry Division at Pleiku and An Khe. Reverend Kelly joined the staff of the Office Chief of Chaplains in 1970, serving first as an action officer in Plans, Programs and Policies Directorate, and later as Director.\nIn 1972, he was selected to attend the Army War College, the highest level of military education in the Department of the Army. Concurrent with his studies at the War College, he received a Master of Science degree in Counseling from Shippensburg State College, Shippensburg, Pennsylvania.\nReturning to Washington in 1973, he was assigned to the Office of the Chief of Chaplains as Executive Officer, a position he held until July 31, 1975.\nOn April 7, 1975, Reverend Kelly was nominated by President Ford for the appointment as Chief of Chaplains, Department of the Army, with promotion from lieutenant colonel to major general. The Senate confirmed the nomination on April 29, 1975, and promotion ceremonies were conducted on August 1, 1975, by General Walter T. Kerwin, Jr., Vice Chief of Staff of the United States Army.\nReverend Kelly retired from the Army on July 1, 1979.\n\n\n== Post-army life ==\nOn August 1, 1979 he assumed the position of Associate General Secretary for the Division of Chaplains and Related Ministries (DCRM). This is an organization part of the Board of Higher Education and Ministry of the United Methodist Church. During his association with DCRM, he became acquainted with the President of the Hospital Corporation of America, who asked him to become the Vice President of Pastoral Service with the responsibility for developing pastoral care programs in the 480 hospital HCA system. He assumed this position in 1985.\n\n\n== Awards and decorations ==\n\n\n== References ==\n\n\n== Further reading ==", "links": ["104th Infantry Division (United States)", "1st Armored Division (United States)", "1st Cavalry Division (United States)", "1st Infantry Division (United States)", "4th Infantry Division (United States)", "53rd Infantry Regiment (United States)", "7th Infantry Division (United States)", "8th Cavalry Regiment (United States)", "Air Defense Artillery Branch", "Air Medal", "America's Army", "American Campaign Medal", "An Khe", "Armor Branch", "Army Commendation Medal", "Army Good Conduct Medal", "Army Medical Department (United States)", "Army National Guard", "Army Reserve Officers' Training Corps", "Army Specialized Training Program", "Army Staff Senior Warrant Officer", "Army of Occupation Medal", "Army of the United States", "Austro-Hungarian Empire", "Awards and decorations of the United States Department of the Army", "Badges of the United States Army", "Basic Officer Leaders Course", "Berchtesgaden", "Bronze Star", "Bronze Star Medal", "Camp Callan", "Camp Fannin", "Camp San Luis Obispo, California", "Camp Shelby, Mississippi", "Chaplain Corps (United States Army)", "Chaplain of the United States Coast Guard", "Chaplain of the United States Marine Corps", "Chemical Corps", "Chief of Chaplains of the United States Air Force", "Chief of Chaplains of the United States Army", "Chief of Chaplains of the United States Navy", "Chief of Staff of the United States Army", "Chiefs of Chaplains of the United States", "Conscription in the United States", "Continental Army", "Cyber Branch (United States Army)", "Czechs", "Department of the Army", "Distinguished Service Medal (U.S. Army)", "Dresden", "Dudley-Winthrop Family", "Early Commissioning Program", "Eighth United States Army", "European-African-Middle Eastern Campaign Medal", "Evanston, Illinois", "Field Artillery Branch (United States)", "Finance Corps", "First United States Army", "Flag of the United States Army", "Fort Benning, Georgia", "Fort Hamilton", "Fort Hood, Texas", "Fort Leonard Wood, Missouri", "Fort Riley, Kansas", "Garrett Theological Seminary", "General (United States)", "Gerald Ford", "Gerhardt W. Hyatt", "Gregory N. Todd", "History of the United States Army", "Hospital Corporation of America", "ISBN (identifier)", "Infantry Branch (United States)", "Kansas Wesleyan University", "Kermit D. Johnson", "Korean War", "Legion of Merit", "List of United States Army careers", "List of United States Army four-star generals", "List of United States Army installations in Germany", "List of United States Army installations in Kosovo", "List of United States Army installations in Kuwait", "List of United States Army installations in South Korea", "List of United States Army lieutenant generals from 1990 to 1999", "List of United States Army lieutenant generals from 2000 to 2009", "List of United States Army lieutenant generals from 2010 to 2019", "List of United States Army lieutenant generals since 2020", "List of United States military premier ensembles", "List of crew-served weapons of the U.S. Armed Forces", "List of equipment of the United States Army", "List of field armies of the United States Army", "List of former United States Army installations", "List of individual weapons of the U.S. Armed Forces", "List of land vehicles of the U.S. Armed Forces", "List of lieutenant generals in the United States Army before 1960", "List of nicknames of United States Army divisions", "Major General (United States)", "Massachusetts", "Meritorious Unit Commendation", "Military Intelligence Corps (United States Army)", "Military Police Corps (United States)", "Military Surface Deployment and Distribution Command", "Military police", "Montrose, Kansas", "National Defense Service Medal", "National Museum of the United States Army", "Ninth United States Army", "Northwestern University", "Oak leaf clusters", "Office of the Inspector General of the United States Army", "Officer Candidate School (United States Army)", "Old Guard Fife and Drum Corps", "Ordnance Corps (United States Army)", "Pennsylvania", "Pleiku", "Psychological operations (United States)", "Quartermaster Corps (United States Army)", "Randall Kitchens", "Regular Army (United States)", "Reorganization plan of United States Army", "Republic of Korea Presidential Unit Citation", "Republic of Vietnam Civil Action Honor Medal", "Salina, Kansas", "Second United States Army", "Sergeant Major of the Army", "Service number (United States Army)", "Service star", "Seventh Army Symphony Orchestra", "Shippensburg", "Shippensburg State College", "Signal Corps (United States Army)", "Sixth United States Army", "Soldier's Creed", "The Army Goes Rolling Along", "Thomas L. Solhjem", "Transportation Corps", "U.S. Army Acquisition Support Center", "U.S. Army Regimental System", "Uniforms of the United States Army", "Union Army", "United Methodist Church", "United States Army", "United States Army Acquisition Corps", "United States Army Adjutant General's Corps", "United States Army Africa", "United States Army Art Program", "United States Army Aviation Branch", "United States Army Band", "United States Army Basic Training", "United States Army Center of Military History", "United States Army Central", "United States Army Civil Affairs and Psychological Operations Command", "United States Army Corps of Engineers", "United States Army Criminal Investigation Division", "United States Army Cyber Command", "United States Army Dental Command", "United States Army Europe and Africa", "United States Army Field Band", "United States Army Forces Command", "United States Army Futures Command", "United States Army Installation Management Command", "United States Army Institute of Heraldry", "United States Army Intelligence and Security Command", "United States Army Judge Advocate General's Corps", "United States Army Logistics Branch", "United States Army Materiel Command", "United States Army Medical Command", "United States Army Medical Corps", "United States Army Military District of Washington", "United States Army North", "United States Army Nurse Corps", "United States Army Pacific", "United States Army Rangers", "United States Army Reserve", "United States Army Reserve Command", "United States Army South", "United States Army Space and Missile Defense Command", "United States Army Special Forces", "United States Army Special Operations Command", "United States Army Test and Evaluation Command", "United States Army Training and Doctrine Command", "United States Army Veterinary Corps", "United States Army War College", "United States Army branch insignia", "United States Army enlisted rank insignia", "United States Army enlisted rank insignia of World War I", "United States Army enlisted rank insignia of World War II", "United States Army officer rank insignia", "United States House Armed Services Subcommittee on Tactical Air and Land Forces", "United States House Committee on Armed Services", "United States Military Academy", "United States Secretary of the Army", "United States Senate Armed Services Subcommittee on Airland", "United States Senate Committee on Armed Services", "United States Under Secretary of the Army", "United States military bands", "United States of America", "University of Kansas", "University of Notre Dame Press", "Vice Chief of Staff of the United States Army", "Vietnam Campaign Medal", "Vietnam Service Medal", "Vietnam Staff Service Medal", "Vietnam War", "Vietnamese Cross of Gallantry", "Walter T. Kerwin, Jr.", "Warrant Officer Basic Course", "Warrant Officer Candidate School", "Warrant officer (United States)", "West Point Band", "World War II", "World War II Victory Medal (United States)"]}