{
    "url": "https://en.wikipedia.org/wiki/Our_Lady_of_Pe%C3%B1afrancia",
    "title": "Our Lady of Peñafrancia",
    "summary": "Our Lady of Peñafrancia (Spanish: Nuestra Señora de Peñafrancia in the Philippines, and Nuestra Señora de la Peña de Francia or Virgen de la Peña de Francia) is a miraculous image of the Virgin Mary venerated in Naga City on the Philippines. The statue is housed at the Basilica of Peñafrancia where each September is held a novena in honor of the image as the principal Patroness and Queen of Bicol.\nPope Benedict XV granted the image a decree of canonical coronation on 13 May 1920. The rite of coronation was executed  on 20 September  1924 via apostolic delegate, Guillermo Piani. On 3 December  2015, a mosaic image of the Virgin Mary under this title was officially enshrined at the Vatican Gardens for the 14th slot at the pontifical mandate of Pope Francis. The ceremony was attended by former President of the Philippines, Benigno Aquino III who unveiled the image with honors.",
    "content": "Our Lady of Peñafrancia (Spanish: Nuestra Señora de Peñafrancia in the Philippines, and Nuestra Señora de la Peña de Francia or Virgen de la Peña de Francia) is a miraculous image of the Virgin Mary venerated in Naga City on the Philippines. The statue is housed at the Basilica of Peñafrancia where each September is held a novena in honor of the image as the principal Patroness and Queen of Bicol.\nPope Benedict XV granted the image a decree of canonical coronation on 13 May 1920. The rite of coronation was executed  on 20 September  1924 via apostolic delegate, Guillermo Piani. On 3 December  2015, a mosaic image of the Virgin Mary under this title was officially enshrined at the Vatican Gardens for the 14th slot at the pontifical mandate of Pope Francis. The ceremony was attended by former President of the Philippines, Benigno Aquino III who unveiled the image with honors.\n\n\n== History of Our Lady of Peñafrancia ==\nDevotion to Our Lady of Peñafrancia is Spanish in origin. The statue of Our Lady of Peñafrancia originates from the one enshrined in the Spanish city of Salamanca.\n\n\n=== In Salamanca, Spain ===\nLegend holds that on 4 September 1401, in the city of Paris in France, a son was born to pious and wealthy parents, Rolan and Barbara. He was christened Simon. When his parents and his only sister died, Simon inherited the property. To avoid trouble, which he worried might ensue from the possession of large amounts of wealth, he sold his property and donated the proceeds to the church and the poor, as well as to charitable institutions. He then he became a lay servant in the Franciscan convent in Paris.\nSimon would frequently visit the church and spend hours in prayer before the altar of the Virgin Mary. Once, while he was absorbed in spiritual contemplation of the Virgin Mary, he lost consciousness. He then heard a clear voice that tried to rouse him from slumber: “Simon, wake up; be on the watch…. From now on your name will be Simon Vela. Go to Peña de Francia west of this country, and there you will find the shrine of the Blessed Virgin Mary\".The next five years, Simon Vela searched for Peña de Francia. One night, as he was about to give up, he heard the same voice once more saying: “Simon, do not give up the search; do not give up what you have begun. Persevere and your labors will be recompensed.” Simon went to the Church of Santiago de Galicia. And while he was passing the market place of Salamanca, he saw two men quarreling. One was seriously wounded and fell at Simon's side. The offender was caught by the crowd who milled around them and he brazenly remarked: “Had I killed my enemy, I would have escaped to Peña de Francia where no one, not even the king, could find me\", reinforcing Simon's faith in the place's existence.On his way to the church of San Martin, Simon met a man selling charcoal. When Simon asked the man where he was from, the man answered that he came from a place called Peña de Francia. He begged the man to guide him there, which the merchant refused to do. Simon then reached a villa called San Martin de Castañar on May 14, 1434. He went to church and after the mass, he asked a man for directions to Peña de Francia. The man took Simon Vela to a place some distance from the church and pointed to the Sierra de Francia in the far distance.Simon set out for the place indicated and came to a steep rocky hill. After spending the night in a cave, he began the search for the shrine. As he grew discouraged, he heard the same voice he had previously heard resounding through the cave: “Simon, be awake: do not sleep.” At a distance on a rocky hill, he saw a glaring and dazzling light. There he found the Virgin Mary with the Christ Child in her arms sittings on a golden throne.\nThe Lady said, “Dig in this spot and take what you can see and place it on the summit of this rocky hill. Build on this hill a beautiful dwelling. You are to begin it and others will come to finish it. This must come to pass as it has been the wish of my child.” Then the Lady suddenly disappeared. Simon began to dig when he heard the same voice again saying: “Simon, do not attempt to undertake that big task alone. Undertake it in the presence and with the help of two, three, or more persons.” Supposedly, this was to avert any doubt or suspicion from people as to a veracity of the miracle and the credibility of Simon. Simon then went to San Martin del Castañar, a nearby town from the spot, and asked five men to help him, who thought they were digging for treasure. After removing a huge stone, they found embedded among the rocks, the image of the Holy Virgin with the Child in her arms.\n\n\n=== In the Philippines ===\n\nAccording to locals in what is now Naga City, a Spanish colonial official from Peña de Francia, Spain (a native of San Martín de Castañar) settled with his family in Cavite in 1712. One day, Miguel Robles de Covarrubias, a son of the official and a seminarian studying at the Universidad de Santo Tomás in Manila, fell seriously ill. He and his family prayed to Our Lady of Peñafrancia. Miguel vowed that if cured, he would out of gratitude construct a chapel on the banks of the Pasig River in Manila which is now called Paco.\nMiguel was miraculously cured, and ordained a priest not in Manila but in Ciudad de Nueva Cáceres (now Naga City) by Bishop Andrés González. To fulfill his vow, Miguel (who was the first diocesan priest ordained in Naga), did two things. First, he mobilized natives along the slopes of Mount Isarog to build a chapel from the local nipa and bamboo, at a site by the banks of the Naga River and not the Pasig as he earlier desired. Second, he ordered a local artisan to carve an image patterned after the picture of Our Lady of Peñafrancia that he always carried with him. The image was made from a santol tree.\nStories of miracles surrounding the image began circulating immediately. News of many other miracles spread quickly, as did public devotion to the image. A letter sent by Miguel to the Dominicans in Salamanca, Spain in 1712 reported numerous miracles through the intercession of Our Lady. The number of devotees eventually increased beyond the Diocese of Nueva Cáceres, which comprised the Bicolandia and Marinduque, and in modern times the devotion has reached other parts of the world along with the Filipino diaspora.The image is known to devotees by the title Ina, a local term for \"Mother\". It is enshrined at the Minor Basilica of Our Lady of Peñafrancia in Naga City.\n\n\n==== Canonical coronation of the image ====\nThe canonical Coronation of Our Lady of Peñafrancia as \"Patroness of Bicolandia\" took place on September 20, 1924, officiated by Guillermo Piani, the apostolic delegate. The image of Our Lady of Peñafrancia currently enshrined in the church on Calle Balatas is approximately 275 years old, making it highly sought-after by antique dealers and collectors.\nAccording to the picture of Ina from the devotional book by Miguel Robles de Covarrubias, the image of Ina is a 17-inch santol wood sculpture. This image of the Queen Mary is the Regional Patroness of Bicol – “Ina” as referred to by the Bikolanos. The replica of Nuestra Señora de Peñafrancia is the second Marian image in the entire Asia and in the Philippines to have been given a Canonical Coronation. This coronation took place at the Church of Naga, currently known as the Naga Metropolitan Cathedral: Parish of Saint John the Evangelist, on the 20th of September 1924. It was presided by the Apostolic Delegate Papal Legate Guillermo Piani, own representative of Pope Benedict XV, and Michael J. O’Doherty, Bishop of Manila. Piani placed the bejeweled crown on the head of the statue of Ina while devotees chanted, “Viva la Virgen!” It was on this celebration that the award-winning piece of Maximo Heguera the “Himno a la Nuestra Señora de Peñafrancia,” popularly known as “Resuene Vibrante,” was sung. The actual manto used by Ina during the canonical coronation is currently kept and displayed at the Our Lady of Peñafrancia Museum. Along with the mantle, a description says that, “threadbare and torn this “manto” was worn by Our Lady for many years until her devotees started donating new ones... she has more than enough now.” It also states that the manto was ordered from Spain which has a label on the inside lining which appears to have the words Fabrica de Ornamentos de Yglesia, Jose Candela Albert, Sto. Tomas 18, Valencia, and a logo. This manto is a significant artifact that commemorates the historic canonical coronation of Ina on September 20, 1924.\n\n\n==== Theft of the image ====\nOn August 15, 1981, at around 4:30 in the morning, the caretaker of the Peñafrancia Shrine discovered that the image of Our Lady of Peñafrancia had disappeared. The police reported that the culprits sawed the iron grills at the back of the church and took the image. The identity of the thieves remained a mystery; with the leading theory that they were selling to a black market of valuable items. The manto and the steel bar which held the image were found on the cemetery grounds of Peñafrancia Shrine without the image. In May 1982, an antique dealer and also a Peñafrancia devotee, Francisco Vecin, acquired information suggesting a man in Mabini St. of Malate, Manila, was selling the image, with it allegedly in the hands of a friend at that time. He reported to Florencio Yllana that the lost image was located in Cebu. On September 3, 1982, the image was turned over to Francisco in a sealed box. The image was returned in Naga on September 8, 1982. Following the theft, officials opted for the production of a replica to be used in the 1981 Peñafrancia celebrations. Today, the original image is enshrined in the Peñafrancia Museum, which forms part of the basilica complex along Calle Balatas in Naga, which was built to accommodate the rising numbers of devotees from the Bicol region, as well as nationwide starting in the late 1970s.\n\n\n==== The Tercentenary Celebration ====\n\nIn 2010, the devotion marked its 300th year.\nThe Archdiocese of Caceres outlined a three-year preparation for the tercentenary with each year centered on a particular theme and objective.\n\nYear 1 (September 2007 to September 2008 ) the theme was “Remembering the Gift of the Devotion to Ina”, was dedicated to revisiting the history of the devotion in view of a deeper understanding of the same devotion.\nYear 2 (September 2008 to September 2009) theme was “Renewing the Faith through Ina”, was dedicated to appreciating the devotees’ giftedness towards a more vibrant and relevant faith life.\nYear 3 (September 2009 to September 2010) theme was “Sharing the Future in Hope”, was dedicated to envisioning the future with the intent of sharing the fruits of the devotion to the next generations.In Year 4 (September 2010), the church in Bicol celebrated in thanksgiving the grace of 300 Years of Devotion. The overall theme of the celebration is “A Gift received, a Gift to share” (Balaog inako, Balaog itao).\n\n\n== The Peñafrancia festival ==\nThe Peñafrancia Festival, which has been described as the biggest Marian event in Asia, is a celebration of two feasts—Divino Rostro (Divine Face of Jesus) on the second Friday of September, and the Our Lady of Peñafrancia the next weekend.Considered the biggest and most popular religious event in the Philippines, the September festivities of the Lady and Mother of Bicol form an opening salvo to the long celebrations of Christmas in the Philippines, which begin on the month the celebrations are held in Bicol and in many other parts of the country. Tens of thousands of pilgrims, devotees, and tourists come to Naga City, Philippines every September for a nine-day festivities in honor of Our Lady of Peñafrancia, the Patroness of Bicol.\n\n\n=== Feast day ===\n\nThe feast of Our Lady of Peñafrancia is celebrated on the third Saturday of September. Filipinos at home or abroad gather in to meet relatives and friends, to share food, drinks, and prayers with them, and to pay homage and make thanksgiving to the Virgin of Peñafrancia.The feast day is preceded by a novena, or nine days of prayer, in honor of the Virgin. On the first day, the image of the Virgin, a copy of the Madonna in Peñafrancia, Spain, is brought from its shrine to the Metropolitan Cathedral and Parish of Saint John the Evangelist where the novena is held. On the last day, the image is returned to her shrine following the Naga River route. The evening procession is lit by thousands of candles from followers in boats escorting the image. When the flatboat reaches its destination, the devotees shout \"Viva la Virgen\" (Long live the Virgin!) and the image is carried back in a procession to the cathedral. Amongst shouts of \"Viva la Virgen,\" Bicolanos and pilgrims holding lit candles in their hands will kneel on the ground and bow their heads in prayer as the fluvial procession carrying the Virgin traverses the Bicol River in downtown Naga.\nA multicolored pagoda carrying the images and icons of the Virgin of Peñafrancia and the Divino Rostro will pass along the Bicol River. The fluvial procession marks the return of the Virgin from the Naga Metropolitan Cathedral to her home shrine at the Basilica. Upon its arrival, the Virgin will be received in formal religious rites by Roman Catholic dignitaries of the Bicol Region led by the Archbishop of Nueva Caceres, which is its home diocese.\n\n\n=== Novena to the Divino Rostro ===\nThe celebration begins with the Feast of the Nativity of Mary on September 8, which is marked by Masses in the old shrine or the Metropolitan Cathedral.\nThe feast of the Divino Rostro, which falls on the second Friday of September, is the first high point of the celebration. This is followed by a Novena honoring the Divino Rostro, a local icon of Holy Face commencing on the second Friday of September. Devotion to the Holy Face in Naga City began in 1882 with a cholera epidemic in Naga. According to legend, the epidemic subsided after the image of the Holy Face was placed at the altar of the cathedral.The icon of the Holy Face is brought in procession from Our Lady of Peñafrancia Basilica to the old Peñafrancia Shrine, where it stays for nine days, with a usual focus on the sick. Generally, the first devotees begin their celebrations during this period. The \"Hymn to the Divino Rostro\" is sung at the end of services.\n\n\n=== Traslación ===\nThe second Friday of September marks the feast day of the Divino Rostro, following the novena at the shrine. During the Traslacion procession the images of the Lady of Peñafrancia and the Divino Rostro (Holy Face) are brought by barefooted male voyadores from the Basilica through the main streets of the city to the cathedral. This procession, which usually lasts 4 hours, welcomes thousands of devotees from all over Bicol and other parts of the country. The devotion started in 1710, when Fr. Miguel Robles de Covarrubias had an image carved, a chapel built and processions held in honor of the miraculous image of the Virgin of Peñafrancia to honor the many favors he is said to have received through the help of the Virgin, especially pertaining to his health.\nThe image of the Our Lady of Peñafrancia is transferred at dawn from Peñafrancia basilica to her old home for the Traslación in the afternoon. After the procession, a community and thanksgiving Mass celebrates the feast of the Divino Rostro. Bishops and delegates from other dioceses in the country then attend a Pontifical Mass, concelebrated by the Archbishop of Caceres outside the shrine.\nThe Traslación begins after the noon mass with the procession of students, delegates from other regions, teachers, government officials, and other professions while the images are being prepared. At around three o'clock in the Afternoon, the Divino Rostro icon leaves the shrine and heads to Naga Cathedral. After a recital of the Rosary, the image of Our Lady of Peñafrancia follows, more slowly than the Divino Rostro. After two or three hours, the Divino Rostro icon arrives at Cathedral, and after an hour, the image of Our Lady enters via the Porta Mariae (Gate of Mary). A Solemn Pontifical Mass (first day Novenary Mass) is celebrated after the procession at the Quadricentenniall Arch at the cathedral grounds, in conclusion of the Mass, the two images are transferred inside of the cathedral to begin the novena (nine-day) period for Our Lady.\n\n\n=== Novena to the Our Lady of Peñafrancia ===\nOn the beginning of Traslación, the novena to the Our Lady starts at the cathedral. This celebration in itself is said to have healed attendants. The novena centers around Mary's intercession to Jesus. During some of the days of the novena, dawn and evening processions are mounted within the vicinity of Naga wherein the images of both Our Lady and the Divino Rostro are brought out to the streets of the city. Believers vie for the honor of sponsoring novena masses and prayers at the Naga Cathedral during the novena.\n\n\n=== Parades and celebrations ===\nDifferent parades are held during the nine-day novena to the Our Lady. These events are open to the public, with coverage on radio and television as well as on online streaming. The Saturday following the Translacion, the citywide Marian Youth Congress is held, gathering young people from the city and region to share and strengthen their faith.\nDuring the Sunday after the Traslacion, the majorettes, CAT, and Drum and Lyre Corps, plus marching bands, exhibit their dancing, music playing, and silent drill at the Robredo Coliseum, with the best in each category being announced at the end of the day's events. On the Tuesday before the Fluvial Procession, the Regional Cheer-dance Competition is held at the Robredo Coliseum, with almost all of the schools and universities in Bicol participating in the event.\nOn Wednesday, school contingents of the Boy Scouts and Girl Scouts of the Philippines, from elementary, high schools and senior high schools from all over the Bicol Region together with their school Drum and Lyre corps, drum majors and majorettes parade in the daylong, Regional BSP/GSP and Drum and Lyre Corps parade and competition at the Plaza Quezon. Awards are given to the best contingents and DLCs which have distinguished themselves.\nOn Thursday, the Civic Parade of the Government workers, and different associations and organizations in Bicol, along with the Float Parade that is joined by hundreds of floats honoring Ina, is held in the morning. In recent years, this has been followed in the afternoon by a street dance competition between schools in the city and the region at Plaza Quezon.\nOn Friday, the popular and century-old military parade, performed by all high schools, senior high schools, colleges and universities of the Bicol region, as well as service personnel of the Philippine National Police, the Armed Forces of the Philippines, the Philippine Coast Guard and the Bureau of Fire Protection, parade in the major streets of Naga City. It is considered to be the longest military parade outside Manila due to its daylong, sometimes going past sundown, parade, and is one of the largest to be held in Southeast Asia, with an estimated 70,000 marches, mostly youth and university cadets together with athletes. Dubbed the Bicol Region Military Parade, it is considered one of the highlights of the celebrations, with the Mayor of Naga acting as the reviewing officer. Awards and decorations are handed out to the best contingents at the end of the parade.\n\n\n=== Fluvial Procession ===\n\nA fluvial procession at the end of the novena caps the feast. Following a farewell service at the Naga Metropolitan Cathedral, the images are both carried through the streets and then in a pagoda (the Filipino term for a decorated shrine-barge, usually with more than one tier, used in fluvial processions) on its return journey to the minor basilica, where a Pontifical Mass is held. Along the route, people shout \"¡Viva La Virgen!\" and people wave handkerchiefs and towels.\nThe images of both Our Lady and the Divino Rostro are escorted by a battalion of devotees, most of them aboard colorful paddle boats pulling the pagoda, and those who are privileged men joining the icons on the pagoda together with the bishops of Bicol and officials. Tradition holds that a woman riding on the pagoda during the September fluvial procession will spell disaster for everyone involved.\n\n\n=== Festival Sunday ===\nFestival masses held on the Sunday after the Octave of the Nativity of Mary at the Peñafrancia Minor Basilica mark the official termination of the festivities. Masses are held all day long in all the Catholic parishes and diocese cathedrals of the Bicol Region. In addition, masses are held in many parts of the country in her honor, organized by local devotees' associations.\n\n\n=== Changes in the Peñafrancia Fiesta celebration due to the COVID-19 Pandemic ===\nWith the ongoing threat of the COVID-19 pandemic in the Philippines, the Archdiocese of Caceres and the Naga City Government diminished thee scope of the 2020 festivities to comply with the minimum health standards implemented in the country.As such, the following changes were observed for the celebrations:\n\nInstead of the traditional novena to the Divino Rostro (the Holy Face of Jesus) from Sept. 2-10 and the novena to Our Lady of Peñafrancia from Sept. 11–19, at the Peñafrancia Shrine, Metropolitan Naga Cathedral, and the Basilica Minore, the practice of the devotion is encouraged in the homes of the faithful.\nThe annual Traslación and Flvuial Processions were canceled.\nThe fiesta mass on 20 September 2020 was streamed live from the Peñafrancia Basilica.\nThe other dioceses of Bicol were encouraged to hold noven masses on the same date as Naga, to deter people from coming to the city.\nAll civic and commercial activities that coincide with the feast, such as the Voyadores Festival, civic and military parades, trade fairs, exhibits, concerts, and other mass events were cancelled.The same changes were adopted for the 2021 Peñafrancia Festivities from 01 to 19 September 2021.\n\n\n== Patronage ==\nThe Virgin of Peñafrancia is patroness of the Bicol Region.\n\n\n== Elsewhere ==\nThe veneration of Our Lady of Peñafrancia is one of the oldest and largest Filipino Marian celebrations in San Diego, with almost 50 years of active celebration\n\n\n== Hymn ==\nThe \"Himno a la Nuestra Señora de Peñafrancia\" or \"Resuene Vibrante\" as Bicolanos call it, is the official hymn of the devotees to the Lady of Bicolandia composed by Fr. Maximo Huguera, CM in the year 1924. It won the first prize during the hymn-writing competition for the Lady's canonical coronation. This was translated to Central Bikol by Fr. Jesus Esplana and Fr. Sohl Saez, but was eventually replaced by the original Spanish text after the Tercentenary celebration in 2010.\n\n\n=== Spanish text ===\nCoro:\nResuene vibrante el himno de amorQue entona tu pueblo con grata y emociónResuene vibrante el himno de amorQue entona tu pueblo con grata emociónPatrona del Bícol, Gran Madre de DiosSé siempre la Reina de Nuestra RegiónPatrona del Bícol, Gran Madre de DiosSé siempre la Reina de Nuestra Región.\nEstrofa I:\nLos ríos murmuran tu nombre al correr\nLos montes proclaman tu gloria y poder\nEl pueblo creyente con gozo te ve\nTe canta amoroso y besa tu pie\nEl pueblo creyente con gozo te ve\nTe canta amoroso y besa tu pie.\n(Repeat Coro)\nEstrofa II:\nPatrona del Bicol altar del amor\nReliquia bendita que el cielo nos dio\nEscucha benigna del pueblo el clamor\nQue acude a tu Templo con fé y devoción\nPatrona del Bicol altar del amor\nReliquia bendita que el cielo nos dio\nEscucha benigna del pueblo el clamor\nQue acude a tu Templo con fé y devoción.\n(Repeat Coro)\nEstrofa III:\nLos pobres y tristes te buscan con fé\nTe miran llorando les miras también\nAl punto sus lágrimas se truscan en bien\nY a casa gozosos les vemos volver\nLos pobres y tristes te buscan con fé\nTe miran llorando les miras también\nAl punto sus lágrimas se truscan en bien\nY a casa gozosos les vemos volver\n(Repeat Coro)\n\n\n=== Bicol text ===\nI\nMaski an kasalogan, Sambit an si'mong ngaran\nMaski an kabukiran, Ika an rokyaw.\nKami si'mong aki, Pano' nin kaogmahan\nSi'mong nangangako, Ika kamo'tan.\nKami si'mong aki, Pano' nin kaogmahan\nSi'mong nangangako, Ika kamo'tan.\nChorus:Awiton an awit nin pagkamootSa saimo samuyang idinodolotAwiton an awit nin pagkamootSa saimo samuyang idonodolot.Patrona nin Bikol, Ina ka nin DiosMagdanay na Reina nin samuyang region,Patrona nin Bikol, Ina ka nin DiosMagdanay na Reina nin samuyang region.\nII\nPatrona nin Bikol, Inang mamomo'ton\nPamanang banal, Balaog nin Dios.\nPakihimatea mga inagrangay, Kan si'mong banwaan\nna napaalaw.\nPatrona nin Bikol, Inang mamomo'ton\nPamanang banal, Balaog nin Dios.\nPakihimatea mga inagrangay, Kan si'mong banwaan\nna napaalaw.\n(Repeat Chorus)\n\n\n== See also ==\nPenha de França\nPenha de França, Goa\n\n\n== References ==\n\n\n== Sources ==\nRubio, T. N., Zantua, B., & Real, M. (2010, September/October). The Blue and Gold \tSpecial Commemorative Issue: 300 YEARS OF DEVOTION TO THE VIRGIN OF PEÑAFRANCIA [PDF]. Ateneo De Naga Junior High School. Retrieved from: \thttp://jhs.adnu.edu.ph/jhs/gainpower/BG_300years_of_ina_commemorative_issue.pdf\n\n\n== External links ==\nOur Lady of Peñafrancia Basilica website\nSantuario de Nuestra Señora de la Peña de Francia – Spain",
    "links": [
        "AMA Computer University",
        "Acts of Reparation to the Virgin Mary",
        "Alma Redemptoris Mater",
        "Angelus",
        "Antiphon",
        "Archdiocese of Caceres",
        "As a Child I Loved You",
        "Assumption of Mary",
        "Ateneo de Naga University",
        "Ave Regina caelorum",
        "Ave maris stella",
        "Avé de Fátima",
        "Bamboo",
        "Benigno Aquino III",
        "Bicol Region",
        "Bicol Region Military Parade",
        "Bicol State College of Applied Sciences and Technology",
        "Bicol region",
        "Blue Army of Our Lady of Fátima",
        "Bombon, Camarines Sur",
        "Bula, Camarines Sur",
        "COVID-19 pandemic in the Philippines",
        "Cagayan Valley",
        "Calabanga, Camarines Sur",
        "Calabarzon",
        "Calendar of saints",
        "Camaligan, Camarines Sur",
        "Camarines Sur",
        "Camarines Sur National High School",
        "Canaman, Camarines Sur",
        "Candlemas",
        "Canonical Coronation",
        "Canonical coronation",
        "Catholic Church",
        "Catholic Marian movements and societies",
        "Catholic Mariology",
        "Cavite",
        "Central Bikol",
        "Central Luzon",
        "Central Visayas",
        "Charcoal",
        "Christ Child",
        "Christmas in the Philippines",
        "Church (building)",
        "Circle of stars",
        "Company of Mary",
        "Congregation of Marian Fathers of the Immaculate Conception",
        "Consecration and entrustment to Mary",
        "Crown (headgear)",
        "Divina Pastora de Gapan",
        "Eastern Visayas",
        "Es ist ein Ros entsprungen",
        "Fatima Family Apostolate",
        "Feast of the Annunciation",
        "Feast of the Immaculate Conception",
        "First Saturdays Devotion",
        "Flos Carmeli",
        "France",
        "Franciscan",
        "Fátima prayers",
        "Gainza, Camarines Sur",
        "Hail Mary",
        "Hail Mary of Gold",
        "Hail Queen of Heaven, the Ocean Star",
        "Halo (religious iconography)",
        "Holy Child",
        "Holy Rosary Major Seminary",
        "Holy Rosary Minor Seminary",
        "Holy Rosary Seminary",
        "Hymns to Mary",
        "Ilocos Region",
        "Immaculata prayer",
        "Immaculate Mary",
        "Josef Moroder-Lusenberg",
        "Legion of Mary",
        "Libmanan, Camarines Sur",
        "Magarao, Camarines Sur",
        "Magnificat",
        "Manila",
        "Mantle (clothing)",
        "Marian Movement of Priests",
        "Marian apparition",
        "Marian devotions",
        "Marian feast days",
        "Marinduque",
        "Mariological Society of America",
        "Mariology of the saints",
        "Marist Brothers",
        "Mary, Mother of Grace",
        "Mary, Mother of Jesus",
        "Mary Help of Christians",
        "Mary Our Queen",
        "Memorare",
        "Metro Manila",
        "Metro Naga",
        "Metropolitan Naga Water District",
        "Milaor, Camarines Sur",
        "Military parade",
        "Mimaropa",
        "Minalabac, Camarines Sur",
        "Miracle",
        "Miraculous Medal",
        "Mosaic",
        "Most Holy Name of the Blessed Virgin Mary",
        "Mount Bernacci",
        "Mount Isarog",
        "Naga, Camarines Sur",
        "Naga Airport",
        "Naga Cathedral",
        "Naga City Science High School",
        "Naga College Foundation",
        "Naga Parochial School",
        "Nativity of Mary",
        "Novena",
        "Nuestra Senora de Consolacion y Correa de Manila",
        "Nuestra Señora de Caridad de Bantay",
        "Nuestra Señora de Guadalupe de Cebu",
        "Nuestra Señora de Pronto Socorro de Boac",
        "Nuestra Señora de la Candelaria de Jaro",
        "Nuestra Señora de la Candelaria de Paracale",
        "Nuestra Señora de la Regla",
        "Nuestra Señora de los Desamparados de Manila",
        "Nuestra Señora de los Desamparados de Marikina",
        "Nuestra Señora del Carmen de Manila",
        "Nuestra Señora del Pilar de Imus",
        "Nuestra Señora del Pilar de Libmanan",
        "Nuestra Señora del Pilar de Morong",
        "Nuestra Señora del Santisimo Rosario de Ubanon",
        "Nypa fruticans",
        "O sanctissima",
        "Ocampo, Camarines Sur",
        "Order of Preachers",
        "Our Lady's Rosary Makers",
        "Our Lady of Aparecida",
        "Our Lady of Aranzazu",
        "Our Lady of Badoc",
        "Our Lady of Banneux",
        "Our Lady of Beauraing",
        "Our Lady of Caysasay",
        "Our Lady of Fátima",
        "Our Lady of Guadalupe",
        "Our Lady of La Naval de Manila",
        "Our Lady of La Salette",
        "Our Lady of Laus",
        "Our Lady of Light Parish Church",
        "Our Lady of Lourdes",
        "Our Lady of Manaoag",
        "Our Lady of Namacpacan",
        "Our Lady of Orani",
        "Our Lady of Peace and Good Voyage",
        "Our Lady of Peñafrancia Shrine",
        "Our Lady of Peñafrancia de Manila",
        "Our Lady of Piat",
        "Our Lady of Pontmain",
        "Our Lady of Porta Vaga",
        "Our Lady of Salvation",
        "Our Lady of Sorrows",
        "Our Lady of the Good Event (Parañaque)",
        "Our Lady of the Immaculate Conception of Malabon",
        "Our Lady of the Immaculate Conception of Malolos",
        "Our Lady of the Immaculate Conception of Pasig",
        "Our Lady of the Pillar",
        "Our Lady of the Rosary",
        "Overseas Filipino",
        "Pamplona, Camarines Sur",
        "Pan-Philippine Highway",
        "Paris",
        "Pasacao, Camarines Sur",
        "Pasig River",
        "Patron saint",
        "Penha de França",
        "Penha de França, Goa",
        "Peña de Francia",
        "Peñafrancia Basilica",
        "Philippine National Railways",
        "Philippines",
        "Pili, Camarines Sur",
        "Pontifically crowned Marian images in the Philippines",
        "Pope",
        "Pope Benedict XV",
        "Pope Francis",
        "Porta Mariae",
        "Prayer",
        "Presentation of Mary",
        "President of the Philippines",
        "Queen of Angels Foundation",
        "Regina caeli",
        "Roman Catholic Church",
        "Rosary",
        "STI College",
        "Saint Mary",
        "Saint symbolism",
        "Salamanca",
        "Salve Regina",
        "San Diego",
        "San Fernando, Camarines Sur",
        "San Juan de Dios Educational Foundation",
        "Schoenstatt Apostolic Movement",
        "Seven Joys of the Virgin",
        "Shrine",
        "Sierra de Francia",
        "Society of Mary (Marianists)",
        "Society of Mary (Marists)",
        "Sodality of Our Lady",
        "Solemnity of Mary, Mother of God",
        "South Luzon Expressway",
        "Spain",
        "Spanish language",
        "St. Anthony of Padua Parish Church (Camaligan)",
        "Stabat Mater",
        "Sub tuum praesidium",
        "Three Hail Marys",
        "Universidad de Santa Isabel",
        "University of Nueva Caceres",
        "University of Santo Tomas",
        "Vatican Gardens",
        "Veneration of Mary in the Catholic Church",
        "Virgen de los Remedios de Pampanga",
        "Virgin Mary",
        "Western Visayas",
        "Zamboanga Peninsula"
    ]
}