{
    "url": "https://en.wikipedia.org/wiki/Ove_Hoegh-Guldberg_(biologist)",
    "title": "Ove Hoegh-Guldberg (biologist)",
    "summary": "Ove Hoegh-Guldberg (born 26 September 1959, in Sydney, Australia), is a biologist and climate scientist specialising in coral reefs, in particular bleaching due to global warming and climate change. He has published over 500 journal articles and been cited over 50,000 times.\nHe is the inaugural Director of the Global Change Institute at the University of Queensland, and the holder of a Queensland Smart State Premier fellowship  (2008–2013). Hoegh-Guldberg has appeared on television, including two Australian Story series profiling his life and work, and radio, and throughout his career has been an active science communicator, including writing a blog and articles for The Conversation and other media outlets.\nHoegh-Guldberg was a contributor to the influential IPCC 8 October 2018 Special Report on Global Warming of 1.5 °C, and was a Coordinating Lead Author of the Chapter 3 of the report.",
    "content": "Ove Hoegh-Guldberg (born 26 September 1959, in Sydney, Australia), is a biologist and climate scientist specialising in coral reefs, in particular bleaching due to global warming and climate change. He has published over 500 journal articles and been cited over 50,000 times.\nHe is the inaugural Director of the Global Change Institute at the University of Queensland, and the holder of a Queensland Smart State Premier fellowship  (2008–2013). Hoegh-Guldberg has appeared on television, including two Australian Story series profiling his life and work, and radio, and throughout his career has been an active science communicator, including writing a blog and articles for The Conversation and other media outlets.\nHoegh-Guldberg was a contributor to the influential IPCC 8 October 2018 Special Report on Global Warming of 1.5 °C, and was a Coordinating Lead Author of the Chapter 3 of the report.\n\n\n== Early life and study ==\nHoegh-Guldberg is of Danish and Irish ancestry and is a direct descendant and namesake of Ove Høegh-Guldberg, a politician in late 18th Century Denmark. His father, the cultural economist Hans Hoegh-Guldberg, was born in Denmark in 1932, and moved to Australia in 1959, where he died 23 February 2016. From an early age Ove wanted to be a scientist, saying \"Diver Dan was a great inspiration\". He first visited the Great Barrier Reef with his Danish grandfather and grandmother to collect butterflies for a Danish museum.\nHe graduated from the University of Sydney with a Bachelor of Science (Hons), and received a scholarship to Oxford University. Before starting he met Professor Leonard Muscatine, a world expert in corals in Los Angeles and changed his plans, sleeping on the floor of the lab to learn from Muscatine, then completing his PhD at UCLA. His PhD thesis focused upon the physiology of corals and their zooxanthellae under thermal stress.\n\n\n== Career ==\nIn 1999, Hoegh-Guldberg published a paper using data from CSIRO and Germany predicting that most corals across the planet will not survive the next century, and the Great Barrier Reef will die in 20–30 years. His evaluation was poorly received at the time, with most experts trying to find fault with his long term predictions but failing to do so. Since then, however, reefs globally have undergone significant bleaching since then, the latest studies documenting an 89% decline in new corals in the Great Barrier Reef compared to historical levels.\nAs of July 2019, he is an author in 521 journal articles, and has been cited 54,532 times. He is currently a Professor of Marine Studies at the University of Queensland. In 2010, Hoegh-Guldberg was appointed as the inaugural Director of the Global Change Institute, a collaborative research hub aimed to address the impacts of climate change.\nIn 2017, Hoegh-Guldberg was one of the Chief Scientific Advisors to the Netflix documentary Chasing Coral. Following this, alongside the CEO of The Ocean Agency Richard Vevers, he started the 50 Reefs initiative to identify a number of reefs globally that have the best chance to survive the impacts of climate change and subsequently repopulate neighboring reefs. After releasing a study in March 2018 identifying 50 reefs, Bloomberg Philanthropies invested $86 million in the Vibrant Oceans initiative focused on protecting reefs across the planet.Hoegh-Guldberg has been an author of various IPCC reports, including being the coordinating lead author of the Oceans Chapter with fifth assessment published in 2014. On 8 October 2018, the International Panel on Climate Change (IPCC) released the Special Report on Global Warming of 1.5 °C, of which one of the findings was that we may have less than 12 years to avoid a temperature rise of over 1.5 °C. Hoegh-Guldberg was a Coordinating Lead Author of the report, and was a Coordinating Lead Author on Chapter 3: Impacts of 1.5 °C of Global Warming on Natural and Human Systems. In an interview with UQ News, he said \"A key finding of the report is that 1.5°C is not a safe level of global warming; however it is much safer than 2.0 °C\", and that \"We are still going to see many challenges at 1.5°C\". The IPCC report has been used as justification for climate action movements, including by Greta Thunberg.\n\n\n== In the media ==\nOve Hoegh-Guldberg has been featured in the media throughout his career, including two segments on Australian Story, The Heat Of The Moment (2009) and Into Hot Water (2017), and an interview on NPR's All Things Considered. He maintained a blog called Climate Shifts from 2007 to 2014 and has written articles for not-for-profit media outlet The Conversation.Hoegh-Guldberg has received criticism from some climate deniers in the media, notably conservative columnist Andrew Bolt at the Herald Sun. Bolt has published a number of columns against Hoegh-Guldberg's predictions. Hoegh-Guldberg wrote an article in response in 2011 countering these claims, saying Bolt has made fundamental scientific errors and is deliberately ignoring evidence.\" Another rebuttal of a Bolt blog post was published in 2011, saying \"What is more surprising is the numerous occasions that Mr. Bolt engaged in false attributions and misrepresented qualifiers. One would expect as a fully-paid member of the chattering class that he would at least have a better level of reading comprehension than what was displayed. These mistakes can either be attributed to political partisanship or poor journalism. In either case it certainly reduces the trustworthiness of Mr. Bolt.\" The scientific consensus on coral reef bleaching and the effect of climate change is overwhelming, and studies with evidence to the contrary have been found to be flawed.In March 2019, Hoegh-Guldberg was named one of the world's top 100 most influential people in climate policy by Apolitical, joining natural historian David Attenborough, Greta Thunberg, former United States of America vice-president Al Gore and many others.\n\n\n== Personal life ==\n\nOve Hoegh-Guldberg is married to Dr Sophie Dove, and has two children, Chris and Fiona. Dove, who he met in 1983 in Los Angeles, has an undergraduate degree in Mathematics and Philosophy from the University of Edinburgh, a PhD in Biological Sciences from University of Sydney, and is now an associate professor at the University of Queensland, also specialising in coral reefs and the impacts of climate change.Hoegh-Guldberg has worked with David Attenborough, who described him saying \"It’s easy enough to imagine the ostrich-like capacity of any of us, when we see something we don’t like to stick our head in the sand… Well, Ove doesn’t do that.\"\n\n\n== Positions ==\nProfessor of Marine Studies, University of Queensland\nDirector, Global Change Institute, University of Queensland\nPast Director, Centre for Marine Studies, University of Queensland\nPast Director, Heron Island, Low Isles and Moreton Bay Research Stations\nDirector, Stanford Australia Program\nDeputy Director, ARC Centre for Excellence for Reef Studies\nVisiting Professor, Stanford University\n\n\n== Awards ==\nUCLA Distinguished Scholar Award (1988)\nRobert D. Lasiewski Award, UCLA (1989)\nSydney University Award for Excellence in Teaching (1996)\nThe Eureka Prize for Scientific Research (1999)\nWesley College (University of Sydney) Medal (2009)\nQueensland 2008 Smart State Premier's Fellow (2008–2013)\nAustralian Laureate Fellowship (2012)\nBanksia International Award (2016)\n\n\n== Notes ==",
    "links": [
        "Al Gore",
        "All Things Considered",
        "Andrew Bolt",
        "Australia",
        "Australian Laureate Fellowship",
        "Australian Story",
        "Biologist",
        "Biology",
        "Bleaching",
        "Blog",
        "Bloomberg Philanthropies",
        "CSIRO",
        "Chasing Coral",
        "Climate change",
        "Climate change denier",
        "Climate scientist",
        "Coral reefs",
        "Danish people",
        "David Attenborough",
        "Denmark",
        "Diver Dan",
        "Documentary",
        "Doi (identifier)",
        "Eureka Prize",
        "Global warming",
        "Great Barrier Reef",
        "Greta Thunberg",
        "Hans Hoegh-Guldberg",
        "Herald Sun",
        "Heron Island, Australia",
        "IPCC",
        "ISSN (identifier)",
        "International Panel on Climate Change",
        "Irish people",
        "Linckia laevigata",
        "Los Angeles",
        "Low Isles",
        "Mathematics",
        "Moreton Bay",
        "NPR",
        "Netflix",
        "Nonprofit organization",
        "ORCID (identifier)",
        "Ove Høegh-Guldberg",
        "Oxford University",
        "Philosophy",
        "Science communicator",
        "Special Report on Global Warming of 1.5 °C",
        "Stanford University",
        "Sydney",
        "Sydney, Australia",
        "The Conversation (website)",
        "The Ocean Agency",
        "Thesis",
        "UCLA",
        "University of Edinburgh",
        "University of Queensland",
        "University of Sydney",
        "VIAF (identifier)",
        "Zooxanthellae"
    ]
}