{"url": "https://en.wikipedia.org/wiki/Owen_Badger", "title": "Owen Badger", "summary": "Owen Badger (3 November 1871 – 17 March 1939) was a Welsh international rugby centre who played rugby union for Llanelli, and was capped four times for Wales. He later switched codes, playing professional rugby league for Swinton.", "content": "Owen Badger (3 November 1871 – 17 March 1939) was a Welsh international rugby centre who played rugby union for Llanelli, and was capped four times for Wales. He later switched codes, playing professional rugby league for Swinton.\n\n\n== Rugby career ==\n\n\n=== Llanelli RFC ===\nBadger came to prominence playing for Llanelli. He was part of the team that won the South Wales Challenge Cup during the 1893/94 under the captaincy of Ben James. While playing for Llanelli, Badger was first chosen to represent Wales in a game against England as part of the 1895 Home Nations Championship. Under the captaincy of Wales legend Arthur 'Monkey' Gould, Wales lost the game 6-14, mainly due to far better play from the English forwards. Although appearing on the losing side, Badger was reselected for the very next game. The Scotland game was a much closer affair, but Wales lost this match too, though the final game of the tournament at home to Ireland saw Wales victorious thanks to Billy Bancroft's conversion of a Tom Pearson try. This match was Badger's only appearance on a winning international team under the rugby union code. His final amateur match for Wales was in the next season's opening game of the Championship. It was a torrid game for Wales and Badger, as in the first 15 minutes of the match, he broke his collar bone in a tackle and was forced to leave the pitch. With replacements not allowed, the Welsh team played on with 14 men and saw seven tries scored against them without reply. Badger's replacement for the next match was Gwyn Nicholls, one of the finest threequarters in Welsh rugby.\n\n\n=== Swinton RLFC ===\nWhether Badger would have regained his position in the Welsh team is unknown, as he switched codes to professional rugby league in 1897. His fee for switching to Swinton was £75, with a match fee of £2, 10 shillings a week. Badger's family remained in Wales while he played in Manchester. This fact caused repercussions for Swinton, when Badger's actions caused the club to forfeit two league points when he took time off work to visit his sick children in Wales. On his return, Swinton forgot to ask permission from the Northern Union (now the Rugby Football League (RFL) to reintroduce Badger into the team, and the club was duly penalised.\n\n\n=== International matches played ===\nWales\n England 1895, 1896\n Ireland 1895\n Scotland 1895\n\n\n== Personal ==\nWhen Badger died in 1939, it was just seven days before his Wales replacement, Nicholls also died.\n\n\n== External links ==\nLlanelli team photograph that includes Badger National Library of Wales\n\n\n== Bibliography ==\nGodwin, Terry (1984). The International Rugby Championship 1883-1983. London: Willows Books. ISBN 0-00-218060-X.\nGriffiths, John (1987). The Phoenix Book of International Rugby Records. London: Phoenix House. ISBN 0-460-07003-7.\nSmith, David; Williams, Gareth (1980). Fields of Praise: The Official History of The Welsh Rugby Union. Cardiff: University of Wales Press. ISBN 0-7083-0766-3.\n\n\n== References ==", "links": ["1895 Home Nations Championship", "1896 Home Nations Championship", "Arthur Gould (rugby player)", "Billy Bancroft", "Cardiff Arms Park", "Cliff Bowen", "England national rugby union team", "Evan Lloyd (rugby union, born 1871)", "Gwyn Nicholls", "ISBN (identifier)", "Ireland national rugby union team", "Llanelli", "Llanelli RFC", "Manchester", "Rugby Football League", "Rugby football", "Rugby league", "Rugby league positions", "Rugby union", "Rugby union positions", "Scotland national rugby union team", "Swinton Lions", "Tom Pearson (rugby union, born 1872)", "Try (rugby)", "Wales", "Wales national rugby union team"]}