{"url": "https://en.wikipedia.org/wiki/Palfrey,_West_Midlands", "title": "Palfrey, West Midlands", "summary": "Palfrey is a neighbourhood in the Metropolitan Borough of Walsall, in the West Midlands. It covers 3.68 sq km, which accounts for 3.5% of the area of the Walsall borough.\n\n", "content": "Palfrey is a neighbourhood in the Metropolitan Borough of Walsall, in the West Midlands. It covers 3.68 sq km, which accounts for 3.5% of the area of the Walsall borough.\n\n\n== Population ==\nIn the Palfrey ward there are 5407 households, with 29.4% owning with a mortgage or loan and 24.1% being socially rented, as of the 2011 census.\n\n\n== Crime ==\nFrom January to December of 2018, Palfrey had a crime rate of 86.3 per 1000 people, and a serious acquisitive crime rate of 19.6 per 1000 people. Both rates were lower than the average in the Walsall borough. 'Violence without injury' was the most prolific type of crime in 2018.\n\n\n== Economy ==\nIn the 2019 Index of Multiple Deprivation (IMD) Palfrey was ranked 2,773 out of 32,844 in England, where 1 was the most deprived and 32,844 the least. This is broken down further by income; employment; education, skills; health; barriers to housing and services; the living environment; and crime (England).In the 2011 census, 64.9% of working age people in Palfrey ward were economically active (compared to the 76.8% national average) and 26.5% had no formal qualifications (compared to the 15.0% national average).\n\n\n== Education ==\nThe schools in the ward include: Palfrey Infants and Junior, Fullbrook Nursery, Joseph Leckie Academy, Whitehall Junior and Infants, and Delves Junior and Infants.\n\n\n== Politics ==\nPalfrey has 3 elected councillors, as of April 2022:\n\nCouncillor Hajran Bashir\nCouncillor Sabina Ditta\nCouncillor Mohammad Nazir BA (Hons), DPHS\n\n\n== Etymology ==\nThe word palfrey refers to a small riding horse which is particularly suitable for women. It is possible that Palfrey's name originated from the keeping of such horses on the land which has since become Palfrey.\n\n\n== Notable features ==\n\nPalfrey Park is significant local landmark and is cited as one of Walsall Council’s flagship greenspaces and the first in the borough to achieve the national Green Flag Award in 2007, which was thereafter retained annually in 2008, 2009 and 2010. The Park is located within walking distance of Palfrey Town Centre and its Broadway West entrance is located off Broadway West (A4148 Walsall ring road). The park has a simple reverse L–shaped layout and is an intimate open space of approximately 6.48 hectares ranging from a formal historical layout in the north dominated by the reconstructed historical bandstand and Palfrey horse sculpture, created in stainless steel by the sculptor John McKenna ARBS, to the play and sports facilities at the centre core of the park, large amenity grass area to the south and informal nature conservation area in the south west corner of the park.Palfrey is home to Walsall's main mosques: Abu Bakr, Al Farooq and Aisha, Shah Jalal Mosques, Jalalia Sunni Jami Masjid, and Masjid E Usman. Walsall has a significant Muslim population. In the 2011 census 8.2% of residents viewed themselves as Muslim, above the UK average of 4.4%.\n\n\n== References ==", "links": ["2011 United Kingdom census", "A4148 road", "Countries of the United Kingdom", "Districts of England", "Emergency medical services in the United Kingdom", "England", "Fire services in the United Kingdom", "Geographic coordinate system", "Hectare", "Index of Multiple Deprivation", "John McKenna (sculptor)", "Joseph Leckie Academy", "List of United Kingdom locations", "List of law enforcement agencies in the United Kingdom, Crown Dependencies and British Overseas Territories", "List of places in England", "List of places in West Midlands (county)", "List of sovereign states", "Metropolitan Borough of Walsall", "Metropolitan and non-metropolitan counties of England", "Ordnance Survey National Grid", "Palfrey", "Post town", "Postcodes in the United Kingdom", "Regions of England", "Square kilometre", "United Kingdom", "WS postcode area", "Walsall Council", "West Midlands (county)", "West Midlands (region)", "West Midlands Ambulance Service", "West Midlands Fire Service", "West Midlands Police"]}