{"url": "https://en.wikipedia.org/wiki/Panchaloha", "title": "Panchaloha", "summary": "Panchaloha (Sanskrit: पञ्चलोह), also called Pañcadhātu (Sanskrit: पञ्चधातु, lit. 'five metals'), is a term for traditional five-metal alloys of sacred significance, used for making Hindu temple murti and jewelry.", "content": "Panchaloha (Sanskrit: पञ्चलोह), also called Pañcadhātu (Sanskrit: पञ्चधातु, lit. 'five metals'), is a term for traditional five-metal alloys of sacred significance, used for making Hindu temple murti and jewelry.\n\n\n== Composition ==\nThe composition is laid down in the Shilpa shastras, a collection of ancient texts that describe arts, crafts, and their design rules, principles and standards. Panchaloha is traditionally described as an alloy of gold, silver, copper, zinc, and iron. Also, in some cases tin or lead are used instead of zinc. It is believed that wearing jewellery made of such an alloy brings balance in life, self-confidence, good health, fortune, prosperity, and peace of mind.In Tibetan culture, it was considered auspicious to use thokcha (meteoric iron) either as a component of the alloy in general or for a specific object or purpose.  The amount used could vary, depending upon the material's availability and suitability, among other considerations.  A small, largely symbolic quantity of \"sky-iron\" might be added, or it might be included as a significant part of the alloy-recipe.\n\n\n== See also ==\n Media related to Panchaloha at Wikimedia Commons\n\n\n== References ==\n\n\n== Further reading ==\nThe Lost-Wax Casting of Icons, Utensils, Bells, and Other Items in South India, R.M. Pillai, S.G.K. Pillai, and A.D. Damodaran, October 2002, JOM.", "links": ["Alloys", "Ashtadhatu", "Brass", "Bronze", "Copper", "Corinthian bronze", "Electrum", "Gold (element)", "Hepatizon", "High-entropy alloys", "Hinduism", "Iron", "Iron meteorite", "Lead", "Literal translation", "Murti", "Orichalcum", "Sacred", "Sanskrit language", "Shakudō", "Shibuichi", "Shilpa shastras", "Silver", "Thokcha", "Tibetan culture", "Tin", "Tumbaga", "Zinc"]}