{
    "url": "https://en.wikipedia.org/wiki/Papillorenal_syndrome",
    "title": "Papillorenal syndrome",
    "summary": "Papillorenal syndrome is an autosomal dominant genetic disorder marked by underdevelopment (hypoplasia) of the kidney and colobomas of the optic nerve.",
    "content": "Papillorenal syndrome is an autosomal dominant genetic disorder marked by underdevelopment (hypoplasia) of the kidney and colobomas of the optic nerve.\n\n\n== Presentation ==\n\n\n=== Ocular ===\nOcular disc dysplasia is the most notable ocular defect of the disease. An abnormal development in the optic stalk causes optic disc dysplasia, which is caused by a mutation in the Pax2 gene. The nerve head typically resembles the morning glory disc anomaly, but has also been described as a coloboma. A coloboma is the failure to close the choroid fissure, which is the opening from the ventral side of the retina in the optic stalk. Despite the similarities with coloboma and morning glory anomaly, significant differences exist such that optic disc dysplasia cannot be classified as either one entity.\nOptic disc dysplasia is noted by an ill-defined inferior excavation, convoluted origin of the superior retinal vessels, excessive number of vessels, infrapapillary pigmentary disturbance, and slight band of retinal elevation adjacent to the disk. Some patients have normal or near normal vision, but others have visual impairment associated with the disease, though it is not certain if this is due only to the dysplastic optic nerves, or a possible contribution from macular and retinal malformations. The retinal vessels are abnormal or absent, in some cases having small vessels exiting the periphery of the disc. There is a great deal of clinical variability.\n\n\n=== Kidney ===\nThe most common malformation in patients with the syndrome is kidney hypodysplasia, which are small and underdeveloped kidneys, often leading to end-stage renal disease (ESRD). Estimates show approximately 10% of children with hypoplastic kidneys are linked to the disease. Many different histological abnormalities have been noted, including:\ndecrease in nephron number associated with hypertrophy\nfocal segmental glomerulosclerosis\ninterstitial fibrosis and tubular atrophy\nmulticystic dysplastic kidneyUp to one-third of diagnosed patients develop end stage kidney disease, which may lead to complete kidney failure.\n\n\n== Causes ==\n\n\n=== Pax2 mutations ===\nThe majority of mutations occur in exons 2,3 and 4, which encode the paired domain and frame shift mutations that lead to a null allele. The missense mutations appear to disrupt hydrogen bonds, leading to decreased transactivation of Pax2, but do not seem to effect nuclear localization, steady state mRNA levels, or the ability of Pax2 to bind to its DNA consensus sequence. Mutations related to the disease have also been noted in exons 7,8, and 9, with milder phenotypes than the other mutations.\n\n\n=== Recent studies ===\nPax2 is expressed in the kidney, midbrain, hindbrain, cells in the spinal column, developing ear and developing eye. Homozygous negative Pax2 mutation is lethal, but heterozygote mutants showed many symptoms of papillorenal syndrome, including optic nerve dysplasia with abnormal vessels emerging from the periphery of the optic cup and small dysplasic kidneys. It is shown that Pax2 is under upstream control of Shh in both mice and zebrafish, which is expressed in the precordal plate.\n\n\n=== Other genes ===\nApproximately half of patients with papillorenal syndrome do not have defects in the Pax2. This suggests that other genes play a role in the development of the syndrome, though few downstream effectors of Pax2 have been identified.\n\n\n== Genetic ==\nPapillorenal syndrome is an autosomal dominant disorder that results from a mutation of one copy of the Pax2 gene, located on chromosome 10q24.3-q25.1. The gene is important in the development of both the eye and the kidney. Autosomal dominant inheritance indicates that the gene responsible for the disorder is located on an autosome (chromosome 10 is an autosome), and only one defective copy of the gene is sufficient to cause the disorder, when inherited from a parent who has the disorder.\n\n\n== Diagnosis ==\n\n\n=== Clinical findings in the kidney ===\nHypoplastic kidneys: Characterized by hypoplasia or hyperechogenicity. This typically occurs bilaterally, but there are also exceptions in which one kidney may be notably smaller while the other kidney is normal sized.\nHypodysplasia (RHD): Characterized histologically by reduced number of nephrons, smaller kidney size, or disorganized tissue.\nMulticystic Dysplastic Kidney: Characterized histologically, displaying cysts or dysplasia. Shows disorganization of kidneys, and occurs in about 10% of patients with papillorenal syndrome.\nOligomeganephronia: Fewer than normal glomeruli, with a notable size increase.\nChronic kidney disease and end-stage kidney disease (ESKD)\nVesicoureteral reflux\n\n\n=== Clinical findings in the eye ===\n\n\n==== Dysplasia of the optic nerve (most common) ====\nThe severity varies, but the most severe form results in an enlarged disc where vessels exit from the periphery instead of the center. Redundant fibroglial tissue also is seen in severe cases. Milder forms of dysplasia exhibit missing portions of the optic disc located in the optic nerve pit. The least severe form of papillorenal disease shown in the eye is the exiting of blood vessels from the periphery that do not disturb the shape of the eye. Other eye malformations include scleral staphyloma, which is the bulging of the eye wall. There can also be retinal thinning and myopia. Additionally, there can be an optic nerve cyst, which is dilation of the optic nerve posterior to the globe; which most likely results from incomplete regression of the primordial optic stalk and the filling of this area with fluid. Retinal coloboma is also common, which is characterized by the absence of retinal tissue in the nasal ventral portion of the retina. However, this is an extremely rare finding.\n\n\n=== Molecular genetic testing ===\nSequence analysis shows that Pax2 is the only known gene associated with the disease. Mutations in Pax2 have been identified in half of renal coloboma syndrome victims.\n\n\n== Treatment ==\nManagement of the disease should be focused on preventing end-stage kidney disease (ESKD) and/or vision loss. The treatment of hypertension may also preserve renal function. Renal replacement therapy is recommended, and vision experts may provide assistance to adapt to continued vision loss.\nKidney transplant is also an option. Treatment plans seem to be limited, as there is a large focus on the prevention of papillorenal syndrome and its implications. People with congenital optic nerve abnormalities should seek ophthalmologists regularly and use protective lenses. If abnormalities are present, a follow up with a nephrologist should be achieved to monitor renal function and blood pressure. Since the disease is believed to be caused by Pax2 mutations and is inherited in an autosomal dominant manner, family members may be at risk and relatives should be tested for possible features. About half of those diagnosed with the disease have an affected parent, so genetic counseling is recommended.\nPrenatal testing is another possibility for prevention or awareness, and this can be done through molecular genetic testing or ultrasounds at later stages of pregnancy. Additionally, preimplantation genetic diagnosis (PGD) should be considered for families where papillorenal syndrome is known to be an issue.\n\n\n== References ==\n\n\n== External links ==\n\nGeneReview/NCBI/NIH/UW entry on Renal Coloboma Syndrome\nPapillorenal syndrome at NIH's Office of Rare Diseases\nNCBI Genetic Testing Registry",
    "links": [
        "Acrocallosal syndrome",
        "Alport syndrome",
        "Alveolar capillary dysplasia",
        "Androgen insensitivity syndrome",
        "Anterior segment mesenchymal dysgenesis",
        "Aristaless related homeobox",
        "Atrichia with papular lesions",
        "Autoimmune polyendocrine syndrome type 1",
        "Autosome",
        "Axenfeld syndrome",
        "Axenfeld–Rieger syndrome",
        "Bamforth–Lazarus syndrome",
        "Barakat syndrome",
        "Bladder exstrophy",
        "CREB-binding protein",
        "Campomelic dysplasia",
        "Chromosome",
        "Chromosome 10 (human)",
        "Chronic kidney disease",
        "Cleft lip and palate",
        "Cleidocranial dysostosis",
        "Coloboma",
        "Coloboma of optic nerve",
        "Complete androgen insensitivity syndrome",
        "Congenital disorder",
        "Congenital hypothyroidism",
        "Currarino syndrome",
        "Cystic kidney disease",
        "Dent's disease",
        "Denys–Drash syndrome",
        "Diseases Database",
        "Doi (identifier)",
        "Dominance (genetics)",
        "Duane-radial ray syndrome",
        "Duplicated ureter",
        "Ectopic ureter",
        "Ectrodactyly–ectodermal dysplasia–cleft syndrome",
        "End-stage renal disease",
        "Enlarged vestibular aqueduct",
        "Epispadias",
        "Estrogen insensitivity syndrome",
        "FOXC2",
        "FOXE1",
        "FOXE3",
        "FOXF1",
        "FOXI1",
        "FOXP3",
        "Familial partial lipodystrophy",
        "Feingold syndrome",
        "Forkhead box C1",
        "Forkhead box L2",
        "Fuchs' dystrophy",
        "Genetic disorder",
        "Gillespie syndrome",
        "Greig cephalopolysyndactyly syndrome",
        "HOXD13",
        "HR (gene)",
        "Hay–Wells syndrome",
        "Heredity",
        "Holt–Oram syndrome",
        "Horseshoe kidney",
        "Hydrogen bond",
        "Hyperimmunoglobulin E syndrome",
        "Hypertrophy",
        "Hypodontia",
        "Hypospadias",
        "IPEX syndrome",
        "IRF6",
        "Intracellular receptor",
        "Iridogoniodysgenesis, dominant type",
        "Kabuki syndrome",
        "Kidney",
        "Kidney disease",
        "LMX1B",
        "Limb–mammary syndrome",
        "Lissencephaly",
        "Li–Fraumeni syndrome",
        "Lymphedema–distichiasis syndrome",
        "MNX1",
        "MODY 1",
        "MODY 3",
        "MODY 4",
        "MODY 5",
        "MSX1",
        "Maturity onset diabetes of the young",
        "Meckel syndrome",
        "Medical Subject Headings",
        "Medical genetics",
        "Medical specialty",
        "Medullary sponge kidney",
        "Megaureter",
        "Mice",
        "Mild androgen insensitivity syndrome",
        "Morning glory disc anomaly",
        "Mowat–Wilson syndrome",
        "Multicystic dysplastic kidney",
        "Myotonic dystrophy",
        "Nail–patella syndrome",
        "National Institutes of Health",
        "Nephron",
        "Nephronophthisis",
        "Nonsyndromic deafness",
        "Ohtahara syndrome",
        "Online Mendelian Inheritance in Man",
        "Optic cup (embryology)",
        "Optic nerve",
        "PAX2",
        "PAX3",
        "PAX4",
        "PAX6",
        "PAX8",
        "PAX9",
        "PDX1",
        "PITX2",
        "PMC (identifier)",
        "PMID (identifier)",
        "POU3F4",
        "POU4F3",
        "Pallister–Hall syndrome",
        "Partial androgen insensitivity syndrome",
        "Pax genes",
        "Pelvic kidney",
        "Penoscrotal transposition",
        "Pitt–Hopkins syndrome",
        "Polycystic kidney disease",
        "Popliteal pterygium syndrome",
        "Posterior polymorphous corneal dystrophy",
        "Posterior urethral valve",
        "Potter sequence",
        "Preimplantation genetic diagnosis",
        "Premature ovarian failure",
        "Pseudohypoaldosteronism",
        "Rapp–Hodgkin syndrome",
        "Rare disease",
        "Renal agenesis",
        "Renal ectopia",
        "Renal hypoplasia",
        "Retina",
        "Rubinstein–Taybi syndrome",
        "SOX10",
        "Saethre–Chotzen syndrome",
        "Sonic hedgehog",
        "Spinal and bulbar muscular atrophy",
        "Steroidogenic factor 1",
        "Supernumerary kidney",
        "Synpolydactyly",
        "TCF4",
        "TP63",
        "Thyroid hormone resistance",
        "Tietz syndrome",
        "Tooth and nail syndrome",
        "Townes–Brocks syndrome",
        "Transcription coregulator",
        "Transcription factor",
        "Transient neonatal diabetes mellitus",
        "Tricho–rhino–phalangeal syndrome",
        "Ulnar–mammary syndrome",
        "Umbilical-urachal sinus",
        "Urachal cyst",
        "Urachal fistula",
        "Urachus",
        "Ureter",
        "Urethra",
        "Urinary bladder disease",
        "Urinary system",
        "Urologic disease",
        "Van der Woude syndrome",
        "Waardenburg syndrome",
        "X-linked adrenal hypoplasia congenita",
        "X-linked intellectual disability",
        "XY gonadal dysgenesis",
        "Yemenite deaf-blind hypopigmentation syndrome",
        "ZEB1",
        "ZEB2",
        "ZFP57",
        "Zebrafish",
        "Zygosity"
    ]
}