{"url": "https://en.wikipedia.org/wiki/Pat_Fanning", "title": "Pat Fanning", "summary": "Pat Fanning (25 August 1918 – 14 March 2010) was an Irish sportsperson. He played hurling with his local club Mount Sion and was a member of the Waterford senior inter-county team in the 1940s and 1950s. He won the county championship on seven occasions. Fanning also served as the 23rd president of the Gaelic Athletic Association from 1970 until 1973, and was honorary life president of Waterford's county board.His election in succession of fellow Munster man Seamus Ryan marked the second time in history a province had consecutive presidents of the Gaelic Athletic Association. Fanning was the former president of the Gaelic Athletic Association to have survived the longest after serving.", "content": "Pat Fanning (25 August 1918 – 14 March 2010) was an Irish sportsperson. He played hurling with his local club Mount Sion and was a member of the Waterford senior inter-county team in the 1940s and 1950s. He won the county championship on seven occasions. Fanning also served as the 23rd president of the Gaelic Athletic Association from 1970 until 1973, and was honorary life president of Waterford's county board.His election in succession of fellow Munster man Seamus Ryan marked the second time in history a province had consecutive presidents of the Gaelic Athletic Association. Fanning was the former president of the Gaelic Athletic Association to have survived the longest after serving.\n\n\n== Presidency ==\nFanning's time as president of the Gaelic Athletic Association is remembered for the 1970 repealing of the ban on being associated with \"foreign games\". He had opposed the move, yet received praise for not objecting to the outcome of the national vote. When Croke Park admitted \"foreign games\" in 2005, Fanning said: We were told in 1970 that rugby schools would embrace our games — not one rugby college relaxed their own severe ban on playing Gaelic Games and it resulted in a net loss for us . . . Opening Croke Park will double and treble the income of these other sports and give them more ammunition to intrude on our schools.\nFanning also oversaw the introduction of senior club All-Irelands during his presidency.\n\n\n== Other life ==\nFanning was employed by the Department of Posts and Telegraphs. In later years he continued to comment on matters related to the GAA.He died early morning on 14 March 2010 at the age of 91. Tributes came from Christy Cooney, President of the Gaelic Athletic Association at the time of Fanning's death.\n\n\n== Honours ==\nFanning was honoured with the Appreciation Award at the Park Hotel in Dungarvan, County Waterford on 29 January 2005. The award was one of five given to Fanning, Paddy Joe Ryan (previously a county chairman), Seamas Grant (secretary), Tony Morrissey (treasurer), and Seamus O'Brien (a representative member of the Central Council), though Fanning spoke as a representative of them all.\n\n\n== References ==\n\n\n== External links ==\nVideo of Christy Cooney's graveside oration at the funeral of Pat Fanning", "links": ["All-Ireland Senior Football Championship", "Christy Cooney", "County Waterford", "Croke Park", "Donal Keenan", "Dungarvan", "Gaelic Athletic Association", "Gaelic football, hurling and camogie positions", "Hurling", "Irish Independent", "Irish name", "Irish people", "Minister for Posts and Telegraphs", "Mount Sion GAA", "Munster", "Munster Senior Football Championship", "National Hurling League", "President of the Gaelic Athletic Association", "RTÉ", "Seamus Ryan (hurler)", "Séamus Ó Riain", "The Irish Times", "The Sunday Times", "Waterford (city)", "Waterford GAA", "Waterford News & Star", "Waterford Senior Football Championship", "Western People"]}