{"url": "https://en.wikipedia.org/wiki/Patented_Medicine_Prices_Review_Board", "title": "Patented Medicine Prices Review Board", "summary": "The Patented Medicine Prices Review Board (French: Conseil d'examen du prix des médicaments brevetés) is a federal quasi-judicial regulatory and reporting agency in Canada with a mandate to protect consumers by ensuring that the prices of patented medication charged by manufacturers of patented drugs are not excessive. The board does this through its role as a regulator, and through its reporting on trends, research and development in the Canadian pharmaceutical industry.The board investigates, reviews and negotiates the price of individual drugs that are still under patent and which have no generic substitutes. It establishes the maximum prices that can be charged in Canada for patented drugs.", "content": "The Patented Medicine Prices Review Board (French: Conseil d'examen du prix des médicaments brevetés) is a federal quasi-judicial regulatory and reporting agency in Canada with a mandate to protect consumers by ensuring that the prices of patented medication charged by manufacturers of patented drugs are not excessive. The board does this through its role as a regulator, and through its reporting on trends, research and development in the Canadian pharmaceutical industry.The board investigates, reviews and negotiates the price of individual drugs that are still under patent and which have no generic substitutes. It establishes the maximum prices that can be charged in Canada for patented drugs.\n\n\n== Accountability ==\nThe board is accountable to Parliament through the Minister of Health, the elected official responsible for the health portfolio. Under sections 89 and 100 of the Patent Act, the board produces an annual report submitted to the minister, who tables it in the House of Commons.\n\n\n== Background ==\nBill C-22, which was passed in 1987, established a compulsory licensing system under which drug patent holders were required to allow competing drug manufacturers to import their patented drug in exchange for a very modest 4% royalty, which resulted in an increase in the market share of generic drugs.: 93  At the same time, it established the federal Patented Medicine Prices Review Board. The board determines a maximum price for individual drugs through a review process, and negotiates \"voluntary compliance agreements\" with drug companies to ensure that \"manufacturer prices are within justification, and [are] not excessive\".: 93 \n\n\n== Annual reports ==\nAccording to their annual report for the fiscal year 2017, there were 1,391 patented medicines for human use that were reported, which included 80 new medicines. By December 31, 2017, there were 14 voluntary compliance undertakings accepted. Patented medicines represented 61.5% of the total medicine sales in Canada in 2017 up from 60.8% in 2016.\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nMulligan, Kate (15 August 2003). \"How Does Canada Keep a Lid On Prescription Drug Costs?\". Psychiatric News. 38 (16). Archived from the original on 4 June 2004.\nMartell, Allison; Paperny, Anna Mehler (8 May 2019). \"In Canada, a little-known drug regulator shows its teeth\". Reuters. Retrieved 8 May 2019.", "links": ["CA$", "Canada", "Compulsory licensing", "Doi (identifier)", "French language", "Generic drug", "Generic drugs", "Hon.", "House of Commons of Canada", "List of patent medicines", "MP (Canada)", "Market share", "Minister of Health (Canada)", "Ottawa", "PMID (identifier)", "Parliament of Canada", "Patent", "Patent Act (Canada)", "Patty Hajdu", "Pharmaceutical industry", "Pharmaceutical industry in Canada", "Prescription drug prices in the United States", "Quasi-judicial body", "Reuters", "VIAF (identifier)"]}