{"url": "https://en.wikipedia.org/wiki/Patricia_Hilliard_(actress)", "title": "Patricia Hilliard (actress)", "summary": "Patricia Hilliard (14 March 1916 – 19 May 2001), born Patricia Maud Penn-Gaskell, was a British stage and film actress.", "content": "Patricia Hilliard (14 March 1916 – 19 May 2001), born Patricia Maud Penn-Gaskell, was a British stage and film actress.\n\n\n== Biography ==\nShe was born at Quetta, then in British India, now in Pakistan, on 14 March 1916. She was the daughter of actress Ann Codrington (real name Marjorie Doris Codrington, who appeared in films such as The Rossiter Case) and her first husband, Percy Charles Penn-Gaskell, a military. Hilliard later adopted the last name of her stepfather, actor Stafford Hilliard. In December 1915, her mother, while pregnant with Patricia, and her grandmother, Mrs. Helen Codrington, were aboard the British passenger liner SS Persia when it was sunk by a German submarine in the Mediterranean. Ann Codrington was one of only 15 surviving women; Helen Codrington did not survive.\nHilliard attended the Royal Academy of Dramatic Art in London, where her performance in Molière's Sicilien and her striking beauty led to a 2-year contract with Warner Brothers. After some modelling she appeared as an extra in Double Wedding (1933). She rapidly progressed, being the female lead in The Girl in the Crowd (1935) and René Clair's The Ghost Goes West (1935). She also appeared in Alexander Korda's Things to Come, based on H. G. Wells's novel. Her film career tailed off, but she continued to work on stage.She married actor William Fox in 1938, with whom she had appeared on stage in William Congreve's Love for Love and the first production of J B Priestley's I Have Been Here Before (1937). She took a break between 1940 and 1944 following the birth of her first child and while her husband was on active military service in World War II, returning to the stage in 1944. In 1952 she joined the BBC's repertory company, before retiring in the early 1960s.\n\n\n== Filmography ==\n\n\n== References ==\n\n\n== Bibliography ==\nLow, Rachael. History of the British Film, 1918–1929. George Allen & Unwin, 1971.\n\n\n== External links ==\nPatricia Hilliard at IMDb", "links": ["A Gentleman's Gentleman", "Alexander Korda", "Ann Codrington", "BBC", "British Raj", "Farewell Again", "Film actress", "Full Circle (1935 film)", "H. G. Wells", "IMDb", "I Have Been Here Before", "J B Priestley", "Love for Love", "Molière", "Quetta", "René Clair", "Royal Academy of Dramatic Art", "SS Persia (1900)", "Shadowed Eyes", "Stafford Hilliard", "Stage actor", "Stage actress", "Sussex", "The Ghost Goes West", "The Girl in the Crowd", "The Limping Man (1936 film)", "The Missing Million", "The Private Life of Don Juan", "The Rossiter Case", "Things to Come", "VIAF (identifier)", "Warner Brothers", "William Congreve", "William Fox (actor)"]}