{"url": "https://en.wikipedia.org/wiki/Pharmaceutical_bioinformatics", "title": "Pharmaceutical bioinformatics", "summary": "Pharmaceutical bioinformatics is a research field related to bioinformatics but with the focus on studying biological and chemical processes in the pharmaceutical area; to understand how xenobiotics interact with the human body and the drug discovery process.", "content": "Pharmaceutical bioinformatics is a research field related to bioinformatics but with the focus on studying biological and chemical processes in the pharmaceutical area; to understand how xenobiotics interact with the human body and the drug discovery process.\n\n\n== Introduction ==\nWhereas traditional bioinformatics is a wide subject it has a large focus on molecular biology, pharmaceutical bioinformatics more specifically targets chemical-biological interaction and exploratory focus of chemical and biological interactors using e.g. cheminformatics and chemometrics methods. Methods include, apart from many general bioinformatics methods, ligand-based modeling such as Quantitative structure–activity relationship (QSAR) and proteochemometrics, computer-aided molecular design, chembioinformatics databases, algorithms for chemical software, and biopharmaceutical chemistry including analyses of biological activity and other issues related to drug discovery.\n\n\n== In silico metabolism prediction ==\nOne of the major fields within pharmaceutical bioinformatics is the in silico metabolism prediction of drug candidates. This field is in turn divided into three tasks; \n\nPredicting the occurrence of an interaction between a compound and an enzyme,\nPredicting the location in the compound that takes part in the interaction, i.e. the site of metabolism (SOM),\nPredicting the outcome from the interaction, i.e. the resulting metabolite product.There are several existing tools trying to solve these tasks, e.g. SMARTCyp and MetaPrint2D predicts the SOM for chemical compounds. \n\n\n== Software and tools ==\nThere are many software tools for pharmaceutical bioinformatics. An example of an open source tool is the Bioclipse workbench.\n\n\n== Conferences ==\nOne conference specific to Pharmaceutical Bioinformatics is \"International Conference on Pharmaceutical Bioinformatics\" (ICPB) (http://www.icpb.net)\n\n\n== References ==\n\n\n== Further reading ==", "links": ["Bioclipse", "Bioinformatics", "Cheminformatics", "Chemometrics", "Doi (identifier)", "Drug discovery", "ISBN (identifier)", "ISSN (identifier)", "Metabolite", "Molecular biology", "PMC (identifier)", "PMID (identifier)", "Quantitative structure–activity relationship", "Software", "Xenobiotic"]}