{
    "url": "https://en.wikipedia.org/wiki/Porting_Authorisation_Code",
    "title": "Porting Authorisation Code",
    "summary": "Porting Authorization Code (PAC) is a unique identifier (normally 9 characters long and in the format \"ABC123456\") used by some mobile network operators to facilitate mobile number portability (MNP). This allows users to retain their mobile telephone number when switching operators.\n\n",
    "content": "Porting Authorization Code (PAC) is a unique identifier (normally 9 characters long and in the format \"ABC123456\") used by some mobile network operators to facilitate mobile number portability (MNP). This allows users to retain their mobile telephone number when switching operators.\n\n\n== United Kingdom ==\nTelecommunications service is regulated in the UK by Ofcom. On 25 July 2003, Ofcom introduced the General Conditions of Entitlement which apply to all communications networks and service providers in the UK. Several amendments to this original document have been issued since this time.\nCondition 18 requires all providers to provide number portability but only to subscribers of publicly available telephone services who request it. Number portability must be provided as soon as practicable and on reasonable terms to subscribers, and bilateral porting arrangements between providers must accord with agreed processes.\n\nThe current Service Provider must give the customer a Porting Authorisation Code (PAC), or a reason why it cannot be issued, within two working hours of their request (if for fewer than 26 numbers) or ten working days (for 26+ numbers)\nA PAC is valid for a period of 30 calendar days from the day of issue, and the customer's request must be submitted to their new Service Provider within that time.\nA number can then be transferred between 1 and 32 calendar days from the date the PAC is issued.Some mobile phone companies can charge a fee to move the customer's number. This is usually no more than £25. The provider must issue a PAC within two hours of the port-out request, if such request was made over the phone for fewer than 25 numbers on a single account. Customer debt is not a valid reason for a service provider to refuse issuing of a PAC. Service providers may not treat PAC requests as requests to terminate service. Pay-as-you-go customers will lose any unused credit when switching service providers.Since 1 July 2019, customers can request a PAC by text message, rather than having to call their existing network.\n\n\n== India ==\nIn India, the code is known as a 'Unique Porting Code (UPC)'. The rules for number portability are prescribed by the Telecom Regulatory Authority of India.\n\nYou are allowed to move to another mobile service provider only after 90 days of the date of activation of your mobile connection or from the date of last porting of your mobile number, whichever is applicable.\nYou are allowed to change mobile service provider across the country.\nIf you are a pre-paid subscriber, note that the balance amount of talk time, if any, at the time of porting will lapse.\nIf you are a post-paid subscriber, ensure that you have paid all the dues as per your last bill. (You will also have to sign an undertaking on the porting form.)\n\n\n== See also ==\nLocal number portability\nMigration Authorisation Code\n\n\n== References ==",
    "links": [
        "Local number portability",
        "Migration Authorisation Code",
        "Mobile network operators",
        "Mobile number portability",
        "Ofcom",
        "Publicly Available Telephone Services",
        "TRAI",
        "Unique identifier",
        "United Kingdom"
    ]
}