{"url": "https://en.wikipedia.org/wiki/Problems_of_Peace_and_Socialism", "title": "Problems of Peace and Socialism", "summary": "Problems of Peace and Socialism (September 1958–June 1990, Russian: Проблемы мира и социализма), also commonly known as World Marxist Review (WMR), the name of its English-language edition, was a monthly theoretical journal containing jointly-produced content by Communist and workers' parties from around the world.\nThe magazine was a subsidized publication of the Information Department of the Communist Party of the Soviet Union, which maintained control over content through appointment of a Soviet chief editor throughout the publication's entire duration.\nThe offices of WMR were based in Prague, Czechoslovakia. Each edition of the magazine had a circulation of above half a million, being read in 145 countries. At its height, WMR appeared in 41 languages, and editors from 69 communist parties around the world worked at its office in Prague.", "content": "Problems of Peace and Socialism (September 1958–June 1990, Russian: Проблемы мира и социализма), also commonly known as World Marxist Review (WMR), the name of its English-language edition, was a monthly theoretical journal containing jointly-produced content by Communist and workers' parties from around the world.\nThe magazine was a subsidized publication of the Information Department of the Communist Party of the Soviet Union, which maintained control over content through appointment of a Soviet chief editor throughout the publication's entire duration.\nThe offices of WMR were based in Prague, Czechoslovakia. Each edition of the magazine had a circulation of above half a million, being read in 145 countries. At its height, WMR appeared in 41 languages, and editors from 69 communist parties around the world worked at its office in Prague.\n\n\n== History ==\n\n\n=== Background ===\nThe Communist International (Comintern) was established in Moscow in March 1919 and began the regular production of a theoretical journal for members of its affiliated organizations, with the first issue of the magazine The Communist International appearing dated May Day of that same year. This publication helped to advance news and theoretical ideas across national boundaries and to unify political campaigns, with an article in the first issue declaring that the journal should become a \"constant companion\" and source of guidance for its readers. The magazine was initially produced in four parallel editions — Russian, German, French, and English — and remained in production until the abrupt termination of the Comintern due to wartime political exigencies in 1943.\nFollowing the end of the Second World War and the wartime alliance between the Soviet Union and the Allied powers of the United States, Great Britain, and France, a new Cold War erupted. The world Communist movement, headed by the USSR, reorganized itself as the Communist Information Bureau (Cominform) in 1947, an institution which attempted to restore the centralized dissemination of news, ideas, and political activities under a new banner. The Cominform also had its official organ, the weekly newspaper For a Lasting Peace, for a People's Democracy, which closely paralleled the earlier Comintern magazine in function if not form. This newspaper remained in production until 1956, when the so-called \"Secret Speech\" of Soviet leader Nikita Khrushchev led to a restructuring of the world Communist movement which ended the Cominform.\nA new effort at joint international activity would begin the following year.\n\n\n=== Establishment ===\nThe idea of launching a joint ideological monthly publication was raised at the 1957 International Meeting of Communist and Workers Parties. The first issue of Problems of Peace and Socialism/World Marxist Review was issued in September 1958. At the start, WMR was published in Russian, German, English, French, Hungarian, Polish, Chinese, Albanian, Vietnamese, Bulgarian, Romanian, Korean, Czech, Mongolian, Spanish, Italian, Dutch, Swedish and Japanese.In some ways WMR represented a continuation of the Cominform organ For a Lasting Peace, for People's Democracy. WMR was supposed to play an important role in formulating a joint political line of the communist parties of the Socialist Bloc. However, it never really came to fill the function of being an intra-Bloc organ, but was rather used by non-ruling communist parties.In May 1989. Soviet defector Evgenii Novikov, a former staff member of Problems of Peace and Socialism/World Marxist Review, said that the publication was a sponsored initiative of the International Department of the Communist Party of the Soviet Union.\n\n\n=== Development ===\nIn the wake of the Sino-Soviet split, the Albanian edition was canceled in 1962, followed by the Chinese and Korean editions in 1963. Meanwhile, a Greek edition was started in Cyprus in 1962, a Portuguese in Brazil in the same year and a Sinhala edition was launched in Ceylon in 1965. During the same period, new distribution centres were set up in Switzerland, Uruguay, Mexico, Chile and Argentina.The costs for the printing of the magazine were mainly covered by the Communist Party of the Soviet Union. Communist parties from East Germany, Poland, Czechoslovakia, Hungary, Romania, Bulgaria and Mongolia also contributed. Around half of the 400 strong staff were from the Soviet Union. Until its final phase chief editor of the magazine as well as one of two executive secretaries were Soviets, with the second executive secretary position traditionally held by a Czechoslovak in apparent deference to the magazine's Prague editorial location. These three individuals were described in the magazine as \"the core of the Editorial Office\" and together with a carefully selected Editorial Board served to maintain pro-Soviet ideological consistency of the journal's content.Ideological orthodoxy was maintained throughout the decades of the 1960s and 1970s, with the sole possible exception of 1968, when an issue was skipped and a chief editor removed following the August Warsaw Pact invasion of Czechoslovakia. The magazine's content was managed by a 65-member Editorial Council, divided into various content-related commissions. In the middle 1980s there were 10 such content commissions, including commissions related to affairs of the Soviet Union and other nations of the Warsaw Pact; developed non-communist countries of the Europe and North America; the countries of Asia and Africa; the countries of Latin America and the Caribbean; the world peace movement; the topic of science and culture, among others.As the Brezhnev period drew to a close there were some 75 national editions of Problems of Peace and Socialism being published in 40 languages, with distribution taking place in 145 countries.\n\n\n=== Activities ===\nIn addition to publication of the theoretical journal itself, the Prague editorial office of Problems of Peace and Socialism served as a nexus for the sponsorship or co-sponsorship of various international conferences, including large events held in Sofia, Bulgaria in December 1978 and East Berlin in October 1980. In the view of scholars these events served as de facto substitutes for previous international congresses of the Comintern and Cominform, gathering representatives of various national communist and anti-colonial political parties for the adaptation of policy.A similar conference was held in Prague in November 1981, attended by representatives of 90 political parties, ostensibly to discuss the work of the magazine. This gathering was marked by explicit criticism on the part of the Japanese delegation which challenged tight Soviet control of the magazine — a position said by the Japanese delegation to be backed by the Eurocommunist parties of Italy, Spain, Great Britain, and Belgium. The Japanese Communist Party in fact went so far as to call for the dissolution of the magazine itself.Problems of Peace and Socialism was also an important conduit of information between Communist parties about the ongoing activities of various front groups of the international movement, including the World Peace Council (WPC), the World Federation of Trade Unions (WFTU), the Women's International Democratic Federation (WIDF), the World Federation of Democratic Youth (WFDY), the International Union of Students (IUS), the Afro-Asian People's Solidarity Organisation (AAPSO), the International Association of Democratic Lawyers (IADL), the World Federation of Scientific Workers (WFSW), and the International Organization of Journalists (IOJ).\n\n\n=== Final period (1988-1990) ===\nWith the ascent to power of Mikhail Gorbachev in the USSR, Problems of Peace and Socialism began to gain notoriety as an incubator of the liberalization known as perestroika. Several of Gorbachev’s top advisors on his reforms (such as Gennadi Gerasimov, Georgy Shakhnazarov, Yevgeny Ambartsumov, Anatoly Chernyaev, Georgy Arbatov, Aleksandr Tsipko, Yegor Yakovlev, Ivan Frolov had worked on the staff of the magazine in Prague.\nIn August 1988 a new publication entitled First Hand Information: Communists and Revolutionary Democrats of the World Presenting Their Parties was launched by Peace and Socialism Publishers, formal publisher of Problems of Peace and Socialism. Shortly thereafter it was announced that the publishing house's longtime auxiliary magazine dedicated to publication of official Communist Party statements, Information Bulletin, was being discontinued.Towards the end of 1989, there were sharp changes in the editorial policy at WMR. Articles written by critics of the traditional Soviet system such as Zbigniew Brzezinski, Alexander Dubček, Milovan Đilas and Andrei D. Sakharov began to appear in the magazine's pages as a foil for discussion and debate.The final issue of the publication was a combined No. 5-6 dated \"May–June 1990.\" Despite vigorous debate and a multiplicity of viewpoints that rendered World Marxist Review a more interesting publication, officials at the magazine claimed that circulation of the publication had fallen from its peak level of 500,000 to \"zero\" and the magazine was abruptly terminated.The immediate cause of the magazine's demise seems to have been a loss of subsidies, which had fallen by 1990 to only the Soviet and Mongolian Communist Parties. The skeleton staff defaulted to Czech leadership, with Lubomír Molnar assuming the editorship early in 1990, becoming the first non-Soviet editor-in-chief of the publication. Following the magazine's closure the Roman Catholic church reclaimed the building where the WMR editorial office had been located.The last editor, Molnar, tried unsuccessfully to negotiate remodeling the Peace and Socialism International Publishers venture into a broader leftwing publishing house. The company was to be renamed \"Patria.\"\n\n\n== Editors ==\nAleksey Rumyantsev was the first editor, and served in the position until 1964. After Rumyantsev, G. P. Frantov (rector of the Academy of Social Sciences) took over the editorship.In 1986 Aleksandr M. Subbotin, who was also a member of the Auditing Committee of the Communist Party of the Soviet Union, became editor of WMR.\n\n\n=== Editorial board ===\nIn 1987, editors from parties of the following countries comprised its editorial board:\n\n\n== Languages ==\nAt its height, WMR appeared in 41 languages. In 1987, it appeared in the following languages:\n\n\n== Footnotes ==\n\n\n== External links ==\nArchive of the English-language edition\nArchive of the Persian-language edition", "links": ["1957 International Meeting of Communist and Workers Parties", "Afro-Asian People's Solidarity Organisation", "Albanian language", "Aleksandr Tsipko", "Aleksei Rumyantsev", "Alexander Dubček", "Algeria", "Allies of World War II", "Anatoly Chernyaev", "Andrei D. Sakharov", "Arabic", "Argentina", "Austria", "Belgium", "Bengali language", "Bolivia", "Brazil", "Bulgaria", "Bulgarian language", "Canada", "Central Auditing Commission of the Communist Party of the Soviet Union", "Ceylon", "Chile", "Chinese language", "Cold War", "Colombia", "Cominform", "Communism", "Communist International", "Communist Party of the Soviet Union", "Communist front", "Costa Rica", "Cuba", "Cyprus", "Czech language", "Czechoslovakia", "Danish language", "Denmark", "Dominican Republic", "Dutch language", "East Berlin", "East Germany", "Ecuador", "Editor-in-chief", "Egypt", "El Salvador", "English language", "Eurocommunist", "Finland", "Finnish language", "France", "French language", "Gennadi Gerasimov", "Georgy Arbatov", "Georgy Shakhnazarov", "German language", "Greece", "Greek language", "Guatemala", "Gujarati language", "Guyana", "Hebrew", "Hindi", "Honduras", "Hoover Institution", "Hungarian language", "Hungary", "ISO 4", "ISSN (identifier)", "India", "Indonesia", "Indonesian language", "International Association of Democratic Lawyers", "International Organization of Journalists", "International Union of Students", "Iran", "Iraq", "Israel", "Italian language", "Italy", "Ivan Frolov (journalist)", "Jamaica", "Japan", "Japanese Communist Party", "Japanese language", "Jordan", "Korean language", "LCCN (identifier)", "Lebanon", "Left-wing politics", "Leonid Brezhnev", "Lesotho", "Luxembourg", "Malayalam", "May Day", "Mexico", "Mikhail Gorbachev", "Milovan Đilas", "Mongolia", "Mongolian language", "Morocco", "Nikita Khrushchev", "North Korea", "Norwegian language", "Odia language", "On the Cult of Personality and Its Consequences", "Panama", "Paraguay", "Perestroika", "Periodical literature", "Persian language", "Peru", "Philippines", "Poland", "Polish language", "Portugal", "Portuguese language", "Prague", "Punjabi language", "Republic of Ireland", "Richard Felix Staar", "Roman Catholic church", "Romania", "Romanian language", "Russian language", "Saudi Arabia", "Senegal", "Sinhala language", "Sino-Soviet split", "Socialist Bloc", "Sofia", "South Africa", "South Yemen", "Soviet Union", "Spain", "Spanish language", "Sri Lanka", "Stanford University", "State of Palestine", "Sudan", "Sweden", "Swedish language", "Switzerland", "Syria", "Tagalog language", "Tamil language", "Telugu language", "Turkey", "Turkish language", "United Kingdom", "United States", "Uruguay", "Venezuela", "Vietnam", "Vietnamese language", "Warsaw Pact", "Warsaw Pact invasion of Czechoslovakia", "West Germany", "Women's International Democratic Federation", "World Federation of Democratic Youth", "World Federation of Scientific Workers", "World Federation of Trade Unions", "World Peace Council", "World War II", "Yearbook on International Communist Affairs", "Yegor Yakovlev", "Yevgeny Ambartsumov", "Zbigniew Brzezinski"]}