{
    "url": "https://en.wikipedia.org/wiki/Proto-Sinaitic_script",
    "title": "Proto-Sinaitic script",
    "summary": "Proto-Sinaitic (also referred to as Sinaitic, Proto-Canaanite when found in Canaan, the North Semitic alphabet, or Early Alphabetic) is considered the earliest trace of alphabetic writing and the common ancestor of both the Ancient South Arabian script and the Phoenician alphabet, which led to many modern alphabets including the Greek alphabet. According to common theory, Canaanites or Hyksos who spoke a Semitic language repurposed Egyptian hieroglyphs to construct a different script. The script is attested in a small corpus of inscriptions found at Serabit el-Khadim in the Sinai Peninsula, Egypt, dating to the Middle Bronze Age (2100–1500 BC).The earliest Proto-Sinaitic inscriptions are mostly dated to between the mid-19th (early date) and the mid-16th (late date) century BC.\n\nThe principal debate is between an early date, around 1850 BC, and a late date, around 1550 BC. The choice of one or the other date decides whether it is proto-Sinaitic or proto-Canaanite, and by extension locates the invention of the alphabet in Egypt or Canaan respectively.\nHowever, the discovery of the Wadi el-Hol inscriptions near the Nile River shows that the script originated in Egypt. The evolution of Proto-Sinaitic and the various Proto-Canaanite scripts during the Bronze Age is based on rather scant epigraphic evidence; it is only with the Bronze Age collapse and the rise of new Semitic kingdoms in the Levant that Proto-Canaanite is clearly attested (Byblos inscriptions 10th–8th century BC, Khirbet Qeiyafa inscription c. 10th century BC).The Proto-Sinaitic inscriptions were discovered in the winter of 1904–1905 in Sinai by Hilda and Flinders Petrie. To this may be added a number of short Proto-Canaanite inscriptions found in Canaan and dated to between the 17th and 15th centuries BC, and more recently, the discovery in 1999 of the Wadi el-Hol inscriptions, found in Middle Egypt by John and Deborah Darnell. The Wadi el-Hol inscriptions strongly suggest a date of development of Proto-Sinaitic writing from the mid-19th to 18th centuries BC.",
    "content": "Proto-Sinaitic (also referred to as Sinaitic, Proto-Canaanite when found in Canaan, the North Semitic alphabet, or Early Alphabetic) is considered the earliest trace of alphabetic writing and the common ancestor of both the Ancient South Arabian script and the Phoenician alphabet, which led to many modern alphabets including the Greek alphabet. According to common theory, Canaanites or Hyksos who spoke a Semitic language repurposed Egyptian hieroglyphs to construct a different script. The script is attested in a small corpus of inscriptions found at Serabit el-Khadim in the Sinai Peninsula, Egypt, dating to the Middle Bronze Age (2100–1500 BC).The earliest Proto-Sinaitic inscriptions are mostly dated to between the mid-19th (early date) and the mid-16th (late date) century BC.\n\nThe principal debate is between an early date, around 1850 BC, and a late date, around 1550 BC. The choice of one or the other date decides whether it is proto-Sinaitic or proto-Canaanite, and by extension locates the invention of the alphabet in Egypt or Canaan respectively.\nHowever, the discovery of the Wadi el-Hol inscriptions near the Nile River shows that the script originated in Egypt. The evolution of Proto-Sinaitic and the various Proto-Canaanite scripts during the Bronze Age is based on rather scant epigraphic evidence; it is only with the Bronze Age collapse and the rise of new Semitic kingdoms in the Levant that Proto-Canaanite is clearly attested (Byblos inscriptions 10th–8th century BC, Khirbet Qeiyafa inscription c. 10th century BC).The Proto-Sinaitic inscriptions were discovered in the winter of 1904–1905 in Sinai by Hilda and Flinders Petrie. To this may be added a number of short Proto-Canaanite inscriptions found in Canaan and dated to between the 17th and 15th centuries BC, and more recently, the discovery in 1999 of the Wadi el-Hol inscriptions, found in Middle Egypt by John and Deborah Darnell. The Wadi el-Hol inscriptions strongly suggest a date of development of Proto-Sinaitic writing from the mid-19th to 18th centuries BC.\n\n\n== Discovery ==\nIn the winter of 1905, Sir William Matthew Flinders Petrie and his wife Hilda Petrie (née Urlin) were conducting a series of archaeological excavations in the Sinai Peninsula. During a dig at Serabit el-Khadim, an extremely lucrative turquoise mine used during between the Twelfth and Thirteenth Dynasty and again between the Eighteenth and mid-Twentieth Dynasty, Petrie discovered a series of inscriptions at the site's massive invocative temple to Hathor, as well as some fragmentary inscriptions in the mines themselves. Petrie immediately recognized hieroglyphic characters in the inscriptions, but upon closer inspection realized the script was wholly alphabetic and not the combination of logograms and syllabics as Egyptian script proper. He thus assumed that the script showed a script that the turquoise miners had devised themselves, using linear signs that they had borrowed from hieroglyphics. He published his findings in London the following year.Ten years later, in 1916, Alan Gardiner, one of the premier Egyptologists of the early and mid-20th century, published his own interpretation of Petrie's findings, arguing that the glyphs appeared to be early versions of the signs used for later Semitic languages such as Phoenician, and was able to assign sound values and reconstructed names to some of the letters by assuming they represented what would later become the common Semitic abjad (one example provided being the character , which Gardiner assigned the ⟨b⟩ sound to, on the grounds that it derived from the Egyptian glyph for 'house' , and was very similar to the similarly-shaped Phoenician character, , which is called bet. The name bet itself was commonly thought to derive from the Semitic word for house, bayt, providing another layer of support to his thesis.) Using this hypothesis, Gardiner was able to affirm Petrie's hypothesis that the mystery inscriptions were of a religious nature, as his model allowed an often recurring word to be reconstructed as lbʿlt, meaning \"to Ba'alat\" or more accurately, \"to (the) Lady\" – that is, the \"lady\" Hathor. Likewise, this allowed another recurring word mʿhbʿlt to be translated as \"Beloved of (the) Lady\", a reading which became very acceptable after the lemma was found carved underneath a hieroglyphic inscription which read \"Beloved of Hathor, Lady of Turquoise\". Gardiner's hypothesis allowed researchers to connect the letters of the inscriptions to modern Semitic alphabets, and resulted in the inscriptions becoming much more readable, leading to his hypothesis' immediate acceptance.\n\n\n== Proto-Sinaitic inscriptions ==\n\n\n=== Serabit inscriptions ===\nThe Sinai inscriptions are best known from carved graffiti and votive texts from a mountain in the Sinai called Serabit el-Khadim and its temple to the Egyptian goddess Hathor (ḥwt-ḥr). The mountain contained turquoise mines which were visited by repeated expeditions over 800 years. Many of the workers and officials were from the Nile Delta, and included large numbers of Canaanites (i.e. speakers of an early form of Northwest Semitic ancestral to the Canaanite languages of the Late Bronze Age) who had been allowed to settle the eastern Delta.Most of the forty or so inscriptions have been found among much more numerous hieratic and hieroglyphic inscriptions, scratched on rocks near and in the turquoise mines and along the roads leading to the temple.The date of the inscriptions is mostly placed in the 17th or 16th century BC.Four inscriptions have been found in the temple, on two small human statues and on either side of a small stone sphinx. They are crudely done, suggesting that the workers who made them were illiterate apart from this script.\n\n\n=== Inscriptions in Canaan ===\nOnly a few inscriptions have been found in Canaan itself, dated to between the 17th and 15th centuries BC. They are all very short, most consisting of only a couple of letters, and may have been written by Canaanite caravaners or soldiers from Egypt. They sometimes go by the name \"Proto-Canaanite\", although the term \"Proto-Canaanite\" is also applied to early Phoenician or Ancient Hebrew writings.\n\n\n=== Wadi el-Hol inscriptions ===\n\nThe Wadi el-Hol inscriptions (Arabic: وادي الهول Wādī al-Hawl 'Ravine of Terror') were carved on the stone sides of an ancient high-desert military and trade road linking Thebes and Abydos, in the heart of literate Egypt. They have been dated to somewhere between 1900 and 1800 BC. They are in a wadi in the Qena bend of the Nile, at approx. 25°57′N 32°25′E, among dozens of hieratic and hieroglyphic inscriptions.The inscriptions are graphically very similar to the Serabit inscriptions, but show a greater hieroglyphic influence, such as a glyph for a man that was apparently not read alphabetically: The first of these (h1) is a figure of celebration [Gardiner A28], whereas the second (h2) is either that of a child [Gardiner A17] or of dancing [Gardiner A32]. If the latter, h1 and h2 may be graphic variants (such as two hieroglyphs both used to write the Canaanite word hillul \"jubilation\") rather than different consonants.\n\nBrian Colless has published a translation of the text, in which some of the signs are treated as logograms (representing a whole word, not just a single consonant) or rebuses:\n\n[Vertical] mšt r h ʿnt ygš ʾl\n[Vertical] Excellent banquet (mšt r[ʾš]) of the celebration (h[illul]) of ʿAnat (ʿnt).  [It] will provide (ygš) ʾEl (ʾl)\n[Horizontal] rb wn mn h ngṯ h ʾ p mẖ r\n[Horizontal] plenty (rb) of wine (wn) [and] victuals (mn) for the celebration (h[illul]). We will sacrifice (ngṯ) to her (h) an ox (ʾ‍[lp]) and (p) a prime fatling (mẖ r[ʾš]).\"Here, aleph, whose glyph depicts the head of an ox, is a logogram used to represent the word \"ox\" (*ʾalp), he, whose glyph depicts a man in celebration, is a logogram for the words \"celebration\" (*hillul) and \"she/her\" (hiʾ‎), and resh, whose glyph depicts a man's head, is a logogram for the word \"utmost/greatest\" (*raʾš). This interpretation fits into the pattern in some of the surrounding Egyptian inscriptions, with celebrations for the goddess Hathor involving inebriation.\n\n\n== Proto-Canaanite ==\n\n\n=== Synonym for Proto-Sinaitic ===\nProto-Canaanite, also referred to as Proto-Canaan, Old Canaanite, or Canaanite, is the name given to the Proto-Sinaitic script (c. 16th century BC), when found in Canaan.\n\n\n=== Synonym for Paleo-Phoenician or Paleo-Hebrew script ===\n\nProto-Canaanite is also used when referring to the ancestor of the Phoenician or Paleo-Hebrew script, respectively, before some cut-off date, typically 1050 BC, with an undefined affinity to Proto-Sinaitic.While no extant inscription in the Phoenician alphabet is older than c. 1050 BC, Proto-Canaanite is used for the early alphabets as used during the 13th and 12th centuries BC in Phoenicia. However, the Phoenician, Hebrew, and other Canaanite dialects were largely indistinguishable before the 11th century BC, and the writing system is essentially identical. A possible example of Proto-Canaanite, the inscription on the Ophel pithos, was found in 2012 on a pottery storage jar during the excavations of the south wall of the Temple Mount by Israeli archaeologist Eilat Mazar in Jerusalem. Inscribed on the pot are some big letters about an inch high, of which only five are complete, and traces of perhaps three additional letters written in Proto-Canaanite script.\n\n\n== History ==\nThe letters of the earliest script used for Semitic languages have been shown to be derived from Egyptian hieroglyphs. In the 19th century, the theory of Egyptian origin competed alongside other theories that the Phoenician script developed from Akkadian cuneiform, Cretan hieroglyphs, the Cypriot syllabary, and Anatolian hieroglyphs. Then the Proto-Sinaitic inscriptions were studied by Alan Gardiner who identified the word bʿlt \"Lady\" occurring several times in inscriptions, and also attempted to decipher other words. In the 1950s and 1960s, William Albright published interpretations of Proto-Sinaitic as the key to show the derivation of the Canaanite alphabet from hieratic, leading to the commonly accepted belief that the language of the inscriptions was Semitic and that the script had a hieratic prototype.The Proto-Sinaitic inscriptions, along with the contemporary parallels found in Canaan and Wadi el-Hol, are thus hypothesized to show an intermediate step between Egyptian hieratic and the Phoenician alphabet.According to the \"alphabet theory\", the early Semitic proto-alphabet reflected in the Proto-Sinaitic inscriptions would have given rise to both the Ancient South Arabian script and the Proto-Canaanite alphabet by the time of the Late Bronze Age collapse (1200–1150 BC). Albright hypothesized that only the graphic form of the Proto-Sinaitic characters derive from Egyptian hieroglyphs, because they were given the sound value of the first consonant of the Semitic translation of the hieroglyph (many hieroglyphs had already been used acrophonically in Egyptian.)\nFor example, the hieroglyph for pr \"house\" (a rectangle partially open along one side, \"O1\" in Gardiner's sign list) was adopted to write Semitic /b/, after the first consonant of baytu, the Semitic word for \"house\". According to the alphabet hypothesis, the shapes of the letters would have evolved from Proto-Sinaitic forms into Phoenician forms, but most of the names of the letters would have remained the same.An alternative hypothesis was recently proposed by Brian Colless (2014), who believes that 18 of the 22 letters of the Phoenician alphabet have counterparts in the Byblos syllabary, and it seems that the proto-alphabet evolved as a simplification of the syllabary, moving from syllabic to consonantal writing, in the style of the Egyptian script (which did not normally indicate vowels); this goes against the Goldwasser hypothesis (2010) that the original alphabet was invented by miners in Sinai.A transitional stage between Proto-Canaanite and Old Phoenician (1000–800 BC) has been proposed by authors such as Werner Pichler as the origin of the Libyco-Berber script used among Ancient Libyans (i.e. Proto-Berbers) – citing common similarities to both Proto-Canaanite proper and its early North Arabian descendants.\n\n\n=== Synopsis ===\nBelow is a table synoptically showing selected Proto-Sinaitic signs and the proposed correspondences with Phoenician letters and Egyptian hieroglyphs. Also shown are the sound values, names, and descendants of the Phoenician letters.\nFor the Ancient South Arabian and Libyco-Berber scripts only the letters with Proto-Canaanite correspondences are shown.\n\nThe Other section shows the corresponding Archaic Greek, Modern Greek, Etruscan, and Latin letters.\n\n\n== See also ==\nTell es-Safi inscription\nUgaritic alphabet\n\n\n== References ==\n\n\n== Further reading ==\nAlbright, William F. (1966). The Proto-Sinaitic Inscriptions and their Decipherment.\nI. Biggs, M. Dijkstra, Corpus of Proto-sinaitic Inscriptions, Alter Orient und Altes Testament, Neukirchener Verlag, 1990.\nButin, Romanus (1928). \"The Serabit Inscriptions: II. The Decipherment and Significance of the Inscriptions\". Harvard Theological Review. 21 (1): 9–67. doi:10.1017/s0017816000021167.\nButin, Romanus (1932). \"The Protosinaitic Inscriptions\". Harvard Theological Review. 25 (2): 130–203. doi:10.1017/s0017816000001231.\nColless, Brian E (1990). \"The proto-alphabetic inscriptions of Sinai\". Abr-Nahrain / Ancient Near Eastern Studies. 28: 1–52. doi:10.2143/anes.28.0.525711.\nColless, Brian E (1991). \"The proto-alphabetic inscriptions of Canaan\". Abr-Nahrain / Ancient Near Eastern Studies. 29: 18–66. doi:10.2143/anes.29.0.525718.\nColless, Brian E., \"The Byblos Syllabary and the Proto-alphabet\", Abr-Nahrain / Ancient Near Eastern Studies 30 (1992) 15–62.\nColless, Brian E (2010). \"Proto-alphabetic Inscriptions from the Wadi Arabah\". Antiguo Oriente. 8: 75–96.\nColless, Brian E., \"The Origin of the Alphabet: An Examination of the Goldwasser Hypothesis\", Antiguo Oriente 12 (2014) 71–104.\nStefan Jakob Wimmer / Samaher Wimmer-Dweikat: The Alphabet from Wadi el-Hôl – A First Try, in: Göttinger Miszellen. Beiträge zur ägyptologischen Diskussion, Heft 180, Göttingen 2001, p. 107–111\nDarnell, J. C.; Dobbs-Allsopp, F. W.;  et al. (2005). \"Two Early Alphabetic Inscriptions from the Wadi el-Hol: New Evidence for the Origin of the Alphabet from the Western Desert of Egypt\". Annual of the American Schools of Oriental Research. 59: 63, 65, 67–71, 73–113, 115–124. JSTOR 3768583.\nHamilton, Gordon J, The origins of the West Semitic alphabet in Egyptian scripts (2006)\nFellman, Bruce (2000) \"The Birthplace of the ABCs.\" Yale Alumni Magazine, December 2000.[2]\nSacks, David (2004). Letter Perfect: The Marvelous History of Our Alphabet from A to Z. Broadway Books. ISBN 0-7679-1173-3.\nGoldwasser, Orly, How the Alphabet Was Born from Hieroglyphs Biblical Archaeology Review 36:02, Mar/Apr 2010.\nLake, K.; Blake, R. (1928). \"The Serabit Inscriptions: I. The Rediscovery of the Inscriptions\". Harvard Theological Review. 21 (1): 1–8. doi:10.1017/s0017816000021155.\nMillard, A. R. (1986) \"The Infancy of the Alphabet\" World Archaeology. pp. 390–398.\nRay, John D. (1986) \"The Emergence of Writing in Egypt\" Early Writing Systems; 17/3 pp. 307–316.\nB. Benjamin Sass (West Semitic Alphabets) – In 1988 a very important doctoral dissertation was completed at Tel Aviv University, *Benjamin Sass, The Genesis of the Alphabet and its Development in the Second Millennium BC, Ägypten und Altes Testament 13, Otto Harrassowitz, Wiesbaden, 1988.\nSimons, F., \"Proto-Sinaitic – Progenitor of the Alphabet\" Rosetta 9 (2011), 16–40.\nhttps://archive.org/details/isbn_9780195079937/page/89/mode/1up\n\n\n== External links ==\nProto-Sinaitic inscriptions (byu.edu)\nProto-Sinaitic - 18th-14th cent. B.C., Mnamon Ancient writing systems in the Mediterranean\nEscritura Proto-sinaítica (in Spanish), Promotora Española de Lingüística (Proel).Wadi el-HolUSC West Semitic Research Project site on Wadi el-Hol, with photos\nYale news article on Wadi el-Hol from 2000 Dec\nArcheology article on Wadi el-Hol from 2000 Jan\nNew York Times article on Wadi el-Hol from 1999 Nov\nBBC article on Wadi el-Hol from 1999 Nov",
    "links": [
        "1829 braille",
        "A",
        "ASLwrite",
        "Abjad",
        "Abjad numerals",
        "Abugida",
        "Abydos, Egypt",
        "Accessible publishing",
        "Acrophony",
        "Adinkra symbols",
        "Adlam script",
        "Afaka syllabary",
        "Ahom script",
        "Akkadian cuneiform",
        "Alan Gardiner",
        "Alay",
        "Albanian Braille",
        "Aleph",
        "Algerian Braille",
        "Alphabet",
        "American Braille",
        "American Printing House for the Blind",
        "Anatolian hieroglyphs",
        "Ancient Hebrew writings",
        "Ancient Libya",
        "Ancient North Arabian",
        "Ancient North Arabian script",
        "Ancient South Arabian script",
        "Anglo-Saxon runes",
        "Arabic Braille",
        "Arabic alphabet",
        "Arabic chat alphabet",
        "Arabic language",
        "Arabic script",
        "Aramaic alphabet",
        "Archaic Greek alphabets",
        "Armenian Braille",
        "Armenian alphabet",
        "Asomtavruli",
        "Assamese alphabet",
        "Assyrian cuneiform",
        "Attic numerals",
        "Avestan alphabet",
        "Avoiuli",
        "Ayin",
        "Azeri Braille",
        "Aztec script",
        "B",
        "Baal",
        "Bagam script",
        "Balinese script",
        "Bamum script",
        "Bassa Vah script",
        "Batak script",
        "Baybayin",
        "Belarusian Braille",
        "Beneventan script",
        "Bengali Braille",
        "Bengali alphabet",
        "Bet (letter)",
        "Beta (letter)",
        "Bhaiksuki script",
        "Bharati Braille",
        "Bhattiprolu script",
        "Bhujimol script",
        "Biblical Archaeology Review",
        "Biblical Hebrew",
        "Bird-worm seal script",
        "Blackfoot language",
        "Blackletter",
        "Blissymbols",
        "Book Pahlavi",
        "Bopomofo",
        "Boyd's syllabic shorthand",
        "Brahmi numerals",
        "Brahmi script",
        "Brahmic family of scripts",
        "Brahmic scripts",
        "Braigo",
        "Braille",
        "Braille ASCII",
        "Braille Institute of America",
        "Braille Patterns",
        "Braille Without Borders",
        "Braille e-book",
        "Braille embosser",
        "Braille kanji",
        "Braille literacy",
        "Braille music",
        "Braille technology",
        "Braille translator",
        "Braille watch",
        "Bronze Age collapse",
        "Buda script",
        "Buhid script",
        "Bulgarian Braille",
        "Burmese Braille",
        "Burmese alphabet",
        "Byblian royal inscriptions",
        "Byblos syllabary",
        "Bété syllabary",
        "C",
        "Canaan",
        "Canaanite and Aramaic inscriptions",
        "Canaanite languages",
        "Canadian Aboriginal syllabics",
        "Canadian currency tactile feature",
        "Cantonese Braille",
        "Carian alphabets",
        "Carolingian minuscule",
        "Carrier syllabics",
        "Catalan Braille",
        "Caucasian Albanian script",
        "Celtiberian script",
        "Chakma script",
        "Cham script",
        "Charles Barbier",
        "Cherokee syllabary",
        "Chinese bronze inscriptions",
        "Chinese characters",
        "Chinese family of scripts",
        "Chữ Nôm",
        "Cipher runes",
        "Cirth",
        "Clear Script",
        "Coelbren y Beirdd",
        "Computer Braille Code",
        "Coorgi–Cox alphabet",
        "Coptic alphabet",
        "Cretan hieroglyphs",
        "Cuneiform",
        "Cuneiform Luwian",
        "Cursive Hebrew",
        "Cypriot syllabary",
        "Cypro-Minoan syllabary",
        "Cyrillic alphabets",
        "Cyrillic script",
        "Czech Braille",
        "D",
        "Dalecarlian runes",
        "Dalet",
        "Deborah Darnell",
        "Decapoint",
        "Delta (letter)",
        "Demotic (Egyptian)",
        "Denglisch",
        "Deseret alphabet",
        "Devanagari",
        "Devanagari Braille",
        "Dham script",
        "Dhives Akuru",
        "Digamma",
        "Ditema tsa Dinoko",
        "Doge (meme)",
        "DoggoLingo",
        "Dogri script",
        "Doi (identifier)",
        "Dongba symbols",
        "Dunging script",
        "Duployan shorthand",
        "Dutch Braille",
        "Dzongkha Braille",
        "E",
        "Early Cyrillic alphabet",
        "Eclectic shorthand",
        "Egypt",
        "Egyptian hieroglyphs",
        "Egyptology",
        "Eighteenth Dynasty of Egypt",
        "Eilat Mazar",
        "Elamite cuneiform",
        "Elbasan script",
        "Elder Futhark",
        "Elifba alphabet",
        "Elymaic",
        "Emoji",
        "Emoticon",
        "Encyclopaedia Judaica",
        "English Braille",
        "Enochian",
        "Epigraphy",
        "Ersu Shaba script",
        "Eskayan script",
        "Espanca script",
        "Esperanto Braille",
        "Estonian Braille",
        "Eta",
        "Etruscan alphabet",
        "Evenki alphabet",
        "Eveyla Akuru",
        "F",
        "Fakkham script",
        "Faroese Braille",
        "Fingilish",
        "Flag semaphore",
        "Flinders Petrie",
        "Fox language",
        "Fraktur",
        "Fraser script",
        "French Braille",
        "G",
        "Gabelsberger shorthand",
        "Gadabuursi Somali Script",
        "Gaelic type",
        "Gamma (letter)",
        "Gardiner's sign list",
        "Gardner–Salinas braille codes",
        "Ge'ez Braille",
        "Geba syllabary",
        "Georgian Braille",
        "Georgian scripts",
        "German Braille",
        "Geʽez script",
        "Ghanaian braille",
        "Ghayn",
        "Gimel",
        "Gjirokastër alphabet",
        "Glagolitic script",
        "Glyph",
        "Golmol script",
        "Gondi writing",
        "Gothic alphabet",
        "Gothic runic inscriptions",
        "Goykanadi",
        "Graffiti",
        "Grantha script",
        "Grapheme",
        "Great Lakes Algonquian syllabics",
        "Greco-Iberian alphabet",
        "Greek Braille",
        "Greek alphabet",
        "Greeklish",
        "Gregg shorthand",
        "Guarani Braille",
        "Gujarati Braille",
        "Gujarati script",
        "Gunjala Gondi script",
        "Gupta script",
        "Gurmukhi",
        "Gyaru-moji",
        "Göttinger Miszellen",
        "H",
        "Hangul",
        "Hanifi Rohingya script",
        "Hanja",
        "Hanunuo script",
        "Hathor",
        "Hatran alphabet",
        "Hawaiian Braille",
        "He (letter)",
        "Hebrew Braille",
        "Hebrew alphabet",
        "Hentaigana",
        "Heth",
        "Hieratic",
        "Hieroglyph",
        "Hieroglyphic",
        "Hilda Petrie",
        "Himmol script",
        "Hindu–Arabic numeral system",
        "Hiragana",
        "History of the alphabet",
        "History of writing",
        "Hittite cuneiform",
        "Hungarian Braille",
        "Hyksos",
        "I",
        "IConji",
        "IPA Braille",
        "ISBN (identifier)",
        "ISO 15924",
        "ISSN (identifier)",
        "Iban language",
        "Icelandic Braille",
        "Ideogram",
        "Idu script",
        "Inscriptional Pahlavi",
        "Inscriptional Parthian",
        "Insular script",
        "International Phonetic Alphabet",
        "International maritime signal flags",
        "International uniformity of braille alphabets",
        "Internet slang",
        "Inuktitut Braille",
        "Iota",
        "Irish Braille",
        "Isotype (picture language)",
        "Isthmian script",
        "Italian Braille",
        "Iñupiaq Braille",
        "J",
        "JSTOR (identifier)",
        "Japan Braille Library",
        "Japanese Braille",
        "Javanese script",
        "Jejemon",
        "Jindai moji",
        "John Darnell",
        "Jurchen script",
        "K",
        "Kadamba script",
        "Kaddare script",
        "Kaidā glyphs",
        "Kaithi",
        "Kalinga script",
        "Kana",
        "Kanji",
        "Kannada Braille",
        "Kannada script",
        "Kaomoji",
        "Kaph",
        "Kappa",
        "Karani script",
        "Katakana",
        "Kawi script",
        "Kayah Li alphabet",
        "Kazakh Braille",
        "Kharosthi",
        "Khema script",
        "Khirbet Qeiyafa",
        "Khitan large script",
        "Khitan small script",
        "Khmer Braille",
        "Khmer script",
        "Khojki script",
        "Khom Thai script",
        "Khom script (Ong Kommadam)",
        "Khudabadi script",
        "Klingon scripts",
        "Kolezhuthu",
        "Koppa (letter)",
        "Korean Braille",
        "Kpelle syllabary",
        "Ktav Ashuri",
        "Kulitan",
        "Kummol script",
        "Kurdish alphabets",
        "Kurrent",
        "Kurukh language",
        "Kvemmol script",
        "Kyrgyz Braille",
        "L",
        "Lambda",
        "Lamedh",
        "Lampung script",
        "Langdi",
        "Lao script",
        "Large seal script",
        "Late Bronze Age collapse",
        "Latin alphabet",
        "Latin script",
        "Latvian Braille",
        "Laṇḍā scripts",
        "Leet",
        "Leke script",
        "Lemma (morphology)",
        "Lepcha script",
        "Libyco-Berber alphabet",
        "Limbu script",
        "Linear B",
        "Linear Elamite",
        "List of constructed scripts",
        "List of creators of writing systems",
        "List of languages by first written accounts",
        "List of languages by writing system",
        "List of writing systems",
        "Lisu language",
        "Lithuanian Braille",
        "Litumol script",
        "Logogram",
        "Logograms",
        "Lolcat",
        "Loma language",
        "Lontara Bilang-bilang script",
        "Lontara script",
        "Louis Braille",
        "Luo script",
        "Luxembourgish Braille",
        "Lycian alphabet",
        "Lydian alphabet",
        "M",
        "Mahajani",
        "Mainland Chinese Braille",
        "Makasar script",
        "Malayalam Braille",
        "Malayalam script",
        "Malayanma",
        "Maldivian writing systems",
        "Maltese Braille",
        "Man'yōgana",
        "Manchu alphabet",
        "Mandaic alphabet",
        "Mandaic script",
        "Mandombe script",
        "Manichaean script",
        "Marchen script",
        "Marcomannic runes",
        "Martian language",
        "Maya script",
        "Medefaidrin",
        "Medieval runes",
        "Meitei script",
        "Mem",
        "Mende Kikakui script",
        "Meroitic script",
        "Merovingian script",
        "Middle Bronze Age",
        "Middle Egypt",
        "Miguxês",
        "Mixtec writing",
        "Miꞌkmaw hieroglyphic writing",
        "Mkhedruli",
        "Modi script",
        "Molodtsov alphabet",
        "Mon script",
        "Mongolian Braille",
        "Mongolian script",
        "Moon type",
        "Mountbatten Brailler",
        "Mru language",
        "Mu (letter)",
        "Muisca numerals",
        "Multani script",
        "Mundari Bani",
        "Mwangwego script",
        "Māori Braille",
        "N",
        "N'Ko script",
        "Nabataean alphabet",
        "Nandinagari",
        "National Braille Association",
        "Navajo Braille",
        "Nemeth Braille",
        "Neo-Tifinagh",
        "Nepalese scripts",
        "New Epoch Notation Painting",
        "New Tai Lue alphabet",
        "New York Point",
        "Nigerian braille",
        "Night writing",
        "Nile Delta",
        "Northeastern Iberian script",
        "Northern Sami Braille",
        "Northwest Semitic abjad",
        "Northwest Semitic languages",
        "Nsibidi",
        "Nun (letter)",
        "Nuskhuri",
        "Nwagu Aneke script",
        "Nüshu",
        "Nāgarī script",
        "O",
        "Odia Braille",
        "Odia script",
        "Ogham",
        "Ojibwe writing systems",
        "Ol Chiki script",
        "Ol Onal",
        "Old Hungarian script",
        "Old Italic script",
        "Old Italic scripts",
        "Old Mon script",
        "Old Permic script",
        "Old Persian cuneiform",
        "Old Sundanese script",
        "Old Turkic script",
        "Old Uyghur alphabet",
        "Olmec hieroglyphs",
        "Omicron",
        "Ophel pithos",
        "Optical braille recognition",
        "Oracle bone script",
        "Orly Goldwasser",
        "Osage script",
        "Osmanya script",
        "Oxhide ingot",
        "P",
        "Pachumol script",
        "Padonkaffsky jargon",
        "Pahawh Hmong",
        "Pahlavi scripts",
        "Paleo-Hebrew alphabet",
        "Paleohispanic scripts",
        "Pallava script",
        "Palmyrene alphabet",
        "Pau Cin Hau script",
        "Pazend",
        "Pe (Semitic letter)",
        "Pegon script",
        "Perforation",
        "Perkins Brailler",
        "Persian Braille",
        "Phi",
        "Philippine Braille",
        "Phoenicia",
        "Phoenician alphabet",
        "Phoenician language",
        "Pi (letter)",
        "Pictogram",
        "Pitman shorthand",
        "Polish Braille",
        "Pollard script",
        "Portuguese Braille",
        "Pr (hieroglyph)",
        "Pracalit script",
        "Proto-Berber language",
        "Proto-Canaanite alphabet",
        "Proto-Elamite script",
        "Psalter Pahlavi",
        "Pseudo-Chinese",
        "Punic alphabet",
        "Punjabi Braille",
        "Pyu script",
        "Q",
        "Qena",
        "Qoph",
        "R",
        "Ranjana script",
        "Rashi script",
        "Rebus",
        "Refreshable braille display",
        "Rejang script",
        "Rencong script",
        "Resh",
        "Rho (letter)",
        "RoboBraille",
        "Roman numerals",
        "Romanian Braille",
        "Runes",
        "Russian Braille",
        "S",
        "S'gaw Karen alphabet",
        "S2CID (identifier)",
        "SMS language",
        "Sabriye Tenberken",
        "Samaritan script",
        "Samekh",
        "Samoan Braille",
        "San (letter)",
        "Sarati",
        "Saurashtra script",
        "Sawndip",
        "Scandinavian Braille",
        "Scribal abbreviation",
        "Seal script",
        "Semi-syllabary",
        "Semitic languages",
        "Serabit el-Khadim",
        "Shan script",
        "Sharada script",
        "Shavian alphabet",
        "Shin (letter)",
        "Si5s",
        "Siddhaṃ script",
        "Sidetic language",
        "Siglas poveiras",
        "Sigma (letter)",
        "SignWriting",
        "Sign language",
        "Simplified Chinese characters",
        "Sinai Peninsula",
        "Sinhala Braille",
        "Sinhala script",
        "Sir William Matthew Flinders Petrie",
        "Slate and stylus",
        "Slovak Braille",
        "Small seal script",
        "Sogdian alphabet",
        "Solitreo",
        "Sorang Sompeng script",
        "South African braille",
        "Southeastern Iberian script",
        "Southwest Paleohispanic script",
        "Soyombo script",
        "Spanish Braille",
        "Sphinx",
        "Staveless runes",
        "Stokoe notation",
        "Sui script",
        "Sukhothai script",
        "Sundanese script",
        "Sunwar language",
        "Sylheti Nagri",
        "Syllabary",
        "Syriac alphabet",
        "Syro-Hittite states",
        "Sütterlin",
        "Sōgana",
        "T",
        "Tactile alphabet",
        "Tagbanwa script",
        "Tai Le script",
        "Tai Noi script",
        "Tai Tham script",
        "Tai Viet script",
        "Taiwanese Braille",
        "Takri script",
        "Tamil-Brahmi",
        "Tamil Braille",
        "Tamil script",
        "Tamyig script",
        "Tanchangya script",
        "Tangut script",
        "Tatar Braille",
        "Tav (letter)",
        "Taw",
        "Teeline Shorthand",
        "Telegraph code",
        "Tell es-Safi inscription",
        "Telugu Braille",
        "Telugu script",
        "Tengwar",
        "Testerian",
        "Teth",
        "Thaana",
        "Thai and Lao Braille",
        "Thai script",
        "Thakur Vishva Narain Singh",
        "Thebes, Egypt",
        "Theta",
        "Thirteenth Dynasty of Egypt",
        "Thomas Natural Shorthand",
        "Tibetan Braille",
        "Tibetan script",
        "Tifinagh",
        "Tigalari script",
        "Tirhuta script",
        "Tironian notes",
        "Tocharian script",
        "Todhri script",
        "Traditional Chinese characters",
        "Translit",
        "Tsade",
        "Turkish Braille",
        "Turquoise",
        "Twelfth Dynasty of Egypt",
        "Twentieth Dynasty of Egypt",
        "Two-cell Chinese Braille",
        "U",
        "Uchen script",
        "Ugaritic alphabet",
        "Ukrainian Braille",
        "Umê script",
        "Undeciphered writing systems",
        "Unicode",
        "Unified English Braille",
        "Upsilon",
        "Urdu Braille",
        "V",
        "Vagindra script",
        "Vai syllabary",
        "Valentin Haüy",
        "Vatteluttu",
        "Vellara alphabet",
        "Vibratese",
        "Vietnamese Braille",
        "Visible Speech",
        "Visigothic script",
        "Vithkuqi script",
        "Voiced bilabial stop",
        "Volapuk encoding",
        "Votive",
        "W",
        "Wadi",
        "Wadi el-Hol",
        "Wancho language",
        "Warang Citi",
        "Waw (letter)",
        "Welsh Braille",
        "Western Neo-Aramaic",
        "Wiktionary",
        "William Bell Wait",
        "William F. Albright",
        "Woleai script",
        "Wolof language",
        "Writing system",
        "Xi (letter)",
        "Y",
        "Yaminjeongeum",
        "Yerkish",
        "Yi script",
        "Yodh",
        "Younger Futhark",
        "Yugoslav Braille",
        "Yugtun script",
        "Z",
        "Zaghawa script",
        "Zambian Braille",
        "Zanabazar square script",
        "Zapotec script",
        "Zayin",
        "Zeta",
        "ʼPhags-pa script",
        "ʾalp",
        "ʿen",
        "Ε",
        "Ν",
        "Τ",
        "Ϟ",
        "Ϡ",
        "𐌅",
        "𐌆",
        "𐌇",
        "𐌈",
        "𐌋",
        "𐌎",
        "𐌐",
        "𐌑",
        "𐌖",
        "𐌘",
        "𐎕",
        "𐎙"
    ]
}