{"url": "https://en.wikipedia.org/wiki/Protopone", "title": "Protopone", "summary": "Protopone is an extinct genus of ants in the formicid subfamily Ponerinae described from fossils found in Europe and Asia.  There are seven described species placed into the genus, Protopone? dubia, Protopone germanica, Protopone magna, Protopone oculata, Protopone primigena, Protopone sepulta, and Protopone vetula.  Protopone is one several Lutetian Ponerinae genera.", "content": "Protopone is an extinct genus of ants in the formicid subfamily Ponerinae described from fossils found in Europe and Asia.  There are seven described species placed into the genus, Protopone? dubia, Protopone germanica, Protopone magna, Protopone oculata, Protopone primigena, Protopone sepulta, and Protopone vetula.  Protopone is one several Lutetian Ponerinae genera.\n\n\n== History and classification ==\nWhen first described, Protopone was known from a single fossil insect included in a transparent chunk of Sakhalin amber. When the fossil was described it was part of the amber collections housed in the Paleontological Institute, Russian Academy of Sciences.  The amber was recovered from fossil bearing rocks in the Sakhalin region of Eastern Russia.  At the time of description, the amber was estimated to date from the Paleocene.  Further research has revised the amber, which originates from the Lower Due Formation, to be of Middle Eocene age.  The amber fossil was first studied by paleoentomologist Gennady Dlussky of the Russian Academy of Sciences, with his 1988 type description for the species was published in  Paleontologicheskii Zhurnal.  In 2012 an additional six species were identified from compression-impression fossils preserved in layers of soft sedimentary rock.  Along with other well preserved insect fossils, the Protopone specimens were collected from layers of Lutetian Messel Formation rock in the Messel pit World Heritage Site.  The Messel formation is composed of brown coals, oil shales, and bituminous shale, which preserved numerous insects, fish, birds, reptiles, and terrestrial mammals as a notable lagerstätten.  The area is a preserved maar lake which initially formed approximately 47 million years ago as the result of volcanic explosions.At the time of description, the holotype specimens for the six Messel species were preserved in the Senckenberg Research Station Messel fossil collections. The fossils were first described by Gennady Dlussky and Sonja Wedmann in a paper on the poneromorph ants of Messel.  In the type description, Dlussky and Wedmann named the species P. ? dubia, P. germanica, P. magna, P. oculata, P. sepulta, and P. vetula.\nProtopone is one of five extinct genera from three subfamilies which have species described from Messel Formation fossils by Dlussky and Wedmann in 2012.  Three of the other genera Cephalopone, Cyrtopone, and Messelepone are also placed in Ponerinae.  The genus Casaleia is placed in Amblyoponinae, while the last genus Pseudectatomma is in Ectatomminae.\n\n\n== Description ==\nThe Protopone queens from Messel have approximate body lengths ranging between 7–26 millimetres (0.28–1.02 in).  Species have heads that are up to, but no shorter than the length of the mesosoma. The frons is over 30% of the front area on the head, while the subtriangular mandibles are no more than 70% of the length of the head.  The antennae sockets are widely placed on the head, in contrast to those seen in Pachycondyla which are close together.  On both the hind and middle tibiae there are a pair of spurs, one simple and one pectinate.  The claws of the pretarsals are simple.  The petiole is rounded with a helcium that projects of the front face of the gasteral segment.\n\n\n=== P.? dubia ===\n\nP.? dubia is known from a single partial fossil, consisting of a head, partial mesosoma and fore-wing fragments.  As such, the species name is based on the Latin \"dubia\" meaning doubtful.  The head looks to be narrower than it is long and has rounded corners and convex back edge.  The eyes are placed just to the front of the heads midline, and the clypeus has a rounded front edge.  The gena plates, below the eyes, are nearly as long as the eyes are wide. The subtriangular mandibles have many small teeth, over ten on each side.  The widely placed antennae sockets and mandibles that are about 65% of the head length preclude placement into Pachycondyla, Cephalopone, Cyrtopone, and Messelpone.  While the mandibles are similar in length to Pseudectatomma, they are more gracile and the antenna scape is shorter.  As such, the species was placed provisionally into Protopone.\n\n\n=== P. germanica ===\n\nThe species epithet was chosen by authors in recognition of Germany, the type locality.  Two specimens were used to describe P. germanica, a complete winged queen and a partial specimen of just the head.  The body length of the holotype is 13.7 mm (0.54 in) with a node shaped petiole and a mesosoma that is 1.3 times longer then the head.  The eyes are placed just back from the midpoint of the head.  The clypeus is rounded on it front edge and the frons is about 45% as wide as the head.  The antennae have a scape that reaches just past the back edge of the head, and there is an elongated segment at the antenna tip rather than a distinct club.\n\n\n=== P. magna ===\nDerived from the Latin \"magnus\", the species name magna was selected as a reference to the large size of the species.  The two described gynes are preserved in lateral view, with the holotype being mostly complete and paratype specimen missing the head.  The estimated body length for the holotype is 26 mm (1.0 in) with a 6.6 mm (0.26 in) long mesosoma.  The head is covered with a distinct sculpturing of small pits, and the front edge of the clypeus is rounded as in other Protopone species.  The antennae lack a club composed of the tip antenna segments, and the middle segments are nearly twice as long as they are thick.  The scutum, on the front of the mesonotum, is shorter than seen in any of the other species.  The petiole is just slightly higher than it is long and the front and top faces are rounded. The rear face is distinctly flattened.\n\n\n=== P. oculata ===\n\nThe notably large eyes of P. oculata are the inspiration for the species name oculata which comes from the Latin \"oculatus\" meaning eyed.  The species is mid sized for the genus, with the holotype having a body length of 14 mm (0.55 in) and a mesosoma of 4.1 mm (0.16 in).  The ovoid eyes are large and placed slightly to the front of the heads mid-length.  The mandibles are sub-triangular in outline with over 10 teeth on each side and are approximately 58% of the head length.  The petiole node is a bit shorter than it is high and has rounded faces on each side.\n\n\n=== P. primigena ===\nThe only specimen of P. primigena differs from the other species in several ways.  The scape is shorter, not extending past the rear margin of the head capsule and the eyes are located closer to the mandibles than in the other species. The estimated body length is approximately 3.5 millimetres (0.14 in) with a petiole node that has a triangular outline.\n\n\n=== P. sepulta ===\nThe mid sized species is known from a single fossil, with a body length of 16.5 mm (0.65 in), making it the second largest of the species, only being smaller than P. magna.  The species name is from the Latin \"sepultus\" meaning buried, but the authors did not elaborate on the reason for the choice. While wings are preserved with the gyne, there is little detail visible of the wing venation. The head capsule is flat along the rear margin and the corners of the rear margin are rounded. The gena are slightly longer than the eyes are wide.  The eyes are placed on or just behind the midpoint of the head. The antennae have a scape that is a little longer than that of P. primigena, extending just past the back of the head.\n\n\n=== P. vetula ===\n\nThe species name vetula is from the Latin \"vetulus\" meaning old or wizened.  With a body length of 7 mm (0.28 in) it is the second smallest species, after P. primigena.  The head is wider than it is long and has eyes placed to the front of the midpoint.  The mandible length is less than the head length. The mesosoma is 2.3 mm (0.091 in) long, 1.5 times longer than it is high.\n\n\n== References ==\n\n\n== External links ==\n Media related to Protopone at Wikimedia Commons\n Data related to Protopone at Wikispecies", "links": ["Amblyoponinae", "Animal", "Ant", "Antenna (biology)", "Arthropod", "Asia", "Bituminous shale", "Cambrian", "Carboniferous", "Casaleia", "Cephalopone", "Clypeus (arthropod anatomy)", "Compression fossil", "Cretaceous", "Cyrtopone", "Devonian", "Doi (identifier)", "Ectatomminae", "Europe", "Extinct", "Formicidae", "Fossilworks", "Frons", "Global Biodiversity Information Facility", "Gyne", "Holotype", "Hymenoptera", "Inclusion (mineral)", "Insect", "Insect morphology", "Integrated Taxonomic Information System", "Interim Register of Marine and Nonmarine Genera", "Journal of Systematic Palaeontology", "Jurassic", "Lagerstätten", "Latin", "Lutetian", "Maar", "Mesosoma", "Messel Formation", "Messel pit", "Messelepone", "Middle Eocene", "Naturmuseum Senckenberg", "Neogene", "Ordovician", "Pachycondyla", "Paleocene", "Paleogene", "Permian", "Ponerinae", "Ponerini", "Precambrian", "Pseudectatomma", "Russian Academy of Sciences", "Sedimentary", "Silurian", "Taxonomy (biology)", "Taylor & Francis", "Triassic", "Type (biology)", "Type locality (geology)", "Type species", "Wikidata", "Wikispecies", "World Heritage Site"]}