{"url": "https://en.wikipedia.org/wiki/Puxada_de_Rede", "title": "Puxada de Rede", "summary": "Puxada de Rede is a Brazilian folkloric theatrical play, seen in many capoeira performances. It is based on a traditional Brazilian legend.", "content": "Puxada de Rede is a Brazilian folkloric theatrical play, seen in many capoeira performances. It is based on a traditional Brazilian legend.\n\n\n== Plot ==\nA fisherman goes out to fish at night on a jangada, a handmade seaworthy sailing raft used by fishermen of north-eastern Brazil.  His wife has a presentiment of something wrong and tries to stop him from going fishing that night.  He goes anyway, leaving his wife crying and his kids scared.  His wife waits the whole night for him on the beach, and around 5:00am, the usual arrival time, she sees the jangada.  The fishermen have a very sad expression and some are even crying, but she does not see her husband.  The fishermen tell her that her husband has fallen off the jangada by accident.  As they start to withdraw the net, they find his body amongst the fish.  His friends carry his body on their arms, in a traditional funeral ritual on the beach.\n\n\n== Lyrics ==\nEnglish translation in italics where available.\nNO MAR\nNo mar, no mar, no mar, no mar eu ouvi cantar\n      In the sea, in the sea, in the sea, in the sea I heard singing\nNo mar, no mar, no mar minha sereia, ela é sereia\n      In the sea, in the sea, in the sea my mermaid, she is a mermaid\nMINHA JANGADA VAI SAIR P'RO MAR\nMinha jangada vai sair p'ro mar\n      My jangada is going out to sea\nVou trabalhar, meu bem querer\n      I'm going to work, my love.\nSe Deus quiser quando eu voltar do mar\n      If God wants when I return from the sea\nUm peixe bom, eu vou trazer\n      A good fish, I will bring\nMeus companheiros tambem vão voltar\n      My friends will also return\nE a Deus do céu vamos agradecer\n      and to God we will give thanks\nA REDE PUXA\nA puxa a marra marinheiro\nA rede puxa\nA puxa lá que eu puxo cá\nA rede puxa\nA puxa a marra samangolê\nA rede puxa\nPUXA A MARRA MARINHEIRO\nPuxa a marra marinheiro puxa a marra\nE olha o vento que te leva pela a barra", "links": ["Capoeira", "Folklore", "Jangada", "Play (theatre)"]}