{"url": "https://en.wikipedia.org/wiki/PZL", "title": "PZL", "summary": "PZL (Państwowe Zakłady Lotnicze - State Aviation Works) was the main Polish aerospace manufacturer of the interwar period, and a brand of their aircraft. Based in Warsaw between 1928 and 1939, PZL introduced a variety of well-regarded aircraft, most notably the PZL P.11 fighter, the PZL.23 Karaś light bomber, and the PZL.37 Łoś medium bomber.\nIn the post-war era, aerospace factories in Poland were initially run under the name WSK (Transport Equipment Manufacturing Plant), but returned to adopt PZL acronym in late 1950s. This was used as a common aircraft brand and later as a part of names of several Polish state-owned aerospace manufacturers referring to PZL traditions, and belonging to the Zjednoczenie Przemysłu Lotniczego i Silnikowego PZL - PZL Aircraft and Engine Industry Union. Among the better-known products during this period is the PZL TS-11 Iskra jet trainer and PZL-104 Wilga STOL utility aircraft.\nAfter the fall of communism in Poland in 1989, these manufacturers became separate companies, still sharing the PZL name. In the case of PZL Mielec, the abbreviation was later developed as Polskie Zakłady Lotnicze - Polish Aviation Works. Over time, most of the now-separate divisions were purchased by foreign concerns, and some continue to use PZL brand.", "content": "PZL (Państwowe Zakłady Lotnicze - State Aviation Works) was the main Polish aerospace manufacturer of the interwar period, and a brand of their aircraft. Based in Warsaw between 1928 and 1939, PZL introduced a variety of well-regarded aircraft, most notably the PZL P.11 fighter, the PZL.23 Karaś light bomber, and the PZL.37 Łoś medium bomber.\nIn the post-war era, aerospace factories in Poland were initially run under the name WSK (Transport Equipment Manufacturing Plant), but returned to adopt PZL acronym in late 1950s. This was used as a common aircraft brand and later as a part of names of several Polish state-owned aerospace manufacturers referring to PZL traditions, and belonging to the Zjednoczenie Przemysłu Lotniczego i Silnikowego PZL - PZL Aircraft and Engine Industry Union. Among the better-known products during this period is the PZL TS-11 Iskra jet trainer and PZL-104 Wilga STOL utility aircraft.\nAfter the fall of communism in Poland in 1989, these manufacturers became separate companies, still sharing the PZL name. In the case of PZL Mielec, the abbreviation was later developed as Polskie Zakłady Lotnicze - Polish Aviation Works. Over time, most of the now-separate divisions were purchased by foreign concerns, and some continue to use PZL brand.\n\n\n== History ==\n\n\n=== PZL (1928-1939) ===\n\nThe PZL - Państwowe Zakłady Lotnicze (State Aviation Works) was founded in Warsaw in 1928 as a state-owned company, and was based on the earlier CWL (Centralne Warsztaty Lotnicze) - Central Aviation Workshops. First to be produced was a licensed version of a French fighter, the Wibault 70, but from then on the company produced exclusively its own designs. In the next decade a talented designer Zygmunt Puławski designed a series of high-wing, all-metal modern fighters: PZL P.1, P.6, P.7 and P.11. The latter two types were used as basic fighters in the Polish Air Force from 1933 onwards. The last variant, PZL P.24, developed after Puławski's death in an air crash, was exported to four countries. PZL also mass-produced a light bomber, PZL.23 Karaś, and a modern medium bomber, PZL.37 Łoś, as well as building small numbers of sport aircraft (PZL.5, PZL.19, PZL.26), and liaison aircraft (PZL Ł.2); and developing prototypes of passenger aircraft. In the late 1930s the company also developed several prototypes of more modern fighters and bombers — and a passenger airliner, the PZL.44 Wicher. However, World War II prevented these aircraft from entering production. PZL was the largest Polish pre-war aircraft manufacturer.\nIn 1934, the main factory in Warsaw was named PZL WP-1 (Wytwórnia Płatowców 1 - Airframe Works 1) in the Okęcie district of Warsaw. A new division PZL WP-2 was built in Mielec in 1938-1939, but production was only just starting there at the outbreak of World War II. An engine factory division, PZL WS-1 in Warsaw-Okęcie (Wytwórnia Silników - Engine Works 1), produced mostly licensed versions of British Bristol engines, such as the Bristol Pegasus and the Bristol Mercury. The WS-1 factory was former  Polskie Zakłady Skody, the Polish division of Skoda Works, and was nationalized and renamed in 1936. In 1937-1939 a new engine division, PZL WS-2, was built in Rzeszów.\n\n\n=== Situation post-war ===\nDuring World War II and the five-year German occupation, all Polish aviation industry was taken over by German firms, and as a result, almost completely destroyed. By the end of the war, all factories were either ruined or robbed of tooling. Despite it, from 1944 there were carried out efforts to design new aircraft, in primitive conditions (first of all, in the LWD). No engines nor suitable production facilities were available at first.  The post-war communist government of Poland wanted to break all connections with pre-war Poland: from the late 1940s the name PZL ceased to be used, and new aerospace factories were named WSK (Wytwórnia Sprzętu Komunikacyjnego - Transport Equipment Manufacturing Plant). Under the Soviet-influenced, centrally planned economy, all indigenous projects were abandoned, in a favour of manufacturing Soviet-licensed aircraft. No own designs were produced for a decade, and only in late 1950s, after the stalinist period (1956), did the PZL brand return to designing new aircraft.\nThe ZPLiS PZL - Zjednoczenie Przemysłu Lotniczego i Silnikowego PZL - PZL Aircraft and Engine Industry Union, which grouped all state-owned aerospace industry factories, was created in following years, but it only enjoyed some economic autonomy from 1973 onwards. It consisted of 19 factories, a research institute, and the Pezetel Foreign Trade Center - CHZ Pezetel, which represented all the Polish aerospace industry abroad (Pezetel being the pronunciation of an abbreviation PZL in Polish). Consequently, in the 1970s some WSK factories also introduced the PZL abbreviation to their names. After the fall of communism in Poland in 1989, all manufacturers became separate companies, initially state-owned, still sharing the PZL name.\n\n\n== Locations ==\n\n\n=== PZL \"Warszawa-Okęcie\" ===\nThe main factory PZL WP-1 in Warsaw was destroyed during World War II, mostly during the German evacuation in 1944. In 1946, the CSS construction bureau (Centralne Studium Samolotów - Central Aircraft Study) was set up there. As the factory was rebuilt, it was renamed in 1950 as the WSK Nr.4, and in 1956 as the WSK-Okęcie.It first produced licensed versions of Soviet types and aircraft developed by other Polish companies. From 1958 onwards it started to produce its own designs under the PZL brand, starting with the PZL-101 Gawron. The factory developed mainly light sports, trainer and utility aircraft. An attempt of producing and airliner PZL MD-12 was unsuccessful. The best-known designs are the PZL-104 Wilga utility aircraft, which was produced in larger numbers than any other Polish-designed aircraft; and the PZL-106 Kruk agricultural aircraft. During the 1970s the factory adopted the name WSK \"PZL Warszawa-Okęcie\", which after the fall of the communist system was changed in 1989 to PZL Warszawa-Okęcie. In 2001 the factory was bought by the Spanish company EADS CASA (now part of Airbus Defence and Space) and since then has been known as EADS PZL Warszawa-Okęcie SA.\n\n\n=== WSK \"PZL-Mielec\" / PZL Mielec ===\n\nThe PZL WP2 factory in Mielec became a part of Heinkel during the German occupation of Poland, and manufactured parts for German aircraft. After the war the factory was named first PZL No.1 works, then from 1949 WSK-Mielec, and later WSK \"PZL-Mielec\". It became the biggest post-war Polish aircraft producer. It manufactured mostly licensed Soviet types, such as the Antonov An-2 transport biplane and early jet fighters: Mikoyan-Gurevich MiG-15 (as Lim-1 and Lim-2) and Mikoyan-Gurevich MiG-17 (as Lim-5 and Lim-6). It also produced the Polish-designed TS-8 Bies piston trainer and TS-11 Iskra jet trainer, and the PZL M-15 Belphegor the world's only jet agricultural aircraft. Large numbers of aircraft were exported abroad, mostly to the USSR. From the 1970s onward it produced mostly its own developments of licensed civil aircraft, the best known are the PZL M-18 Dromader agricultural aircraft, which was exported to numerous countries, and the PZL M-28 Skytruck/Bryza light transport aircraft. In 1998 the state factory WSK PZL-Mielec went bankrupt and was changed into the state-owned Polskie Zakłady Lotnicze Sp.z o.o. (Polish Aviation Works) (PZL Mielec).\nOn March 16, 2007, PZL Mielec was purchased by the Sikorsky Aircraft Corporation, a unit of United Technologies Corporation (UTX). It still produces M-18 and M-28 aircraft.\n\n\n=== WSK \"PZL-Świdnik\" ===\n\nIn 1951 a third national aerospace factory, WSK-Świdnik, was built in Świdnik, and in 1957 it was renamed to WSK \"PZL-Świdnik\". Since 1956 it has become one of the world's major helicopter manufacturers, producing helicopters under Soviet licences, starting from the SM-1 (Mil Mi-1). Świdnik was the main producer of the Mi-1 and the exclusive producer of the Mil Mi-2, which was widely used throughout the world. Since the late 1980s, Świdnik has been producing a Polish-designed medium helicopter PZL W-3 Sokół. It also produces a light helicopter, the PZL SW-4 Puszczyk. After 1991 the state factory became a state-owned corporation (WSK \"PZL-Świdnik\" SA). It also produced the SZD-30 Pirat, PW-5 and PW-6 gliders and cooperates widely with other nations' manufacturers, e.g., in the manufacture of Agusta A109 fuselages.\nIn early 2010 the factory was acquired by AgustaWestland.\n\n\n=== PZL-Bielsko / Allstar PZL Glider ===\nGlider manufacturer SZD (Szybowcowy Zakład Doświadczalny - Glider Experimental Works) was created in Bielsko-Biała in 1948. The company grew and had production plants in additional locations, during this process it was renamed several times until it got its name PZL-Bielsko in the 1990s. It was one of the biggest sailplane factories and exported its gliders world-wide.In 2002 Allstar PZL Glider Sp. z o.o. acquired the production plant in Bielsko-Biala and the Type Certificates of the following SZD sailplanes: SZD-59-1 Acro - a single-seater for aerobatics and cross-country, SZD-54-2 Perkoz – a double-seater training-glider for aerobatic and cross-country, SZD-55-1 Nexus – a single seater glider of the standard class,  SZD-51-1 Junior - single seater training glider of the club class, SZD-50 Puchacz - double-seater training-glider and SZD-48-3 Jantar Standard 3 – single-seater glider of standard class.\nThe company further manufactures and develops the first four SZD-glider models. Allstar PZL Glider is also producing and distributing spare parts for all six types mentioned above.\nOn the occasion of the air show “Aero” 2019 in Friedrichshafen Allstar PZL Glider has presented its proof-of-concept of a new electric propulsion system for the SZD-55 Nexus. The electric sustainer, developed by the company and named “Allstar-e-motion”, is right now in the advanced certification process. The system will also be available as an assembly kit for retrofitting of existing SZD-55s.\n\n\n=== WSK-Rzeszów ===\nThe engine division WS-2 of the PZL was built in Rzeszów in 1937-1939. After the war it still bore a name PZL (Państwowe Zakłady Lotnicze) until 1951, when it was renamed WSK-Rzeszów. From 1949 it manufactured Soviet-licensed M-11 engines, later, among others, ASh-62IR, turboshaft engines GTD-350 and Polish jet engines SO-1. The factory was bought by United Technologies in 2002 and changed its name to Pratt & Whitney Rzeszów in 2015.\n\n\n=== WSK \"PZL-Kalisz\" ===\nIn 1952 the engine manufacturer WSK-Kalisz was created. It manufactured mostly Soviet-licensed engines, first piston (the Shvetsov ASh-82 and the Ivchenko AI-14) and then jet (the Klimov VK-1). It also produced Polish piston engines, such as the WN-3, and other equipment. In October 1996 it was renamed WSK \"PZL-Kalisz\" and became a corporation (SA).\n\n\n=== WSK \"PZL Warszawa II\" ===\nWSK Warszawa II was created in 1952 in Warsaw as a manufacturer of aircraft parts and military equipment parts. In 1995 it was changed from a state factory to a corporation WSK \"PZL Warszawa II\" SA.\n\n\n== Aircraft ==\n\n\n=== Other types of aircraft ===\nPZL Krosno KR-03 Puchatek - glider\n\n\n=== Engines ===\nPZL-3\n\n\n== See also ==\nGliders built at PZL-Bielsko\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Bibliography ===\n\n\n== External links ==\nSwidnik PZL branch home page\nWarsaw EADS PZL \"Warszawa-Okęcie\" home page\nPZL Mielec home page\nAllstar PZL Glider home page\nWeb design scotland", "links": ["Aerospace", "Aerospace manufacturer", "Agricultural aircraft", "AgustaWestland", "Agusta A109", "Airbus Defence and Space", "Allstar SZD-54 Perkoz", "Allstar SZD-59", "Antonov An-2", "Bielsko-Biała", "Brand", "Bristol Mercury", "Bristol Pegasus", "CSS-10 (airplane)", "CSS-11", "CSS-12", "CSS-13", "Centralne Warsztaty Lotnicze", "Communist", "Diana Sailplanes Diana", "EADS CASA", "Fall of communism in Poland", "Fighter aircraft", "Flight International", "Glider (sailplane)", "Heinkel", "Helicopter", "Interwar period", "Ivchenko AI-14", "Jerzy Dąbrowski", "Klimov GTD-350", "Klimov VK-1", "LWD Junak", "LWD Szpak", "LWS-6 Żubr", "Liaison aircraft", "Light bomber", "Lim-6", "Limited liability company", "List of gliders", "Lotnicze Warsztaty Doświadczalne", "Medium bomber", "Mieczysław Miłosz", "Mielec", "Mikoyan-Gurevich MiG-15", "Mikoyan-Gurevich MiG-17", "Mil Mi-1", "Mil Mi-2", "Okęcie", "PZL-101 Gawron", "PZL-102 Kos", "PZL-104 Wilga", "PZL-105 Flaming", "PZL-106 Kruk", "PZL-110 Koliber", "PZL-112 Junior", "PZL-126 Mrowka", "PZL-126 Mrówka", "PZL-130 Orlik", "PZL-230 Skorpion", "PZL-3", "PZL-Mielec Lim-6", "PZL-Mielec M-18 Dromader", "PZL-Świdnik", "PZL.12", "PZL.16", "PZL.19", "PZL.23 Karaś", "PZL.26", "PZL.27", "PZL.3", "PZL.30 Żubr", "PZL.37 Łoś", "PZL.38 Wilk", "PZL.39", "PZL.4", "PZL.43", "PZL.44 Wicher", "PZL.45 Sokół", "PZL.46 Sum", "PZL.48 Lampart", "PZL.49 Miś", "PZL.5", "PZL.50 Jastrząb", "PZL.53 Jastrząb II", "PZL.54 Ryś", "PZL.55", "PZL.56 Kania", "PZL An-28", "PZL Bielsko SZD-30", "PZL Bielsko SZD-34", "PZL Bielsko SZD-43", "PZL Bielsko SZD-50 Puchacz", "PZL Bielsko SZD-52", "PZL Bielsko SZD-55", "PZL I-22 Iryda", "PZL I-23 Manager", "PZL Kania", "PZL Krosno KR-03 Puchatek", "PZL M-15 Belphegor", "PZL M-17", "PZL M-18 Dromader", "PZL M-2", "PZL M-20 Mewa", "PZL M-21 Dromader Mini", "PZL M-24 Dromader Super", "PZL M-26 Iskierka", "PZL M-28", "PZL M-28 Skytruck", "PZL M-3 Pliszka", "PZL M-4 Tarpan", "PZL M12", "PZL M14", "PZL M16", "PZL M19", "PZL M25 Dromader Micro", "PZL M26 Iskierka", "PZL M28 Skytruck", "PZL M30", "PZL M32", "PZL M34", "PZL M7", "PZL M8 Pelikan", "PZL MD-12", "PZL Mi-2", "PZL Mielec", "PZL P.1", "PZL P.11", "PZL P.24", "PZL P.6", "PZL P.7", "PZL P.8", "PZL PW-5", "PZL PW-6", "PZL S-1", "PZL S-4 Kania", "PZL S-4 Kania 2", "PZL SM-1", "PZL SM-2", "PZL SM-4 Łątka", "PZL SW-4 Puszczyk", "PZL SZD-30 Pirat", "PZL TS-11 Iskra", "PZL TS-16 Grot", "PZL TS-8 Bies", "PZL W-3 Sokół", "PZL Ł.2", "PZL Świdnik", "Planned economy", "Podlaska Wytwórnia Samolotów", "Poland", "Polikarpov Po-2", "Polish Air Force", "Polish Armed Forces", "Polish złoty", "Politechnika Warszawska PW-5", "Politechnika Warszawska PW-6", "Rzeszów", "S.A. (corporation)", "SOCATA Rallye family", "STOL", "SZD-10 Czapla", "SZD-11 Albatros", "SZD-12 Mucha 100", "SZD-13 Wampir", "SZD-14x Jaskółka M", "SZD-15 Sroka", "SZD-17X Jaskółka L", "SZD-18 Czajka", "SZD-19 Zefir", "SZD-20X Wampir II", "SZD-21 Kobuz", "SZD-22 Mucha Standard", "SZD-24 Foka", "SZD-25A Lis", "SZD-26 Wilk", "SZD-27", "SZD-28", "SZD-35 Bekas", "SZD-36 Cobra 15", "SZD-38 Jantar 1", "SZD-40x Halny", "SZD-41 Jantar Standard", "SZD-42 Jantar 2", "SZD-45 Ogar", "SZD-48 Jantar Standard 2/3", "SZD-49 Jantar K", "SZD-51 Junior", "SZD-6X Nietoperz", "SZD-7 Osa", "SZD-8 Jaskółka", "SZD-9 Bocian", "SZD-C Żuraw", "Shvetsov ASh-62", "Shvetsov ASh-82", "Sikorsky Aircraft Corporation", "Skoda Works", "Stalinism", "Stanisław Prauss (engineer)", "Subsidiary", "Szybowcowy Zakład Doświadczalny", "TS-11 Iskra", "TS-8 Bies", "Tadeusz Sołtyk", "United Technologies", "United Technologies Corporation", "VIAF (identifier)", "WSK SO-3", "WSK WN-3", "Warsaw", "Wibault 70", "Wiesław Stępniewski", "World War II", "Wsiewołod Jakimiuk", "Yakovlev Yak-12", "Zygmunt Puławski", "Świdnik"]}