{
    "url": "https://en.wikipedia.org/wiki/Quercus_sinuata_var._breviloba",
    "title": "Quercus sinuata var. breviloba",
    "summary": "Quercus sinuata var. breviloba, commonly called Bigelow oak or Bigelow's oak, is a variety of Quercus sinuata, a species of oak tree that grows in parts of the southern United States and northeastern Mexico. Common names for this taxon are shallow-lobed oak, white shin oak, scaly-bark oak, limestone Durand oak, and shortlobe oak. The less specific common name bastard oak may refer to either of the two varieties of Quercus sinuata, var. sinuata and var. breviloba. Other common names include scrub oak or shin oak, but these names may refer to a number of other low growing, clump forming oak species, subspecies or varieties. For clear differentiation in common reference, American Forests uses Durand Oak to mean Quercus sinuata var. sinuata and Bigelow oak to mean Quercus sinuata var. breviloba, a shrubby variety of Quercus sinuata distinguished in part by its habit of forming clonal colonies in parts of its range.",
    "content": "Quercus sinuata var. breviloba, commonly called Bigelow oak or Bigelow's oak, is a variety of Quercus sinuata, a species of oak tree that grows in parts of the southern United States and northeastern Mexico. Common names for this taxon are shallow-lobed oak, white shin oak, scaly-bark oak, limestone Durand oak, and shortlobe oak. The less specific common name bastard oak may refer to either of the two varieties of Quercus sinuata, var. sinuata and var. breviloba. Other common names include scrub oak or shin oak, but these names may refer to a number of other low growing, clump forming oak species, subspecies or varieties. For clear differentiation in common reference, American Forests uses Durand Oak to mean Quercus sinuata var. sinuata and Bigelow oak to mean Quercus sinuata var. breviloba, a shrubby variety of Quercus sinuata distinguished in part by its habit of forming clonal colonies in parts of its range.\n\n\n== Description ==\nThe Bigelow oak grows to a height of 12 metres (39 feet), with a diameter at breast height of 81 centimetres (32 inches) and gray flaking bark. The leaves range from 3–8 cm (1+1⁄4–3+1⁄4 in) long by 2–4.5 cm wide, with shapes Duncan & Duncan describe as  \"narrowly obovate to oblanceolate or narrowly elliptic\", with \"broadly rounded and bristleless\" tips. The twigs are glabrous or may have sporadic hairs. Per Duncan & Duncan, the leaf undersides have \"numerous minute sessile stelate hairs with horizontally spreading rays\".\n\n\n=== Historical description ===\nJohn Torrey wrote the first published description of what came to be called Bigelow oak:\nQUERCUS OBTUSIFOLIA, var.? BREVILOBA: foliis subcoreaceis obovato oblongis basi cuneatis, lobis brevibus obtusis supra viridibus subtus pallidis pubescentibus; fructibus sessilibus solitariis vel geminis, cupula depressa hemispherica, glande oblongo-ovato obtusa.Quercus obtusifolia var.? breviloba: Almost leathery leaves, rectangular or shaped like a section through the long axis of an egg, attached at the narrower end and with a length to width ratio between 3:2 and 2:1, tapering to a wedge shape at the base. Lobes of leaves obtusely shallow and green on the upper surface. Pale on the underside and covered with short, soft hairs. Stalkless acorns, solitary or in pairs. Cupule shaped like a hemisphere that has been flattened as if pressed down from the top. Acorns, somewhat rectangular or egg shaped with a length to width ratio between 3:2 and 2:1, attached at the broader end and blunted or broadly rounded at the tip, forming an angle greater than ninety degrees at the apex.\n\n\n== Taxonomy ==\n\nJohn Milton Bigelow collected and pressed the first specimen of Bigelow oak in a mountain gorge near Howard Springs (30°28′31″N 101°28′31″W) in what is now Crockett County, Texas. Bigelow's botanical collection focused on Texas, Arizona, New Mexico and California.Synonymous names for this taxon include Quercus durandii var. breviloba (Torr.) Palmer and Q. sinuata var. breviloba (Torr.) C. H. Mull. Because it was given by Samuel Botsford Buckley to name some taxa he believed to be varieties but are now understood to be separate species, the term \"durandii\" is currently regarded as \"nomen confusum.\"Quercus sinuata, first described by Thomas Walter in Flora Caroliniana in 1788, claims no subspecies and only two varieties, var. sinuata and var. breviloba. Var. breviloba was first described as Q. obtusifolia var. breviloba by John Torrey in 1859. In order of chronology, subsequent reclassifications of Quercus sinuata var. breviloba are: \n\nQ.annulata Buckl.1861\nQ.undulata var. obtusifolia A.DC 1864\nQ.sansabeana Buckl. ex M.J.Young 1873\nQ.undulata var. breviloba (Torr.) Engelm. 1877\nQ.durandii var. sansabeana (Buckl. ex M.J.Young) Buckl. 1883\nQ.breviloba (Torr.) Sarg. 1895\nQ.pseudocrispata A.Camus 1939\nQ. sinuata var. breviloba (Torr.) C.H.Muller 1944 Journal of the Arnold Arboretum. 25: 439\nQ.durandii var. breviloba (Torr.) Palmer 1945\nQ.sinuata subsp breviloba (Torr.) E.Murray 1983\n\n\n=== Etymology ===\n\nQuercus sinuata var. breviloba (Latin quercus, \"oak\" + sinuata, species epithet from nominative feminine singular of Latin sinuatus, participle of sinuo, \"to bend or bow out in curves\" + var. (variety or varietas) breviloba, a combination of Latin brevis, \"short,\" and loba, \"lobed\") is an infraspecific scientific name inspired by the shallowly wavy leaf margins characteristic of the taxon. \nThe common English word \"oak,\" designating a shrub or tree of the genus Quercus, descends from the Proto-Germanic *eiks through the Old English ac, \"oak tree,\" and the Middle English oke. Bigelow oak takes its name from John Milton Bigelow.\nApplied to the thickets produced by the clonal habits of some North American oaks, a French word for \"oak grove\" or \"a place where oaks grow,\" chênerie, gave rise to the English \"shinnery.\" The word \"shin\" in \"shin oak\" thus becomes a back-formation from the French rather than an allusion to the low \"shin high\" growth habit of the shinnery.\n\n\n== Distribution ==\nThe principal distribution of Quercus sinuata var. breviloba is in central Texas and the northern Mexico states of Coahuila, Nuevo León, and Tamaulipas. Disjunct populations occur in the Arbuckle Mountains of south central Oklahoma and, approximately 240 kilometres (150 miles) to the northwest, on a low hill in Custer County just north of Foss, Oklahoma.\n\n\n== Ecology ==\nQuercus sinuata var. breviloba hybridizes with Quercus stellata to yield Quercus × macnabiana nothovar. mahonii (E.J. Palmer) Govaerts (1998).Apart from thicker acorn cups, longer nuts and smaller leaves, Quercus sinuata var. breviloba is further differentiated from var. sinuata by its clonal habit. Although some individuals develop in tree-form, other individuals of Quercus sinuata var. breviloba grow as clonal colonies. Clonal colonies of Quecus sinuata var. breviloba are believed to be more likely to occur where soils are light or roots have been disturbed. A clonal colony of var. breviloba originates from a single zygote that matures into a viable acorn. Following germination, the free-living individual plant grows vegetatively by the production of ramets. A clonal colony or genet of Quercus sinuata var. breviloba appears as thickets of ramets that may grow as high as five meters from a single extensive underground root system. The clustered stems of a clonal individual may cover large geographical expanses, creating the appearance of many individual small trees or shrubs. The genetic uniformity of the ramets identifies the colony as a singular genetic individual. Fragmentation may result in parts of the colony becoming geographically isolated from the main colony, but these fragments do not create new genets. They remain constituents of the original genet. Consequently, a clonal individual of var. breviloba may exist in more than one place.\n\n\n=== Phytosociology ===\n\n\n==== Associations ====\n\n\n===== Forest & woodland =====\n\n\n===== Shrub & herb vegetation =====\n\n\n== National champion ==\nThe largest known Bigelow oak in the United States appeared on the National Register of Champion Trees in 2017. Located in Travis, Texas, the national champion specimen of Quercus sinuata var. breviloba was nominated in 2007 by Eric Beckers and Jim Houser and crowned on May 12, 2017, when it was last measured. By that time, the champion tree had attained a trunk circumference of 3.1 m (124 in), a height of 14 m (46 ft) and a crown spread of 24 m (78 ft). The American Forests formula for assigning point scores to nominated trees, Trunk Circumference (in inches) + Height (in feet) + 1/4 Average Crown Spread (in feet), resulted in an overall score of 190 points.\n\n\n== References ==\n\n\n== External links ==\nQuercus sinuata var. breviloba in Flora of North America @ efloras.org\nhttps://www.cpp.edu/~larryblakely/whoname/who_bigelow.htm",
    "links": [
        "Agricultural Research Service",
        "Aimée Antoinette Camus",
        "Alphonse Pyramus de Candolle",
        "American Forests",
        "Arbuckle Mountains",
        "Arnold Arboretum",
        "Athens, Georgia",
        "Augustus Guy de Vaudricourt",
        "Back-formation",
        "Bark (botany)",
        "Binomial nomenclature",
        "Charles Sprague Sargent",
        "Clonal colony",
        "Coahuila",
        "Cornelius Herman Muller",
        "Crockett County, Texas",
        "Custer County, Oklahoma",
        "Devils River (Texas)",
        "Diameter at breast height",
        "Disjunct distribution",
        "Doi (identifier)",
        "Edward Palmer (botanist)",
        "Eudicots",
        "Fagaceae",
        "Fagales",
        "Flora Caroliniana",
        "Flora of North America",
        "Flowering plant",
        "Foss, Oklahoma",
        "Fragmentation (reproduction)",
        "Genet (biology)",
        "Germplasm Resources Information Network",
        "Glabrous (botany)",
        "Global Biodiversity Information Facility",
        "Harvard University Herbaria",
        "INaturalist",
        "ISBN (identifier)",
        "ISSN (identifier)",
        "Infraspecific name",
        "Integrated Taxonomic Information System",
        "Interim Register of Marine and Nonmarine Genera",
        "International Plant Names Index",
        "James David Smillie",
        "John Milton Bigelow",
        "John Torrey",
        "Latin",
        "Leaf margins",
        "Leaf shape",
        "Leaves",
        "Maude Jeannie Young",
        "Mexico",
        "Missouri Botanical Garden",
        "National Center for Biotechnology Information",
        "National Register of Champion Trees",
        "Natural Resources Conservation Service",
        "Nuevo León",
        "Oak",
        "Oklahoma",
        "Pecos River",
        "Plant",
        "Plants of the World Online",
        "Quercus durandii",
        "Quercus sinuata",
        "Quercus sinuata var. sinuata",
        "Quercus stellata",
        "Quercus × macnabiana",
        "Rosids",
        "Samuel Botsford Buckley",
        "Scrub oak",
        "Sessility (botany)",
        "Shin oak",
        "Species",
        "Tamaulipas",
        "Taxon",
        "Taxonomy (biology)",
        "Texas",
        "The Plant List",
        "Thomas Walter (botanist)",
        "Travis, Texas",
        "Tree",
        "Trinomial nomenclature",
        "Tropicos",
        "Twig",
        "United States",
        "United States Department of Agriculture",
        "United States and Mexican Boundary Survey",
        "University of Georgia Press",
        "Variety (botany)",
        "Vascular plant",
        "Wikidata",
        "World Checklist of Selected Plant Families",
        "World Flora Online"
    ]
}