{"url": "https://en.wikipedia.org/wiki/Revolt_of_Ghent_(1449%E2%80%931453)", "title": "Revolt of Ghent (1449–1453)", "summary": "The revolt of Ghent was a rebellion by the city of Ghent against the Burgundian State. It lasted from 1449 to 1453. The rebellion was eventually suppressed by the Burgundians.", "content": "The revolt of Ghent was a rebellion by the city of Ghent against the Burgundian State. It lasted from 1449 to 1453. The rebellion was eventually suppressed by the Burgundians.\n\n\n== Prior events ==\nAfter their efforts in the Battle of the Golden Spurs (1302), the guilds demanded and received the so-called small \"Nering\": participation in the rule of the Flemish cities, something which was not an uncommon result in the wars and battles involving the low countries. In Ghent, a relative equilibrium was achieved between 1360 and 1380, where the schepenen formed a coalition called the Great council of Ghent. The council had three members; one was chosen by the poorters (a type of citizenship), one was chosen by the influential guild of weavers (Flanders had become rich because of its cloth production), and one was chosen by the smaller guilds. This trio was called the Rule of the Three Council Members.\nFrom around 1430, Philip the Good strove for a return of the situation before the Guldensporenslag; the influence of the guilds, especially those with arch-deacons (in the Low countries, Deacon was also used to denote the leaders of guilds), was in conflict with the Charter of Senlis (1301) according to Philip. The Ghent city government based its defense against Philip's claims on customs and old privileges from the 12th and 13th century, before the Charter of Senlis had been signed. To enforce his attempts at gaining control over the appointment of city officials, Philip the Good also searched for a reliable source of income. This he found in the rich Flemish cities, where he raised indirect taxes. Until then he had been forced to rely on requests for individual taxes (called beden), which could be refused by the city government.\n\n\n== Causes ==\n\nDuring his visit to Ghent in January 1447, Philip proposed a semi-permanent tax on salt, after the French example of the Gabelle. Later he proposed a similar tax on flour, which would be collected by ducal officials. Salt at that time was very important as it was the only way to preserve food for long periods of time. Philip had prepared a speech in Dutch, the principal language of the Council, and the deacons of some of the guilds were consulted or bribed. The city government of Ghent refused to give in. After two years of negotiation, the taxes were rejected. Wanting to avoid further humiliation, Philip decided not to propose the taxes to other large Flemish cities. Philip accused the deacons of perjury and removed them from the Council. In reaction, Ghent proposed to replace them with outspoken opponents of the Duke. Philip increased the pressure with measures such as recalling the bailiff twice, bringing all judicial procedures in the city to a halt.\nThe conflict escalated, and on 28 October 1451, the guilds proclaimed a general strike, and took up arms. In December Biervliet was taken. In Ghent, a revolutionary rule of an assembly of the people was formed. Opponents of the revolt, who probably realised that their city could not win, were killed. This way Ghent lost the support of the councils of the other cities who saw their own power threatened. Only Ninove kept supporting Ghent, because it was economically dependent on the city.\n\n\n== War ==\nOn Friday, 31 May 1452, Philip the Good declared war on Ghent. A month earlier, from April 1452, the Ghent city government was forced to take military actions to secure supplies from the local region. They marched along the Scheldt river to Oudenaarde, Spiere and Helkijn, and along the Dender to Aalst and Geraardsbergen. Several strategic locations were taken and occupied by Ghent, amongst which a bridge of the Scheldt at Spiere, and the castles of:\n\nPoeke, west of Ghent, near Aalter, halfway to Bruges.\nSchendelbeke, along the Dender at Geraardsbergen, south of Ghent.\nGavere, along the Scheldt between Ghent and Oudenaarde where the Ghent garrison of 50 men was supported by 16 English mercenaries.At the siege of Oudenaarde, which lasted 12 to 13 days, the army of Ghent used one of the largest artillery bombardments to take place in Europe at the time, but the Burgundian garrison of the city, under the leadership of Simon de Lalaing, was able to withstand the attack. Geraardsbergen, where the Burgundian main force was located, also withstood a siege. The Burgundian main force was even able to unite with an army led by John of Burgundy, that marched from Seclin to relieve the sieges of Spiere and Helkijn on Friday 21 April, and relieved the siege of Oudenaarde on Monday 24 April. The forces of Ghent were forced to retreat, leaving behind their artillery on the banks of the Scheldt river. From 1 to 15 May Ghent was bombarded by the Burgundians, who eventually pulled back to Aalst, Dendermonde, and Oudenaarde.\nDuring the constant skirmishes, Philip's favorite illegitimate son, Corneille of Burgundy was killed at the Battle of Bazel on 14 June 1452.\n\nIn July the Burgundians took the upper hand; they had amongst others taken control of the land east of Ghent, and secured the neutrality of the other cities. King Charles VII of France negotiated a six-week truce between the two parties. Philip the Good strengthened his garrisons at Aalst, Dendermonde, Oudenaarde, and Kortrijk, after which his army pulled back to France for the winter. During the entire winter the garrisons, as well as the whole Flemish region, were pillaged and plundered by troops from Ghent without intervention from Philip the Good. Ghent troops were nearly able to blow up the entire Burgundian winter supply of gunpowder in Lille, but an observant guard extinguished the fuse in time.\nPhilip attempted to negotiate a peace because Ghent, a rich city, was very valuable to him, but Ghent refused any further negotiations. Halfway through 1453, Philip began a decisive military campaign that started on 18 June 1453. While a fleet moved up the Scheldt river from Sluis and Antwerp, Philip himself travelled from Lille in order to take the smaller Ghent possessions before marching on Ghent itself. On 27 June 1453, Schendelbeke was taken after two days of heavy artillery bombardment. After that the Poeke Castle was reduced to rubble from 2 to 5 July, though a prominent Knight of the Golden Fleece, Jacques de Lalaing, was killed. After every victory, all captured troops from Ghent were hanged and strangled; in Schendelbeke, 104 were killed. On 18 July, Burgundian troops reached the Gavere castle, the last bastion before the city of Ghent. At this castle the decisive battle was fought.\nAfter an artillery bombardment lasting five days, the English mercenary captain John Fox and his soldiers escaped from the castle. They were wearing Burgundian Crosses (confused with Saint Andrew's Cross by some) and knew the poorly chosen Burgundian password: Burgundy. They reached Ghent on Monday 23 July around 5 o'clock in the morning. In the resulting panic in the city, a group of 25,000 men 'volunteered' (under threat of being hanged) to relieve Gavere castle. The Burgundians, however, were well prepared for such an attempt. They chose the fields between Semmerzake and Gavere as the battlefield, where most troops had hidden themselves in the wooded valley of the Leebeek. When, at the first confrontation, the Ghent troops witnessed John Fox and his mercenaries defect to the Burgundian side, they realised they had been betrayed.\nPhilip ordered an artillery barrage, and the Ghent army responded. However, at this critical moment a Ghent cannoneer accidentally dropped his lighted match in a gunpowder barrel, upon which everyone nearby ran away. The Ghent army panicked at seeing so many people flee, after which the Ghent militia was destroyed in the ensuing battle. 16,000 to 20,000 people died. Only the desperate resistance of 1,000 militia prevented Philip the Good from marching straight to Ghent; Charles the Bold charged the Ghent army with his knights and delivered his father, who had personally entered the fight and was in a difficult position.\nWhen the remains of the fleeing army reached Ghent, the city decided to surrender without any further resistance, an outcome that pleased Philip. The humiliating Peace of Gavere ended the revolt of Ghent. The peace was also a definitive step towards the centralisation of the Burgundian control, at the cost of the power of the cities. Philip the Good's summer campaign had also reinforced the establishment of modern gunpowder artillery as a decisive factor in early modern battles.\nFor the whole duration of the revolt, Philip the Good expected and waited for the arrival of around 800 - 1,000 soldiers from the Duchy of Luxembourg which eventually always arrived too late at every battle. Since the Duchy of Luxembourg had only been conquered by the Burgundians in 1443, the majority of the luxembourgish people and noblemen did not like the idea of serving a Duke who was still seen a foreigner and occupier in Luxembourg. To avoid fighting and dying for Philip the Good, luxembourgish troops would use this strategy of deliberatley arriving too late for years, always arriving at the battlefield when the latter was already over. However, since the soldiers always eventually arrived, Philip the Good had no other choice but to angrily accept this feat.\n\n\n== See also ==\nFlemish revolts against Maximilian of Austria\n\n\n== References ==\n\n\n== External links ==\nDigitale Bibliotheek voor de Nederlandse Letteren Jan Baptist David: Vaderlandse historie deel 8, 4de en 5de hoofdstuk\nGoogle Books - Amable-Guillaume-Prosper Brugière Barante: Histoire des ducs de Bourgogne de la maison de Valois, 1364-1477 (Tome Treizième Livre Huitième, vanaf blz. 90)", "links": ["Aalst, Belgium", "Antwerp", "Armagnac–Burgundian Civil War", "Assassination of John the Fearless", "Assassination of Louis I, Duke of Orléans", "Bailiff", "Battle of Bazel", "Battle of Brouwershaven", "Battle of Brustem", "Battle of Gavere", "Battle of Grandson", "Battle of Guinegate (1479)", "Battle of Héricourt", "Battle of Montenaken", "Battle of Montlhéry", "Battle of Morat", "Battle of Nancy", "Battle of Nicopolis", "Battle of Othée", "Battle of Roosebeke", "Battle of Westbroek", "Battle of the Golden Spurs", "Battle on the Planta", "Bavaria-Straubing", "Belgium", "Biervliet", "Bishopric of Utrecht", "Bruges", "Burgundian Netherlands", "Burgundian School", "Burgundian State", "Burgundian Wars", "Cabochien Revolt", "Charles VII of France", "Charles the Bold", "Charolais, France", "Charter of Senlis", "Congress of Arras", "Corneille of Burgundy", "Count of Zutphen", "Counts and Dukes of Rethel", "Counts of Eu", "County of Artois", "County of Burgundy", "County of Flanders", "County of Hainaut", "County of Holland", "County of Namur", "County of Nevers", "County of Zeeland", "Cross of Burgundy", "Custom (law)", "Deacon", "Dender", "Dendermonde", "Duchy of Brabant", "Duchy of Burgundy", "Duchy of Guelders", "Duchy of Limburg", "Duchy of Luxembourg", "Duchy of Luxemburg", "Duke of Lothier", "Dukes of Burgundy", "Dukes of Burgundy family tree", "Dulle Griet", "Dutch language", "Feast of the Pheasant", "First Utrecht Civil War", "Flemish revolts against Maximilian of Austria", "Flour", "Frisian freedom", "Gabelle", "Gavere", "Geraardsbergen", "Ghent", "Gravensteen", "Great Privilege", "Guild", "History of Burgundy", "Hook and Cod wars", "Indirect tax", "Jacques de Lalaing", "John II, Count of Nevers", "John the Fearless", "Killed in action", "Kingdom of England", "Kingdom of France", "Knight of the Golden Fleece", "Kortrijk", "League of the Public Weal", "Lille", "Low Countries", "Luxembourgers", "Margraviate of Antwerp", "Mary of Burgundy", "Mercenary", "Ninove", "Order of the Golden Fleece", "Oudenaarde", "Peace of Gavere", "Perjury", "Philip the Bold", "Philip the Good", "Poeke Castle", "Poorter", "Prince-Bishopric of Liège", "Privilege (legal ethics)", "Revolt of Ghent (disambiguation)", "Salt", "Saltire", "Scheldt", "Schendelbeke", "Schepen", "Seclin", "Second Utrecht Civil War", "Semmerzake", "Siege of Deventer (1456)", "Siege of Neuss", "Siege of Oudenaarde", "Siege of Utrecht (1483)", "Simon de Lalaing", "Sluis", "Spiere-Helkijn", "States General of the Netherlands", "Treaty of Arras (1482)", "Treaty of Conflans", "Treaty of Péronne (1468)", "Treaty of Senlis", "Treaty of Troyes", "War of the Burgundian Succession", "Wars of Liège", "Weaver (occupation)", "Wounded in action"]}