{
    "url": "https://en.wikipedia.org/wiki/Richard_Hefter",
    "title": "Richard Hefter",
    "summary": "Richard Hefter (March 20, 1941 – May 6, 2011) was an American author of books for young children.",
    "content": "Richard Hefter (March 20, 1941 – May 6, 2011) was an American author of books for young children.\n\n\n== Biography ==\nRichard Hefter met children's author Jacquelyn Reinach in 1975. He was contracted at the time to write 26 books for the publishers Holt. After the contract expired he formed a publishing venture, Euphrosyne, with Reinach.He is known as the creator of Stickybear and as the co-creator (with Reinach) and illustrator for the Sweet Pickles library of books, and for the Strawberry Library of First Learning. The Sweet Pickles series went on to sell 40 million copies. Hefter described his aim as \"trying to help children understand things like shyness, laziness and embarrassment in a humorous way.\"In 1982, Hefter formed a computer software company, Optimum Resource. He died in 2011 in Hilton Head Island, South Carolina.\n\n\n== Works ==\nThe Strawberry Library of First Learning is a series of books written and illustrated by Hefter. Mr. Hefter is best known as the creator of Stickybear and as the illustrator for the Sweet Pickles library of books.  All of the books in the Strawberry Library have a strawberry depicted somewhere on the cover. Many of the books in this series star Stickybear or other anthropomorphic animal\nAll were originally published by McGraw-Hill, Grosset & Dunlap, and Optimum Resources.\n\nA Noise in the Closet (1974) ISBN 0-07-027802-4\nThe Strawberry Book of Shapes (1977) ISBN 0-88470-021-6\nOne Bear, Two Bears: The Strawberry Number Book (1980) ISBN 0-8374-0951-9\nThe Strawberry Book of Colors (1980) ISBN 0-07-027826-1\nSome, More, Most (Written By Judy Freudberg and Illustrated by Richard Hefter) ISBN 0-88470-023-2\nYes and No: A Book of Opposites ISBN 0-07-027809-1\nThe Strawberry Mother Goose (Written by Lawrence Di Fiori and Illustrated by Richard Hefter) ISBN 0-07-027819-9\nNoses and Toes: An Up and Down and in and Out Book ISBN 0-88470-006-2\nAn Animal Alphabet ISBN 0-88470-003-8\nOne White Crocodile Smile: A Number Book ISBN 0-448-14404-2\nThings that Go ISBN 0-448-46809-3\nThe Strawberry Look Book ISBN 0-07-027824-5\nThe Strawberry Word Book ISBN 0-88470-001-1\nStrawberry Picture Dictionary  ISBN 0-07-027806-7\nBears at Work ISBN 0-911787-00-3\nStickybear Book of Weather ISBN 0-911787-01-1\nJobs for Bears (1983) ISBN 0-911787-02-X\nWatch Out! The Stickybear Book of Safety (1983) ISBN 0-911787-03-8\nLots of Little Bears: A Stickbear Counting Book (1983) ISBN 0-911787-04-6\nBears Away From Home (1983) ISBN 0-911787-05-4\nWhere is the Bear? (1983) ISBN 0-911787-06-2\nNeat Feet (1983) ISBN 0-911787-07-0\nBabysitter Bears (1983) ISBN 0-911787-08-9\nFast Food (1983) ISBN 0-911787-09-7\n\n\n=== Other software ===\nOld Ironsides, a naval combat game by Hefter and Jack Rice.\nChivalry (1985), a medieval adventure game co-written by Hefter and Janie and Steve Worthington.\n\n\n== References ==",
    "links": [
        "Anthropomorphic",
        "Children's literature",
        "Grosset & Dunlap",
        "Hilton Head Island, South Carolina",
        "ISBN (identifier)",
        "Judy Freudberg",
        "Lawrence Di Fiori",
        "McGraw-Hill",
        "Naval combat",
        "Stickybear",
        "Sweet Pickles",
        "VIAF (identifier)"
    ]
}