{"url": "https://en.wikipedia.org/wiki/Richard_Smallwood_(footballer)", "title": "Richard Smallwood (footballer)", "summary": "Richard Smallwood (born 29 December 1990) is an English professional footballer who plays as a central midfielder for League Two club Bradford City.", "content": "Richard Smallwood (born 29 December 1990) is an English professional footballer who plays as a central midfielder for League Two club Bradford City. \n\n\n== Club career ==\n\n\n=== Middlesbrough ===\nSmallwood's natural position is the holding role in the centre of midfield. He is a product of the Middlesbrough Academy and later became captain of the reserve team. At the start of the 2009–10 season, Smallwood signed his first professional contract with the club. Smallwood made his debut for Middlesbrough on 19 October 2010 in a 1–0 away defeat to Nottingham Forest. In January 2011, Smallwood signed an 18-month contract with the club. On 2 May 2011, Smallwood scored his first goal for the club in a 3–0 win against Cardiff City. On 3 November 2012, he scored his second league goal in a 4–1 win away to Charlton Athletic. However, in the 2013–14 season, Smallwood lost his first team place following new arrivals. Under the management of Aitor Karanka, Smallwood was among the players to be offloaded as part of Karanka's plans to reduce the squad size.\n\n\n=== Rotherham United ===\nOn 23 January 2014, Smallwood joined Rotherham United on loan for the remainder of the 2013–14 season. Shortly after arriving at Rotherham United, Smallwood quickly went straight into the first team; he was sent-off for a late challenge on Billy Knott, as Rotherham United beat Port Vale 1–0 on 21 August 2014. As a result of the challenge, Smallwood had to serve a three-match suspension, missing the last two games of the season and one match in the play-offs.Smallwood scored the winning penalty in the shoot-out after taking the fifth penalty to win it as Rotherham secured promotion with a penalty shoot-out victory against Leyton Orient. After the match, Smallwood said it was the first time he had taken a penalty in his professional career. As a result of his good performance at Rotherham United, the club made a bid to sign Smallwood in early July, only to be rejected by Middlesbrough.Initially signed in an emergency loan deal, Smallwood signed for Rotherham United on a permanent basis after Middlesbrough accepted a £175,000 bid for him.Smallwood scored his first ever goal for Rotherham United in their 3–3 home draw with Derby County with a free-kick from the edge of the area.\nOn 31 August 2016, new Rotherham United manager Alan Stubbs sent Smallwood out on a season long loan to Scunthorpe United for the last year of his contract. With Stubbs no longer at the club, agreement was reached to terminate the loan on 9 January 2017. Smallwood scored one goal for Scunthorpe during his loan, the final goal in a 4–0 home defeat of Southend United on 10 September 2016. Smallwood elected to leave Rotherham United at the end of his contract, turning down an extension offered by the club.\n\n\n=== Blackburn Rovers ===\nSmallwood signed a two-year contract with Blackburn Rovers on 20 June 2017. He scored his first goal for Blackburn in a 3–1 EFL Cup win against Coventry City on 8 August 2017.\n\n\n=== Hull City ===\nOn 11 August 2020, Smallwood signed for Hull City, on a two-year deal with an option to extend a further year. Smallwood was then named as Hull City's captain for the upcoming 2020–21 season.\nSmallwood played his first game for the club on 5 September 2020, in the first round of the EFL Cup away against Sunderland, which Hull won on penalties after a 0–0 draw. He scored his first goal for Hull in a 4–1 win at Preston North End on 7 August 2021.Smallwood was released at the end of the 2021–22 season.\n\n\n=== Bradford City ===\nOn 22 June 2022, Smallwood signed for Bradford City on a free transfer on an initial two year deal.\n\n\n== International career ==\nHe was a member of the England under-18 squad which defeated Austria 2–0 at Hartlepool United's Victoria Park on 16 April 2008.\n\n\n== Career statistics ==\nAs of 7 May 2022.\n\n\n== Honours ==\nRotherham United\n\nFootball League One play-offs: 2014Hull City\n\nEFL League One: 2020–21\n\n\n== References ==\n\n\n== External links ==\nRichard Smallwood at Soccerbase \nRichard Smallwood at Soccerway", "links": ["2010–11 Middlesbrough F.C. season", "2011–12 Middlesbrough F.C. season", "2012–13 Middlesbrough F.C. season", "2013–14 Football League Championship", "2013–14 Middlesbrough F.C. season", "2013–14 Rotherham United F.C. season", "2014 Football League One play-off Final", "2014 Football League play-offs", "2014–15 Middlesbrough F.C. season", "2014–15 Rotherham United F.C. season", "2015–16 Rotherham United F.C. season", "2016–17 Rotherham United F.C. season", "2016–17 Scunthorpe United F.C. season", "2017–18 Blackburn Rovers F.C. season", "2018–19 Blackburn Rovers F.C. season", "2019–20 Blackburn Rovers F.C. season", "2020–21 EFL League One", "2020–21 Hull City A.F.C. season", "2021–22 Hull City A.F.C. season", "2022–23 Bradford City A.F.C. season", "Abo Eisa", "Aitor Karanka", "Alan Stubbs", "Alex Gilliead", "Andy Cook (footballer, born 1990)", "Association football", "BBC", "BBC Sport", "Billy Knott", "Blackburn Rovers F.C.", "Bradford City A.F.C", "Bradford City A.F.C.", "Cardiff City F.C.", "Charlie Wood (footballer)", "Charlton Athletic F.C.", "Colin Doyle (footballer)", "Coventry City", "Danny Ward (English footballer)", "Derby County F.C.", "EFL Championship", "EFL Cup", "EFL League One", "EFL League One play-offs", "EFL League Two", "EFL Trophy", "Emmanuel Osadebe", "England national under-18 football team", "FA Cup", "Fiacre Kelleher", "Finn Cousin-Dawson", "Football League One play-offs", "Harry Chapman (footballer, born 1997)", "Harry Lewis (footballer, born 1997)", "Hartlepool United F.C.", "Headline Publishing Group", "Hull City A.F.C.", "ISBN (identifier)", "Jake Young (footballer)", "Jamie Walker (footballer)", "Kian Harratt", "Kian Scales", "Lee Angol", "Lee Camp (footballer)", "Lee Frecklington", "Levi Sutton", "Leyton Orient F.C.", "Liam Ridehalgh", "Luke Hendrie", "Mark Hughes", "Matthew Platt", "Matty Foulds", "Michael Ihiekwe", "Michael Smith (footballer, born 1991)", "Middlesbrough F.C.", "Middlesbrough F.C. Reserves and Academy", "Midfielder", "Nottingham Forest F.C.", "Oscar Threlkeld", "Penalty shoot-out (association football)", "Port Vale F.C.", "Preston North End", "Redcar", "Reece Staunton", "Romoney Crichlow", "Rotherham United F.C.", "Ryan East", "Scunthorpe United F.C.", "Southend United F.C.", "Sunderland A.F.C.", "Timi Odusina", "Victoria Park, Hartlepool", "Will Vaulks", "Yann Songo'o"]}