{"url": "https://en.wikipedia.org/wiki/Rickmansworth", "title": "Rickmansworth", "summary": "Rickmansworth () is a town in southwest Hertfordshire, England, about 17 miles (27 km) northwest of central London and inside the perimeter of the M25 motorway. The town is mainly to the north of the Grand Union Canal (formerly the Grand Junction Canal) and the River Colne. The town of Watford is 5 miles (8 km) to the northeast. Rickmansworth is the administrative seat of the Three Rivers District Council. The confluence of the River Chess and the River Gade with the Colne in Rickmansworth inspired the district's name. The enlarged Colne flows south to form a major tributary of the River Thames. The town is served by the Metropolitan line of the London Underground and Chiltern Railways from London Marylebone to Aylesbury.", "content": "Rickmansworth () is a town in southwest Hertfordshire, England, about 17 miles (27 km) northwest of central London and inside the perimeter of the M25 motorway. The town is mainly to the north of the Grand Union Canal (formerly the Grand Junction Canal) and the River Colne. The town of Watford is 5 miles (8 km) to the northeast. Rickmansworth is the administrative seat of the Three Rivers District Council. The confluence of the River Chess and the River Gade with the Colne in Rickmansworth inspired the district's name. The enlarged Colne flows south to form a major tributary of the River Thames. The town is served by the Metropolitan line of the London Underground and Chiltern Railways from London Marylebone to Aylesbury.\n\n\n== Toponymy ==\nThe name Rickmansworth comes from the Saxon name Ryckmer, the local landowner, and worth meaning a farm or stockade. In the Domesday Book of 1086 it was recorded as the Manor of Prichemaresworde. Other spellings include Rykemarwurthe (1119–46), Richemaresworthe (1180), Rykemerewrthe (1248), Richemereworthe (1259), Rikesmareswrth (1287), Rikmansworth (1382), Rikmeresworth (1396) and Rykemerysworth (1418).\n\n\n== History ==\nThere was a settlement in this part of the Colne Valley in the Stone Age. Rickmansworth was one of five manors with which the great Abbey of St Albans had been endowed when founded in 793 by King Offa. Local tithes supported the abbey, which provided clergy to serve the people until the dissolution of the monasteries in 1539. Around the time of the Domesday Book, the population of \"Prichemareworth\" may have been about 200.\nCardinal Wolsey, in his capacity as Abbot of St Albans, held the Manor of le More in the valley. The manor house was replaced by the hill-top mansion Moor Park, which eventually became the residence of Admiral Lord Anson, who commissioned Capability Brown to remake the formal gardens, and in 1828 of the Barons Ebury; it is now the Golf Club House. The wider area, including Croxley Green, Moor Park, Batchworth, Mill End, West Hyde and Chorleywood, formed the original parish of Rickmansworth.\nIn 1851, the population had grown to 4,800, and the parish was divided. St Mary's Church serves the parish concentrated in the town and extending to Batchworth and parts of Moor Park. The town had a population of 14,571 recorded at the 2001 census.\nThe three rivers, the Colne, Chess and Gade, provided water for the watercress trade and power for corn milling, silk weaving, paper making and brewing, all long gone. Other industries have included leather-tanning, soft drinks,  laundry, straw-plaiting and stocking production. Now, the rivers, canal and flooded gravel pits provide for recreation.\nWest Mill, a water mill, existed at the time of the Domesday Survey. It was leased to the abbot and convent of St Albans by Ralph Bukberd for a term of years ending in 1539. In 1533, they leased it from the end of this term for twenty-six years to Richard Wilson of Watford. He was to keep in repair the mill and also two millstones, 10 inches (25 centimetres) thick, and 4 ft 8 in (142 cm) in breadth. The mill was leased in 1544 to William Hutchinson, yeoman of the spicery, and Janet his wife for their lives. It afterwards came to John Wilson, and was granted in 1576–77 to Richard Master. There was also a water-mill called Batchworth Mill, and a fishery called Blacketts Mill in Rickmansworth. Batchworth Mill was later used as a cotton mill, but was bought in 1820 by John Dickinson & Co., and converted into paper mills, now the site of Affinity Water. Scotsbridge Mill was also productive but is now a restaurant with the unusual feature of a salmon run. During the sixteenth and seventeenth centuries many of the principal inhabitants were described as \"clothiers\", from which it may be inferred that the manufacture of cloth was at one time carried on in the parish, but this industry has long since ceased. There were also silk and flock mills here, described in 1808 as recently built.\nA long-running dispute over water levels in the Batchford area, following construction of the Grand Junction Canal, was resolved in 1825, when an 8-foot-3-inch (2.51 m) obelisk was erected in a pond, to act as a water gauge. It records the agreement made between the canal company, John Dickinson the miller at Batchworth Mill, and R. Williams of Moor Park the landowner.In July 1860, Lord Ebury obtained powers to construct a 4+1⁄2-mile (7.2 km) single-track railway line, the Watford and Rickmansworth Railway (WRR) between Rickmansworth and Watford. Opening in October 1862, Rickmansworth (Church Street) railway station was opposite the parish church of St Mary, with interchange sidings to the Grand Union Canal. The line had stations at Watford Junction and Watford High Street and a depot in Watford. A further Parliamentary authorisation was obtained a year later to construct an extension from Rickmansworth to connect with the Great Western Railway's Uxbridge branch, but this was never realised.Despite hopes that the railway would bring economic development and serve the factories and warehouses that had developed along the Grand Union Canal, it was Watford that grew at a faster pace and drew business from Rickmansworth. The railway was dogged with financial problems and a further Act of Parliament in 1863 authorised the issue of further shares to the value of £30,000 (£40,000 worth had already been issued). The service consisted of five trains each way. The line was worked from the outset by the London and North Western Railway (LNWR), which paid the WRR 50% of the gross earnings.The railway was never financially successful and the Official Receiver was called in four years after opening. The company attempted to remedy its financial problems by opening several freight branches, the most notable being to the Croxley printers and to the Grand Union Canal at Croxley Green. The company was absorbed by the burgeoning LNWR whose station it shared at Watford Junction in 1881.\nRickmansworth grew dramatically during the Victorian era and in the 1920s and 1930s as part of Metro-land, due to the extension of Metropolitan Railway, and became a commuter town.\n\n\n== Transport ==\n\n\n=== Train ===\nDiesel express trains from Marylebone station, London, via Harrow-on-the Hill, to Aylesbury on the London to Aylesbury Line, and fast, electric Metropolitan trains from the City of London, via Baker Street, to Amersham stop at Rickmansworth station.\n\n\n=== Motorway ===\nJunctions 17 and 18 of the M25 motorway are within Rickmansworth's boundaries, giving access to Heathrow Airport and the national motorway network.\n\n\n=== Bus ===\n320 Rickmansworth to Hemel Hempstead\n324 Rickmansworth to Garston\n103 between Watford and High Wycombe, via Beaconsfield, stops at Rickmansworth station\n724 between Heathrow Airport and Harlow, via St Albans and Ware, stops at Rickmansworth station\n\n\n== Politics and economy ==\nRickmansworth is a part of the UK Parliament constituency of South West Hertfordshire. Gagan Mohindra has been the Member of Parliament since the December 2019 United Kingdom general election.The agricultural co-operative, Quality Milk Producers has its headquarters in Scotsbridge House, as do the English Guernsey Cattle Society, the Jersey Cattle Society, the UK Holstein Society, the British Friesian Breeders Club, the Milk Development Council and the Centre for Dairy Information.\n\n\n== Police station ==\nIn 1897, a police station opened in the High Street adjoining the fire station. The site of the later police station on Rectory Road was purchased by Lidl in 2013 and the building was demolished. The residents association (RDRA) have opposed the proposal for a store. Rickmansworth police station is now located within Three Rivers House.\n\n\n== Geography ==\nValley Road in Rickmansworth has a frost hollow. This is caused by the local geography, notably the railway embankment which prevents the natural drainage of cold air from a specific part of the valley. The greatest daily temperature range in England was recorded on 29 August 1936 in Rickmansworth when the temperature climbed from 1.1 °C at dawn to 24.9 °C within 9 hours due to this unusual geographic feature.\n\n\n== Administrative history ==\n\n\n=== Parish ===\nRickmansworth was an ancient parish. Following the Poor Law Amendment Act 1834 the parish was included in the Watford Poor Law Union, established in 1835. When sanitary districts were created in 1872, the parish of Rickmansworth therefore became part of the Watford Rural Sanitary District, which in turn became Watford Rural District in December 1894.\n\n\n=== Rickmansworth Urban District (1898–1974) ===\nShortly after Watford Rural District had been created, the process of creating an urban district for the town of Rickmansworth began. An inquiry was held in February 1896 at the Town Hall in Rickmansworth, considering whether to turn the parish into urban district. The initial conclusion was that the whole parish was not appropriate for becoming an urban district, but that an urban district could perhaps be created for just part of it. It was eventually decided to split the parish of Rickmansworth into three parts. The hamlet of Chorleywood was made into a separate parish, whilst the remainder of Rickmansworth parish was split between a Rickmansworth Urban parish (covering the built-up area including Mill End, Rickmansworth and Croxley Green), and a Rickmansworth Rural parish. The Rickmansworth Rural parish was not one contiguous area, but a number of detached pieces of land around the edges of the original parish. The Chorleywood and Rickmansworth Rural parishes remained in the Watford Rural District, whilst the parish of Rickmansworth Urban became Rickmansworth Urban District. These changes all came into force on 15 April 1898. The first meeting of Rickmansworth Urban District Council was held on 16 April 1898 at the Town Hall at 105 High Street in Rickmansworth. William Culley was elected the first chairman of the council.In 1930, Rickmansworth Urban District Council bought Basing House at 46 High Street in Rickmansworth, which had once been the home of William Penn. The council converted Basing House to become its offices and meeting place, holding its first meeting there in November 1930.The Rickmansworth Rural parish was abolished in 1935, with most of its area being added to Rickmansworth Urban District and the remainder to the neighbouring parish of Sarratt with effect from 1 April 1935.Rickmansworth Urban District Council was granted a coat of arms on 30 October 1953.Under the Local Government Act 1972, Rickmansworth Urban District was abolished, becoming part of the district of Three Rivers on 1 April 1974.\n\n\n=== After 1974 ===\nNo successor parish was created for Rickmansworth in 1974 and so it became an unparished area, governed directly by Three Rivers District Council.\nTwo parish councils were subsequently created from parts of the former Rickmansworth Urban District. The civil parish of Croxley Green was created on 1 April 1986, covering the eastern part of the former Rickmansworth Urban District and an adjoining area transferred from the parish of Sarratt.The civil parish of Batchworth was created on 1 April 2017 covering the two Three Rivers district wards of Rickmansworth Town, and Moor Park and Eastbury. The Batchworth parish therefore covers much of Rickmansworth, including the town centre. The Batchworth and Croxley Green parishes do not cover the whole of the former Rickmansworth Urban District, with two areas remaining unparished: one around Maple Cross and Mill End, and another near Loudwater.\n\n\n== Education ==\n\n\n=== Junior schools ===\nArnett Hills JMI School\nRickmansworth Park JMI School\nShepherds Primary School\nSt. John's Catholic Primary School\nSt. Mary's C of E Primary School\nSt. Peter's C of E Voluntary Aided Primary School\n\n\n=== Secondary schools ===\nRickmansworth School\nSt. Clement Danes School\nSt Joan of Arc Catholic School\nThe Reach Free School\n\n\n=== Independent schools ===\nThe Royal Masonic School for Girls\nNorthwood Prep School\nYork House Prep School\n\n\n== Culture and sport ==\nWatersmeet is a 515-seat theatre complex owned by the Three Rivers District Council in the town centre. Its auditorium can be transformed from a raked theatre to a flat floor for performances in the round, dancing, cabaret, weddings, indoor markets and craft fairs. The Rickmansworth Players (affiliated to NODA) is a well-established amateur dramatics society that performs musicals and plays on a regular basis. Rickmansworth Historical Society meets monthly from September to June in the Cloisters Hall.\nRickmansworth is sometimes shortened to \"Ricky\", as used in the annual Ricky Week celebrations which occur in May. The town's canal history is remembered at the end of the week with the Rickmansworth Festival organised by Rickmansworth Waterways Trust. The annual Ricky Road Run takes place with more than 500 runners. The annual Victorian Evening, held in the town centre at the end of November, was changed to Starlight Evening in 2011. Inspired by the reference to Rickmansworth on the first page of The Hitchhiker's Guide to the Galaxy by Douglas Adams: \"And then, one Thursday, nearly two thousand years after one man had been nailed to a tree for saying how great it would be to be nice to people for a change, a girl sitting on her own in a small café in Rickmansworth suddenly realized what it was that had been going wrong all this time, and she finally knew how the world could be made a good and happy place. This time it was right, it would work, and no one would have to get nailed to anything.\"\n\n\n=== Aquadrome ===\n\nThe Aquadrome covers 41 hectares (100 acres) and includes the Aquadrome Local Nature Reserve, Batchworth and Bury Lakes, open grassland, areas of woodland, car parking, a café and a children's play area. Its boundaries are the River Colne to the north, the Grand Union Canal to the east and south and Stocker's Lake nature reserve to the west.  In July 2009, it received a Green Flag Award for parks and open spaces which meet high standards.\nThe lakes are old gravel quarries filled with water and stocked with fish but only Batchworth Lake is available for fishing. Some gravel from the site was used to build Wembley Stadium in 1923. Batchworth Lake is popular for water skiing events and hosts the Rickmansworth Water Ski Club.\nBury Lake is home to Bury Lake Young Mariners (BLYM); a sailing club and RYA-recognised teaching establishment.\n\n\n=== Sports clubs ===\n\nRickmansworth Cricket Club was founded in 1787 and is one of the oldest recorded clubs in England. Its clubhouse was built in 1921 by Sir William Francis Reckitt – a member of the Reckitt and Colman Mustard dynasty. Rickmansworth Sports Club runs five teams in the Saracens Hertfordshire Cricket League. Over the years, other sports clubs have moved into the grounds, including Chess Valley Rugby Football Club and Rickmansworth & Chess Valley Hockey Clubs.\nRickmansworth Golf Course is adjacent to Moor Park golf course.\nRickmansworth Lawn Tennis Club also hosts Rickmansworth table tennis club matches.\nRickmansworth Water Ski Club is located on Batchworth Lake.\nRickmansworth hosts a sub-aqua Club.\nThe William Penn Leisure Centre has an indoor swimming pool and sports facilities.\n\n\n== Filming ==\nThe Adventures of Black Beauty (1972)\nGrange Hill (1978)\nRaiders of the Lost Ark (1981)\nWithnail and I (1986)\nIndiana Jones and the Last Crusade (1989)\nDouble X: The Name of the Game  (1992)\nAshes to Ashes (British TV series) (2009)\nHarry and Paul (2010)\nThe First Men in the Moon (2010)\nFoyle's War (Lesson in Murder)\nBridget Jones: The Edge of Reason (film) (Pig report scene, filmed at Stockers Farm)\nDick Turpin (Starring Richard O'Sullivan, filmed at Stockers Farm)\nGenevieve (Genevieve 'broke down' at the top of Batchworth Hill, by the gates to Moor Park)\nMetro-land (Television documentary) (1973)\nDoctor Who ('The Three Doctors' – 10th anniversary story 1972/1973)\nHarry Enfield's Television Programme (80's)\nNew Tricks (2014)\nChildren of Men (2006)\nSilent Witness (2013)\nDoctor Foster (2015 & 2017 Filming took place in Green Lane, Croxley Green)\nThe Professionals (TV series) Harefield Road & Springwell Lock\n28 Weeks Later (2007) Stockers Farm\nEndeavour (TV series) 2019 Stockers Farm\n\n\n== Notable people ==\nCardinal Wolsey (Manor of the More, 1522–1530\nRobert Carey, 1st Earl of Monmouth (Moor Park, 1631–1639, buried at Rickmansworth Parish Church)\nFrancis Russell, 2nd Earl of Bedford (Moor Park, 1576)\nEdward Russell, 3rd Earl of Bedford (Moor Park, 1585–1627)\nWilliam Herbert, 3rd Earl of Pembroke (Moor Park, 1627)\nFranklin baronets (bought Moor Park and Manor of Rickmansworth, 1655)\nHenry Carey, 2nd Earl of Monmouth (buried at Rickmansworth Parish Church)\nJames Butler, 1st Duke of Ormonde (Moor Park, 1664)\nThomas Butler, 6th Earl of Ossory (made Lord Butler of Moore Park in 1666)\nWilliam E. Fairbairn (Developed hand-to-hand combat methods)\nJames Scott, 1st Duke of Monmouth (illegitimate son of Charles II, Moor Park, 1670 – executed 1685))\nGeorge Anson, 1st Baron Anson (Admiral Lord Anson, Moor Park c1752)\nSir Lawrence Dundas, 1st Baronet (Moor Park, 1763)\nWilliam Penn (founder of Pennsylvania)\nThomas Dundas, 1st Baron Dundas (Moor Park, sold 1785)\nRobert Grosvenor, 1st Marquess of Westminster (Moor Park, 1828–1845)\nRobert Grosvenor, 1st Baron Ebury (Moor Park, 1846 and The Bury, 1879 to 1893)\nRobert Grosvenor, 2nd Baron Ebury (Moor Park, 1893–1918)* Harvey Fellows (Cricketer)\nGuy Calthrop aka Sir Calthrop Guy Spencer Calthrop, 1st Baronet (26 March 1870 – 23 February 1919)\nDavid Urquhart (MP, Russophile and advocate for Turkish Baths)\nGeorge Eliot (pen-name of Mary Anne Evans – The Elms, 1875)\nVal Doonican (resided in The Drive, Rickmansworth)\nSam Little (golfer)\nGeorge Orwell (pen-name of Eric Blair, author, who spent some summers in Rickmansworth)\nThomas Andrews, (the naval architect in charge of the plans for the ocean liner Titanic, perished on her maiden voyage).\nBarbara Woodhouse (dog trainer, author, horse trainer and television personality)\nWilliam Stanier (locomotive designer and Chief Mechanical Engineer of the London, Midland and Scottish Railway.)\n\n\n== See also ==\nW. H. Walker and Brothers\n\n\n== References ==\n\n\n== Sources ==\nPopulation figures (PDF)\nWilliam Page, ed. (1908). \"Parishes: Rickmansworth\". A History of the County of Hertford: volume 2. Institute of Historical Research. Retrieved 31 March 2012.\n\n\n== External links ==\nPast Times:This is Rickmansworth 2005\nThree Rivers Museum, Rickmansworth\nRickmansworth Historical Society\nHistorical photographs of Rickmansworth\nWatford Observer Historical Tour of Rickmansworth\nPictures of Rickmansworth\nRickmansworth in Hertfordshire: A history", "links": ["2019 United Kingdom general election", "28 Weeks Later", "Abbey of St Albans", "Administrative centre", "Amersham", "Archive.today", "Ashes to Ashes (British TV series)", "Aylesbury", "Aylesbury railway station", "Baker Street", "Baldock", "Barbara Woodhouse", "Baron Ebury", "Batchworth", "Beaconsfield", "Berkhamsted", "Bishop's Stortford", "Borehamwood", "Borough of Broxbourne", "Bridget Jones: The Edge of Reason (film)", "Broxbourne", "Buntingford", "Bury Lake Young Mariners", "Bushey", "Capability Brown", "Cardinal Wolsey", "Central London", "Ceremonial counties of England", "Cheshunt", "Chief Mechanical Engineer", "Children of Men", "Chiltern Railways", "Chorleywood", "Civil parish", "Coat of arms", "Commuter town", "Confluence", "Constituencies of the Parliament of the United Kingdom", "Constituency", "Countries of the United Kingdom", "Croxley Green", "Dacorum", "David Urquhart", "Dick Turpin (TV series)", "Dissolution of the monasteries", "Districts of England", "Doctor Foster (TV series)", "Doctor Who", "Domesday Book", "Double X: The Name of the Game", "Douglas Adams", "East Hertfordshire", "East of England", "East of England Ambulance Service", "Edward Russell, 3rd Earl of Bedford", "Emergency medical services in the United Kingdom", "Endeavour (TV series)", "England", "Fire services in the United Kingdom", "Flag of Hertfordshire", "Foyle's War", "Francis Russell, 2nd Earl of Bedford", "Franklin baronets", "Gagan Mohindra", "Garston, Hertfordshire", "Genevieve (film)", "Geographic coordinate system", "George Anson, 1st Baron Anson", "George Eliot", "George Orwell", "Grade II* listed buildings in Hertfordshire", "Grade I listed buildings in Hertfordshire", "Grand Junction Canal", "Grand Union Canal", "Grange Hill", "Great Western Railway", "Green Flag Award", "Guy Calthrop", "Harlow", "Harpenden", "Harrow-on-the Hill", "Harry Enfield's Television Programme", "Harry and Paul", "Harvey Fellows", "Hatfield, Hertfordshire", "Heathrow Airport", "Hemel Hempstead", "Henry Carey, 2nd Earl of Monmouth", "Hertford", "Hertfordshire", "Hertfordshire (European Parliament constituency)", "Hertfordshire Constabulary", "Hertfordshire County Council", "Hertfordshire County Council elections", "Hertfordshire Fire and Rescue Service", "Hertsmere", "High Sheriff of Hertfordshire", "High Wycombe", "Historic England", "History of Hertfordshire", "Hitchin", "Hoddesdon", "ISBN (identifier)", "Indiana Jones and the Last Crusade", "James Butler, 1st Duke of Ormonde", "James Scott, 1st Duke of Monmouth", "Letchworth", "Lidl", "List of Hertfordshire boundary changes", "List of King George V Playing Fields in Hertfordshire", "List of Sites of Special Scientific Interest in Hertfordshire", "List of United Kingdom locations", "List of civil parishes in Hertfordshire", "List of law enforcement agencies in the United Kingdom, Crown Dependencies and British Overseas Territories", "List of lost settlements in Hertfordshire", "List of museums in Hertfordshire", "List of places in England", "List of places in Hertfordshire", "List of schools in Hertfordshire", "List of settlements in Hertfordshire by population", "List of sovereign states", "List of windmills in Hertfordshire", "Local Government Act 1972", "London, Midland and Scottish Railway", "London Marylebone railway station", "London Underground", "London and North Western Railway", "London to Aylesbury Line", "Lord Anson", "Lord Lieutenant of Hertfordshire", "Loudwater, Hertfordshire", "M25 motorway", "MBAREA (identifier)", "Maple Cross", "Marylebone station", "Member of Parliament", "Metro-Land (TV film)", "Metro-land", "Metropolitan Railway", "Metropolitan and non-metropolitan counties of England", "Metropolitan line", "Mill End, Rickmansworth", "Minor characters from The Hitchhiker's Guide to the Galaxy", "Moor Park (house)", "National Heritage List for England", "Naval architect", "New Tricks", "Non-metropolitan district", "North Hertfordshire", "Northwood Prep School", "Offa", "Official Receiver", "Ordnance Survey National Grid", "Parliamentary constituencies in Hertfordshire", "Poor Law Amendment Act 1834", "Poor law union", "Post town", "Postcodes in the United Kingdom", "Potters Bar", "Raiders of the Lost Ark", "Regions of England", "Rickmansworth (Church Street) railway station", "Rickmansworth Aquadrome", "Rickmansworth Cricket Club", "Rickmansworth School", "Rickmansworth station", "River Chess", "River Colne, Hertfordshire", "River Gade", "River Thames", "Robert Carey, 1st Earl of Monmouth", "Robert Grosvenor, 1st Baron Ebury", "Robert Grosvenor, 1st Marquess of Westminster", "Robert Grosvenor, 2nd Baron Ebury", "Royston, Hertfordshire", "Sam Little (golfer)", "Sanitary district", "Sarratt", "Sawbridgeworth", "Silent Witness", "Sir Lawrence Dundas, 1st Baronet", "South West Hertfordshire (UK Parliament constituency)", "St. Clement Danes School", "St Albans", "St Albans City and District", "St Joan of Arc Catholic School, Rickmansworth", "Stevenage", "Stocker's Lake", "Successor parish", "Telephone numbers in the United Kingdom", "The Adventures of Black Beauty", "The First Men in the Moon", "The Hitchhiker's Guide to the Galaxy", "The Professionals (TV series)", "The Royal Masonic School for Girls", "The Three Doctors (Doctor Who)", "Thomas Andrews", "Thomas Butler, 6th Earl of Ossory", "Thomas Dundas, 1st Baron Dundas", "Three Rivers (district)", "Three Rivers District", "Titanic", "Tring", "United Kingdom", "Unparished area", "Urban district (Great Britain and Ireland)", "Uxbridge branch", "VIAF (identifier)", "Val Doonican", "Victorian era", "W. H. Walker and Brothers", "WD postcode area", "Waltham Cross", "Ware, Hertfordshire", "Watford", "Watford High Street railway station", "Watford Junction", "Watford Rural District", "Watford and Rickmansworth Railway", "Welwyn Garden City", "Welwyn Hatfield", "Wembley Stadium (1923)", "West Hyde", "William E. Fairbairn", "William Herbert, 3rd Earl of Pembroke", "William Penn", "William Stanier", "Withnail and I", "York House School (Redheath)"]}