{"url": "https://en.wikipedia.org/wiki/Roman_Frigg", "title": "Roman Frigg", "summary": "Roman Frigg (born 1972) is a Swiss philosopher, Professor at the London School of Economics and Political Science and director of its Centre for Philosophy of Natural and Social Science. In 2016 he was awarded the Friedrich Wilhelm Bessel Research Award.Born in Basel, Switzerland, Frigg obtained his MSc in Theoretical Physics at the University of Basel. In 2003 he obtained his PhD in Philosophy at the London School of Economics and Political Science under Nancy Cartwright and Carl Hoefer with the thesis entitled Re-presenting Scientific Representation.After graduation Frigg started his academic career at the London School of Economics. After some years he was appointed Professor of Philosophy in its Department of Philosophy, Logic and Scientific Method. He is also visiting professor at the Ludwig Maximilian University of Munich at its Munich Centre for Mathematical Philosophy.", "content": "Roman Frigg (born 1972) is a Swiss philosopher, Professor at the London School of Economics and Political Science and director of its Centre for Philosophy of Natural and Social Science. In 2016 he was awarded the Friedrich Wilhelm Bessel Research Award.Born in Basel, Switzerland, Frigg obtained his MSc in Theoretical Physics at the University of Basel. In 2003 he obtained his PhD in Philosophy at the London School of Economics and Political Science under Nancy Cartwright and Carl Hoefer with the thesis entitled Re-presenting Scientific Representation.After graduation Frigg started his academic career at the London School of Economics. After some years he was appointed Professor of Philosophy in its Department of Philosophy, Logic and Scientific Method. He is also visiting professor at the Ludwig Maximilian University of Munich at its Munich Centre for Mathematical Philosophy.\n\n\n== Philosophy ==\nFrigg's philosophy draws from his physics background. He often takes examples from the field to demonstrate how order is emergent, holistic, and contextual by universal and exceptionless laws. For instance, together with Robert Bishop, he explained that there is self-organization and patterns of emergent order in the universe rather than a system being built up just from independently calculated movement of its part. This theory is applied to explain phenomena such as heavenly bodies, global politics, and even family life, among others with the view that a domain is regarded as ordered once its objects are seen as behaving according to a general law.Along with some philosophers like Gabrielle Contessa and Peter Godfrey-Smith, Frigg also theorizes that there are parallels between theoretical modelling and works of fiction that involve fictional characters. For the philosopher, the best way to understand mathematical models is to approach it as if they were more closely related to literary fictions than to bits of mathematics. This can be demonstrated in the way Frigg draws from Kendall Walton's theory, which offers a framework of understanding games of make-believe and uses it to understand the nature and varieties of representation in the arts of art and fiction. Frigg proposed that scientists' prepared descriptions are analogous to props in games of make believe and that the descriptions do not require imaginings about actual objects but ask us to imagine a model-system. It is believed that this approach addresses the concept of model individuation - that \"if models are simply mathematical objects, then when two distinct models use the same mathematics, we will not be able to individuate them as separate objects.\"\n\n\n== Selected publications ==\nRoman Frigg, Re-presenting Scientific Representation. London School of Economics, University of London, September 2003.\nRoman Frigg, Matthew Hunter (eds.). Beyond mimesis and convention: representation in art and science. Springer Netherlands, 2010.Articles, a selection:\n\nFrigg, Roman (2003). \"On the property structure of realist collapse interpretations of quantum mechanics and the so-called \"counting anomaly\"\" (PDF). International Studies in the Philosophy of Science. Informa UK Limited. 17 (1): 43–57. doi:10.1080/02698590305232. ISSN 0269-8595. S2CID 10241494.\nFrigg, Roman; Reiss, Julian (25 June 2009). \"The philosophy of simulation: hot new issues or same old stew?\" (PDF). Synthese. Springer Science and Business Media LLC. 180 (1): 77. doi:10.1007/s11229-009-9577-x. ISSN 0039-7857. S2CID 19243684.\nFrigg, Roman (2006). \"Scientific Representation and the Semantic View of Theories\" (PDF). Theoria. The University of Chicago Press. 55 (2): 183–206. Retrieved 14 February 2013.\nFrigg, Roman (27 March 2009). \"Models and fiction\". Synthese. Springer Science and Business Media LLC. 172 (2): 251–268. doi:10.1007/s11229-009-9505-0. ISSN 0039-7857. S2CID 1685834.\nFrigg, Roman; Votsis, Ioannis (2011). \"Everything you always wanted to know about structural realism but were afraid to ask\" (PDF). European Journal for Philosophy of Science. Springer Science and Business Media LLC. 1 (2): 227–276. doi:10.1007/s13194-011-0025-7. ISSN 1879-4912. S2CID 1500468.\nRoman, Frigg; Hartmann, Stephan (27 February 2006). \"Models in Science\".  In Zalta, Edward N. (ed.). The Stanford Encyclopedia of Philosophy (Fall 2012 ed.). Retrieved 24 July 2015.\n\n\n== References ==\n\n\n== External links ==\nRoman Frigg Personal website", "links": ["Basel", "Centre for Philosophy of Natural and Social Science", "Doi (identifier)", "ISBN (identifier)", "ISNI (identifier)", "ISSN (identifier)", "Kendall Walton", "London School of Economics", "London School of Economics and Political Science", "Ludwig Maximilian University of Munich", "Mathematical model", "Nancy Cartwright (philosopher)", "Peter Godfrey-Smith", "Philosopher", "S2CID (identifier)", "SUDOC (identifier)", "Stephan Hartmann", "University of Basel", "VIAF (identifier)"]}