{
    "url": "https://en.wikipedia.org/wiki/Ruth_Cadbury",
    "title": "Ruth Cadbury",
    "summary": "Ruth Margaret Cadbury (born 14 May 1959) is a British Labour Party politician serving as the Member of Parliament (MP) for Brentford and Isleworth since 2015, and the Shadow Minister for Planning since 2021. A former planning consultant, she previously served on the opposition front bench as the Shadow Minister for Housing from 2016 to 2017.",
    "content": "Ruth Margaret Cadbury (born 14 May 1959) is a British Labour Party politician serving as the Member of Parliament (MP) for Brentford and Isleworth since 2015, and the Shadow Minister for Planning since 2021. A former planning consultant, she previously served on the opposition front bench as the Shadow Minister for Housing from 2016 to 2017.\n\n\n== Early life and career ==\nCadbury is the eldest child of Charles Lloyd Cadbury and Jillian Stafford Ransome. She was privately educated at The Mount School, York, Bournville College, and graduated from the University of Salford with a BSc in social sciences in 1981.Having worked from 1983 to 1989 for Covent Garden Community Association, she was a Planning Advisor at Planning Aid for London for the next seven years, before working as a Policy Planner at the London Borough of Richmond upon Thames for five years, and then working as a freelance planning consultant from 2006 to 2014.Cadbury was first elected as a Labour Party councillor for the Gunnersbury ward of Hounslow Borough Council in 1986, before being elected for the Brentford Clifden ward in 1998 and the Brentford ward in 2002. She was Deputy Leader of the Council from 2010 to 2012 and stood down as a councillor in May 2015.\n\n\n== Career ==\nAt the 2015 general election, she defeated the sitting Conservative MP, Mary Macleod. In her maiden speech to the House of Commons on 2 June 2015, Cadbury made much of her Quaker background and its relevance to social justice. Her speech also referenced her distant ancestor, the chocolate producer and Quaker George Cadbury (whose name lent itself to the Cadbury chocolate brand). In December 2015, she voted against military intervention in Syria.In October 2016, she was appointed by Labour Party leader Jeremy Corbyn as a Shadow Housing Minister. She supported Owen Smith in the failed attempt to replace Jeremy Corbyn in the 2016 Labour Party leadership election.Cadbury was ousted as Shadow Housing Minister on 29 June 2017 for contravening a whipped vote on an amendment to the Queen's speech calling for the UK to remain in the European Single Market; whilst the Labour position was to abstain, she voted to support the motion.She voted in the unsuccessful no ('Noes') lobby in a key House of Commons division of 25 June 2018 for the National Policy Statement on Airports, which laid out government support for a third runway, and she was among 28 of the 46 London Labour MPs opposing the runway.In the House of Commons she sits on the Transport Committee and previously sat on the Justice Committee and the Women and Equalities Committee.Cadbury re-joined the Labour front bench in the May 2021 as the Shadow Minister for Planning, receiving half of Mike Amesbury's former brief as the Shadow Minister for Housing and Planning. In Keir Starmer's front bench reshuffle of November 2021, Cadbury was appointed Shadow Trade Minister.\n\n\n== Personal ==\nCadbury is a Quaker. She was one of three Quakers elected at the 2015 general election (the others being Labour's Catherine West and the Conservatives' Tania Mathias). She is an honorary associate of the National Secular Society.  Cadbury is married to Nick Gash, a non-executive director of the Chelsea and Westminster NHS Foundation Trust and former chair of West Middlesex Hospital (Cadbury's constituency local hospital).\n\n\n== References ==\n\n\n== External links ==\nOfficial website\n\nProfile at Parliament of the United Kingdom\nContributions in Parliament at Hansard\nVoting record at Public Whip\nRecord in Parliament at TheyWorkForYou\nAppearances on C-SPAN",
    "links": [
        "2015 United Kingdom general election",
        "2016 Labour Party (UK) leadership election",
        "Abena Oppong-Asare",
        "Alma mater",
        "Andy Slaughter",
        "Anushka Asthana",
        "Apsana Begum",
        "Bachelor of Science",
        "Bambos Charalambous",
        "Barry Gardiner",
        "Bell Ribeiro-Addy",
        "Birmingham",
        "Bournville College",
        "Brentford and Isleworth (UK Parliament constituency)",
        "C-SPAN",
        "Cadbury",
        "Catherine West",
        "Clive Efford",
        "Conservative Party (UK)",
        "David Lammy",
        "Dawn Butler",
        "Department for International Trade",
        "Diane Abbott",
        "Doi (identifier)",
        "Ellie Reeves",
        "Emily Thornberry",
        "European Single Market",
        "Feryal Clark",
        "Fleur Anderson",
        "Florence Eshalomi",
        "Gareth Thomas (English politician)",
        "George Cadbury",
        "Hansard",
        "Harriet Harman",
        "Helen Hayes (politician)",
        "Hounslow London Borough Council",
        "House of Commons of the United Kingdom",
        "ISBN (identifier)",
        "Incumbent",
        "James Murray (London politician)",
        "Janet Daby",
        "Jeremy Corbyn",
        "John Cryer",
        "John McDonnell",
        "Jon Cruddas",
        "Karen Buck",
        "Kate Osamor",
        "Keir Starmer",
        "LabourList",
        "Labour Party (UK)",
        "Leader of the Labour Party (UK)",
        "List of Labour Party Members of Parliament in London",
        "London Borough of Richmond upon Thames",
        "London Labour Party",
        "Lyn Brown",
        "Maiden speech",
        "Margaret Hodge",
        "Marsha de Cordova",
        "Mary Macleod",
        "Matthew Pennycook",
        "Meg Hillier",
        "Melanie Onn",
        "Member of Parliament (United Kingdom)",
        "Mike Amesbury",
        "Ministry of Housing, Communities and Local Government",
        "National Secular Society",
        "Owen Smith",
        "Parliament of the United Kingdom",
        "Public Whip",
        "Quakers",
        "Rosena Allin-Khan",
        "Rupa Huq",
        "Rushanara Ali",
        "Sam Tarry",
        "Sarah Jones (politician)",
        "Seema Malhotra",
        "Siobhain McDonagh",
        "Speech from the throne",
        "Stella Creasy",
        "Stephen Timms",
        "Steve Reed (politician)",
        "Tania Mathias",
        "The Guardian",
        "The Mount School, York",
        "TheyWorkForYou",
        "Tulip Siddiq",
        "University of Salford",
        "Vicky Foxcroft",
        "Virendra Sharma",
        "Wes Streeting",
        "Whip (politics)"
    ]
}