{
    "url": "https://en.wikipedia.org/wiki/Sahara_Las_Vegas",
    "title": "Sahara Las Vegas",
    "summary": "Sahara Las Vegas is a hotel and casino located on the Las Vegas Strip in Winchester, Nevada. It is owned and operated by the Meruelo Group. The hotel has 1,616 rooms, and the casino contains 50,662 square feet (4,706.7 m2). The Sahara anchors the northern end of the Las Vegas Strip, at the corner of Sahara Avenue. It is the site of the northernmost station of the Las Vegas Monorail.\nThe resort initially operated under the Sahara name from 1952 to 2011. Originally, Milton Prell opened the Club Bingo casino on the site in 1947. In 1951, he gathered former business partners to begin work on the Sahara, which was built on the land partially occupied by Club Bingo. Del E. Webb Construction Company built the Sahara, which opened on October 7, 1952, as the sixth resort on the Las Vegas Strip. It featured an African theme. Martin Stern Jr. designed several hotel additions for the Sahara, including a 14-story tower that opened in 1960. The Sahara was sold to Del Webb in 1961, and a 24-story hotel tower, also designed by Stern, was opened in 1963.\nThe Sahara began to decline in the 1960s with the opening of several large resorts nearby. Paul Lowden purchased the Sahara in 1982, and a third hotel tower was added in 1988. Lowden sold the Sahara to Bill Bennett in 1995, and Bennett launched a $100 million renovation of the resort that included a Moroccan theme. Bennett's renovation also added a NASCAR-themed attraction that included a restaurant and a roller coaster known as Speed – The Ride.\nSam Nazarian's SBE Entertainment Group, along with Stockbridge Real Estate Group, purchased the Sahara in 2007. The Sahara was closed on May 16, 2011, as it was no longer considered economically viable. In 2013, Nazarian began a complete renovation of the resort before reopening it as the SLS Las Vegas on August 23, 2014, as part of SBE's chain of SLS hotels. SLS Las Vegas featured a chic and modern design, and was targeted at southern California residents.\nThe SLS experienced financial hardships after its opening, and Nazarian sold his stake to Stockbridge in 2015. One of the hotel towers was rebranded the following year as W Las Vegas, managed by Starwood as part of its W Hotels chain. The SLS was sold to Meruelo Group in 2018, and the W Las Vegas became part of the SLS again after the resort ended its relationship with Starwood. The SLS was renamed Sahara Las Vegas on August 29, 2019, as part of an ongoing renovation by Meruelo.",
    "content": "Sahara Las Vegas is a hotel and casino located on the Las Vegas Strip in Winchester, Nevada. It is owned and operated by the Meruelo Group. The hotel has 1,616 rooms, and the casino contains 50,662 square feet (4,706.7 m2). The Sahara anchors the northern end of the Las Vegas Strip, at the corner of Sahara Avenue. It is the site of the northernmost station of the Las Vegas Monorail.\nThe resort initially operated under the Sahara name from 1952 to 2011. Originally, Milton Prell opened the Club Bingo casino on the site in 1947. In 1951, he gathered former business partners to begin work on the Sahara, which was built on the land partially occupied by Club Bingo. Del E. Webb Construction Company built the Sahara, which opened on October 7, 1952, as the sixth resort on the Las Vegas Strip. It featured an African theme. Martin Stern Jr. designed several hotel additions for the Sahara, including a 14-story tower that opened in 1960. The Sahara was sold to Del Webb in 1961, and a 24-story hotel tower, also designed by Stern, was opened in 1963.\nThe Sahara began to decline in the 1960s with the opening of several large resorts nearby. Paul Lowden purchased the Sahara in 1982, and a third hotel tower was added in 1988. Lowden sold the Sahara to Bill Bennett in 1995, and Bennett launched a $100 million renovation of the resort that included a Moroccan theme. Bennett's renovation also added a NASCAR-themed attraction that included a restaurant and a roller coaster known as Speed – The Ride.\nSam Nazarian's SBE Entertainment Group, along with Stockbridge Real Estate Group, purchased the Sahara in 2007. The Sahara was closed on May 16, 2011, as it was no longer considered economically viable. In 2013, Nazarian began a complete renovation of the resort before reopening it as the SLS Las Vegas on August 23, 2014, as part of SBE's chain of SLS hotels. SLS Las Vegas featured a chic and modern design, and was targeted at southern California residents.\nThe SLS experienced financial hardships after its opening, and Nazarian sold his stake to Stockbridge in 2015. One of the hotel towers was rebranded the following year as W Las Vegas, managed by Starwood as part of its W Hotels chain. The SLS was sold to Meruelo Group in 2018, and the W Las Vegas became part of the SLS again after the resort ended its relationship with Starwood. The SLS was renamed Sahara Las Vegas on August 29, 2019, as part of an ongoing renovation by Meruelo.\n\n\n== History ==\nBefore the Sahara was built, an earlier casino had operated on the site as Club Bingo. Around 1942, Melvin D. Close (1900–1974) purchased a 19-acre property on what would become the northern end of the Las Vegas Strip. Club Bingo owner Milton Prell had previously opened the 30 Club in Butte, Montana. Prell and his family then moved to Las Vegas in 1945, with the intention of opening a small hotel. Remembering how successful his earlier casino club had been, Prell opened the similar Club Bingo in Las Vegas before building a full hotel-casino. Prell opened Club Bingo with Frank Schivo, who previously worked at the 30 Club. Schivo managed Club Bingo's casino.Club Bingo opened on July 24, 1947, on 4 acres of the 19-acre property, and it quickly became a success. Club Bingo included a 300-seat bingo parlor as well as the Bonanza Room, which provided food and entertainment. Entertainers included singer Dorothy Dandridge and comedian Stan Irwin. Irwin eventually became the entertainment director for Club Bingo. The Club Bingo building was considered basic, with the exception of an electric bingo board sign on top.Prell briefly considered adding a small hotel and a village of adobe buildings to the Club Bingo property, but he decided against the idea because it did not fit in with his ultimate vision of a luxury hotel. In early 1951, Prell gathered several former business partners to begin work on a hotel-casino project that would become the Sahara. In July 1951, Close announced he had sold the remaining land for $225,000 to the Club Bingo owners. Plans were simultaneously announced for a 200-room hotel project that would be built on the land. The site was considered ideal for the new resort because it was located just outside of city limits, allowing Prell and business partner Al Winter to avoid paying taxes on slot machines and property. At the time, the project was expected to cost $2 million.Winter, a co-owner of Club Bingo, recruited Sam Boyd to be a partner in the new Sahara project. Boyd had previously operated a bingo game for Winter in Oregon. Boyd invested in the Sahara to become an owner and partner. Real estate developer Del Webb and his top executive, L. C. Jacobson, helped arrange financing for construction, which was handled by Del E. Webb Construction Company. Jacobson was also a partner in the project, holding a 20-percent interest. The Sahara was originally set to open in summer 1952, but construction delays pushed back the opening date.\n\n\n=== Early years ===\nThe $5 million Hotel Sahara opened on October 7, 1952, with an African Sahara theme. Attendees to the grand opening included Ray Bolger and Gus Greenbaum. It was the sixth resort to open on the Las Vegas Strip. Max Maltzman was the architect, and Ragnar Qvale was the interior designer. The Sahara utilized a modern and simple design. The North African desert theme was conveyed only minimally in the Sahara's architecture. Outside, the only depiction of the theme consisted of fake camels and Arabian people. The interior included statues of Arab guards.The Sahara was located on 20 acres (8.1 ha), employed 500 people, and contained 240 hotel rooms. The hotel consisted of two-story motel wings that formed a quadrangle around the pool. Each room included a patio or balcony. Other amenities included a casino, an 85-foot bar, and two restaurants: The Congo Room, which was the primary dining choice; and The Caravan, a coffee shop featuring hand-painted murals. These areas of the resort, as well as the Casbar Theatre, featured African images. Like at Club Bingo, Schivo managed the casino at the Sahara. Schivo's wife, Shirlee, would later help to decorate the hotel's interior during a refurbishment. Irwin also retained his position as entertainment director, responsible for arranging celebrity performances at the Sahara.The Sahara included the first Olympic-size swimming pool in Las Vegas, and would become the first hotel to host hydroplane races on Lake Mead. The Sahara Cup hydroplane races were first held in 1956, and continued for several years. In 1958, the hotel began sponsoring the Sahara Pro-Am golf tournament, played at an off-site golf course. It later became known as the Sahara Invitational. The hotel ended its sponsorship of the hydroplane races in 1959, stating that they had become too big of an event for a single organization to sponsor.\n\n\n==== Expansions ====\nUpon realizing that the resort needed more rooms, Prell hired Del Webb in 1954 to build additional units. The project took five months to construct, and was completed by 1955. Originally known as the Sahara Oasis Motel, the addition contained 192 rooms. It consisted of seven interconnected buildings, one of which connected to the main resort through an air-conditioned walkway. The addition was designed by Martin Stern Jr. as a two-story motel wing, built out in an \"E\"-like shape just south of the quadrangle structures. The addition marked Stern's first project in Las Vegas.\n\nIn 1959, a $3.5 million construction and remodeling project began at Hotel Sahara, including the start of construction on a 14-story hotel tower. The tower was designed by Stern, and construction was handled by Del E. Webb Construction Company. It was built southeast of the hotel pool. Construction on the tower had reached the eighth floor in November 1959, and the project was topped out in early 1960. Aside from the tower, other new features included a coffee shop with seating for 300 people, and a 700-person convention hall, located on the resort's north side. The 14-story Sahara Tower (later the Tunis Tower) opened in June 1960, adding 204 additional rooms for a total of 604. It was the tallest building in Nevada at the time. A flashing, electric clock was located atop the tower. The clock included the time as well as the temperature, and was topped by a letter \"S\" sign. Also added was a 127-foot vertical roadside sign, designed by YESCO and installed in front of the resort.By July 1961, there were plans for a $2.5 million renovation of the Hotel Sahara. Also planned was a 24-story hotel tower, designed by Stern, that would cost $4.5 million. The project would also include a parking garage along the Las Vegas Strip. Del E. Webb Corporation completed a purchase of the Sahara later in 1961, by acquiring shares in its corporate owner, the Sahara-Nevada Corporation. At the time, state law for gaming licenses meant that every shareholder in a company would have to undergo the mandated investigations of the Nevada Gaming Control Board. Because large corporations have many shareholders, this essentially prevented such companies from operating casinos in Nevada. Del Webb devised a plan to work around this issue by operating as a landlord, meaning its shareholders would not need to undergo investigations. A separate organization, Consolidated Casino Corporation, was set up by Del Webb to operate the casino. Jacobson, Prell and Winter owned Consolidated Casino Corporation, and Prell and Winter were also retained to serve, respectively, as chairman of the board and president of Sahara-Nevada Corporation. An expansion of the restaurant and lounge facilities was underway in late 1961, and an enlargement of the Casbar Theater was completed in early 1962.\n\nA groundbreaking ceremony was held on February 9, 1962, for the $6 million, 24-story Sahara Skyscraper hotel tower, located next to the Sahara Tower. The new tower, built by Del Webb, was expected to measure 260 feet in height. It would add 400 rooms, for a total of 1,000. Three swimming pools, including the original Olympic pool, opened in April 1962, after construction and remodeling. A keno facility opened later that year, making the Sahara the second hotel on the Strip to offer the game. The House of Lords steakhouse opened in August 1962. It became a popular hangout among celebrities who performed at the Sahara, including the Rat Pack. The restaurant was modeled after the real House of Lords in the United Kingdom.By October 1962, construction on the new tower had reached its 17th floor. A Don the Beachcomber restaurant opened the following month. At the time, Prell and other Sahara executives sought to rename the adjacent San Francisco Avenue as Sahara Avenue. Beldon Katleman, owner of the former El Rancho Vegas across the street, objected to the proposal, stating that the road should be renamed after his hotel-casino property. Despite the opposition, the street was renamed after the Sahara.In early 1963, several new facilities were opened in a new three-story building as part of a $12 million expansion. These facilities included the Caravan Room coffee shop and a 1,000-seat convention hall. Don the Beachcomber and the House of Lords were also part of the three-story addition. Temporary walls had been put up to shield casino customers from construction of the new facilities.\n\nThe 24-story hotel addition, eventually known as the Alexandria Tower, was opened in May 1963, with Nevada governor Grant Sawyer attending the ribbon-cutting ceremony. The clock and \"S\" sign were relocated from the original tower to the new tower. During 1963, to attract visitors, the casino introduced its Shower of Money, in which a selected participant would get into a plexiglass booth and be showered with $100,000 in money bills. The participant had one minute to push as much money as possible out through an opening in the booth, and that person would get to keep the ejected money.In August 1964, the Sahara paid $25,000 to have the Beatles perform in Las Vegas and stay at the resort, although their performance took place at the nearby Las Vegas Convention Center, as the Sahara's 600-seat showroom could not handle the crowd size of a Beatles concert. The Sahara would later display photos of the Beatles' visit to the resort. U.S. president Lyndon B. Johnson stayed at the hotel in October 1964.In 1967, there were plans to add a $3 million, two-story convention facility to the Sahara. In July 1968, the hotel was nearing completion on the facility, known as the Sahara Space Center. The facility opened in September 1968, and hosted U.S. vice presidential candidate Spiro Agnew for a speech. The Sahara Space Center measured 40,000 sq ft (3,700 m2), and included seating for up to 5,000 people.\n\n\n==== Incidents ====\nA rooftop fire occurred at the Sahara in August 1964, causing nearly $1 million in damage. A work crew had been on the roof installing a sprinkler system, and the fire was believed to have been caused by a smoldering rag. Firefighters put it out with thousands of gallons of water, which soaked through the main casino area's ceiling and also flooded the main showroom. Las Vegas sheriff Ralph Lamb believed the fire to be more financially destructive than the one which destroyed the El Rancho Vegas, stating that it was \"probably the biggest hotel fire we've ever had in Las Vegas.\" Some gamblers had been hesitant to quit playing and evacuate the casino.Approximately 100 workmen began repairs immediately following the fire, and most of the affected facilities reopened the day after. For its reopening, the Sahara sign advertised, \"Visit The Hottest Casino In Town.\" Casino operations were moved to a recently completed casino addition, adjacent to the main casino, that was unharmed by the fire. Full repair work was expected to take 30 days.In May 1967, three men were arrested after planting a homemade bomb in a Sahara hotel room on the 12th floor, part of a failed extortion attempt. A note was left demanding $75,000 for information to disarm the bomb. The note also warned that bombs had been placed in two other hotels owned by Del Webb. Seven hotels in three states were evacuated, but no other bombs were found.In July 1968, a fire started on the roof of the casino building, prompting the evacuation of hundreds of people. A crew had been working on a rooftop air conditioning unit, and the fire was believed to have started from a spark created by welding equipment. The fire caused an estimated $1 million in damage to the main casino area, the hotel's executive offices, the coffee shop, a lounge, and the showroom. The fire was stopped before it could damage a new casino addition, which had been in operation for several months and was located north of the main casino. The hotel portion was also unaffected by the fire, and its guests were not evacuated. Most of the affected facilities were expected to be quickly repaired and reopened the next day after the fire.In July 1981, a fire started in a third-floor hotel room and smoke poured through the upper floors, prompting the evacuation of more than 200 guests. The cause of the fire was considered suspicious.\n\n\n=== Decline and later years ===\nRevenue declined at the Sahara following the opening of several large resorts nearby, including Caesars Palace in 1966, the International Hotel in 1969, and the MGM Grand in 1973. Many of the Sahara's high rollers started going to Caesars Palace instead. Eugene Moehring, a history professor at University of Nevada, Las Vegas (UNLV), said the Sahara \"helped establish Las Vegas as a major resort city after World War II. But its contributions to Las Vegas shifted as the years went by. By the early 1970s it was getting to be old. One problem is that it just didn't have the money to keep up with the times.\" Webb died in 1974, leaving the resort under new management through his eponymous company.In 1975, a new, larger keno facility was opened to replace the original. The following year, Del Webb canceled its sponsorship of the Sahara Invitational golf tournament, due to rising costs over the past six years. In the late 1970s, the Sahara was among several casinos involved in a scam pulled off by gamblers. As a result, the Sahara faced a $37,500 fine by the Nevada Gaming Control Board, which alleged that the resort had violated casino procedures.A renovation was concluded by 1977. At the end of 1978, Del Webb launched a $50 million expansion project, with Stern as the architect. The project would include the addition of a 27-story hotel tower with 625 rooms. At the time, the Sahara had 953 rooms. The expansion would also increase the casino by nearly double, adding 18,000 sq ft (1,700 m2). The expansion was scheduled for completion in 1981. Increased parking space was also part of the project. In 1978, Del Webb purchased 25 acres at the southeast corner of Paradise Road and Sahara Avenue, directly east of the resort, and turned it into a rear parking lot for customers. A pedestrian bridge was also built over Paradise Road, allowing for direct access to the Sahara. The parking lot was once the site of Las Vegas' first airport, Anderson Field, during the 1920s.In 1980, Del Webb had a new sign installed in front of the resort. The sign was created by YESCO and measured approximately 223 feet in height, making it the world's tallest free-standing sign. A new entrance was also added to the resort's south side near Paradise Road, which had become the main exit road from McCarran International Airport. A foundation had been set for the new tower, but construction was halted in 1980, because of financial problems, as Del Webb and the Sahara struggled during the early 1980s recession.\n\n\n==== Lowden ownership ====\nIn 1981, Del Webb announced that it would have to sell the Sahara to reduce its debt. Paul W. Lowden, who owned the Hacienda hotel-casino, purchased the 932-room Sahara for $50 million. With the purchase, Lowden owned the southernmost and the northernmost casino resorts on the Las Vegas Strip. At the time, the Sahara had a 26,000 sq ft (2,400 m2) casino, as well as 2,500 employees, five of whom had been working there since its opening in 1952. As part of the sale, Del Webb retained the \"House of Lords\" restaurant name. Lowden finalized his purchase of the resort in August 1982, and he acquired the rear parking lot from Del Webb the following year.Shortly before Lowden took over, a Sahara blackjack dealer and seven card players were indicted for taking part in a cheating scheme at the casino. In addition, 50 table game dealers and six supervisors were laid off because of a reduction in business. The table dealers had previously voted to be represented by the Teamsters union, but Del Webb declined to discuss a contract. As Lowden assumed ownership, the dealers considered striking against him to protest the firing of longtime employees. They also wanted contract discussions to take place between Teamsters and Lowden. The dealers failed to get two-thirds support to go on strike.Shortly after taking over, Lowden, a born-again Christian, arranged for the hotel to host a convention of born-again Christians that would include speakers, singers, and teachers. Lowden also planned various improvements for the Sahara, including the hosting of boxing matches. A long-running production show, Bottoms Up, would be removed. Lowden considered the Sahara overstaffed and intended to make the resort more cost-efficient. He also disliked the way some of the employees behaved: \"I don't like to see the dealers leaning on the tables when no one is playing. There doesn't have to be regimentation, but they will stand up straight. The pit bosses won't be drinking coffee on the job. It's a firm but fair approach.\"Lowden believed that the resort could no longer attract high rollers, and he instead focused on middle rollers. He also expanded the Sahara Space Center to attract mid-sized conventions and more business meetings. Lowden had the casino expanded to 34,000 sq ft (3,200 m2) and had columns removed for a spacious appearance. He also moved the hotel lobby to the south entrance, allowing hotel guests to skip walking through the casino. This design had previously been implemented at competitors such as Caesars Palace. Because of interest costs, the Sahara failed to make a profit during the first four years of Lowden's ownership, but room occupancy was up in 1986 as a result of the renovations.In January 1987, Lowden announced the formation of Sahara Casino Partners, a master limited partnership. A portion of the interest in Sahara Casino Partners would be sold through an initial public offering to pay off debt and resume construction of the third hotel tower. Later that year, Sahara Casino Partners became the first casino-based limited partnership to be traded on the New York Stock Exchange. The partnership raised $51 million, and the debt was paid off later in 1987.The proposed hotel addition would bring the Sahara to 1,500 rooms, helping it compete with other major resorts in Las Vegas. A new sportsbook was opened in early 1988, and the hotel addition, ultimately known as the Tangiers Tower, was completed that September. In 1989, Lowden announced plans for 600 additional rooms, with completion expected the following year, at an expected cost of $30 million. The new rooms were housed in an additional tower attached to the Tangiers Tower. This brought the Sahara up to 2,100 rooms.The Sahara continued to decline in popularity as newer, bigger resorts opened on the Las Vegas Strip, including The Mirage in 1989 and the new MGM Grand in 1993. Lowden ultimately decided to sell the Sahara, saying later, \"All you had to do was look at The Mirage and say 'How do you compete with that?' The only way is (room) price and you can only do that for so long. We would have had to do something very expensive and we chose not to.\" The Sahara was also hurt by its location at the north end of the Las Vegas Strip, as newer resorts were opening further south.\n\n\n==== Bennett ownership ====\n\nIn June 1995, Lowden's Sahara Gaming Corporation announced that gaming executive Bill Bennett had agreed to buy the Sahara. Bennett completed his purchase later that year, at a cost of $193 million. Bennett owned the Sahara through his company, Gordon Gaming Corporation. The opening of the nearby Stratosphere resort in 1996 helped bring revenue back to the northern Las Vegas Strip and the Sahara.Bennett hired Joel Bergman to redesign the Sahara. A $65 million renovation began in March 1996, and was aimed at attracting midlevel gamblers. The original African theme had been largely discarded ever since Del Webb took over ownership, but Bennett restored it. His complete remodel featured a Moroccan theme throughout the resort. The prominent theming was in line with other new resorts on the Las Vegas Strip.Part of the renovation would include additional casino space and a new sportsbook. Two new restaurants would also be added, along with a new buffet. The renovation was funded entirely by Bennett and his company. The start of the renovation project was marked by the demolition of the original poolside motel structures, which had housed various celebrities such as Ann-Margret, George Burns, and Tony Bennett. The renovation was scheduled for completion in January 1997, at which point a second phase of remodeling was scheduled to begin. The second phase was intended to add 1,300 rooms, for a total of more than 3,000. Plans for an additional hotel tower were later put on hold in order to evaluate the performance of other new hotel additions in Las Vegas. Ultimately, construction never began on the new tower.As part of the renovation work, the resort's main entrance was relocated from the north side of the property to a new southwest entrance on the Las Vegas Strip. The casino was increased to 95,000 sq ft (8,800 m2), with expansion into the southeast area of the property, bringing the gaming closer to the hotel and the newly relocated pool area. Chandeliers were placed throughout the resort. A $4.6 million porte-cochère was added, consisting of an expansive overhead Moroccan-style dome, measuring 140 feet high and 200 feet in diameter. Fountains and palm trees surrounded the hotel's circular entryway. A seven-story parking garage with 2,000 spaces was added as well, replacing the 1954 motel addition. The demolition of the Sahara's old motel buildings reduced the room count from 2,100 to approximately 1,800. A new sign, featuring two neon camels, was added along the Las Vegas Strip. A smaller neon camel sign was also added to the rear entrance on Paradise Road.\n\nIn January 1997, the resort opened its new Sahara Buffet, which had been relocated to the second floor for views of Sahara Avenue and the nearby Stratosphere tower. The new buffet was part of the ongoing renovation work, and it occupied the site previously used for the Sahara Space Center. With 1,154 seats, it was the second largest buffet in Las Vegas, only behind the buffet at the Excalibur Hotel and Casino. On October 10, 1997, the Sahara opened Speedworld, its $15 million race car simulator attraction. It measured 35,000 sq ft (3,300 m2) and featured 24 vehicles with a television screen built into each one. Bennett enjoyed auto racing, and he had previously helped finance the Las Vegas Motor Speedway.The resort's renovation project ultimately cost $100 million. Part of the project included the new Sahara Steak House, which opened in December 1997, as the renovations were nearing completion. Plans were approved in July 1998 for a new Sahara convention center to be built on the parking lot behind the resort. However, these plans were put on hold later that year as there was also a preliminary idea for a parking garage to be built on the land, for the upcoming Las Vegas Monorail.\n\nIn October 1998, plans were approved for a roller coaster that would be built inside the Sahara, with a height of 100 feet. The following year, the design plans changed so that the roller coaster would be located outside, with a new height of 244 feet. The coaster was part of a planned NASCAR restaurant that would be added to the resort. The original Congo Showroom was demolished in 1999, to make room for the NASCAR Cafe. The showroom was relocated to the second floor. The NASCAR Cafe was housed in a new 75,000 sq ft (7,000 m2) building constructed at the corner of Las Vegas Boulevard and Sahara Avenue. The restaurant and roller coaster were part of Bennett's $100 million renovation project.The NASCAR Cafe opened on March 2, 2000. The grand opening was attended by 20 NASCAR racers. The NASCAR roller coaster, known as Speed – The Ride, opened a month later. The $6 million roller coaster included a 79-foot loop and a 224-foot tower peak. At 70 miles per hour, it was the fastest roller coaster in Las Vegas. It was designed and built by Premier Rides. The Sahara Speedworld was renamed as the Las Vegas Cyber Speedway, and it was included as part of the new NASCAR-themed attraction, which was owned by a company separate from the Sahara. The Sahara received $2 million a year through a lease agreement, as well as 50 percent of the gross revenue. A video game arcade was also added in 2000 along with the NASCAR attraction, and the Sahara Theater was added later that year. At the time, Bennett was still considering the addition of a convention center to the rear parking lot, which was under-used.The Sahara began appealing to middle-class customers under Bennett's ownership, offering dollar specials to stay competitive against newer resorts. UNLV professor Moehring considered the Moroccan and race car themes to be an awkward combination. He stated that Bennett's idea of combining \"Arabs with NASCAR\" was a desperate move that ultimately did not work, and that the Sahara mainly attracted low rollers from the 1990s onward.A modest celebration was held in October 2002, marking the resort's 50th anniversary. By that time, the capacity for the Congo Room theater had been reduced from 1,000 people to 850, and dinner was no longer served with the show. Bennett was suffering from an illness at the time, and employees stated that he was micromanaging the resort, having a negative effect on the staff. During 2002, the Sahara had gone through three general managers. Bennett died in December 2002. Following his death, there were no plans to sell the Sahara. Bennett's wife, Lynn, oversaw daily operations from that point forward along with her brother, Al Hummel, who served as the resort's chief executive officer. The steakhouse reopened under the House of Lords name on April 30, 2003.\n\nIn June 2003, Gordon Gaming sought to evict the NASCAR Cafe and owner Dyer Ventures. The attempted eviction was in response to alleged breaches in its lease regarding maintenance. Efram Rosenfeld, an attorney for Dyer Ventures, said, \"We had an excellent relationship with [Bennett]. The current management has become very hostile. They just want to see if they can grab the money.\" Rosenfeld believed that the resort wanted to operate the NASCAR attraction on its own to avoid sharing revenue. Gordon Gaming stated that the cafe was not being operated in a way that would maximize its gross sales. Later that month, the two companies resolved the issue, with Dyer agreeing to make improvements to the attraction. Gordon Gaming later purchased the attraction in 2005. The sale included Speed – The Ride, the race car simulators, and a NASCAR store. The cafe remained under Dyer's ownership.The opening of the Las Vegas Monorail increased visitation to the Sahara. By February 2006, Hummel had turned down hundreds of offers to purchase the resort, saying that the prospective buyers and the timing never seemed right. By June, the Sahara site was reportedly up for sale. Lynn Bennett died in December 2006, at the age of 64.\n\n\n==== SBE and Stockbridge ====\nIn March 2007, Sam Nazarian's SBE Entertainment Group, along with Stockbridge Real Estate Group, agreed to purchase the Sahara from the Bennett family, at a cost of $331.8 million. The purchase would include the Sahara and its 17.45 acres, but not the rear parking lot. Stockbridge would be the majority owner. Nazarian considered the Sahara ideal because of its proximity to the Las Vegas Convention Center, the planned Echelon Place resort, and several new high-rise condominiums.SBE and Stockbridge completed their purchase on August 1, 2007. Under the new ownership, the Sahara's casino portion was operated by Navegante Group. SBE and Stockbridge also filed for their own gaming licenses. Navegante had a one-year lease, and was to operate the casino only until SBE and Stockbridge received their licenses, but Navegante ultimately operated it for the next four years until the resort closed. SBE managed the hotel and restaurants.Nazarian had plans to renovate and redesign the Sahara. In the months after taking ownership, the companies spent $2 million on various upgrades, including new carpeting, seating and wallpaper in the hotel lobby. Hotel employees received new uniforms and the landscaping was also improved. Mini-baccarat was added to attract an Asian clientele, and casino specials were added to lure more local residents to the property. Revenue improved following the changes, and there were plans for a complete renovation of the resort. The companies intended to keep much of the historic hotel intact rather than demolish it, although there was the possibility of a name change. The Clark County Commission approved renovation plans in February 2008. The plans would include the demolition of the original Tunis Tower, the renovation of the two newer high-rise towers, and the addition of a new tower measuring 520 feet in height. The plans were scheduled for completion in 2011, but construction never began due to the Great Recession, which negatively impacted the Sahara and the northern Las Vegas Strip.In 2008, the Sahara designated a portion of its casino space as \"Locals Lane,\" part of an effort to appeal to local residents. Slot machines in this area gave higher payouts, and a separate slot club redemption center was also set up for locals. In addition, the slot club provided such customers with discounts on hotel rooms, restaurants, and shows. In 2009, the Equal Employment Opportunity Commission filed a lawsuit on behalf of a Sahara employee who said he was repeatedly harassed because of his Egyptian heritage. Gordon Gaming, SBE and Stockbridge subsequently agreed to pay a total of $100,000 to settle the lawsuit. In December 2009, the Sahara closed its buffet and two of its hotel towers due to weak demand during the holiday season. The Tangiers Tower remained open. In 2010, Nazarian was in negotiations with lenders to restructure the Sahara's debt, ultimately reaching a forbearance agreement with Royal Bank of Scotland Group, the primary lender.\n\n\n=== Closure ===\n\nOn March 11, 2011, it was announced that the Sahara would close in two months. At the time, the Sahara had 1,720 hotel rooms and 85,000 sq ft (7,900 m2) of casino space, and offered the only $1 blackjack on the Las Vegas Strip. The resort featured two primary restaurants at the time: House of Lords steakhouse, and the NASCAR Cafe. The Sahara had 1,050 employees who would be affected by the closure. SBE intended to help find new jobs for Sahara employees at MGM Resorts' properties. Hotel customers with reservations following the planned closing date would also be transferred to MGM Resorts' properties.At the time of the closing announcement, Nazarian, the CEO of SBE, said, \"We are working with our partners to assess a variety of options for the property, including a complete renovation and repositioning. While no final decisions have been made at this point, the continued operation of the aging Sahara was no longer economically viable.\" Jerry Lewis, once a performer at the Sahara, said, \"We are losing what was considered by most of us Las Vegans as one of the trademarks of the city.\" Lowden said he was not saddened by the closure: \"I like progress. I like change. It's fun to look back, but this might be a chance for the Sahara to move forward.\"Speed – The Ride closed on May 1, 2011. It was later sold and removed. The sports book and Sahara Theater closed later in May 2011. The resort's hotel and casino closed at 2:00 p.m. on May 16, 2011, marking the end of the Sahara's 58-year operation. National Content Liquidators began a two-month liquidation sale at the Sahara in June 2011, with more than 600,000 items available for sale on the first day. The contents of the NASCAR Cafe were initially excluded from the sale, although an auction was later held for 2,000 items from the restaurant. The sale of the resort items concluded in September 2011, and it attracted thousands of people over the course of its run. It was the largest liquidation sale in Las Vegas history. Items that did not sell were donated. The camel sign at the rear entrance was donated to the city's Neon Museum.\n\n\n=== SLS Las Vegas ===\nIn September 2011, plans to redevelop the Sahara were accelerated, as SBE and Stockbridge announced the purchase of the resort's mortgage debt. Gensler was hired as the architectural design firm, while Penta Building Group would serve as the general contractor. Philippe Starck would handle the interior design. Starck was a longtime partner of Nazarian, and his design plans for the Sahara dated to 2007.Later in 2011, the Clark County Commission approved renovation plans for the resort. The Sahara would be renamed as SLS Las Vegas, part of SBE's growing chain of SLS-branded hotels in the United States. The name \"SLS\" stood for style, luxury, and service. Nazarian planned to remodel the Sahara into a luxurious boutique hotel, matching his other properties. The Las Vegas location would include restaurant and nightlife brands affiliated with SBE, and would provide a Beverly Hills experience. The room count would be reduced from 1,720 to 1,622 as a result of the renovations. The plans would also include the demolition of Speed – The Ride. The SLS Las Vegas would oversee all amenities, unlike other casinos which would lease such space to third-party operators.Nazarian hoped to have SLS Las Vegas opened in the second quarter of 2014, and he needed to raise $415 million from investors and lenders to convert the Sahara into the new resort. The project was expected to cost a total of $744 million, with SBE and Stockbridge contributing $329 million. The project's financing plan would include investors through the EB-5 program. Moody's and Standard & Poor's considered the project risky because of its location, and they questioned the owners' ability to pay off future debt.\n\nIn April 2012, the project secured $300 million in funding through JPMorgan Chase. Nazarian said the Sahara hotel towers would be \"stripped down to their skeletons\" to allow for renovation work. SBE was known for redeveloping old hotels into new ones rather than demolishing them. Nazarian said, \"Instead of exploding an Old Vegas landmark like everybody else does, I am reusing the bones to build something new. I'm making it smaller and more personal, though, so the experience is more manicured. Bigger isn't better.\" Retaining the hotel buildings would allow the SLS to offer low room rates.Groundbreaking for the SLS Las Vegas project took place on February 13, 2013, after the EB-5 program provided the remainder of the $415 million needed to renovate the Sahara. Senator Harry Reid, the U.S. Senate Majority Leader, later received criticism for using his power to expedite the EB-5 process for Asian investors in the SLS. Reid defended his action, stating that the project otherwise could have lost funding, resulting in the loss of future jobs. The EB-5 financing came from 800 Chinese investors. A three-month demolition phase was underway in March 2013, with much of the interior gutted. The Sahara's camel sign on the Las Vegas Strip was dismantled, followed by the removal of the Moroccan-style dome.In early 2014, it was announced that the SLS Las Vegas would open later that year on August 29, during the Labor Day weekend. In June 2014, it was announced that the SLS would be part of Hilton's Curio brand, which allowed customers to use and earn points at select hotels. The SLS was also part of the Preferred Hotels & Resorts guest loyalty program, increasing the potential for a customer base. SBE also had a loyalty program of its own with more than five million customers in its database, with an average age of 38 years. Many of those customers lived in southern California.Construction progressed ahead of schedule, prompting a new opening date of August 23, 2014. A $5.2 million marketing campaign was launched to promote the opening. The campaign honored the original Sahara through photographs taken during the 1960s, alongside modern images of the SLS. Historical photos were also featured inside the SLS. Carpeting throughout the resort featured the images of celebrities who had performed at the Sahara over the years, including Dean Martin. Approximately 50 S-shaped Sahara door handles were turned into a chandelier for the SLS.Stockbridge received state approval to operate the casino two days prior to the scheduled opening. Stockbridge would operate it through a subsidiary known as SB Gaming. The Nevada Gaming Commission requested that Nazarian and SBE not have any involvement in the casino operation until his license investigation was concluded, a process that was expected to take up to five months. Nazarian and SBE would manage all other areas of the SLS. Stockbridge owned 90 percent of the resort, while SBE owned the remainder.\n\n\n==== Opening ====\n\nSLS Las Vegas hosted a VIP party on the night of August 22, 2014, ahead of the public opening at midnight. The VIP party hosted 3,600 guests, including various celebrities. Thousands of local residents arrived for the midnight opening, which was celebrated with performances by Iggy Azalea, Rita Ora, and Lenny Kravitz. A fireworks display also marked the celebration. It was the first new resort to open on the Las Vegas Strip since the Cosmopolitan in 2010. The SLS employed 3,400 people, including nearly 100 former Sahara employees.The SLS Las Vegas was SBE's flagship property with 1,620 rooms, the most of any of its hotel properties. The SLS featured a chic and modern design. The target demographic consisted of residents from southern California, as well as younger people. The resort had a focus on offering amenity brands that were popular in Los Angeles, where Nazarian owned several businesses such as nightclubs. The SLS also sought to attract between 35 and 40 percent of its business through local residents, a demographic that generally did not venture to the Las Vegas Strip. Restaurants and nightclubs were priced low to attract locals, and resort entrances were situated to allow locals to easily access the eateries. The SLS would also appeal to local residents through gaming and restaurant promotions. The Sahara's original entrance for the Las Vegas Monorail was demolished and rebuilt for easier access from the casino. The resort also took advantage of its proximity to the Las Vegas Convention Center by offering convention guests with discounts on the monorail.\n\nLittle remained of the earlier Sahara resort, aside from the exterior shell of its buildings. The Sahara hotel towers were renamed as the Lux, Story, and World towers, catering respectively to luxury travelers, younger people, and tourists. Kravitz designed four suites for the SLS, and the former Alexandria Tower was turned into an all-suite building. The World tower was the largest, with 1,100 rooms. The rooms in the Story tower featured a basic design with gray walls and exposed concrete ceilings. Nazarian's plans made the resort more spacious and provided easier access to the hotel towers and the 45,000 sq ft (4,200 m2) conference center. The Sahara's Congo Room was renamed as the Congo Ballroom. A portion of the former NASCAR Cafe was turned into space for gambling, nightclubs, and the Bazaar Meat steakhouse. Along the Las Vegas Strip, an indoor-outdoor patio area was added to serve as a beer garden, taking the place where Speed – The Ride once operated.Nazarian had the casino floor redesigned for a darker appearance resembling a nightclub, with a high ceiling and exposed ductwork. Part of the casino featured floor tiles that changed colors. The casino measured 56,000 sq ft (5,200 m2) and included 790 slot machines, as well as 74 table games. The casino was small compared to others on the Las Vegas Strip. In contrast to the Sahara casino, the number of slot machines in the SLS was reduced to allow more table games. The updated SLS floor plan had gaming throughout the property, including table games in one of the nightclubs and in a restaurant's lounge area. The casino also included a sports book operated by William Hill.Prior to its opening, observers were concerned that the SLS did not have enough of a focus on its casino portion. The Cosmopolitan, also a modern resort with a limited focus on gaming, had lost money since its opening in 2010. However, gaming was no longer a primary source of revenue for most casino resorts in Las Vegas. As the opening approached, analysts believed the SLS would perform better than the Cosmopolitan.The SLS opened with nine restaurants, many of which were popular in Los Angeles. José Andrés had two restaurants at the resort, including Bazaar Meat. Andrés had been a partner of SBE for six years. The resort also included an Umami Burger, the SLS Buffet, the Griddle Cafe, and a Mediterranean restaurant known as Cleo.The SLS had three nightclubs: Foxtail, Life, and Sayers Club. Foxtail had an 8,000 sq ft (740 m2) interior space. It also featured a 43,000 sq ft (4,000 m2) exterior area known as Foxtail Pool Club, open during certain times of the year. Foxtail Pool Club parties included 3D images projected onto the wall of the resort's parking garage. Life measured 20,000 sq ft (1,900 m2), and took the space formerly occupied by the Sahara Theater. Life had capacity for 1,800 people, and included three bars, 70 VIP tables, DJ music, and a rooftop pool smaller than the one at Foxtail. The Sayers Club originated in Hollywood in 2011, and the SLS Las Vegas marked its second location. The club measured 4,700 sq ft (440 m2) and included capacity for 168 people. It doubled as a live music venue.\n\nClothing retailer Fred Segal operated seven stores throughout the SLS, each offering different merchandise and taking up a total of 10,000 sq ft (930 m2). Fred Segal was a well known retailer in the Los Angeles area and was added to SLS Las Vegas to provide southern California tourists with familiarity. It marked the first time that Fred Segal opened a location outside of southern California.A 32-foot-tall abstract statue, known as Sam by Starck, was designed by Starck and placed in front of the SLS, as a homage to Nazarian. The statue, resembling a silver starfish, was compared by some observers to the Stay Puft Marshmallow Man and the Pillsbury Doughboy. The statue, which used an internal steel frame, was constructed on-site and in pieces. A 12-foot metal duck statue, also by Starck, was added to the hotel's pool area. The duck statue was filled with Styrofoam and was glued in place.The opening of the SLS was considered a positive step for the north Las Vegas Strip following the Great Recession. The resort soon became a popular hangout for celebrities.\n\n\n==== Changes ====\nThe SLS opening was followed by the winter season, typically a weaker business period for Las Vegas resorts. The SLS experienced various hardships during its first year. In October 2014, the SLS laid off less than two percent of its workers. A reduction in staffing was common for Las Vegas Strip casinos shortly after opening, as business is difficult to predict prior to that point. The number of layoffs was low for a Las Vegas resort. Rob Oseland, the president of SLS Las Vegas, announced later that month that he would depart the property to work on a new project. Such departures are also common following a resort opening. He was replaced by Scott Kreeger, a former executive for MGM Resorts and Station Casinos. The buffet did not perform as hoped, due to its location on the second floor. It was temporarily closed for the season in November 2014, with an expected reopening the next year.In December 2014, during a hearing with the Nevada Gaming Control Board, Nazarian admitted to drug use earlier in the year. The board had concerns about this and also questioned Nazarian's handling of an extortionist who received money from Nazarian to leave him alone. The board was concerned that Nazarian could be easily manipulated, but ultimately recommended him for a limited gaming license. Later that month, Nazarian and Stockbridge came to a mutual agreement that he step back from all daily operations at the SLS. Nazarian said he wanted to focus on other SBE brands, while SBE would continue to operate the non-gaming areas of the SLS.Although Nazarian was no longer involved in operations, state law still required that he be licensed, as he owned more than five percent of the resort. A few days after Nazarian's departure, the Nevada Gaming Commission held a hearing in regard to his licensing. Although the commission intended to deny him, Nazarian apologized for his past actions and convinced the commission to grant him a one-year limited gaming license. Because of the prior concerns regarding Nazarian, there were several conditions relating to his license, including random drug testing and no involvement in casino operations.Although the Griddle Cafe was popular among customers, its owner chose to close it in January 2015, to focus on new locations. The restaurant was renamed as Northside Cafe the following month. At the time, there were no plans to reopen the buffet, and the Foxtail club had seen poor revenue. In addition, Dean Martin's family had requested a $50,000 licensing fee for using his image on the resort's carpeting. The family stated that the image infringed on Martin's right of publicity, and legal action was threatened if the SLS did not either remove the carpet image or pay the fee. The SLS filed a lawsuit against Martin's family and sought a declaratory judgment that the carpeting was not infringement. In May 2015, the Teamsters union picketed for several days outside the SLS, alleging that the resort refused to let its valet parkers form a union.The SLS experienced revenue losses during the first half of 2015. Walk-in traffic was poor due to the resort's location, surrounded by unbuilt projects. The SLS was also half a mile away from its nearest rival resorts, further contributing to a lack of walk-in business. However, the monorail helped increase customer numbers. Kreeger estimated that a complete turnaround at the resort could take 18 to 24 months as adjustments were made. In response to the losses, there were plans to turn the Life nightclub into a live music venue with a third-party operator to manage it. The casino's loyalty club was revamped in a further effort to attract locals, and Kreeger wanted to double the resort's convention space. There was consideration given to turning the closed buffet into additional meeting space.Two SLS restaurants were sold to restaurant operator One Group in July 2015, although SBE continued to manage them. The following month, Fred Segal closed its stores at the SLS, and the resort opened three of its own retailers as a replacement. Kreeger said that local customers were not interested in the high-priced clothing at the Fred Segal stores, and tourists from southern California already have such stores to shop at, leading to the closure of the SLS locations. The SLS continued to suffer financially.\n\nIn October 2015, it was announced that Nazarian would sell his 10-percent interest to Stockbridge, which would pay a licensing fee to SBE to continue using the SLS name. Stockbridge stated that the deal would be more cost-efficient and would give greater flexibility to open new restaurants at the resort. Nazarian also considered the deal beneficial. The acquisition was approved by the state in November 2015, and Stockbridge ended its affiliation with Hilton and its Curio collection.That month, Stockbridge announced a partnership with Starwood to take over the 289-room Lux tower and reopen it in 2016 under the name W Las Vegas. W Hotels was considered a luxury brand, and the new project was expected to increase revenue by attracting a more upscale demographic. In addition, the two SLS towers were be added to Tribute Portfolio, a chain of independent four-star hotels. Both companies financed the W Las Vegas project, while the other two towers remained part of the SLS Las Vegas. Starwood managed the W Las Vegas, while Stockbridge continued managing the SLS. It would mark the first W hotel in Las Vegas after several previous attempts to build one, including a failed project near the Las Vegas Strip.The Life nightclub reopened as a live music venue, The Foundry, in February 2016. The Foundry had capacity for 1,800 standing guests, or seating for 600. Musical acts were handled by Live Nation Entertainment. The Sayers Club had begun offering comedy acts, which were also offered at The Foundry in addition to its musical performances.W Las Vegas had been scheduled to open in September 2016, but this was delayed when Starwood was acquired by Marriott International that month. W Las Vegas ultimately opened on December 1, 2016, becoming the city's latest hotel-within-a-hotel after others such as Delano Las Vegas. It included its own entrance at the rear of the SLS. It also featured a W-branded spa, and a three-floor building with 15,000 sq ft (1,400 m2) of event and meeting space. The three-story building was a new addition. A 13,500-pound neon \"W\" letter was added atop the SLS sign on the Las Vegas Strip.Kreeger resigned as SLS Las Vegas president at the end of 2016, to work for another company. Several weeks later, Terry Downey was named as the new president and chief operating officer, while Robert Schaffhauser was named as chief financial officer. They had previously worked as executives for the Aliante hotel-casino in North Las Vegas. Downey and Schaffhauser subsequently hired 13 executives from the Aliante for new positions at the SLS.\n\n\n==== Sale to Meruelo ====\n\nIn May 2017, it was announced that Reno businessman Alex Meruelo and his company, Meruelo Group, would purchase the SLS Las Vegas from Stockbridge. The sale was initially expected to be finalized later that year, although continued price negotiations between Meruelo and Stockbridge pushed back the completion of the purchase. Following the announcement of the sale, the SLS renamed its rewards program from \"The Code\" to \"Club 52\", referencing the resort's initial opening in 1952. The \"SLS\" name was not popular among gamblers, and there were rumors that the resort would revert to its \"Sahara\" name once Meruelo took over ownership. At the time, the casino measured 50,662 sq ft (4,706.7 m2), excluding an 1,800 sq ft (170 m2) sports book. Downey and Schaffhauser stepped down from their positions in July 2017. Such departures were common during an ownership transition.At the end of 2017, a lawsuit was filed by 60 Chinese residents who had invested in the SLS through the EB-5 program. The suit was filed against Stockbridge, SBE, and Meruelo. The investors had yet to receive a green card through the program, and they alleged that the resort had never made a profit. They sought $255 million in damages and other costs, and stated that Meruelo's purchase would nullify their chances at getting a green card. Meruelo negotiated with the investors regarding their loan money, which was due back in 2018 and 2019. The dispute further delayed the sale to Meruelo.In February 2018, the Culinary Workers Union was in a labor dispute with Meruelo regarding his employees at the Grand Sierra Resort in Reno, Nevada. The union subsequently called for a state investigation into Meruelo's impending purchase of the SLS Las Vegas, citing concerns about his suitability to own and operate the resort. The union also cited objections from the EB-5 investors regarding the proposed sale. Meruelo Group completed its purchase of the SLS in April 2018. At the time, the SLS employed 1,800 people.Alex Meruelo had plans for a $100 million renovation of the resort, and he was also expected to rebrand it in 2019. Observers speculated that the resort would revive the Sahara name, and renovation plans used a \"working name\" of \"Grand Sahara Resort\", mirroring the Grand Sierra Resort. Paul Hobson was hired as general manager and would oversee the renovations. Meruelo considered the Hispanic clientele in Las Vegas underserved, and stated that it would be among the target demographics for the resort under his ownership. Meruelo owned two television and three radio stations in California, which he would use to promote the SLS.In August 2018, the W Las Vegas was renamed as the Grand Tower and brought back under in-house management, as part of Meruelo's plans for the resort. At the time, the SLS had a total of 1,616 rooms. Meruelo's $100 million renovation began in October 2018, and included upgrades to the hotel's rooms, hallways, and lobby. Meruelo had the casino floor brightened, as he considered it too dark. The Story tower was updated to remove its basic design in favor of a more conventional appearance, as most guests did not like the earlier design. Meruelo's construction firm handled the upgrades. The SLS became profitable near the end of 2018, and there was optimism that the resort would continue to improve in the coming years with the scheduled resort openings of The Drew and Resorts World, as well as an expansion of the Las Vegas Convention Center.\n\n\n=== Return to Sahara ===\nMeruelo held an enormous ceremony involving fireworks and a light show on June 27, 2019, to announce an upcoming name change to Sahara Las Vegas, as part of the ongoing renovation. The resort would continue to operate under the SLS name for several months until the Sahara name was fully implemented throughout the resort. The process to replace the SLS branding, including exterior signage, was expected to conclude in September or October 2019, at which point the resort would be marketed under the Sahara name.On the night of August 27, 2019, the Sam by Starck statue was removed during a ceremony and subsequently disposed, as part of the Sahara rebranding. The ceremony began with flames that were set off at the base of the statue, followed by a fireworks show. A crane subsequently tore the statue down. Palm trees are expected to take the place of the former statue. Because of the way that the statue was constructed, a company spokesman stated that it would be nearly impossible to disassemble the statue and restore it elsewhere for display. The pool area's duck statue was expected to be relocated to the pool at the Grand Sierra Resort.The resort became Sahara Las Vegas on August 29, 2019, and renovations were expected to continue into 2020. A renovation of the pool area was scheduled to begin in September 2019. The Sahara's new lounge was named Casbar Lounge, after the resort's original live-music venue. The Sayers Club was renamed Club 101. The new Sahara is modern in its design and does not feature a Moroccan theme as before, although it features references to the original Sahara. Hobson said, \"You might see some camels in artwork around the property, but nothing in terms of a theme. There will be reference to the original Sahara era that reflects what we want for the modern era. There's some nostalgia, but we are defining it for today.\" A few months after its opening, the Sahara Las Vegas sought donations of old memorabilia from the original Sahara for display in the resort.A poker room opened in February 2020, as part of the renovation project. Poker had been absent from the casino for nearly a decade, and many Las Vegas casinos had shut their poker rooms in recent years due to a decline in popularity. The resort also planned to add a restaurant row, which would replace Club 101. Sahara executives intended to use the resort's restaurant space and pool decks to host meetings and conventions, recapturing a demographic that was largely ignored when the resort operated as SLS Las Vegas.In September 2021, the resort opened its 35,000 sq ft (3,300 m2) renovated pool area, known as Azilo Ultra Pool. The Moroccan-inspired pool area would also be available as event space. It includes two giant LED walls, measuring two stories in height. The pool area replaces the Foxtail club, and is part of the resort's $150 million renovation plans, which also include several restaurants such as Chickie's & Pete's.\n\n\n== Entertainers ==\n\nNumerous performers have entertained at the resort over the years, including Buddy Hackett, Liberace, Edgar Bergen and Charlie McCarthy, George Burns, and Sammy Davis Jr. Other performers included Bobby Darin, Red Skelton, Ann Blyth, Martha Raye, Donald O'Connor, Louis Prima, Kathryn Grayson, Mae West, Jack Benny, Frank Sinatra, Dean Martin, Ann-Margret, George Carlin, Tina Turner, and drag queen Kenny Kerr.In 1952, Sahara owner Milton Prell booked transgender woman Christine Jorgensen to sing at the Sahara, without hearing her first. Prell learned prior to her two-week gig that she could not sing well, and he canceled her performances by claiming that he did not know about her transgender status. Bill Miller, the resort's entertainment director at the time, sent a letter to Jorgensen reading, \"I'm not going to pull a farce on my customers. I won't give them a man dressed in women's clothing. I bought a 'she.'\" In 1953, after Jorgensen gave a performance in Pittsburgh that was positively reviewed, Prell signed her back up for a two-week gig at the Sahara, which proved to be a success.In 1953, singer Marlene Dietrich was paid $90,000 to give performances for three weeks at the Sahara. A $200,000 contract was later announced that would have Dietrich perform in two separate engagements at the hotel, each spanning four weeks. The Sahara subsequently took credit for pioneering the concept of high-priced acts, citing Dietrich's initial performances there in 1953. In late 1954, Miller hired jazz musician Louis Prima to be their late night lounge act, one of the earliest ones on the Las Vegas Strip. Along with his then-wife Keely Smith and sax player Sam Butera, they created one of the most popular late-night attractions on the Strip.In 1956, Abbott and Costello appeared together for the last time on the Sahara stage before their permanent breakup. Don Rickles was a regular performer at the Sahara and launched his Las Vegas career there in 1959. In 1961, Eleanor Powell came out of retirement after 14 years to star in a musical revue at the Sahara. Judy Garland performed at the resort in 1962, and Johnny Carson regularly appeared at the Sahara's Congo Room from 1962 to 1974. In 1965, Milton Berle starred in a comedy show at the Sahara known as Never Too Late.Several live albums were recorded at the Sahara, including Live from Las Vegas by Prima and Smith, Live at the Sahara: Las Vegas, 1964 by Tony Bennett, Live at The Sahara in Las Vegas by Connie Francis, and Live in Las Vegas Vol. 2 by Sonny & Cher. The resort was the site of the annual Jerry Lewis Labor Day Telethon for many years, first from 1973 to 1981 and again from 1991 to 1994. Jerry Lewis himself also performed at the resort. The Sahara Space Center hosted events such as boxing matches, and the Jerry Lewis telethon. It also hosted the bands Kiss and Rush in 1975.In early 2000, The Amazing Johnathan hosted a magic act at the Sahara during a five-week period. Shortly thereafter, the hotel launched a Rat Pack tribute show known as The Rat Pack is Back. Later in 2000, Steve Wyrick began hosting a magic show at the Sahara Theater. Resort owner Bill Bennett gave Wyrick full control over the design of the new theater, which had seating for 860 people. Charo, who made her headliner debut at the Sahara two decades earlier, started a concert show at the resort in 2002. The following year, the Sahara launched \"World's Greatest Magic Show\", a variety style show featuring eight to ten magicians, each performing their best trick.The Amazing Johnathan opened another magic show at the Sahara in 2005. He left two years later to focus on television production, and was replaced by comedian Roseanne Barr. The Scintas performed at the Sahara for a year, before departing in 2007. In 2008, the Sahara launched a dance show called Raw Talent Live, focusing on the relationship between humans and technology. In 2009, The Comedy Stop relocated from the Tropicana resort to the Sahara, offering a rotating lineup of comedians. During the same year, the Sahara debuted an act by magician Rick Thomas, and a new Rat Pack tribute show by Sandy Hackett.Comedian Eddie Griffin has been a frequent performer at the resort since 2018. Blanc de Blanc, a cabaret-style variety show, debuted at The Foundry in August 2019, and ended in November after a poor financial performance. Another show, Magic Mike Live, opened in August 2021, after several delays caused by the COVID-19 pandemic.\n\n\n== Film history ==\nClub Bingo was used as a filming location in the 1951 film Painting the Clouds with Sunshine.\nThe Sahara was a prominent filming location for the 1960 film Ocean's 11.\nA scene was shot in the resort's parking lot for the 1964 film Viva Las Vegas.\nThe Sahara appears in the first episode of Hardcastle and McCormick (1983)\nThe 1986 documentary film Stripper takes place at a convention held in the Sahara's Congo Room.\nThe Sahara sign briefly appeared in the 2003 film Looney Tunes: Back in Action.\nIn 2011, the TV show Storage Wars filmed their special \"Storage Wars Unlocked\" at the closed hotel/casino.\n\n\n== Gallery ==\n\n\t\t\n\t\t\n\t\t\n\n\n== See also ==\n\nHard Rock Hotel and Casino (Stateline), formerly Sahara Tahoe\nThe Montage Reno, formerly Sahara Reno\nSahara Boardwalk Hotel and Casino, proposed for Atlantic City in the 1970s\nSLS Brickell\nSLS Lux\nSLS South Beach Hotel\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nHistoric photo gallery from University of Nevada, Las Vegas",
    "links": [
        "2017 Las Vegas shooting",
        "Abbott and Costello",
        "Adobe",
        "Adventuredome",
        "Ahern Hotel",
        "Aladdin (hotel and casino)",
        "Alex Meruelo",
        "Alexis Park",
        "Algiers Hotel",
        "Aliante Casino and Hotel",
        "All Net Resort & Arena",
        "Allure Las Vegas",
        "Anderson Field (Nevada)",
        "Ann-Margret",
        "Ann Blyth",
        "Arcadia Publishing",
        "Archon Corporation",
        "Aria Express",
        "Aria Resort and Casino",
        "Arizona Charlie's Boulder",
        "Arizona Charlie's Decatur",
        "Associated Press",
        "Aztec Inn",
        "Bally's Las Vegas",
        "Beer garden",
        "Bellagio (resort)",
        "Beverly Hills",
        "Big Apple Coaster",
        "Bill Miller (impresario)",
        "Binion's Gambling Hall and Hotel",
        "Boardwalk Hotel and Casino",
        "Bobby Darin",
        "Born-again",
        "Boulder Station",
        "Boulder Strip (Nevada gaming area)",
        "Bourbon Street Hotel and Casino",
        "Buddy Hackett",
        "Butte, Montana",
        "COVID-19 pandemic",
        "Cabaret",
        "Caesars Palace",
        "California Club (casino)",
        "California Hotel and Casino",
        "Cannery Casino and Hotel",
        "Casino",
        "Casino Royale Hotel & Casino",
        "Castaways (casino)",
        "Castaways Hotel and Casino",
        "Charlie McCarthy",
        "Charlie Palmer Hotel",
        "Charo",
        "Chic",
        "Chickie's & Pete's",
        "Christine Jorgensen",
        "Circa Resort & Casino",
        "Circus Circus Las Vegas",
        "CityCenter",
        "Clarion Hotel and Casino",
        "Clark County Commission",
        "Club Renaissance",
        "Connie Francis",
        "Cosmopolitan of Las Vegas",
        "Craig Ranch Station",
        "Crown Las Vegas",
        "Culinary Workers Union",
        "Curio (brand)",
        "Daily Herald (Utah)",
        "Damages",
        "Dean Martin",
        "Declaratory judgment",
        "Del E. Webb Construction Company",
        "Del Webb",
        "Delano Las Vegas",
        "Desert Inn",
        "Don Rickles",
        "Don the Beachcomber",
        "Donald O'Connor",
        "Dorothy Dandridge",
        "Downtown Grand",
        "Downtown Las Vegas",
        "Drag queen",
        "Dream Las Vegas",
        "Dunes (hotel and casino)",
        "Durango (hotel and casino)",
        "EB-5",
        "Early 1980s recession",
        "Eastside Cannery",
        "Echelon Place",
        "Eddie Griffin",
        "Edgar Bergen",
        "El Cortez (Las Vegas)",
        "El Rancho Hotel and Casino",
        "El Rancho Vegas",
        "Elara (timeshare)",
        "Eleanor Powell",
        "Ellis Island Casino & Brewery",
        "Encore Las Vegas",
        "Equal Employment Opportunity Commission",
        "Excalibur Hotel and Casino",
        "Fashion Show Mall",
        "Fiesta Henderson",
        "Fiesta Rancho",
        "Flamingo Las Vegas",
        "Fontainebleau Las Vegas",
        "Forbearance",
        "Fountains of Bellagio",
        "Four Queens",
        "Four Seasons Hotels and Resorts",
        "Frank Sinatra",
        "Fred Segal",
        "Fremont Hotel and Casino",
        "Gaming license",
        "Gensler",
        "Geographic coordinate system",
        "George Burns",
        "George Carlin",
        "Gold Coast Hotel and Casino",
        "Gold Spike Hotel and Casino",
        "Golden Gate Hotel and Casino",
        "Golden Nugget Las Vegas",
        "Grand Canal Shoppes",
        "Grand Central Hotel (Las Vegas)",
        "Grand Sierra Resort",
        "Grant Sawyer",
        "Great Recession",
        "Green Valley Ranch",
        "Groundbreaking",
        "Gus Greenbaum",
        "Hacienda (resort)",
        "Hard Rock Hotel and Casino (Las Vegas)",
        "Hard Rock Hotel and Casino (Stateline)",
        "Hardcastle and McCormick",
        "Harmon Corner",
        "Harrah's Las Vegas",
        "Harry Reid",
        "Harry Reid International Airport",
        "High Roller (Ferris wheel)",
        "High roller",
        "Hilton Grand Vacations Club",
        "Holy Cow Casino and Brewery",
        "Hotel",
        "House of Lords",
        "Hydroplane racing",
        "ISBN (identifier)",
        "Iggy Azalea",
        "Imperial Palace Hotel and Casino",
        "Initial public offering",
        "Ivana Las Vegas",
        "JPMorgan Chase",
        "JW Marriott Las Vegas",
        "Jack Benny",
        "Jerry's Nugget",
        "Jerry Lewis",
        "Joel Bergman",
        "Johnny Carson",
        "Jokers Wild Casino",
        "José Andrés",
        "Judy Garland",
        "Kathryn Grayson",
        "Keely Smith",
        "Key Largo (hotel and casino)",
        "Kiss (band)",
        "Klondike Hotel and Casino",
        "Klondike Sunset Casino",
        "Krystle Sands",
        "LV Strip (Nevada gaming area)",
        "La Bayou",
        "La Concha Motel",
        "Lake Las Vegas",
        "Lake Mead",
        "Landmark (hotel and casino)",
        "Las Vegas",
        "Las Vegas Boulevard",
        "Las Vegas Club",
        "Las Vegas Convention Center",
        "Las Vegas Grand Prix",
        "Las Vegas Monorail",
        "Las Vegas Motor Speedway",
        "Las Vegas Plaza",
        "Las Vegas Review-Journal",
        "Las Vegas Strip",
        "Las Vegas Sun",
        "Las Vegas Valley",
        "Lender",
        "Lenny Kravitz",
        "Liberace",
        "List of Las Vegas Strip hotels",
        "List of Las Vegas casinos that never opened",
        "List of tallest buildings in Nevada",
        "Live Nation Entertainment",
        "Live at The Sahara in Las Vegas",
        "Live in Las Vegas Vol. 2",
        "Looney Tunes: Back in Action",
        "Los Angeles Times",
        "Louis Prima",
        "Lounge singer",
        "Lucky Club Casino and Hotel",
        "Lucky Dragon Hotel and Casino",
        "Luxor Las Vegas",
        "Lyndon B. Johnson",
        "MGM Grand Garden Arena",
        "MGM Grand Las Vegas",
        "MGM Resorts",
        "MSG Sphere at The Venetian",
        "M Resort",
        "Mae West",
        "Magic Mike Live",
        "Main Street Station Hotel and Casino and Brewery",
        "Majestic Las Vegas",
        "Mandalay Bay",
        "Mandalay Bay Tram",
        "Marina Hotel and Casino",
        "Marlene Dietrich",
        "Marriott's Grand Chateau",
        "Marriott International",
        "Martha Raye",
        "Martin Stern Jr.",
        "Master limited partnership",
        "McCarran International Airport",
        "Mermaids Casino",
        "Meruelo Group",
        "Michael Gaughan (businessman)",
        "Michelob Ultra Arena",
        "Milton Berle",
        "Milton Prell",
        "Mini-baccarat",
        "Miracle Mile Shops",
        "Mirage-Treasure Island Tram",
        "Moody's",
        "Mortgage debt",
        "Moulin Rouge Hotel",
        "Mural",
        "NASCAR",
        "Navegante Group",
        "Neon Museum",
        "Nevada",
        "Nevada Gaming Control Board",
        "Nevada State Route 582",
        "New Frontier Hotel and Casino",
        "New York-New York Hotel and Casino",
        "New York Stock Exchange",
        "New York Times",
        "North Las Vegas",
        "O'Sheas Casino",
        "Ocean's 11",
        "Old Vegas",
        "Olympic-size swimming pool",
        "Opera House Casino",
        "Oyo Hotel & Casino",
        "Painting the Clouds with Sunshine (film)",
        "Palace Station",
        "Palms Casino Resort",
        "Palms Place",
        "Pampa Daily News",
        "Panorama Towers",
        "Paradise, Nevada",
        "Paradise Road (Las Vegas)",
        "Paris Las Vegas",
        "Park MGM",
        "Philippe Starck",
        "Pillsbury Doughboy",
        "Pinnacle (Las Vegas)",
        "Pioneer Club Las Vegas",
        "Planet Hollywood Las Vegas",
        "Plaza Hotel & Casino",
        "Poker Palace",
        "Porte-cochère",
        "Preferred Hotels & Resorts",
        "Premier Rides",
        "Quadrangle (architecture)",
        "RTC Transit",
        "Railroad Pass Casino",
        "Ralph Lamb",
        "Rat Pack",
        "Ray Bolger",
        "Red Rock Casino, Resort & Spa",
        "Red Rock Resort Spa and Casino",
        "Red Skelton",
        "Resorts World Las Vegas",
        "Right of publicity",
        "Rio (hotel and casino)",
        "Rita Ora",
        "Riviera (hotel and casino)",
        "Roseanne Barr",
        "Royal Bank of Scotland Group",
        "Royal Nevada",
        "Rush (band)",
        "SBE Entertainment Group",
        "SLS Brickell",
        "SLS Lux",
        "SLS South Beach Hotel",
        "Sahara Avenue",
        "Sahara Boardwalk Hotel and Casino",
        "Sahara Invitational",
        "Sam's Town Hotel and Gambling Hall, Las Vegas",
        "Sam Boyd",
        "Sam Butera",
        "Sam Nazarian",
        "Sam by Starck",
        "Sammy Davis Jr.",
        "Sandhurst Las Vegas",
        "Sands Hotel and Casino",
        "Sandy Hackett",
        "Santa Fe Station",
        "Santa Fe Valley",
        "Senate Majority Leader",
        "Shark Reef at Mandalay Bay",
        "Showcase Mall",
        "Silver City Casino",
        "Silver Nugget",
        "Silver Sevens",
        "Silver Slipper",
        "Silverton (hotel and casino)",
        "Sky Las Vegas",
        "Skyline Casino",
        "Skyvue",
        "Slots-A-Fun Casino",
        "Smoldering",
        "Sonny & Cher",
        "South Point Hotel, Casino & Spa",
        "Speed – The Ride",
        "Spiro Agnew",
        "Sportsbook",
        "Standard & Poor's",
        "Stardust Resort and Casino",
        "Starwood",
        "Station Casinos",
        "Stay Puft Marshmallow Man",
        "Steve Wyrick",
        "Stockbridge Capital Group",
        "Storage Wars",
        "Stripper (film)",
        "Suncoast Hotel and Casino",
        "Sunset Station (hotel and casino)",
        "T-Mobile Arena",
        "Tahiti Village",
        "Teamsters",
        "Texas Station",
        "The Amazing Johnathan",
        "The Artisan Hotel",
        "The Beatles",
        "The Cromwell Las Vegas",
        "The D Las Vegas",
        "The Deuce (transit bus service)",
        "The Drew Las Vegas",
        "The Forum Shops at Caesars",
        "The Grandview at Las Vegas",
        "The Harmon",
        "The Jerry Lewis MDA Labor Day Telethon",
        "The Linq",
        "The Meadows Casino & Hotel",
        "The Mint Las Vegas",
        "The Mirage",
        "The Montage Reno",
        "The New York Times",
        "The Orleans",
        "The Palazzo",
        "The Pass Casino",
        "The Platinum",
        "The Scintas",
        "The Shops at Crystals",
        "The Signature at MGM Grand",
        "The Strat (Las Vegas)",
        "The Venetian Las Vegas",
        "The Western",
        "Tina Turner",
        "Tony Bennett",
        "Topping out",
        "Transgender",
        "Transportation in Las Vegas",
        "Treasure Island Hotel and Casino",
        "Tribute Portfolio",
        "Tropicana Las Vegas",
        "Tropicana – Las Vegas Boulevard intersection",
        "Trump International Hotel Las Vegas",
        "Turnberry Place",
        "Turnberry Towers",
        "Tuscany Suites and Casino",
        "Umami Burger",
        "University of Nevada, Las Vegas",
        "Vacation Village",
        "Vdara",
        "Veer Towers",
        "Vegas World",
        "Virgin Hotels Las Vegas",
        "Viva Las Vegas",
        "W Hotels",
        "W Las Vegas",
        "Waldorf Astoria Las Vegas",
        "Welcome to Fabulous Las Vegas sign",
        "Westgate Las Vegas",
        "Westin Las Vegas",
        "Westward Ho Hotel and Casino",
        "Wild Wild West Gambling Hall & Hotel",
        "William G. Bennett (gaming executive)",
        "William Hill (bookmaker)",
        "Winchester, Nevada",
        "Wynn Las Vegas",
        "YESCO"
    ]
}