{"url": "https://en.wikipedia.org/wiki/Sakhalin%E2%80%93Hokkaido_Tunnel", "title": "Sakhalin–Hokkaido Tunnel", "summary": "The Sakhalin–Hokkaido Tunnel (or potentially bridge) is a proposed connection to link the Russian island of Sakhalin with the Japanese island of Hokkaido. Cost estimates by Russia in the year 2000 put the project to span the 45-kilometre (28-mile) strait at $50 billion.", "content": "The Sakhalin–Hokkaido Tunnel (or potentially bridge) is a proposed connection to link the Russian island of Sakhalin with the Japanese island of Hokkaido. Cost estimates by Russia in the year 2000 put the project to span the 45-kilometre (28-mile) strait at $50 billion.\n\n\n== Overview ==\n\nOn 16 January 2009, the Russian Vice-Minister of Transport, Andrei Nedossekov, confirmed that proposals are now under consideration in regards to the Sakhalin–Hokkaido Tunnel. The proposal was for a bridge rather than a tunnel. His decision to invite Japanese companies to bid to become consortium members of a wide array of Russian rail infrastructure work, particularly the Sakhalin Tunnel (or bridge) to the Russian mainland could be taken as a nod towards future rail cooperation between Russia and Japan.The tunnel would span roughly 40–45 km between Sakhalin's Cape Crillon (in Russia) to Hokkaido's Cape Sōya (in Japan). In comparison, the completed 53.85 km (33.46 mi) Seikan Tunnel links the Japanese islands of Honshu and Hokkaido. A further tunnel or bridge in the north of Sakhalin to the Russian mainland would also have to be created. Already a proposal for the Sakhalin Tunnel, has been announced by the Russian Government. Once on the Russian mainland, the rail link could connect to the rest of the Russian (and hence European) rail network, allowing for gauge changes. Running south, from Hokkaido, the line would connect with the Seikan Tunnel between Hokkaido and Honshu, currently the longest undersea tunnel in the world and second-longest railway tunnel. This would allow connections to the rest of the Japanese rail network.\nThe project could be seen as an alternative to the Japan–Korea Undersea Tunnel, as Russia is already under way with planning and construction of many of the necessary linkages on the Russian side, whilst the tunnel itself would be considerably shorter than that between Japan and Korea.\nAs well as the great cost and engineering difficulty, there may be political problems, particularly in regards to the Kuril Islands dispute between Russia and Japan. The Japanese government's initial reaction has been positive towards the idea.Russian officials again raised the idea of a bridge or tunnel to connect Sakhalin with Hokkaido in 2013. When combined with a potential bridge between Sakhalin and the Russian mainland, if built, it would be one of the final fixed links needed for a continuous rail corridor between Europe and Japan.The project has repeatedly come up in discussions between officials from Russia and Japan. During Russian President Vladimir Putin's first term in office, the Kremlin greatly intensified its outreach to Japan, the world's third biggest economy.  Russia's plan was to build a 28-mile bridge between the two countries that could link Moscow to Tokyo by land and rail. Putin reignited speculation about the long-rumored project in 2017, when he announced that a land link between Russia and Japan would have “planetary” significance.\nIn July 2018, Russia's president Vladimir Putin commissioned an analysis of a proposal to build a bridge to Sakhalin Island. Putin said that the project is very important for Sakhalin residents and would be a major factor in encouraging people to remain in the region. It would also boost the development of Khabarovsk Territory. He said that he has instructed the government to analyse this matter, particularly its economic aspects.\n\n\n== Gauges ==\nThe railways on the Russian mainland use the 1,520 mm (4 ft 11+27⁄32 in) Russian gauge, while the Sakhalin Railway was by 2019 converted from the original Japanese 1,067 mm (3 ft 6 in) gauge (Cape gauge) to the Russian gauge. Japanese railways use 1,067 mm (3 ft 6 in) (legacy lines and freight traffic) and 1,435 mm (4 ft 8+1⁄2 in) standard gauge (mostly Shinkansen).  If the tunnel were built with 1520 mm, there would be one break of gauge for all traffic on the Japanese side.  If it were built with 1435 mm only, there would be twice a break of gauge for freight traffic.  It is unclear what gauge would be used for the proposed tunnel and associated infrastructure. Here are the current proposed figures:\n\nBreaks of gauge: in Wakkanai area, Hokkaido, 1,520 mm (4 ft 11+27⁄32 in)/1,435 mm (4 ft 8+1⁄2 in).\nSakhalin–Hokkaido Tunnel\nTrack gauge: 1,520 mm (4 ft 11+27⁄32 in)\nLoading gauge: 4.1 m wide and 6.15 m tall\nElectrification: 25 kV 50 Hz AC overhead lines\nHokkaido network:\nTrack gauge: 1,435 mm (4 ft 8+1⁄2 in)\nLoading gauge: Japanese Shinkansen\n\n\n== See also ==\nTrans Global Highway\nList of bridge–tunnels\n\n\n== References ==", "links": ["Andrei Nedossekov", "Bifuka Station", "Cape Crillon", "Cape Sōya", "Cape gauge", "Hokkaido", "Honshu", "Horonobe Station", "Japan", "Japan–Korea Undersea Tunnel", "Korsakov (town)", "Kuril Islands dispute", "La Pérouse Strait", "List of bridge–tunnels", "Minami-Wakkanai Station", "Nayoro Station", "Nogliki", "Otoineppu Station", "Prefecture", "Rail transport in Japan", "Railway Gazette International", "Russia", "Russian gauge", "Sakhalin", "Sakhalin Oblast", "Sakhalin Railway", "Sakhalin Tunnel", "Sakhalin bridge", "Sea of Japan", "Seikan Tunnel", "Shibetsu Station", "Shinkansen", "Standard gauge", "Teshio-Nakagawa Station", "Toyotomi Station", "Trans Global Highway", "Tsugaru Strait", "Wakkanai Station", "Yuzhno-Sakhalinsk"]}