{
    "url": "https://en.wikipedia.org/wiki/Sandra_Navidi",
    "title": "Sandra Navidi",
    "summary": "Sandra Navidi (born September 1, 1972) is an international attorney, bestselling author, consultant, media contributor and public speaker. She is the founder and chief executive officer of BeyondGlobal, an international strategic consultancy.",
    "content": "Sandra Navidi (born September 1, 1972) is an international attorney, bestselling author, consultant, media contributor and public speaker. She is the founder and chief executive officer of BeyondGlobal, an international strategic consultancy.\n\n\n== Early life and education ==\nNavidi was born in Mönchengladbach, Germany, to an Iranian father and a German mother. She graduated from the University of Cologne School of Law in Germany with a law degree, and from Fordham University School of Law in New York with a Master-of-Law Degree in Banking, Corporate, and Finance Law. She studied at the Universiteit Leiden, the Université Paris-Sorbonne in Paris, the University of California at Berkeley in California, and the University of Arizona in Tucson. She passed the German tax lawyer's exam and the Series 7 General Securities Representative Exam (GSRE) with the Financial Industry Regulatory Authority (FINRA).\n\n\n== Career ==\nNavidi is a macroeconomic consultant. She is the founder and chief executive officer of BeyondGlobal, an international management consultancy. Previously, she worked with New York University (NYU) economics professor Nouriel Roubini at his advisory firm Roubini Global Economics (RGE) as director of research strategies and senior relationship manager. Prior to that, Navidi held positions as investment banker at Scarsdale Equities, general counsel at Muzinich & Co. and consultant at Deloitte. She is admitted to the practice of law in the United States and in Germany and serves as Counsel to the international law firm Urban Thier & Federer, where she adds extensive expertise in the areas of alternative investments (hedge funds, private equity funds, real estate funds, loan funds, venture capital, mergers & acquisitions, structured finance), corporate, tax and regulatory law and cross-border business transactions. She regularly gives interviews and keynotes at industry events. She works for n-tv and Spreeradio as financial expert. (RTL). At the end of May 2019 she started her weekly column about economics and finance in the German \"Bild-Zeitung\".Her bestselling book SuperHubs (2016) was recommended by Lawrence H. Summers former US Secretary of the Treasury, Edmund S. Phelps 2006 Nobel Prize in Economics, William R. White chairman of the Economic and Development Review Committee (EDRC) at the OECD, Jürgen Stark former executive board member of the European Central Bank, Klaus Schwab founder and chairman of the World Economic Forum, Olafur Ragnar Grimsson President of Iceland 1996–2016, Stephen A. Schwarzman CEO and co-founder Blackstone, among many others. Nouriel Roubini wrote the foreword. SuperHubs has been published in English (worldwide), German, Chinese, Japanese, Korean, Portuguese and Ukrainian. Navidi has spoken on the topic of SuperHubs at several literary festivals all over the world.\n\n\n== Current memberships ==\nAtlantic Council\nAmerican Council on Germany\nRotary Club of New York\nHuman Rights Watch\n\n\n== Awards ==\nOne of Bloomberg's Best Books of the Year 2016\nSilver Medal, Axiom Business Book Awards 2018\nIntermedia-globe Silver award at World Media Festival in Hamburg for the documentary film „Wie tickt Amerika“, 2019\n\n\n== Works ==\nNavidi, Sandra; Roubini, Nouriel (2017). Superhubs: How the Financial Elite and their Networks Rule Our World. Nicholas Brealey. ISBN 978-1-85788-664-1.\nNavidi, Sandra; Das Future Proof Mindset : Wie Sie im Zeitalter der Digitalisierung zukunftssicher werden. FinanzBuch Verlag, München 2021\n\n\n== References ==\n\n\n== External links ==",
    "links": [
        "Atlantic Council",
        "Author",
        "Berkeley, California",
        "Bild",
        "Chief executive officer",
        "Chinese Language",
        "Column (periodical)",
        "Consultant",
        "Deloitte",
        "Edmund S. Phelps",
        "Financial Industry Regulatory Authority",
        "Fordham University School of Law",
        "German language",
        "Germany",
        "Hachette Book Group",
        "Human Rights Watch",
        "ISBN (identifier)",
        "Iranian peoples",
        "Japanese Language",
        "Jürgen Stark",
        "Klaus Schwab",
        "Korean Language",
        "Lawrence H. Summers",
        "Lawyer",
        "Literary festival",
        "Mönchengladbach",
        "N-tv",
        "Nouriel Roubini",
        "Olafur Ragnar Grimsson",
        "Portuguese Language",
        "RTL Group",
        "Rotary Club",
        "SUDOC (identifier)",
        "Stephen A. Schwarzman",
        "Tucson, Arizona",
        "Ukrainian Language",
        "Universiteit Leiden",
        "University of Arizona",
        "University of California",
        "University of Cologne",
        "Université Paris-Sorbonne",
        "VIAF (identifier)",
        "William White (economist)"
    ]
}