{
    "url": "https://en.wikipedia.org/wiki/Santiago_P%C3%A9rez_de_Manosalbas",
    "title": "Santiago Pérez de Manosalbas",
    "summary": "Santiago Pérez de Manosalbas was a Colombian educator, lawyer, diplomat, writer, journalist and statesman who was President  of the United States of Colombia between 1874 and 1876.",
    "content": "Santiago Pérez de Manosalbas was a Colombian educator, lawyer, diplomat, writer, journalist and statesman who was President  of the United States of Colombia between 1874 and 1876.\n\n\n== Biographic data ==\nPérez was born in Zipaquirá, Cundinamarca, on May 23, 1830, in what was then the Republic of New Granada. Born to a family of farmers, his parents were Felipe Pérez and Rosa Manosalbas. He died while in exile in Paris on August 5, 1900 at the age of 70.\nHe was buried in the Batignolles Cemetery in Paris and there he rested until 1952, when his remains were repatriated and buried in the Central Cemetery of Bogotá.\n\n\n== Early life ==\nThe Pérez de Manosalbas was not a family of means, and Santiago and his brother Felipe Pérez went to the local public school in Zipaquirá, but they excelled beyond their teachers’ expectations. When the Director of Public Instruction Lorenzo María Lleras went to Zipaquirá to visit the school, he was impressed by Santiago and Felipe’s talent and potential. Lleras decided to help them and took them with him to Our Lady of the Rosary University, where he was the rector. He later took them to the “Colegio del Espíritu Santo”, a higher education school, which Lleras had founded. There, Pérez studied jurisprudence and on May 23, 1830, he received his law degree, although he never professed this occupation, as he was a man of letters and politics.\n\n\n== Private life ==\nPérez was married to Tadea Triana Silva; together they had four children, Santiago, Paulina, Eduardo and Amelia. Amelia married Clímaco Calderón, future President of Colombia. Eduardo became a diplomat. Santiago followed in his fathers footsteps, becoming a writer, politician, diplomat, and journalist.\n\n\n== Career as an educator ==\nPérez started his true calling as an educator working as a teacher in Spanish and Spanish literature while studying law in the Colegio del Espíritu Santo. In 1857 together with his brother Felipe, they established the Colegio Pérez Hermanos, a learning institution that taught such people as the linguist Rufino José Cuervo.\nDuring the second administration of president Manuel Murillo Toro he was appointed Director of Public Instruction while also working as rector of the National University of Colombia. In his prominent role as Director of Public Instruction he fomented education and the construction of new schools.\n\n\n== Comisión Corográfica ==\nIn 1852 Pérez joined the Comisión Corográfica, a state funded expedition led by Agustin Codazzi whose goal was to map out the entire country and collect information on its inhabitants. Pérez worked as secretary of the expedition, replacing Manuel Ancízar, who had fallen ill along the trip. His mission was to record events, places, descriptions, statistics, and other valuable information of the places they went to. During his time in the commission, he traveled to Neiva, Mariquita, Chocó, Casanare, Bogotá, and the territory of the Caquetá. He published his studies in the newspaper El Neo-Granadino, and wrote a memoir on the expedition entitled Apuntes de un viajero por Antioquia y el sur de la Nueva Granada.\n\n\n== Political career ==\nPérez was elected MP and assisted to congress in several legislatures. In 1869, between June 23–30, he acted as interim president during the government of General Santos Gutiérrez. He also served as Secretary of the Interior and Foreign Affairs between 1868 and 1870. Later, he was appointed ambassador to the United States.\n\n\n== The Presidency ==\n\nPérez, being considered an educator rather than a politician, chose education as his highest priority. He strengthened training facilities for teachers, ordered the construction of various primary schools, and consolidated the National University of Colombia. As president he, and members of his staff assisted the graduation ceremonies of young professionals to show support from the government. He promoted the expansion of the national railways system, including the construction of the \"Ferrocarril del Norte\" and the acquisition of the \"Ferrocarril de Bolívar\".During his administration the civil war of 1875-76 broke out.\n\n\n== Writer ==\nPérez started out early on in his life to write.\n\n\n=== Selected works ===\nVivo o muerto, novel in verse.\nLeonor, legend.\nEl manual del ciudadano, an instruction pamphlet on how to be a good citizen.\nJacobo Molai,  a drama in five acts based on the life of Jacques de Molay.\nEl castillo de Berkley, a historic drama in five acts composed in verse, based around the Berkley Castle.\nEconomía política y estadística, a recompilation of Pérez’ works as a teacher of economy, published in 2002 by the Universidad Externado de Colombia.\n\n\n==== Philology and linguistics ====\nAs a literate, he wrote the Compendio de gramática castellana por un granadino, which became a required book for the instruction of the Spanish language in ColombiaFor all his knowledge of the grammar and essence of the Castilian language, Pérez was elected member of the Academia Colombiana de la Lengua (Colombian Academy of the Language) as one of its original founders, along as other prominent members as Miguel Antonio Caro, and his former student Rufino José Cuervo among others.\n\nGramática filosófica del Idioma Español\nCompendio de gramática castellana por un granadino \nGramática abreviada de don Andres Bello, written in 1881 in commemoration of the centenary of the great Venezuelan philologist Andrés Bello.\n\n\n==== Memoirs ====\nApuntes de un viaje por el sur de la Nueva Granada, memoir form his expedition in the Comisión Corográfica\nMemoria del secretario de lo Interior y Relaciones Exteriores al Congreso nacional de 1869\n\n\n=== Theatre ===\nJacobo Molai, an adaptation of his book of the same name. It debuted on November 15, 1851 in the Colegio Espíritu Santo and directed by his mentor Lorenzo María Lleras.\nEl castillo de Berkley, inspired by his book, debuted on October 13, 1853 in the Maldonado Theater in Bogotá.\nNemequene, drama inspired by the Muisca ruler Nemequene, 3rd zipa of Bacatá.\n\n\n=== Translations ===\nCasarse o no casarse, “To Marry of not to Marry”, English comedy by Elizabeth Inchbald.\n\n\n=== Journalism ===\nPérez served as collaborator for the newspapers, El Neo-Granadino (1851), El Tiempo (1856), El Mensajero (1866), El Relator (1893), La Defensa and La América (1880). He published various articles on different topics including politics, literature and economy.\n\n\n== References ==",
    "links": [
        "Academia Colombiana de la Lengua",
        "Agustin Codazzi",
        "Alberto Lleras Camargo",
        "Alfonso López Michelsen",
        "Alfonso López Pumarejo",
        "Alma mater",
        "Ambassador",
        "Andrés Bello",
        "Andrés Pastrana Arango",
        "Aquileo Parra",
        "Bartolomé Calvo",
        "Batignolles Cemetery",
        "Belisario Betancur",
        "Berkley Castle",
        "Bogotá",
        "Caquetá Territory",
        "Carlos Eugenio Restrepo",
        "Carlos Lleras Restrepo",
        "Casanare Department",
        "Castilian language",
        "Central Cemetery of Bogotá",
        "Clímaco Calderón",
        "Colombia",
        "Colombian Liberal Party",
        "Colombian people",
        "Comedy",
        "Comisión Corográfica",
        "Cundinamarca Department (1824)",
        "César Gaviria",
        "Department of Chocó",
        "Eduardo Santos Montejo",
        "Educator",
        "El Tiempo (Colombia)",
        "Elizabeth Inchbald",
        "Enrique Olaya Herrera",
        "Ernesto Samper",
        "Eustorgio Salgar",
        "Felipe Pérez",
        "France",
        "Francisco Javier Zaldúa",
        "Francisco de Paula Santander",
        "Gran Colombia",
        "Granadine Confederation",
        "Guillermo León Valencia",
        "Gustavo Rojas Pinilla",
        "ISBN (identifier)",
        "ISNI (identifier)",
        "Iván Duque",
        "Jacques de Molay",
        "Joaquín Mosquera",
        "Jorge Holguín",
        "José Eusebio Otalora",
        "José Hilario López",
        "José Ignacio de Márquez",
        "José Manuel Marroquín",
        "José María Melo",
        "José María Obando",
        "José Vicente Concha",
        "Journalist",
        "Juan José Nieto Gil",
        "Juan Manuel Santos",
        "Julio César Turbay Ayala",
        "Julián Trujillo Largacha",
        "Laureano Gómez",
        "Lawyer",
        "Legend",
        "Manuel Ancízar",
        "Manuel Antonio Sanclemente",
        "Manuel Murillo Toro",
        "Marco Fidel Suárez",
        "Mariano Ospina Pérez",
        "Mariano Ospina Rodríguez",
        "Mariquita, Tolima",
        "Miguel Abadía Méndez",
        "Miguel Antonio Caro",
        "Ministry of Foreign Affairs (Colombia)",
        "Ministry of National Education (Colombia)",
        "Ministry of the Interior and Justice",
        "Misael Pastrana Borrero",
        "Muisca people",
        "National University of Colombia",
        "Neiva, Colombia",
        "Nemequene",
        "Novel",
        "OCLC (identifier)",
        "Our Lady of the Rosary University",
        "Pamphlet",
        "Paris",
        "Pedro Alcántara Herrán",
        "Pedro Nel Ospina Vázquez",
        "Politician",
        "President of Colombia",
        "President of the United States of Colombia",
        "Primary school",
        "Rafael Núñez (politician)",
        "Rafael Reyes",
        "Rafael Urdaneta",
        "Railways",
        "Ramón González Valencia",
        "Rector (academia)",
        "Repatriated",
        "Republic of New Granada",
        "Rufino José Cuervo",
        "Santos Acosta",
        "Santos Gutiérrez",
        "Simón Bolívar",
        "Spanish language",
        "Spanish literature",
        "Spanish name",
        "Surname",
        "Tomás Cipriano de Mosquera",
        "United States",
        "United States of Colombia",
        "VIAF (identifier)",
        "Venezuela",
        "Verse (poetry)",
        "Virgilio Barco Vargas",
        "Writer",
        "Zipa",
        "Zipaquirá",
        "Álvaro Uribe",
        "Île-de-France (region)"
    ]
}