{"url": "https://en.wikipedia.org/wiki/Sarah_Lees", "title": "Sarah Lees", "summary": "Dame Sarah Anne Lees  (née Buckley; 13 November 1842 – 14 April 1935) of Werneth Park, Oldham, was an English Liberal politician, activist, and philanthropist who was the first female councillor elected in Lancashire (1907–19) and the first female Mayor of Oldham (1910–11), only the second woman in England to hold such a position.", "content": "Dame Sarah Anne Lees  (née Buckley; 13 November 1842 – 14 April 1935) of Werneth Park, Oldham, was an English Liberal politician, activist, and philanthropist who was the first female councillor elected in Lancashire (1907–19) and the first female Mayor of Oldham (1910–11), only the second woman in England to hold such a position.\n\n\n== Career ==\nLees was born in Mossley, Greater Manchester, in 1842. On 30 July 1874, she married Charles Edward Lees JP (1840–1894) of Werneth Park in Oldham, Lancashire, a relative of the Oldham MP John Frederick Lees.\nAfter the Qualification of Women Act 1907 was passed by Parliament, Lees became the first woman to be elected to Oldham's Town Council, representing Hollinwood Ward. Already in her 60s, Lees was named the first female Freeman of the Borough of Oldham in November 1909. She became Mayor of Oldham the following year, only the second woman to be installed with that title in the United Kingdom.At a ceremony on 28 July 1927, Lees opened \"The Nook\" Convalescent Hospital, Greenfield. The ceremony was attended by the Mayor of Oldham, Alderman Samuel Frith JP, and Dr Thomas Fawsitt (Chairman of the proceedings, of Lees and Fawsitt Ward, Oldham Royal Infirmary). The hospital had originated in a bequest made by the late Mr H. L. Hargraves and, with the sum of £13,296, the foundation stone had been laid on 23 April 1870. The building opened on 20 September 1872 (it had originally been intended for it to be opened by Florence Nightingale but she was unable to attend due to illness). The Hospitals's original number of beds was 24, but these increased to 150. By 1926, 5,206 new outpatients applied for treatment, 5,349 accidents were admitted (1,402 for radiography), with 25,256 attendances for massage and electro-therapeutic departments.\nLees was involved with various local institutions: she was President of the Oldham Royal Infirmary, a Governor of Hulme Grammar School, a Member of the Court of the University of Manchester, and also served as Chairman of the Oldham Branch of the League of Nations.\nLees died, aged 92, at Werneth Park, Oldham, on 14 April 1935. Her daughter, Marjory Lees (1878–1970), presented the estate to the people of Oldham in 1936 to form the present public Werneth Park.\n\n\n== Honours ==\nLees was awarded an Honorary Doctor of Law (LLD) degree by the University of Manchester in July 1914. In 1916, she was appointed a Lady of Grace (DStJ) of the Order of St John of Jerusalem. On 25 August 1917, she was appointed a Dame Commander of the Order of the British Empire (DBE) in recognition of her services during World War I.\nThe Dame Sarah Lees Memorial erected in Werneth Park in 1937, was designed and made by the local artist and sculptor Williams Hargreaves Whitehead.\n\n\n== External links ==\nDame Sarah Lees Memorial (1937), National Recording Project, Public Monument and Sculpture Association.\n\n\n== References ==", "links": ["Activist", "Councillor", "Dame", "Dame Commander of the Order of the British Empire", "Dame of Justice of the Order of St John", "Doctor of Law", "Doi (identifier)", "English people", "Florence Nightingale", "Greater Manchester", "ISBN (identifier)", "John Frederick Lees", "Justice of the Peace", "Lancashire", "League of Nations", "Liberal Party (UK)", "Marjory Lees", "Mayor", "Mossley", "OCLC (identifier)", "Oldham", "Oldham, Greater Manchester", "Oldham Hulme Grammar School", "Order of Saint John (chartered 1888)", "Order of the British Empire", "Philanthropist", "Politician", "Qualification of Women Act 1907", "United Kingdom", "University of Manchester", "Werneth Park", "World War I"]}