{"url": "https://en.wikipedia.org/wiki/Sebo_Walker", "title": "Sebo Walker", "summary": "Sebo Walker (born April 28, 1988) is a professional skateboarder and artist living in Venice, Los Angeles who is best known for winning the Red Bull Manny Mania Amateur U.S. Championships in 2011 and for living in his Chrysler Town and Country van in West LA from 2010–2015.", "content": "Sebo Walker (born April 28, 1988) is a professional skateboarder and artist living in Venice, Los Angeles who is best known for winning the Red Bull Manny Mania Amateur U.S. Championships in 2011 and for living in his Chrysler Town and Country van in West LA from 2010–2015.\n\n\n== Early life ==\nSebastian Alvin Walker is the youngest of three children born to Ron and Delight Walker in Salem, Oregon. He was a star club soccer team member for Salem's Cascade FC as well as an avid participant in tennis and basketball. He began skateboarding at the age of 13 and after pressure from his coaches and parents to stop skateboarding, he quit organized sports altogether to focus on skating.\n\n\n== Career ==\nWalker was first noticed by the shop Exit Real World in 2004 and completed his first full video part in Exit's shop video \"Pieces\" in 2007 and \"Count It?!\" in 2009. With influence from local friends/professionals Tyler Bledsoe and Brent Atchley, Sebo began to receive product from Element Skateboards in 2007. After being contacted by professional skateboarder Reese Forbes and, ex-Global Design Director for Nike, Michael Leon in 2010, Sebo joined Commonwealth Stacks skateboards. He debuted as the first AM with an introduction video in 2010 and later a full feature video titled \"SEBO\" in 2011. This was Forbes and Leon's second attempt at creating a skateboard company following Rasa Libre.Sebo began receiving product from Lakai Limited Footwear in 2008 and was officially added to the team as an AM in 2012. His first shoe commercial for Lakai  debuted in 2012.\nOn Jan. 31st, 2014 Krooked Skateboards (Deluxe Distribution) added Sebo to the team in a turf killer video titled \"Krooked Welcomes Sebo Walker\". On Jan. 7th, 2016 Krooked Skateboards and Mark Gonzales turned Sebo pro.\n\n\n== Awards ==\n1st Place; 2011 Amateur Red Bull Manny Mania U.S. Championships\n4th place; 2011 Amateur Red Bull Manny Mania World Finals.\nBest Trick; 2012 Nike US Open Damn AM, Huntington Beach, CA. with a 360 shove-it to smith grind down the big hubba.\n2nd Place; 2012 Above the Line Contest - Relentless - Bright, Berlin, Germany\n12th Place; 2014 (1st Place qualifier); Phoenix AM 2014\n\n\n== References ==\n\n\n== External links ==\nSebo Walker (videos)\nLakai", "links": ["Alien Workshop", "Chrysler", "Deluxe Distribution", "Element Skateboards", "Lakai Limited Footwear", "Mark Gonzales", "Nike, Inc.", "Red Bull", "Reese Forbes", "Salem, Oregon", "Skateboarding", "Venice, Los Angeles"]}