{
    "url": "https://en.wikipedia.org/wiki/Self-crucifixion_of_Mattio_Lovat",
    "title": "Self-crucifixion of Mattio Lovat",
    "summary": "Mattio Lovat was an Italian who made two self-crucifixion attempts, in 1803 and 1805 in Venice, Italy, respectively. In July 1805, Mattio, on his second self-crucifixion attempt at public streets, was successful, an act that landed him on hospital. He died the following year at the San Servolo Island asylum.",
    "content": "Mattio Lovat was an Italian who made two self-crucifixion attempts, in 1803 and 1805 in Venice, Italy, respectively. In July 1805, Mattio, on his second self-crucifixion attempt at public streets, was successful, an act that landed him on hospital. He died the following year at the San Servolo Island asylum.\n\n\n== Background ==\nMattio Lovat was born in Casale, at the territory of Belluno, in 1761, in Italy. A son of poor parents, he was a shoemaker. On November 13, 1802 he went to Venice, where a younger brother named Angelo conducted Mattio to the house of a widow, the relict of Andrew Osgualda, with whom he lodged, until September 21, 1803. On the mentioned day, he made an attempt to crucify himself, in the middle of the street called Cross of Biri.\n\n\n== Self-crucifixion attempt of 1803 ==\nIn the middle of the street called Cross of Biri, Mattio made an attempt of self-crucifixion. Upon a frame that he had constructed of the timber of his bed, he was prevented from succeeding his attempt by several people who came upon him as he was driving a nail into his left foot. Being interrogated as to the motive for his self-crucifixion, he was silent, except that he once said to his brother, that that day was the festival of St. Matthew and that he could give no further explanation. Days after the affair, he set out for his own country, where he remained a certain time, but afterwards returned to Venice, and in July 1805, lodged in a room in the third floor of a house, in the street Delle Monache.\n\n\n== Self-crucifixion attempt of 1805 ==\nOn July 19, 1805 Mattio attempted to crucify himself in a public street. He constructed a wooden cross, inflicted a wound on his side, and put a crown of thorns on his head. In order to reenact the crucifixion of Jesus Christ, he then fixed himself to the cross with nails. Using a net that tied his body to the wooden beam, he finally hung himself and the cross out of the window of his room. With his left arm nailed to the cross, and his right hanging down, Lovat was found alive in the early morning by some passer-by who took him down from the cross and put him to bed.\n\n\n== Aftermath ==\nVenetian physician Cesare Ruggieri, came to the spot out of curiosity and made sure that Lovat was immediately admitted to the Clinical School of Venice at which he himself was Professor of Surgery. For several weeks Ruggieri treated and observed Lovat at his bedside until he had physically recovered. Due to Ruggieri's diagnosis of a persistent mental disorder, Lovat was then transferred to the asylum of San Servolo, an early mental asylum situated on an island of the same name in the Venetian lagoon, where Lovat died in April 1806 from some unspecified chest disease.The case was closed. Soon, however, Ruggieri wrote down the medical case history of his patient. In his case narrative, titled in Italian Storia della crocifissione di Mattio Lovat da se stesso eseguita Ruggieri suggested that Lovat suffered from an kind of mental disorder that was connected to religion. Ruggieri subsequently published, between 1806 and 1814, the illustrated case report in two Italian versions and one in French. Subsequently, the narrative of Lovat's self-crucifixion was read, commented on, rewritten and reproduced by editors and authors in Italy, France, Germany and Britain throughout the nineteenth century. A book about Lovat's self-crucifixion, The Man Who Crucified Himself: Readings of a Medical Case in Nineteenth-Century Europe was published in November 2018.The book published in 1814 by the physician Cesar Ruggieri, tells the story of his crucified patient.A case report about Lovat's self-crucifixion is available.\n\n\n== References ==",
    "links": [
        "Belluno",
        "ISBN (identifier)",
        "ISNI (identifier)",
        "Jesus Christ",
        "San Servolo",
        "VIAF (identifier)",
        "Venice"
    ]
}