{"url": "https://en.wikipedia.org/wiki/Serra_do_Conduru_State_Park", "title": "Serra do Conduru State Park", "summary": "The Serra do Conduru State Park (Portuguese: Parque Estadual da Serra do Conduru) is a state park in the state of Bahia, Brazil.\nIt protects an area of Atlantic Forest that is regenerating after damage from human intervention.", "content": "The Serra do Conduru State Park (Portuguese: Parque Estadual da Serra do Conduru) is a state park in the state of Bahia, Brazil.\nIt protects an area of Atlantic Forest that is regenerating after damage from human intervention.\n\n\n== Location ==\nThe Serra do Conduru State Park is divided between the municipalities of Uruçuca (44%), Itacaré (41%) and Ilhéus (15%) in Bahia.\nIt has an area of 9,275 hectares (22,920 acres).\nThe buffer zone covers 25,057 hectares (61,920 acres).\nThe park is in the eastern  hydrographic basin of Bahia.\nIt includes the Lagoa Encantada, the village of Serra Grande, the Itacaré Forest and the mountainous coastline.\nHuman activities include extreme sports, adventure tourism, mountaineering, trekking, mountain biking and ecotourism.\nThreats include illegal logging and poaching, and delays in regularization of land ownership.\n\n\n== Environment ==\nThe average annual temperature is 23 °C (73 °F), with a super-humid tropical climate.\nThe park contains the headwaters of 30 rivers and streams.The park is in the Atlantic Forest biome and consists of dense submontane rainforest in various stages of succession.\nVegetation includes many clearings for agriculture or pasture and fragments of forest in different stages of regeneration.\nThe vegetation is always green, and includes trees up to 40 metres (130 ft) in height as well as dense shrub growth of ferns, arborescents, bromeliads, palms, vines, orchids and cactuses.\nThe wetlands that have not been disturbed by people hold fig trees, palm trees and palmettos.\nThere are as many as 458 tree species per hectare, a very high rate of biodiversity.\nAbout 72% of species are typical of the Amazon Forest.175 bird species have been identified, including 27 that are endemic and six that are threatened.\nThey include red-billed curassow (Crax blumenbachii), red-browed amazon (Amazona rhodocorytha) and ochre-marked parakeet (Pyrrhura cruentata).\n9 species of small mammals have been recorded and 30 species of medium or large mammals. \nThese include golden-headed lion tamarin (Leontopithecus chrysomelas), golden-bellied capuchin (Sapajus xanthosternos), cougar (Puma concolor), ocelot (Leopardus pardalis) and coastal black-handed titi (Callicebus melanochir).\nAt least 45 species of endemic amphibians with limited distribution have been identified, including Hylomantis áspera,\nEleutherodactylus bilineatus, Cycloramphus migueli and Hyla sibilata.\n\n\n== History ==\nThe campaign to create the Serra do Conduru State Park began in 1993, and was promoted in 1996 by Conservation International Brazil, the SOS Atlantic Forest Foundation and the Institute of Social and Environmental Studies of Southern Bahia (IESB).\nThe park was formally created by 6.227 of 21 February 1997.\nIn 1998 highway BA-001 from Ilhéus to Itacaré was inaugurated, prompting studies on land regularization and closing the sawmills in southern Bahia that threatened the ancient trees of the region.\nIt became part of the Central Atlantic Forest Ecological Corridor, created in 2002.Decree 8.702 of 4 November 2003 expanded the size of the park.\nThe composition of the park's management board was agreed in November 2010.\nBy 2011 the park had formal tenure over 51% of the land, but was still vulnerable due to lack of infrastructure for protecting the land and allowing public use.\n\n\n== Notes ==\n\n\n== Sources ==", "links": ["Atlantic Forest", "Bahia", "Central Atlantic Forest Ecological Corridor", "Coastal black-handed titi", "Cougar", "Cycloramphus migueli", "Eleutherodactylus bilineatus", "Geographic coordinate system", "Golden-bellied capuchin", "Golden-headed lion tamarin", "Hyla sibilata", "Hylomantis áspera", "ISBN (identifier)", "IUCN protected area categories", "Ilhéus", "Illegal logging", "Itacaré", "National park", "Ocelot", "Ochre-marked parakeet", "Poaching", "Portuguese language", "Red-billed curassow", "Red-browed amazon", "Sloanea Obtusifolia", "State park (Brazil)", "Uruçuca"]}