{"url": "https://en.wikipedia.org/wiki/Shigeyoshi_Matsumae", "title": "Shigeyoshi Matsumae", "summary": "Shigeyoshi Matsumae (松前重義, Matsumae Shigeyoshi, October 24, 1901 – August 25, 1991) was a Japanese electrical engineer, inventor of the non-loaded cable carrier system, the Minister of the Ministry of Communications (Teishin-in, between August 30, 1945 and April 8, 1946), politician and the founder of Tokai University. He is also known as a patron of Yasuhiro Yamashita, a judo champion from Tokai University.", "content": "Shigeyoshi Matsumae (松前重義, Matsumae Shigeyoshi, October 24, 1901 – August 25, 1991) was a Japanese electrical engineer, inventor of the non-loaded cable carrier system, the Minister of the Ministry of Communications (Teishin-in, between August 30, 1945 and April 8, 1946), politician and the founder of Tokai University. He is also known as a patron of Yasuhiro Yamashita, a judo champion from Tokai University.\n\n\n== Life ==\nHe was born in Kumamoto Prefecture, Japan and graduated from Tohoku Imperial University in 1925. After entering the Ministry of Communications as an engineer, he proposed the idea of Long Distance Non-Loaded Cable Carrier Communication System in 1932. In 1933, he was sent to Germany by the Government for one year, and exchanged opinions with engineers such as of Siemens factories. The Long Distance Non-Loaded Cable Carrier Communication System was realized between Harbin of Manchuria and Japan. In 1940, he assumed the post of the general affairs department of the Taisei Yokusankai (大政翼賛会, \"Imperial Rule Assistance Association\") which was Japan's para-fascist organization created by Prime Minister Fumimaro Konoe on October 12, 1940 to promote the goals of his Shintaisei movement. In 1941, he was appointed General Director of the Engineering Department of the Ministry of Communications. In 1943, he established a school for airplane technology in Shimizu, Shizuoka Prefecture, and in 1949 a school for wireless science in Nakano, Tokyo; these schools joined later to a school called Tokai Science School. During World War II, he changed his opinions and left the Taisei Yokusankai and strongly opposed the policy of the Hideki Tojo cabinet. Matsumae was sent to the front of the Philippines, as a second class private in the Imperial Army. Right before the end of the war, he returned to Japan. He was appointed Minister of Communications in 1945.  Between January 1950 and June 1951, he was purged from public service. Later, he assumed the post of the President of Tokai University, which was constructed based on the schools established earlier. In 1952, he was elected a member of the Lower House of the Japanese Parliament and served for 17 years belonging to the Socialist Party. In 1966, he established a cultural exchange system Nihon Taigai Bunka Kyokai at the request of Soviet Russia, and assumed the post of its president. He boasted that he could talk to the Chief Secretary personally by telephone. He was also a judo player and as the top of Students' Association of Judo, he staged harsh struggles with the Kodokan, the traditional association of judo. He established the Matsumae International Foundation in 1979. He has established a large number of educational cultural exchange programs with universities throughout the world. For his efforts he received numerous honorary degrees from various countries. He died in 1991 at the age of 89.\n\n\n== World War II ==\nAt age 42, he was sent to the Philippines as a private soldier, as a punitive treatment by Hideki Tojo. At that time, Matsumae was the top of the engineering bureau of the Tsushin-in (Ministry of Communications), and the draft came in a telegram on July 18, 1944. A document of the draft came from the Mayor of Kumamoto. In spite of all efforts from his side, he was sent to Manila, Saigon, and Singapore. He came back to Japan in January 1945.\n\n\n== Nuclear research ==\nAtom bomb was dropped on Hiroshima on 6 August 1945 at 9:15am. To look into the nature of the new type of bomb \"Hiroshima Bomb Investigation Group\" was formed and Matsumae was appointed as its leader. On 8 August 1945, the Hiroshima Bomb Investigation Group (Shigeyoshi Matsumae accompanied by a team of technicians) set off from Tokorozawa in a military aircraft bound for Hiroshima.  As the team left the aircraft and walked into the city area the scene of desolation was indescribable.  Besides the heaps of corpses the survivors, their bodies terribly burnt, squatted vacantly. Matsumae found his way into the Hiroshima telegraph office which Matsumae visited previously and went inside the shell of the building. Matsumae found the blackened body of the Director, Tadasi Yoshida, who had helped him with the development of non-loaded cable. He had already been laid to rest. Squatting by his side was his wife, apparently drained of blood (5 days later she died of radiation sickness).\nWherever Matsumae took measurements of radiation, the amount of deadly radiation was  far above normal.  Matsumae and technicians of his team were continuously being bathed in radiation and had no idea when their bodies would start to undergo some change.  They worked desperately, since Matsumae had a duty to the dead to record all the details of the appalling scene and to transmit these to posterity.  On 10 August 1945 Matsumae returned to Tokyo with the results of the investigation and submitted the report to the Emperor.  The book \"My Turbulent life in a Turbulent Century\" by Dr. Shigeyoshi Matsumae, Published by Tokai University Press shows a photo of Matsumae carrying out the radiation measurements in Hiroshima in page 159.\n\n\n== Religion and education ==\nWhile serving as an engineer in Tokyo, he attended Bible classes by Uchimura Kanzō, the founder of the Nonchurch Movement (Mukyōkai) of Christianity in the Meiji and Taishō period Japan. Matsumae was deeply interested in him, especially in his talk on Denmark and education there. Matsumae was interested further in education, leading to the establishment of many schools later, and the European center of Tokai University in Copenhagen, in 1970. In 1971, Hirohito and Empress Kōjun paid a visit there.\n\n\n== Family ==\nThe father of Shigeyoshi Matsumae was the chief of a village, Kashima town, Kumamoto. There was one elder brother, named Akiyoshi, who became a pharmacist and a judo champion (once, No. 1 in Japan) who helped Shigeyoshi financially.Akiyoshi built a training hall and Shigeyoshi also became a strong judoist.\nTatsuro Matsumae, the first son of Shigeyoshi is the chief President of Tokai University. Norio Matsumae, the second son, was previously the President of Tokai University and Aogu Matsumae, the third son, was previously the President of Hokkaido Tokai University. Yoshiaki Matsumae, the first son of Tatsuro Matsumae is the vice President of Tokai University.\n\n\n== Bibliography ==\nRecord of a 2nd Private Soldier Tokai University Press. ISBN 978-4-486-00338-0\nA Collection of Works by Shigeyoshi Matsumae in 10 volumes, Tokai University Press.\nThis includes Record of my discovery Exploring Denmark culture, Progress of Science and materialistic conception of history, My views on Politics in these present days of science, Science changes history, Record of a 2nd private soldier, Science, Technology and Thought, My Thought on Religion, Dialogues of Shigeyoshi Matsumae, Poems of Shigeyoshi Matsumae, My thought on modern culture,  Let's live in young days (Collection of lectures of Matsumae at Bosei Juku,  Revized edition of Electric Communications (Matsumae and Kitahara).\nExploring Bushido ThoughtsMy Turbulent life in a turbulent century 1982, by Dr.Shigeyoshi Matsumae,  TOKAI UNIVERSITY PRESS, ISBN 4-486-00688-7 C0023.\n\n\n== Honours ==\nGrand Cordon of the Order of the Sacred Treasure (1971)\nGrand Cordon of the Order of the Rising Sun (1982)\nSenior third rank in the order of precedence\nHonorary degree at the Technical University Dresden (1979)\nInducted into the Japanese Baseball Hall of Fame (2022)\n\n\n== References ==\nKumamoto Prefecture Encyclopedia  Kumamoto Nichinichi Shinbun, 1982 p. 759\nKimio Mori, Kumamoto Prefecture Modern Cultural Persons with Achievements Kumamoto Prefecture Educational Committee, 1989 p. 178-189\nHisaya Shirai(edit) Matsumae Shigeyoshi - My Showa History Asahi Shinbun sha, 1987.\nMamoru Sakamoto, Shishifunjin(With lionlike force)- Shigeyoshi Matsumae Story  Nishinippon Shimnun sha,1983. ISBN 4-8167-0049-8\n\n\n== Footnotes ==", "links": ["Bushido", "Copenhagen", "Electrical engineering", "Empress Kōjun", "Fumimaro Konoe", "Germany", "Harbin", "Hideki Tojo", "Hirohito", "Hiroshima", "Honorary degree", "ISBN (identifier)", "ISNI (identifier)", "Japanese Baseball Hall of Fame", "Japanese nationalism", "Judo", "Kashima, Kumamoto", "Kodokan", "Kumamoto Prefecture", "Manchuria", "Manila", "Minister (government)", "Ministry of Communications", "National Diet", "Nuclear weapon", "Order of the Rising Sun", "Order of the Sacred Treasure", "Philippines", "Private (rank)", "Russian Soviet Federative Socialist Republic", "SUDOC (identifier)", "Saigon", "Shizuoka Prefecture", "Siemens", "Singapore", "Taisei Yokusankai", "Technical University Dresden", "Telegraphy", "Tohoku Imperial University", "Tokai University", "Tokorozawa, Saitama", "Trove (identifier)", "Uchimura Kanzō", "VIAF (identifier)", "World War II", "Yasuhiro Yamashita"]}