{"url": "https://en.wikipedia.org/wiki/Shulamit_Reinharz", "title": "Shulamit Reinharz", "summary": "Shulamit Reinharz (born 1946)  was the Jacob Potofsky Professor of Sociology at Brandeis University until 2017. During her tenure at Brandeis, she was director of the women's studies program from 1991 to 2001 and launched The Scholars Program, the first graduate program to focus on Jewish women. She was the founding director of the Hadassah-Brandeis Institute in 1997 and founder and director of the Women's Studies Research Center in 2001.", "content": "Shulamit Reinharz (born 1946)  was the Jacob Potofsky Professor of Sociology at Brandeis University until 2017. During her tenure at Brandeis, she was director of the women's studies program from 1991 to 2001 and launched The Scholars Program, the first graduate program to focus on Jewish women. She was the founding director of the Hadassah-Brandeis Institute in 1997 and founder and director of the Women's Studies Research Center in 2001.\n\n\n== Early life ==\nShulamit Tirzah \"Shula\" Rothschild was born in 1946 in Amsterdam, the Netherlands to Ilse Hertha (née Strauss) and Max Michael Rothschild. She was named after the Shulamite to whom the biblical Solomon sung the Song of Songs. Rothschild's family were of German-Jewish heritage and as teenagers her parents became involved in the Socialist-Zionist youth movement known as Habonim to learn the agricultural skills which might be needed for life on a kibbutz. During World War II both of Rothschild's parents' families were scattered. Her father's sisters were rescued through the Kindertransport program, which sent them to England, and his parents, fled to Malden, Massachusetts. Her mother's parents were transported from Germany to the Gurs concentration camp near Pau, France. Rothschild's maternal grandfather died from starvation in Gurs before her maternal grandmother was sent to Auschwitz and exterminated. Two maternal aunts managed to escape to Palestine and survived The Holocaust.After Kristallnacht and Max's detention in Buchenwald, Rothschild's parents fled their homeland with the help of Habonim, which secured Max's release. Hoping to pass through Holland and make aliyah to Eretz Yisrael, they were unable to leave the country because of the limits on immigration imposed by the British White Paper of 1939. When the Nazis invaded in 1940, the couple were forced into hiding. Thirteen months after the war ended, Rothschild was born and when she was one year old, her family migrated to the United States to join her paternal grandparents in Massachusetts. They did not remain long, but immigrated to Israel within a year and a half, where Rothschild's sister, Tova Chaya \"Toby\" was born. Plans did not go as expected and the family soon returned to Massachusetts. A brother, Yonatan Efraim \"Jonathan\", joined the family and Rothschild attended first grade in suburban Boston.In 1951 the family moved to Bergen County, New Jersey, where the remainder of Rothschild's schooling occurred. In addition to her secular education, from a young age Rothschild received Jewish instruction in Teaneck and celebrated her bat mitzva in 1959. In high school, at River Edge, New Jersey, she met Jehuda Reinharz, a German immigrant who had recently arrived in the U.S. speaking only Hebrew and German. As she spoke both, Rothschild helped Jehuda acclimate to the United States. Furthering her education, Rothschild graduated with a BA in sociology from Barnard College in 1967. Later that year, on 26 November 1967 in New York City, she married Reinharz and subsequently the couple had two daughters: Yael Dalia, Naomi Carla.\n\n\n== Career ==\nReinharz began her career in 1970 at Simmons School of Social Work. Between 1972 and 1983, she taught psychology, as an assistant professor at the University of Michigan. During this time, she earned her master's degree in sociology and completed a PhD from Brandeis University in 1977. During her studies, she recognized how \"inadequate\" the representations of women's lives were in social science and was drawn to examine women history had forgotten. She taught her first course in women's studies at Michigan in 1979. In 1982, she became an assistant professor of sociology at Brandeis; earned a full professorship in 1991, the only woman to hold the rank at the university; and became the women's studies program director 1992. That year she launched an interdisciplinary graduate program, known as The Scholars Program, allowing students to earn a dual master's degree in women's studies and another field, which was the first graduate program to focus on Jewish women.In 1997, Reinharz was chosen as founding director of the Hadassah-Brandeis Institute, after she had chaired the National Commission on American Jewish Women for the organization. The Institute was founded to focus on publishing research and organizing conferences and lectures regarding Jewish women's roles in various eras, but did not offer academic courses. The Institute, devoted to the study of Jewish women, was the first of its kind and aimed as a feminist enterprise to bring \"women into the scholarship\" of Jewish studies. In 1998, Reinharz and the Institute partnered with the Schechter Institute of Jewish Studies to found Nashim, a journal on Jewish gender studies, for which she became co-editor. Between 1997 and 2000, Reinharz, after being denied help from Brandeis administrators, raised over $2.4 million to renovate a derelict building and oversaw its design and construction to house the Women's Studies Research Center. The Center, which opened 19 November 2000 was created to house both the graduate program in Women's Studies and the Hadassah-Brandeis Institute, as well as research office space, and a reference library.In 2001, Reinharz stepped down as director of the women's studies program, when she became founding director of the Center, though she continued to publish and edit the research of others, authoring over 60 articles and a dozen books throughout her career. During her academic career, Reinharz strove to develop new methodologies for social sciences. Using holistic and interdisciplinary methods, she analyzed subjects in their context and argued that methods used in the natural sciences were inadequate for studying behavior, bias and the purpose of actions. She retired in 2017 from her post as the Jacob Potofsky Professor of Sociology and as director of the Hadassah-Brandeis Institute and in honor of the occasion Nashim dedicated its 32nd, 33rd, and 34th issues to her. Reinharz also currently serves as a member of the advisory board of the Remember the Women Institute\n\n\n== Selected works ==\nReinharz, Shulamit (1979). On Becoming a Social Scientist (1st ed.). San Francisco, California: Jossey-Bass Publishers. ISBN 978-0-875-89416-4.\nReinharz, Shulamit; Rowles, Graham D. (1987). Qualitative Gerontology. New York, New York: Springer Publishing. ISBN 978-0-826-15230-5.\nReinharz, Shulamit; Conrad, Peter (1988). Qualitative Sociology in International Perspective. New York, New York: Human Sciences Press. ISBN 978-0-898-85420-6.\nReinharz, Shulamit (1989). Social Science Methods: Feminist Voices. New York, New York: Pergamon Press. ISBN 978-0-080-32794-5.\nReinharz, Shulamit; Davidman, Lynn (1992). Feminist Methods in Social Research. New York, New York: Oxford University Press. ISBN 978-0-195-07385-0.\nReinharz, Shulamit (1998). Timeline of Women and Women's Issues in the Yishuv and Israel. Waltham, Massachusetts: Brandeis University. OCLC 42373912.\nReinharz, Shulamit; Vinick, Barbara (2002). Esther's Legacy: Celebrating Purim Around the World. New York City, New York: Hadassah. OCLC 51023600.\nReinharz, Shulamit; Raider, Mark A (2005). American Jewish Women and the Zionist Enterprise. Waltham, Massachusetts: Brandeis University Press. ISBN 978-1-584-65438-4.\nPolis, Miriam P; Reinharz, Shulamit; Adelman, Penina V (2005). The Jgirl's, Teacher's, and Parent's Guide. Woodstock, Vermont: Jewish Lights Publishing. ISBN 978-1-580-23225-8.\nReinharz, Shulamit; Pergola, Sergio Della (2009). Jewish Intermarriage around the World. New Brunswick, New Jersey: Transaction Publishers. ISBN 978-1-138-51124-8.\nReinharz, Shulamit (2011). Observing the Observer: Understanding our Selves in Field Research. Oxford, England: Oxford University Press. ISBN 978-0-195-39780-2.\nPalgi, Michal; Reinharz, Shulamit (2011). One Hundred Years of Kibbutz Life: A century of crises and reinvention. New Brunswick, New Jersey: Transaction Publishers. ISBN 978-1-4128-4229-7.\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Bibliography ===\n\n\n== External links ==\nFaculty page\nThe Rothschild Family of Gunzenhausen", "links": ["Aliyah", "Amsterdam", "Auschwitz", "Barnard College", "Bat mitzva", "Bergen County, New Jersey", "Brandeis University", "Brandeis University Press", "Buchenwald", "Doi (identifier)", "Eretz Yisrael", "Feminism", "Gurs concentration camp", "Habonim Dror", "Hadassah-Brandeis Institute", "Hadassah Women's Zionist Organization of America", "History of the Jews in Germany", "ISBN (identifier)", "ISNI (identifier)", "ISSN (identifier)", "Indiana University Press", "Jehuda Reinharz", "Jewish Lights Publishing", "Jewish Women's Archive", "Jewish studies", "Johns Hopkins University Press", "Jossey-Bass Publishers", "Kibbutz", "Kindertransport", "Kristallnacht", "Malden, Massachusetts", "NWSA Journal", "Nashim (journal)", "Netherlands in World War II", "Newspapers.com", "OCLC (identifier)", "Oakland University", "Open access", "Oxford University Press", "Palestine (region)", "Pau, Pyrénées-Atlantiques", "Pergamon Press", "Project MUSE", "Remember the Women", "River Edge, New Jersey", "S2CID (identifier)", "SUDOC (identifier)", "Schechter Institute of Jewish Studies", "Shulamite", "Simmons University", "Sociology", "Solomon", "Song of Songs", "Springer Publishing", "Teaneck", "The Berkshire Eagle", "The Boston Globe", "The Holocaust", "The Palm Beach Daily News", "The Palm Beach Post", "Transaction Publishers", "University of Michigan", "VIAF (identifier)", "White Paper of 1939", "Women's Studies Research Center", "Women's studies", "World War II"]}