{"url": "https://en.wikipedia.org/wiki/Somen_Banerjee", "title": "Somen Banerjee", "summary": "Somen \"Steve\" Banerjee (Bengali: সোমেন বন্দোপাধ্যায়; October 8, 1946 – October 23, 1994) was an Indian American entrepreneur, and the founder of Chippendales.", "content": "Somen \"Steve\" Banerjee (Bengali: সোমেন বন্দোপাধ্যায়; October 8, 1946 – October 23, 1994) was an Indian American entrepreneur, and the founder of Chippendales.\n\n\n== Biography ==\nSomen Banerjee was born in Bombay (now Mumbai), India in October 8, 1946. After operating a Mobil gas station and a failed backgammon club, Banerjee bought a failed Los Angeles club named \"Destiny II\" and turned it into a nightclub that featured female mud wrestling and a \"Female Exotic Dancing Night.\" The 1979 addition of a male stripper dance troupe performing to target female audiences was the first of its kind in the United States. Banerjee partnered with Paul Snider (eventual killer of Playboy Playmate Dorothy Stratten) but shortly afterwards developed a more theatrical show with Emmy award winning producer Nick De Noia.\nBanerjee was charged with enlisting the aid of Ray Colon, former Palm Springs police officer and lounge room entertainer, to commit the murder of show producer De Noia in 1987, and in 1990 and '91, a plot to kill Michael Fullington, a former Chippendales dancer and choreographer, and two other ex-Chippendales dancers, who Banerjee felt were competition to the Chippendales franchise. He eventually pleaded guilty to attempted arson, racketeering, and murder for hire. He entered into a plea agreement that would have led to 26 years in prison, and loss of his share of Chippendales.\nIn the early morning of October 23, 1994, hours before he was due to be sentenced, Banerjee was found dead in his cell, having hanged himself. Reports stated that while Banerjee was depressed, it was not thought he would take his own life.\n\n\n== Biographical depiction ==\nActor Naveen Andrews portrayed him in the 2000 television movie The Chippendales Murder, and Shelley Malil portrayed him in the 2002 movie Just Can't Get Enough.In 2009, director Tony Scott was reportedly working on a film about Banerjee and the Chippendales story. In 2016, Trisha Ray and Salman Khan were reportedly working on a film based on Banerjee's life. In 2020, Deadline reported an upcoming film based on Banerjee's life, starring Dev Patel.In 2001, Banerjee was the subject of an episode of The FBI Files entitled \"Backstage Murder\" (Season 3, Episode 13). He is also the central focus of the first episode of Welcome to Your Fantasy, a 2021 serial podcast telling the Chippendales story, as well as the Season 43 (2021) premiere episode of ABC's 20/20, \"The Chippendales Murders\".\n\n\n== References ==\n\n\n== External links ==\nBiography of Somen Banerjee\nObituary of Somen Banerjee", "links": ["20/20 (American TV program)", "American Broadcasting Company", "Backgammon", "Bengali language", "Bombay", "Bombay Province", "British Raj", "California", "Chippendales", "Deadline Hollywood", "Dev Patel", "Dorothy Stratten", "Hanged", "Indian American", "List of The FBI Files episodes", "Los Angeles", "Mobil", "Mumbai", "Naveen Andrews", "Nick De Noia", "Nightclub", "Paul Snider", "Playboy Playmate", "Salman Khan", "Shelley Malil", "The Chippendales Murder", "The FBI Files", "Tony Scott", "Trisha Ray", "United States"]}