{"url": "https://en.wikipedia.org/wiki/Sotiris_Silaidopoulos", "title": "Sotiris Silaidopoulos", "summary": "Sotiris Silaidopoulos (Greek: Σωτήρης Συλαϊδόπουλος; born 8 February 1979) is a Greek professional football manager and former player.", "content": "Sotiris Silaidopoulos (Greek: Σωτήρης Συλαϊδόπουλος; born 8 February 1979) is a Greek professional football manager and former player.\n\n\n== Early life and playing career ==\nSilaidopoulos was born on the Greek island of Kos and started playing football at local club Antagoras F.C., where he later went on to play for the club's senior team at age 15.\nIn 1999 he signed for Super League 1 club Panionios F.C., where the 19-year-old initially joined the Under-20 team, while training with the senior side. At the end of 2000, Silaidopoulos suffered a severe knee injury that forced him to undergo multiple surgeries and prevented him to pursue a professional playing career.\nAfter a long injury break, Silaidopoulos returned to the pitch in 2004 and played for lower division clubs, before he retired in 2009 and focused on his coaching career.\n\n\n== Managerial career ==\n\n\n=== First steps into coaching ===\nFollowing his retirement, Silaidopoulos started making his first experiences in coaching by taking over the U-15 team of Omilos Athlopaidion Kos at the beginning of the 2010–11 season. In the following season, he led the club's U-17 side to victory in the Dodecanese League.\n\n\n=== Antagoras F.C. ===\nIn 2012, Silaidopoulos was approached by his childhood club Antagoras F.C. to take over the senior team after the club had overcome some financial turmoil and was forced to build up a new team in the 4th division. He accepted the offer and gained promotion to Greece's 3rd division in the 2014–15 season.\n\n\n=== Panathinaikos F.C. ===\nOn July 1, 2015, Silaidopoulos was hired by Super League 1  club Panathinaikos F.C. and appointed as head coach of the club's U-16 team, which he led to win the Attica League in his first season in charge.\nIn the following two seasons, he was coaching the club's U-17s. During this period, the team reached the final of the prestigious 2017 Puskás Cup in Felcsút, Hungary only losing to champion Real Madrid.His team finished first in the regular season of 2017-18 and lost the championship title in a penalty shoot-out against Olympiakos F.C., in which Panathinaikos conceived a late equaliser in extra time.Since the 2018–19 season, Silaidopoulos has been the head coach of the Under-19 team of Panathinaikos. With many players being from the 2001 generation, his side was the youngest U-19 team in the Greek league and finished 5th in the championship.  On international stage the team won the 2019 Tri-Series Tournament hosted by Aspire Academy in Qatar and finished as runner-up in the 2019 ICGT Tournament in the Netherlands losing 1–0 to Valencia in the final.In the 2019–20 season, his team aimed to make the next step in its development. By the time the season was stopped in February 2020 due to the outbreak of COVID-19, Panathinaikos was ranked 2nd in the Super League K-19 after 24 games with just two matches remaining. Several players of this successful youth team have also been promoted to the club's senior team during the season.On 12 October 2020, he was appointed as interim head coach after Dani Poyatos was sacked. He drew his only game 2-2 against OFI in the Super League. After Laszlo Boloni was appointed as the new Head Coach of Panathinaikos, Silaidopoulos joined the coaching staff of the club's first tam as Assistant Manager on October 19, 2020. \n\n\n== Personal life ==\nSilaidopoulos is married with one child. He speaks fluent Greek and English and also has basic knowledge of Italian and German. He is holder of the UEFA A, UEFA B and UEFA Youth Elite licenses and also received a diploma in Art History from the Ippokrateio-Lyceum of Kos.\n\n\n== References ==", "links": ["2017 Puskás Cup", "Alberto Malesani", "Andrea Stramaccioni", "Andreas Papaemmanouil", "Angelos Anastasiadis", "Antonis Migiakis", "Apostolos Nikolaidis (athlete)", "Aymoré Moreira", "Bruno Pesaola", "Béla Guttmann", "Dani Poyatos", "David Barnes (football manager)", "Fabri González", "Ferenc Puskás", "Fernando Santos (footballer, born 1954)", "Georgios Donis", "Giannis Anastasiou", "Giannis Vonortas", "Giorgos Kalafatis", "Greek language", "Gunder Bengtsson", "Hans Backe", "Harry Game", "Helmut Senekowitsch", "Henk ten Cate", "Hristo Bonev", "Ioannis Kyrastas", "Itzhak Shum", "Ivan Jovanović (football manager)", "Ivica Osim", "Jacek Gmoch", "Jasminko Velić", "Jesualdo Ferreira", "Johann Strnad", "John Cyril Campbell", "José Peseiro", "Juan Hohberg", "Juan Ramón Rocha", "János Zsolnai", "József Künsztler", "Kazimierz Górski", "Kos", "Kostas Tsakos", "Lakis Petropoulos", "László Bölöni", "Manager (association football)", "Marinos Ouzounidis", "Marton Bem", "Miklos Forner", "Nikos Nioplias", "OFI Crete F.C.", "Olympiacos F.C.", "Olympiacos F.C. Youth Academy", "Panathinaikos F.C.", "Panionios F.C.", "Petr Packert", "Ronnie Allen", "Sergio Markarián", "Stjepan Bobek", "Super League Greece", "Svetislav Glišović", "Th. Nikolaidis", "Themos Asderis", "Tomislav Ivić", "Totis Filakouris", "Vassilis Daniil", "Velimir Zajec", "Víctor Muñoz", "Ypofantis", "Zdeněk Ščasný", "Ștefan Kovács"]}