{
    "url": "https://en.wikipedia.org/wiki/Space_Power_Facility",
    "title": "Space Power Facility",
    "summary": "Space Power Facility (SPF) is a NASA facility used to test spaceflight hardware under simulated launch and spaceflight conditions. The SPF is part of NASA's Neil A. Armstrong Test Facility, which in turn is part of the Glenn Research Center. The Neil A. Armstrong Test Facility and the SPF are located near Sandusky, Ohio (Oxford Township, Erie County, Ohio).\nThe SPF is able to simulate a spacecraft's launch environment, as well as in-space environments. NASA has developed these capabilities under one roof to optimize testing of spaceflight hardware while minimizing transportation issues. Space Power Facility has become a \"One Stop Shop\" to qualify flight hardware for crewed space flight. This facility provides the capability to perform the following environmental testing:\n\nThermal-vacuum testing\nReverberation acoustic testing\nMechanical vibration testing\nModal testing\nElectromagnetic interference and compatibility testing",
    "content": "Space Power Facility (SPF) is a NASA facility used to test spaceflight hardware under simulated launch and spaceflight conditions. The SPF is part of NASA's Neil A. Armstrong Test Facility, which in turn is part of the Glenn Research Center. The Neil A. Armstrong Test Facility and the SPF are located near Sandusky, Ohio (Oxford Township, Erie County, Ohio).\nThe SPF is able to simulate a spacecraft's launch environment, as well as in-space environments. NASA has developed these capabilities under one roof to optimize testing of spaceflight hardware while minimizing transportation issues. Space Power Facility has become a \"One Stop Shop\" to qualify flight hardware for crewed space flight. This facility provides the capability to perform the following environmental testing:\n\nThermal-vacuum testing\nReverberation acoustic testing\nMechanical vibration testing\nModal testing\nElectromagnetic interference and compatibility testing\n\n\n== Thermal-Vacuum Test Chamber ==\nThe Space Power Facility (SPF) is a vacuum chamber built by NASA in 1969. It stands 122 feet (37 m) high and 100 feet (30 m) in diameter, enclosing a bullet-shaped space. It is the world's largest thermal vacuum chamber. It was originally commissioned for nuclear-electric power studies under vacuum conditions, but was later decommissioned. It was subsequently recommissioned for use in testing spacecraft propulsion systems. Recent uses include testing the airbag landing systems for the Mars Pathfinder and the Mars Exploration Rovers, Spirit and Opportunity, under simulated Mars atmospheric conditions.\nThe facility was designed and constructed to test both nuclear and non-nuclear space hardware in a simulated Low-Earth-Orbiting environment. Although the facility was designed for testing nuclear hardware, only non-nuclear tests have been performed throughout its history. Some of the test programs that have been performed at the facility include high-energy experiments, rocket-fairing separation tests, Mars Lander system tests, deployable Solar Sail tests and International Space Station hardware tests. \nThe facility can sustain a high vacuum (10−6 torr, 130 μPa); simulate solar radiation via a 4 MW quartz heat lamp array, solar spectrum by a 400 kW arc lamp, and cold environments (−320 °F (−195.6 °C)) with a variable geometry cryogenic cold shroud.\nThe facility is available on a full-cost reimbursable basis to government, universities, and the private sector.\nIn Spring 2013 SpaceX conducted a fairing separation test in the vacuum chamber.\n\n\n=== Aluminum Test Chamber ===\nThe Aluminum Test Chamber is a vacuum-tight aluminum plate vessel that is 100 feet (30 m) in diameter and 122 feet (37 m) high. Designed for an external pressure of 2.5 psi (17 kPa) and internal pressure of 5 psi (34 kPa), the chamber is constructed of Type 5083 aluminum which is a clad on the interior surface with a 1⁄8 in (3.2 mm) thick type 3003 aluminum for corrosion resistance. This material was selected because of its low neutron absorption cross-section. The floor plate and vertical shell are 1 inch (25 mm) (total) thick, while the dome shell is 1+3⁄8 in (35 mm). Welded circumferentially to the exterior surface is aluminum structural T-section members that are 3 feet (0.9 m) deep and 2 feet (0.6 m) wide. The doors of the test chamber are 50 by 50 feet (15 by 15 m) in size and have double door seals to prevent leakage. The chamber floor was designed for a load of 300 tons.\n\n\n=== Concrete Chamber Enclosure ===\nThe concrete chamber enclosure serves not only as a radiological shield but also as a primary vacuum barrier from atmospheric pressure. 130 feet (40 m) in diameter and 150 feet (46 m) in height, the chamber was designed to withstand atmospheric pressure outside of the chamber at the same time vacuum conditions are occurring within. The concrete thickness varies from 6 to 8 feet (1.8 to 2.4 m) and contains a leak-tight steel containment barrier embedded within. The chamber's doors are 50 by 50 feet (15 by 15 m) and have inflatable seals. The space between the concrete enclosure and the aluminum test chamber is pumped down to a pressure of 20 torrs (2.7 kPa) during a test.\n\n\t\t\n\t\t\n\t\t\n\t\t\nBrian Cox of the BBC's Human Universe filmed a rock and feather drop episode at the Space Power Facility.  Below is a YouTube clip:\nRock and Feather Drop at NASA's Space Power Facility\n\n\n=== Electromagnetic Interference/Compatibility (EMI/EMC) functionality ===\nDesigned specifically as a large-scale thermal-vacuum test chamber for qualification testing of vehicles and equipment in outer-space conditions, it was discovered in the late 2000s that the unique construction of the SPF interior aluminum vacuum chamber also makes it an extremely large and electrically complex RF cavity with excellent reverberant RF characteristics. In 2009 these characteristics were measured by NIST and others after which the facility was understood to be, not only the world's largest Vacuum chamber, but also the world's largest EMI/EMC test facility. In 2011 NASA GRC successfully performed a calibration of the aluminum vacuum chamber using IEC 61000-4-21 methodologies. As a result of these activities, the SPF is capable of performing radiated susceptibility EMI tests for vehicles and equipment per MIL-STD-461 and able to achieve MIL-STD-461F limits above approximately 80 MHz. In the spring of 2017 the low-power characterizations and calibrations from 2009 and 2011 were proven correct in a series of high-power tests performed in the chamber to validate its capabilities. The SPF chamber is currently being prepared for EMI radiated susceptibility testing of the crew module for the Artemis 1 of NASA's Orion spacecraft.\n\n\t\t\n\n\n== Reverberant Acoustic Test Facility ==\nThe Reverberant Acoustic Test Facility has 36 nitrogen-driven horns to simulate the high noise levels that will be experienced during a space vehicle launch and supersonic ascent conditions. The RATF is capable of an overall sound pressure level of 163 dB within a 101,500-cubic-foot (2,870 m3) chamber.\n\n\t\t\n\t\t\n\t\t\n\n\n== Mechanical Vibration Test Facility ==\n\nThe Mechanical Vibration Test Facility (MVF), is a three-axis vibration system. It will apply vibration in each of the three orthogonal axes (not simultaneously) with one direction in parallel to the Earth-launch thrust axis (X) at 5–150 Hz, 0-1.25 g-pk vertical, and 5–150 Hz 0-1.0 g-pk for the horizontal axes. \nVertical, or the thrust axis, shaking is accomplished by using 16 vertical actuators manufactured by TEAM Corporation, each capable of 30,000 lbf (130 kN). The 16 vertical actuators allow for testing of up to a 75,000 lb (34,000 kg) article at the previously stated frequency and amplitude limits.\nHorizontal shaking is accomplished through use of 4 TEAM Corporation Horizontal Actuators. The horizontal actuators are used during Vertical testing to counteract cross axis forces and overturning moments.\n\n\t\t\n\t\t\n\t\t\n\t\t\nNASA's Space Power Facility Vibro-Acoustic Construction\n\n\n== Modal Test Facility ==\nIn addition to the sine vibe table, a fixed-base Modal floor sufficient for the 20 ft (6.1 m) diameter test article is available. The fixed based Modal Test Facility is a 6 in (150 mm) thick steel floor on top of 19 ft (5.8 m) of concrete, that is tied to the earth using 50 ft (15 m) deep tensioned rock anchors.\nThere were over 21,000,000 pounds (9,500 t) of rock anchors, and 6,000,000 pounds (2,700 t) of concrete used in the construction of the fixed-base modal test facility and mechanical vibration test facility.\n\n\t\t\n\t\t\n\n\n== Assembly Area ==\nThe SPF Facility layout is ideal for performing multiple test programs. The facility has two large high bay areas adjacent to either side of the vacuum chamber. The advantage of having both areas available is that it allows for two complex tests to be prepared simultaneously. One test can be prepared in a high bay while another test is being conducted in the vacuum chamber. Large chamber doors provide access to the test chamber from either high bay.\n\nNASA's Space Power Facility Vibro-Acoustic Construction\n\n\n== References ==\n\n\n== External links ==\nSkylab Shroud in Plum Brook Space Power Facility\nNASA image gallery, featuring the SPF\nDetailed facility capabilities",
    "links": [
        "2001 Mars Odyssey",
        "Apollo 11 goodwill messages",
        "Apollo 15 postal covers incident",
        "Apollo 8 Genesis reading",
        "Apollo program",
        "Apollo–Soyuz",
        "Aquarius (SAC-D instrument)",
        "Artemis 1",
        "Artemis program",
        "Astronaut",
        "Astronaut ranks and positions",
        "Astronauts Day",
        "Augustine Committee",
        "Budget of NASA",
        "Bullet",
        "Canberra Deep Space Communication Complex",
        "Cassini–Huygens",
        "Chief of the Astronaut Office",
        "Christopher C. Kraft Jr. Mission Control Center",
        "Columbia Accident Investigation Board",
        "Commercial Crew Program",
        "Commercial Lunar Payload Services",
        "Commercial Orbital Transportation Services",
        "Commission on the Future of the United States Aerospace Industry",
        "Constellation program",
        "Cosmic Background Explorer",
        "Curiosity (rover)",
        "Dawn (spacecraft)",
        "Deep Space Atomic Clock",
        "Discovery Program",
        "Earth Observing System",
        "Earthrise",
        "Europa Clipper",
        "Explorers Program",
        "Fallen Astronaut",
        "Family Portrait (MESSENGER)",
        "Family Portrait (Voyager)",
        "Fe, Fi, Fo, Fum, and Phooey",
        "GALEX",
        "GOES 14",
        "GOES 15",
        "GRAIL",
        "Galileo project",
        "Glenn Research Center",
        "Goldstone Deep Space Communications Complex",
        "Great Observatories program",
        "Hitchhiker Program",
        "Hubble Space Telescope",
        "Human spaceflight",
        "InSight",
        "Ingenuity (helicopter)",
        "International Space Station",
        "International Space Station programme",
        "James Webb Space Telescope",
        "Johnson Space Center",
        "Joint Polar Satellite System",
        "Juno (spacecraft)",
        "Kennedy Space Center",
        "Kennedy Space Center Launch Complex 39",
        "Kennedy Space Center Launch Complex 48",
        "Kepler space telescope",
        "LADEE",
        "Launch Control Center",
        "Launch Services Program",
        "List of Apollo astronauts",
        "List of Apollo missions",
        "List of Gemini astronauts",
        "List of NASA aircraft",
        "List of NASA cameras on spacecraft",
        "List of NASA cancellations",
        "List of NASA missions",
        "List of Space Shuttle crews",
        "List of Space Shuttle missions",
        "List of administrators and deputy administrators of NASA",
        "List of astronauts by name",
        "List of astronauts by year of selection",
        "List of rockets of the United States",
        "List of surface features of Mars visited by Spirit and Opportunity",
        "List of uncrewed NASA missions",
        "Living With a Star",
        "Lunar Gateway",
        "Lunar Orbiter program",
        "Lunar Precursor Robotic Program",
        "Lunar Reconnaissance Orbiter",
        "Lunar Sample Laboratory Facility",
        "Lunar plaque",
        "Lunar sample displays",
        "MAVEN",
        "MESSENGER",
        "MESUR",
        "MIL-STD-461",
        "Madrid Deep Space Communications Complex",
        "Magellan (spacecraft)",
        "Magnetospheric Multiscale Mission",
        "Manned Space Flight Network",
        "Mariner Mark II",
        "Mariner program",
        "Mars 2020",
        "Mars Exploration Program",
        "Mars Exploration Rover",
        "Mars Pathfinder",
        "Mars Reconnaissance Orbiter",
        "Mars Science Laboratory",
        "Mars Surveyor '98",
        "Mercury-Atlas 6",
        "Mercury-Redstone 3",
        "Mercury Control Center",
        "Mission patch",
        "Monkeys and apes in space",
        "Moon tree",
        "Mystic Mountain",
        "NASA",
        "NASA Astronaut Corps",
        "NASA Chief Scientist",
        "NASA Deep Space Network",
        "NASA International Space Apps Challenge",
        "NASA Social",
        "NASA TV",
        "NASA insignia",
        "NASA research",
        "NASA space-flown Gemini and Apollo medallions",
        "NASA spinoff technologies",
        "NISAR (satellite)",
        "Nancy Grace Roman Space Telescope",
        "National Advisory Committee for Aeronautics",
        "National Aeronautics and Space Act",
        "Near Earth Network",
        "Neil Gehrels Swift Observatory",
        "New Frontiers program",
        "New Horizons",
        "New Millennium Program",
        "North American X-15",
        "NuSTAR",
        "OSIRIS-REx",
        "Operations and Checkout Building",
        "Opportunity (rover)",
        "Orion (spacecraft)",
        "Orion spacecraft",
        "Oxford Township, Erie County, Ohio",
        "Pale Blue Dot",
        "Payload fairing",
        "Perseverance (rover)",
        "Pillars of Creation",
        "Pioneer 10",
        "Pioneer 11",
        "Pioneer plaque",
        "Pioneer program",
        "Planetary Observer program",
        "President's Commission on Implementation of United States Space Exploration Policy",
        "Project Gemini",
        "Project Mercury",
        "Project Prometheus",
        "Ramaty High Energy Solar Spectroscopic Imager",
        "Ranger program",
        "Review of United States Human Space Flight Plans Committee",
        "Ride Report",
        "Robotic spacecraft",
        "Rogers Commission Report",
        "Roscosmos",
        "Sandusky, Ohio",
        "Shuttle–Mir program",
        "Skylab",
        "Sojourner (rover)",
        "Solar Dynamics Observatory",
        "Solar Terrestrial Probes program",
        "Soviet space program",
        "SpaceX",
        "Space Communications and Navigation Program",
        "Space Exploration Initiative",
        "Space Flight Operations Facility",
        "Space Mirror Memorial",
        "Space Network",
        "Space Race",
        "Space Shuttle",
        "Space Shuttle program",
        "Space Task Group",
        "Space policy of the United States",
        "Spacecraft propulsion",
        "Spirit (rover)",
        "Spitzer Space Telescope",
        "Sub-orbital spaceflight",
        "Surveyor program",
        "THEMIS",
        "The Astronaut Monument",
        "The Blue Marble",
        "The Day the Earth Smiled",
        "Thomas O. Paine",
        "Timeline of Galileo (spacecraft)",
        "Timeline of Mars 2020",
        "Timeline of Mars Science Laboratory",
        "Timeline of Opportunity",
        "Timeline of the James Webb Space Telescope",
        "Torr",
        "Transiting Exoplanet Survey Satellite",
        "U.S. space exploration history on U.S. stamps",
        "United States Astronaut Hall of Fame",
        "Vacuum chamber",
        "Van Allen Probes",
        "Vehicle Assembly Building",
        "Viking program",
        "Vision for Space Exploration",
        "Voyager 1",
        "Voyager 2",
        "Voyager Golden Record",
        "Voyager program",
        "We choose to go to the Moon",
        "Wide-field Infrared Survey Explorer",
        "Wilkinson Microwave Anisotropy Probe"
    ]
}