{"url": "https://en.wikipedia.org/wiki/Spencer_family", "title": "Spencer family", "summary": "The Spencer family is an aristocratic family in the United Kingdom. Founded in the 15th century, it has spawned numerous aristocratic titles including the dukedom of Marlborough, the earldoms of Sunderland and Spencer, and the Churchill barony. Two prominent members of the family during the 20th century were Sir Winston Churchill and Diana, Princess of Wales.", "content": "The Spencer family is an aristocratic family in the United Kingdom. Founded in the 15th century, it has spawned numerous aristocratic titles including the dukedom of Marlborough, the earldoms of Sunderland and Spencer, and the Churchill barony. Two prominent members of the family during the 20th century were Sir Winston Churchill and Diana, Princess of Wales.\n\n\n== History ==\n\n\n=== Descent and claims ===\n\nThe House was founded in the 15th century by Henry Spencer (died c. 1478), from whom all members descend. In the 16th century the claim arose that the Spencers were a cadet branch of the ancient House Le Despencer, though this theory has since been debunked, in particular by J. Horace Round in his essay The Rise of the Spencers. The Spencers were first granted a coat of arms in 1504, \"Azure a fess Ermine between 6 sea-mews’ heads erased Argent,\"  but this bears no resemblance to the arms used by the family after c. 1595, which were derived from the Despencer arms, \"Quarterly Argent and Gules in the second and third quarters a Fret Or overall on a Bend Sable three Escallops of the first\" (the scallops standing for the difference as a cadet branch). Round argued that the Despencer descent was fabricated by Richard Lee, a corrupt Clarencieux King of Arms. Citing Round, The Complete Peerage dismissed the alleged Despencer descent as an \"elaborate imposture\" which \"is now incapable of deceiving the most credulous.\"\n\n\n=== Rise to wealth ===\nA close relative of Henry Spencer (died c. 1478) was John Spencer, who in 1469 had become feoffee (trustee) of Wormleighton in Warwickshire and a tenant at Althorp in Northamptonshire in 1486. His nephew, Sir John Spencer (died 1522), first made a living by trading in livestock and other commodities and eventually saved enough money to purchase both the Wormleighton and Althorp lands. Wormleighton was bought in 1506, the manor house was completed in 1512. In 1508, Spencer also purchased the estate of Althorp with its moated house and several hundred acres of farmland. He had grazed sheep here from the 1480s. Impressed by the quality of the land, he eventually bought it and rebuilt the house in 1508. At that time, his estate and mansion in Warwickshire were considerably larger, and the house in Wormleighton was four times the size of Althorp. In 1511 he made further purchases to acquire the villages of Little Brington and Great Brington as well their parish church of St Mary the Virgin, from Thomas Grey, 2nd Marquess of Dorset. By putting down roots at Althorp, Spencer provided what was to become a home for the next 19 generations. In 1519 he was knighted by King Henry VIII, died three years later and was buried in the new family chapel at Great Brington.The Spencers rose to opulent prominence during the 16th century. Sir John Spencer's grandson Sir John Spencer (d. 1586) was a Knight of the Shire for Northamptonshire. The Spencers’ administration of their Northamptonshire and Warwickshire estates was admired and often emulated by gentlemen all over England. Sheep from their pastures were purchased for breeding and it is probable that the family's success as farmers was rarely equalled in the century.In the late 16th century, the latter Sir John Spencer's grandson Sir Robert Spencer (1570–1627) represented Brackley in Parliament. In 1601, he was made a Knight of the Garter, and created Baron Spencer, of Wormleighton, in the Peerage of England in 1603. During the reign of King James I he was reputed to be the richest man in England. The humble origins of the Spencers as sheep farmers once caused a heated exchange of words between wealthy yet then upstart Spencers with the more established Howards whose FitzAlan ancestors had been the Earls of Arundel since the 13th century. During a debate in the House of Peers, Lord Spencer was speaking about something that their great ancestors had done when suddenly the Earl of Arundel cut him off and said \"My Lord, when these things you speak of were doing, your ancestors were keeping sheep\". Lord Spencer then instantly replied, \"When my ancestors as you say were keeping sheep, your ancestors were plotting treason.\"Robert Spencer, 1st Baron Spencer, was succeeded in his peerage and estates by his eldest surviving son, William. He had previously represented Northamptonshire in Parliament. Two of his sons received additional peerages: His eldest son, Henry (1620–1643),  succeeded as 3rd Baron Spencer in 1636 and was created Earl of Sunderland in the Peerage of England in 1643. The younger son, Robert (1629–1694),  sat in the House of Commons from 1660 to 1679 and was created Viscount Teviot in the Peerage of Scotland in 1685.\nThe senior branch of the Spencers (later known as the Spencer-Churchill family) is currently represented by Jamie Spencer-Churchill, 12th Duke of Marlborough, direct descendant via the eldest male-line of Sir John Spencer, who was knighted by King Henry VIII in 1519 while the cadet branch of the family, the Spencers of Althorp who descends via the male-line from the younger son of the 3rd Earl Sunderland is represented by Charles Spencer, 9th Earl Spencer.\n\n\n=== Spencer, later Spencer-Churchill ===\nRobert Spencer, 2nd Earl of Sunderland was Lord President of the Council from 1685 to 1688 and a Knight of the Garter. His son Charles, 3rd Earl of Sunderland, was Lord-Lieutenant of Ireland, Lord Privy Seal, Secretary of State for both the Northern and Southern Departments, Lord President of the Council, First Lord of the Treasury and a Knight of the Garter. His second wife was Lady Anne Churchill, the second daughter of the distinguished soldier John Churchill, 1st Duke of Marlborough. After Churchill's death in 1722, the Marlborough titles first passed to his eldest daughter Henrietta (1681–1733), then to Anne's second son, Charles. After the death of his elder brother, Robert, in 1729, Charles Spencer had already inherited the titles of 4th Earl of Sunderland and Baron Spencer of Wormleighton as well as the Spencer family estates. In 1733, he succeeded to the Churchill family estates and titles and became the 3rd Duke of Marlborough as well as a Knight of the Garter, while the Spencer estates in Bedfordshire, Northamptonshire (including Althorp) and Warwickshire passed to his younger brother John (1708–1746).\nIn 1815, Francis Spencer, the younger son of George Spencer, 4th Duke of Marlborough, was created Baron Churchill, of Wychwood in the County of Oxford, in the Peerage of the United Kingdom. In 1902, his grandson, the 3rd Baron, was created Viscount Churchill, of Rolleston in the County of Leicester, also in the Peerage of the United Kingdom.\nIn 1817, George Spencer, 5th Duke of Marlborough, obtained permission to assume and bear the additional surname of Churchill in addition to his own surname of Spencer, in order to perpetuate the name of his illustrious great-great-grandfather. At the same time he received Royal Licence to quarter his paternal arms of Spencer with the coat of arms of Churchill. The modern Dukes of Marlborough thus originally bore the surname \"Spencer\". The double-barrelled surname of \"Spencer-Churchill\" as used since 1817 has remained in the family to this day, though some members have preferred to style themselves merely \"Churchill\". The 7th Duke of Marlborough was the paternal grandfather of Sir Winston Churchill (1874–1965), the British prime minister. The latter's widow, Clementine (1885–1977), was created a life peeress in her own right as Baroness Spencer-Churchill in 1965.\nThe family seat of the Dukes of Marlborough is Blenheim Palace in Woodstock, Oxfordshire. Most Spencer-Churchills are interred in the churchyard of St Martin's Church, Bladon, a short distance from the palace; only the Dukes and Duchesses are buried in the Blenheim Palace chapel.\n\n\n=== Spencer, of Althorp House ===\n\nIn 1761, John Spencer (1734–1783), a grandson of the 3rd Earl of Sunderland, was created Baron Spencer of Althorp and Viscount Spencer in the Peerage of Great Britain by King George III. In 1765, he was further created Viscount Althorp and Earl Spencer, also in the Peerage of Great Britain. In 1755, he had privately married Margaret Poyntz (1737–1814) in his mother's dressing room at Althorp. They had five children, including the 2nd Earl Spencer, who later became Home Secretary from 1806 to 1807 and a Knight of the Garter. His older son, the 3rd Earl Spencer was Chancellor of the Exchequer under Lord Grey and Lord Melbourne from 1830 to 1834. The 2nd Earl's youngest son George (1799–1864) converted from Anglicanism to the Roman Catholic Church, became a priest and took the name of Father Ignatius of St Paul. He worked as a missionary and is a candidate for beatification. His older brother, who eventually became the 4th Earl Spencer, was a naval commander, courtier and Whig politician. He initially served in the Royal Navy and fought in the Napoleonic Wars and the Greek War of Independence, eventually rising to the rank of Vice-Admiral, and was made a Knight of the Garter in 1849. His son, the 5th Earl Spencer, who was known as the \"Red Earl\" because of his distinctive long red beard, was a close friend of prime minister William Ewart Gladstone. He served twice as Lord Lieutenant of Ireland and was made a Knight of the Garter in 1864. He was succeeded in 1910 by his half-brother, the 6th Earl Spencer, who had been made Viscount Althorp, of Great Brington in the County of Northamptonshire, in the Peerage of the United Kingdom, in 1905 and served as Lord Chamberlain from 1905 to 1912. He became a Knight of the Garter in 1913, and was succeeded in the earldom and estates by his son, the 7th Earl Spencer, in 1922. His son, the 8th Earl Spencer, succeeded to the earldom and estates in 1975. He married Frances Ruth Roche in 1954 and had a daughter, Diana, who married Prince Charles in 1981.\nThe family seat of the Earl Spencer is Althorp in Northamptonshire, their traditional burial place is the parish church of St Mary the Virgin Church, Great Brington. The family estate includes significant land holdings in other parts of the country, including the village of North Creake in Norfolk.\n\n\n== Members of the family ==\n\n\n=== Spencer Knights ===\nSir John Spencer, Kt. of Snitterfield & Wormleighton (1447–1522) married Isabel, daughter of Sir Walter Graunt, of Snitterfield\nSir William Spencer, Kt. of Wormleighton & Althorp (1483–1532) married Susan, daughter of Sir Richard Knightley, of Fawsley, Northants\nSir John Spencer, Kt. of Wormleighton & Althorp (1524–1586) married Katherine, daughter of Sir Thomas Kitson, of Hengrove, Suffolk\nSir John Spencer, Kt. (1546–1600) married Mary, daughter of Sir Robert Catlyn, of Berne, Dorset\nSir Robert Spencer (1570–1627), was made 1st Baron Spencer\n\n\n=== Spencer Baronets ===\n\nThis now extinct line descended from two younger sons of Sir John Spencer (1524–1586) and his wife Katherine Kitson: \n\nTheir third son William was a landowner in Yarnton, Oxfordshire; his son Thomas was created Baronet of Yarnton in 1611.\nTheir fourth son Richard was the ambassador of James I to the Dutch Republic; his son, John, was a landowner in Great Offley, Hertfordshire and was created Baronet of Offley in 1627.\n\n\n=== Barons Spencer ===\nRobert Spencer, 1st Baron Spencer (1570–1627), married Margaret, daughter of Sir Francis Willoughby (1547-1596), Kt.\nWilliam Spencer, 2nd Baron Spencer (1591–1636), married Penelope, daughter of Henry Wriothesley, 3rd Earl of Southampton\nHenry Spencer, 3rd Baron Spencer (1620–1643), royalist in the English Civil War, was made 1st Earl of Sunderland\n\n\n=== Earls of Sunderland ===\n\nHenry Spencer, 1st Earl of Sunderland (1620–1643), royalist in the English Civil War\nRobert Spencer, 2nd Earl of Sunderland (1640–1702), politician\nCharles Spencer, 3rd Earl of Sunderland (1675–1722), politician\nRobert Spencer, 4th Earl of Sunderland (1701–1729)\nCharles Spencer, 5th Earl of Sunderland (1706–1758), succeeded his maternal aunt as 3rd Duke of Marlborough\n\n\n=== Dukes of Marlborough ===\n\nCharles Spencer, 5th Earl of Sunderland, 3rd Duke of Marlborough (1706–1758), general and politician\nGeorge Spencer, 4th Duke of Marlborough (1739–1817), politician\nGeorge Spencer-Churchill, 5th Duke of Marlborough (1766–1840), elder son of the 4th Duke, changed his surname from \"Spencer\" to \"Spencer-Churchill\"\nGeorge Spencer-Churchill, 6th Duke of Marlborough (1793–1857), eldest son of the 5th Duke\nJohn Winston Spencer-Churchill, 7th Duke of Marlborough (1822–1883), eldest son of the 6th Duke (and paternal grandfather of Sir Winston Churchill)\nGeorge Charles Spencer-Churchill, 8th Duke of Marlborough (1844–1892), eldest son of the 7th Duke\nCharles Richard John Spencer-Churchill, 9th Duke of Marlborough (1871–1934), only son of the 8th Duke\nJohn Albert William Spencer-Churchill, 10th Duke of Marlborough (1897–1972), elder son of the 9th Duke\nJohn George Vanderbilt Henry Spencer-Churchill, 11th Duke of Marlborough (1926-2014), elder son of the 10th Duke\nCharles James Spencer-Churchill, 12th Duke of Marlborough (born 1955), eldest son of the 11th Duke\n\n\n=== Barons and Viscounts Churchill ===\n\nThis line of the family descends from Francis Spencer, younger son of the 4th Duke of Marlborough. In 1902, his grandson, the 3rd Baron, was created Viscount Churchill. Holders of these titles include\n\nFrancis Almeric Spencer, 1st Baron Churchill (1779–1845)\nVictor Albert Francis Charles Spencer, 1st Viscount Churchill (1864–1934)\n\n\n=== Earls Spencer ===\n\nJohn Spencer, 1st Earl Spencer (1734–1783), a grandson of the 3rd Earl of Sunderland through his third and youngest son\nGeorge John Spencer, 2nd Earl Spencer (1758–1834), politician and book collector\nJohn Charles Spencer, 3rd Earl Spencer (1782–1845), better known as Lord Althorp, politician\nFrederick Spencer, 4th Earl Spencer (1798–1857)\nJohn Poyntz Spencer, 5th Earl Spencer (1835–1910), politician\nCharles Robert Spencer, 6th Earl Spencer (1857–1922)\nAlbert Edward John Spencer, 7th Earl Spencer (1892–1975)\n(Edward) John Spencer, 8th Earl Spencer (1924–1992), father of Diana, Princess of Wales\nCharles Edward Maurice Spencer, 9th Earl Spencer (born 1964), younger brother of Diana, Princess of Wales\n\n\n=== Notable marriages ===\nJane Spencer, daughter of Sir William Spencer (1483–1558) of Wormleighton and Althorp, married Sir Richard Brydges, Kt.\nAlice Spencer (1559–1637), daughter of Sir John Spencer (1524–1586), married Ferdinando Stanley, 5th Earl of Derby. Their daughter Anne (1580–1647) was heiress presumptive to the English throne upon the death of Elizabeth I according to the will of Henry VIII and the Third Succession Act. As Lady Derby, Alice was a noted patron of the arts and to whom poet Edmund Spenser represented the character \"Amaryllis\" in his eclogue Colin Clouts Come Home Againe in 1595 and dedicated his poem The Teares of the Muses in 1591.\nLady Georgiana Spencer (1757–1806), daughter of the 1st Earl Spencer, married William Cavendish, 5th Duke of Devonshire\nDiana Russell, Duchess of Bedford (born Lady Diana Spencer), daughter of the 3rd Earl of Sunderland, married in 1731 John Russell, 4th Duke of Bedford\nDiana, Princess of Wales (born The Hon. Diana Spencer), daughter of the 8th Earl Spencer, married in 1981 Charles, Prince of Wales, and had issue.\nClarissa Spencer-Churchill, daughter of Jack Spencer-Churchill (younger brother of Sir Winston Churchill), married Sir Anthony Eden, Prime Minister of the United Kingdom.\nSir Winston Churchill (1874–1965), Prime Minister of the United Kingdom, grandson of the 7th Duke of Marlborough, married Clementine Hozier (1885–1977), later a life peeress in her own right as Baroness Spencer-Churchill.\nThe 9th Duke of Marlborough married Consuelo Vanderbilt, member of the prominent American Vanderbilt family.\nThe 11th Duke of Marlborough married in 1961 Athina Livanos, former wife of Aristotle Onassis. In 1972 he married Countess Rosita Douglas-Stjernorp, daughter of Swedish nobleman and diplomat Count Carl Douglas-Stjernorp. They were divorced in 2008. Her elder sister Elisabeth (b. 1940) is married to Prince Max, Duke in Bavaria, heir presumptive to the Headship of the Royal House of Bavaria. As an artist, she is known professionally as Rosita Marlborough.\nMary Spencer-Churchill, daughter of Sir Winston Churchill, married Christopher Soames, Baron Soames, and was made a Lady of the Garter in 2005.\nThe 7th Earl Spencer, when heir to the earldom and styled Viscount Althorp,  married in 1919 Lady Cynthia Hamilton, daughter of the 3rd Duke of Abercorn.\nThe 8th Earl Spencer, when heir to the earldom and styled Viscount Althorp, married in 1954 the Hon. Frances Ruth Roche, daughter of the 4th Baron Fermoy.\nThe 9th Earl Spencer, then Viscount Althorp, married Victoria Lockwood, a British fashion model, in 1989. They divorced in 1997. He married his third wife Karen Gordon, a Canadian philanthropist, in 2011.\n\n\n=== Other notable members ===\nLady Diana Beauclerk (née Spencer) (1734–1808), eldest child of the 3rd Duke of Marlborough, was artist and Lady of the Bedchamber to Queen Charlotte from 1762 to 1768.\nLord Charles Spencer (1740–1820), second son of the 3rd Duke of Marlborough, was Postmaster General of the United Kingdom from 1801 to 1806 and Master of the Mint in 1806.\nWilliam Robert Spencer (1769–1834), younger son of Lord Charles Spencer, became a poet and wit.\nAubrey George Spencer (1795–1872), son of the poet William Robert Spencer, became the first Bishop of Newfoundland in 1839, later Bishop of Jamaica.\nGeorge John Trevor Spencer (1799–1866), son of the poet William Robert Spencer, became Bishop of Madras in 1837.\nGeorge Spencer (1799–1864), son of the 2nd Earl Spencer. He was first an Anglican priest, converted to Catholicism to become a Roman Catholic priest as Father Ignatius, worked as a missionary and is now a candidate for beatification.\nGeneral Sir Augustus Almeric Spencer, GCB (1807–1893), third son of Francis Almeric Spencer, 1st Baron Churchill (1779–1845).\nLord Randolph Henry Spencer-Churchill, publicly known as Lord Randolph Churchill (1849–1895), son of the 7th Duke of Marlborough, Chancellor of the Exchequer and Leader of the House of Commons, father of Sir Winston Leonard Spencer Churchill.\nThe Reverend Canon Henry Spencer Stephenson, M.A. (1871-1957), Chaplain to King George VI and Queen Elizabeth II.\nRandolph Frederick Edward Spencer-Churchill, publicly known as Randolph Churchill (1911–1968), son of Sir Winston Leonard Spencer Churchill.\nLady Rosemary Spencer-Churchill (born 1929), maid of honour to Elizabeth II at her coronation in 1953.\nLady Kitty Spencer (born 1990), daughter of Charles Spencer, 9th Earl Spencer\nLouis Spencer, Viscount Althorp (born 1994), son of Charles Spencer, 9th Earl Spencer\n\n\n== Members of the Order of the Garter ==\nMany members of the Spencer family have also been knights or dames of the Order of the Garter. The following is a list is of all Spencer members of this order, across all branches of the family, along with their year of investiture.\n\n1601 – Robert Spencer, 1st Baron Spencer\n1687 – Robert Spencer, 2nd Earl of Sunderland\n1719 – Charles Spencer, 3rd Earl of Sunderland\n1741 – Charles Spencer, 3rd Duke of Marlborough\n1768 – George Spencer, 4th Duke of Marlborough\n1799 – George Spencer, 2nd Earl Spencer\n1849 – Frederick Spencer, 4th Earl Spencer\n1865 – John Spencer, 5th Earl Spencer\n1868 – John Spencer-Churchill, 7th Duke of Marlborough\n1902 – Charles Spencer-Churchill, 9th Duke of Marlborough\n1913 – Charles Spencer, 6th Earl Spencer\n1953 – Sir Winston Churchill\n2005 – Mary, Baroness Soames, née Spencer-Churchill\n\n\n== Coat of arms ==\n\n\n== Family tree ==\n\n\n=== Spencer origins ===\n\n\n=== Barons Spencer of Wormleighton and Earls of Sunderland ===\n\n\n=== Dukes of Marlborough ===\n\n\n=== Earls Spencer ===\nFor the Earls Spencer from John Spencer to present see: Family Tree of the Earls Spencer.\n\n\n=== Barons and Viscounts Churchill ===\n\n\n== References ==\n\n\n== Bibliography ==\nRound, J.H. (1901) Studies in Peerage and Family History, A. Constable and Company, London.\n\n\n== External links ==\nSpencer Family Tree, Althorp.com\nOrigins of the Spencer family\nFamily tree and information – Archived link\nhttp://homepages.rootsweb.com/~djmurphy/conn/washington.htm\nThe Heraldry of the Early Spencers\nHeraldry of the House of Spencer", "links": ["Albert Spencer, 7th Earl Spencer", "Alice Spencer", "Althorp", "Anglicanism", "Anne Churchill", "Anne Spencer, Countess of Sunderland (1683–1716)", "Anne Spencer, Countess of Sunderland (died 1715)", "Anne Stanley, Countess of Castlehaven", "Anthony Ashley Cooper, 1st Earl of Shaftesbury", "Anthony Eden", "Arabella Churchill (charity founder)", "Arabella Churchill (royal mistress)", "Aristotle Onassis", "Athina Livanos", "Aubrey Spencer", "Augustus Spencer", "Baron Churchill (1815 creation)", "Baron Churchill of Whichwood", "Baron Le Despencer", "Baron Spencer of Wormleighton", "Baron le Despencer", "Beatification", "Bedfordshire", "Blenheim Palace", "Blois", "Brackley (UK Parliament constituency)", "British prime minister", "British princess", "British royal family", "Cadet branch", "Canon (priest)", "Chancellor of the Exchequer", "Charles, Prince of Wales", "Charles Grey, 2nd Earl Grey", "Charles Spencer, 3rd Duke of Marlborough", "Charles Spencer, 3rd Earl of Sunderland", "Charles Spencer, 6th Earl Spencer", "Charles Spencer, 9th Earl Spencer", "Charles Spencer-Churchill, 9th Duke of Marlborough", "Charlotte of Mecklenburg-Strelitz", "Christopher Soames, Baron Soames", "Churchill family", "Clarencieux King of Arms", "Clarissa Eden, Countess of Avon", "Clementine Churchill, Baroness Spencer-Churchill", "Coat of arms", "Companion of Honour", "Consuelo Vanderbilt", "Countess of Sunderland", "Cynthia Spencer, Countess Spencer", "Dame Commander of the Order of the British Empire", "Descendants of Winston Churchill", "Diana, Princess of Wales", "Diana Churchill", "Diana Russell, Duchess of Bedford", "Diana Spencer (1710-1735)", "Diocese of Madras of the Church of South India", "Diocese of Newfoundland", "Dorothy Spencer, Countess of Sunderland", "Double-barrelled name", "Duke of Albemarle", "Duke of Berwick", "Duke of Cambridge", "Duke of Marlborough", "Duke of Marlborough (title)", "Dukes of Marlborough", "Dutch Republic", "Earl Spencer (peerage)", "Earl of Arundel", "Earl of Godolphin", "Earl of Sunderland", "Earl of Winchester", "Earls of Sunderland", "Edmund Spenser", "Elizabeth II", "Elizabeth I of England", "England", "Fellow of the Royal Society of Literature", "Feoffee", "Ferdinando Stanley, 5th Earl of Derby", "First Lord of the Treasury", "FitzAlan (name)", "Frances Shand Kydd", "Francis Godolphin, 2nd Earl of Godolphin", "Francis Spencer, 1st Baron Churchill", "Francis Willoughby (1547-1596)", "Frederick Spencer, 4th Earl Spencer", "French language", "George III of the United Kingdom", "George Savile, 1st Marquess of Halifax", "George Spencer, 2nd Earl Spencer", "George Spencer, 4th Duke of Marlborough", "George Spencer-Churchill, 5th Duke of Marlborough", "George Spencer-Churchill, 6th Duke of Marlborough", "George Spencer-Churchill, 8th Duke of Marlborough", "George Spencer-Churchill, Marquess of Blandford", "George Spencer (bishop)", "George VI", "Georgiana Cavendish, Duchess of Devonshire", "Georgiana Spencer, Countess Spencer", "Great Brington", "Great Offley", "Greek War of Independence", "Henrietta Godolphin, 2nd Duchess of Marlborough", "Henry FitzJames, 1st Duke of Albemarle", "Henry Howard, 4th Earl of Carlisle", "Henry Spencer, 1st Earl of Sunderland", "Henry Spencer Stephenson", "Henry VIII of England", "Henry Wriothesley, 3rd Earl of Southampton", "Hertfordshire", "Home Secretary", "House of Commons of England", "Howard family", "ISBN (identifier)", "Ignatius Spencer", "J. Horace Round", "Jack Churchill (1880–1947)", "James FitzJames, 1st Duke of Berwick", "James Hamilton, 3rd Duke of Abercorn", "James Hamilton, 4th Duke of Hamilton", "James II of England", "James I of England", "James Spencer-Churchill, 12th Duke of Marlborough", "James VI and I", "Jamie Spencer-Churchill, 12th Duke of Marlborough", "John Churchill, 1st Duke of Marlborough", "John Churchill, Marquess of Blandford", "John Russell, 4th Duke of Bedford", "John Spencer, 1st Earl Spencer", "John Spencer, 3rd Earl Spencer", "John Spencer, 5th Earl Spencer", "John Spencer, 8th Earl Spencer", "John Spencer-Churchill, 10th Duke of Marlborough", "John Spencer-Churchill, 11th Duke of Marlborough", "John Spencer-Churchill, 7th Duke of Marlborough", "John Spencer (British politician)", "John Spencer (died 1522)", "John Spencer (died 1586)", "John Spencer (died 1600)", "John Spencer (sheriff)", "John Strange Spencer-Churchill", "Karen Spencer, Countess Spencer", "Knight of the Order of the Garter", "Knight of the Shire", "Lady Diana Beauclerk", "Lady Kitty Spencer", "Lady Rosemary Spencer-Churchill", "Lady of the Bedchamber", "Lady of the Order of the Garter", "Landed gentry", "Leader of the House of Commons", "Leicestershire", "Life peer", "Little Brington", "Lord-Lieutenant of Ireland", "Lord Chamberlain", "Lord Charles Spencer", "Lord Lieutenant of Ireland", "Lord President of the Council", "Lord Privy Seal", "Lord Randolph Churchill", "Louis Spencer, Viscount Althorp", "Marigold Churchill", "Marquess of Blandford", "Mary Soames, Baroness Soames", "Master's degree", "Master of the Mint", "Maurice Roche, 4th Baron Fermoy", "Member of Parliament (United Kingdom)", "Member of the Order of Merit", "Missionary", "Most Honourable Order of the Bath", "Napoleonic Wars", "Noble family", "Norfolk", "North Creake", "Northamptonshire", "Northamptonshire (UK Parliament constituency)", "Order of the British Empire", "Order of the Garter", "Oxfordshire", "Peerage of England", "Peerage of Great Britain", "Peerage of the United Kingdom", "Postmaster General of the United Kingdom", "Prime Minister of the United Kingdom", "Prince Max, Duke in Bavaria", "Prince William, Duke of Cambridge", "Prince of Wales", "Randolph Churchill", "Richard Brydges", "Robert Catlyn", "Robert Spencer, 1st Baron Spencer of Wormleighton", "Robert Spencer, 1st Viscount Teviot", "Robert Spencer, 2nd Earl of Sunderland", "Robert Spencer, 4th Earl of Sunderland", "Roman Catholic", "Rosita Spencer-Churchill, Duchess of Marlborough", "Royal Navy", "Sarah Churchill (actress)", "Sir Winston Churchill", "Spencer (disambiguation)", "Spencer (surname)", "Spencer Baronets", "Spencer House, London", "Spencer baronets", "St Martin's Church, Bladon", "St Mary the Virgin Church, Great Brington", "Surname", "The Complete Peerage", "The Teares of the Muses", "Third Succession Act", "Thomas Gainsborough", "Thomas Grey, 2nd Marquess of Dorset", "United Kingdom", "Vanderbilt family", "Vice-Admiral", "Victor Spencer, 1st Viscount Churchill", "Victoria Aitken", "Viscount Althorp", "Viscount Churchill", "Viscount Teviot", "Wales", "Warwickshire", "Wedding of Charles, Prince of Wales, and Lady Diana Spencer", "Whig (British political faction)", "Will of Henry VIII", "William Cavendish, 5th Duke of Devonshire", "William Ewart Gladstone", "William Godolphin, Marquess of Blandford", "William Lamb, 2nd Viscount Melbourne", "William Spencer, 2nd Baron Spencer of Wormleighton", "William Spencer (Sheriff)", "William Spencer (poet)", "Winston Churchill", "Winston Churchill (1940–2010)", "Winston Churchill (Cavalier)", "Woodstock, Oxfordshire", "Wormleighton Manor", "Wychwood", "Yarnton"]}