{"url": "https://en.wikipedia.org/wiki/St_Mary%27s_Church,_Wreay", "title": "St Mary's Church, Wreay", "summary": "St Mary's Church, Wreay is the Church of England parish church of Wreay in Cumbria. It was designed by Sara Losh in about 1835 and built between 1840 and 1842. It is notable as the earliest known example in Britain of a revival of Lombard architecture. It is a Grade II* listed building.\n\nProminent in the churchyard are a mausoleum of Sara Losh's sister, Katharine, and a copy of the Bewcastle Cross.", "content": "St Mary's Church, Wreay is the Church of England parish church of Wreay in Cumbria. It was designed by Sara Losh in about 1835 and built between 1840 and 1842. It is notable as the earliest known example in Britain of a revival of Lombard architecture. It is a Grade II* listed building.\n\nProminent in the churchyard are a mausoleum of Sara Losh's sister, Katharine, and a copy of the Bewcastle Cross.\n\n\n== Style and inspiration ==\nSt Mary's replaces an earlier parish church in Wreay. Losh funded the new church on condition that she was allowed to choose the design. She intended her design to follow the style of Roman basilicas of the early Church. But its style is in fact Lombard, which was a 7th-and 8th-century successor to early Christian architecture and predecessor of Romanesque. Lombard is an Italian style, but the church also includes French features.In the 1830s the architectural fashion for new churches was shifting from Neoclassical to Gothic Revival, but Losh chose neither. By the 1830s Britain had a very small number of buildings designed in a revival of Norman architecture, which is a form of northern European Romanesque, but these do not seem to have been a direct influence on Losh either.\nLosh seems to have been inspired by architects in Berlin and Munich who had begun to revive Lombard architecture in the 1820s. She designed her church at the same time as Romanesque Revival architecture in the United Kingdom was pioneered by the architects TH Wyatt with the parish church at Wilton, Wiltshire and John Shaw Jr. with Christ Church, Watney Street in the East End of London, but she seems to have developed her ideas independently.\n\nLosh and her sister Katherine had been on the Grand Tour. Neither was married. Katherine died in 1835 and Sara dedicated the church to her. In the churchyard is a mausoleum in which is a life-size marble statue of Katherine Losh that was sculpted by David Dunbar based on a sketch supplied by Sara. Dunbar worked locally.\n\nLosh innovated liturgically as well as architecturally. She designed the chancel with a freestanding altar, allowing the priest to face his congregation as he presided at the Eucharist. In doing so she followed early Christian practice, and broke with the Anglican tradition of standing either at the north end of the altar or, in the High church Anglican tradition, facing east with one's back to the congregation. The practice became common in Anglican churches after the 1960s but was a radical departure in the 1840s.\n\n\n== Description ==\nThe church has a rectangular nave and a semicircular apsidal chancel. Dante Gabriel Rossetti admired Losh's works in Wreay and described St Mary's church as  \"extraordinary architectural works\" with \"a church of a byzantine style and other things ... full of beauty and imaginative detail, though extremely severe and simple\" and \"much more original than the things done by the young architects now.\"Losh decorated the church with many carved details both inside and out. Many are of plants or animals: birds, insects, flowers, foliage, corn ears, and a recurring motif of pine cones. A young local stonemason, William Hindson, carved the sculptures. A plaque in the church commemorates him.The style of the sculptures prefigures that of the Arts and Crafts movement of the 1890s and 1900s, which coincided with a small-scale revival of Byzantine Revival architecture. In the architecture and decorative arts of the early 1840s, St Mary's church at Wreay is pioneering and seems to be unique.\n\n\t\t\n\t\t\n\t\t\n\n\n== See also ==\n\nListed buildings in St Cuthbert Without\n\n\n== References ==\n\n\n== Bibliography ==\nBirkett, Elizabeth (August 2007). \"A Note on St Mary's Church at Wreay\" (PDF). The Journal. Lorton & Derwent Fells Local History Society (40): 16–17. Retrieved 3 September 2012.\nBullen, JB (November 2001). \"Sara Losh: Architect, Romantic, Mythologist\". The Burlington Magazine. 143 (1184): 676–684.\nPevsner, Nikolaus (1967). Cumberland and Westmorland. The Buildings of England. Harmondsworth: Penguin Books.\nUglow, Jenny (2012). The Pinecone: the Story of Sara Losh. London: Faber and Faber. ISBN 978-0571269501.\n\n\n== External links ==\n Media related to St Mary's, Wreay at Wikimedia Commons\n\nOfficial website", "links": ["Ancient Roman architecture", "Apse", "Arcade (architecture)", "Architect", "Arts and Crafts movement", "BBC Four", "Basilica", "Berlin", "Bewcastle Cross", "Byzantine Revival architecture", "Christian denomination", "Church of England", "Church of England parish church", "Consecration", "Cumbria", "Dante Gabriel Rossetti", "Diocese", "Diocese of Carlisle", "Early Christianity", "Ecclesiastical province", "Eucharist", "Faber and Faber", "Geographic coordinate system", "Gothic Revival architecture", "Grand Tour", "Great British Railway Journeys", "High church", "Historic England", "ISBN (identifier)", "J. B. Bullen", "Jenny Uglow", "John Shaw Jr.", "Listed building", "Listed buildings in St Cuthbert Without", "Lombard architecture", "Michael Portillo", "Munich", "National Heritage List for England", "Neoclassical architecture", "Nikolaus Pevsner", "Norman architecture", "Penguin Books", "Pevsner Architectural Guides", "Province of York", "Romanesque Revival architecture in the United Kingdom", "Romanesque architecture", "Sacred architecture", "Sara Losh", "The Burlington Magazine", "Thomas Henry Wyatt", "United Kingdom", "VIAF (identifier)", "Wilton, Wiltshire", "Wreay"]}