{"url": "https://en.wikipedia.org/wiki/St._Francis_Xavier_Church_(Winooski,_Vermont)", "title": "St. Francis Xavier Church (Winooski, Vermont)", "summary": "St. Francis Xavier Church is a Catholic church within the City of Winooski, Vermont in the United States. Built in 1870 within what was then known as a village within the township of Colchester, the parish church became one of the most visible landmarks in Chittenden County due to its unique double-spired design and proportional size comparative to its surrounding structures.  The Church was listed on the Vermont State Historic Register on November 22, 1993.", "content": "St. Francis Xavier Church is a Catholic church within the City of Winooski, Vermont in the United States. Built in 1870 within what was then known as a village within the township of Colchester, the parish church became one of the most visible landmarks in Chittenden County due to its unique double-spired design and proportional size comparative to its surrounding structures.  The Church was listed on the Vermont State Historic Register on November 22, 1993.\n\n\n== History ==\nAfter conducting a survey in the village of Winooski during the winter of 1867-68, Bishop Louis de Goesbriand initiated the parish of St. Francis Xavier to serve the population of some 800 French-Canadian Roman Catholics, or about 170 French-Canadian families. The first Mass took place within a rented hall in Winooski Block on March 22, 1868 during the fourth Sunday of Lent with two-hundred parishioners in attendance.\nOn May 13, 1869, ten acres of land for the church, rectory, and a cemetery was sold for $4,000 by a local merchant Francis LeClair to the Révérend Jean Frederick Audet (1842-1917), who was appointed as the pastor in 1868 and served in that capacity until his passing on December 28, 1917.  On July 11, 1869 a committee of parishioners was commissioned to raise funds for the church's construction.  Members from Winooski included Francis LeClair, Bruno Pepin, Pierre Allard, Pierre Desautels, Pierre Fontain, and Louis Berube.  Excavation for the building commenced on October 12, 1869.Construction of the church building began on May 1, 1870.  Francis LeClair (1818-1889) who had emigrated from Quebec in 1828 established two brick yards, a grocery store, and served two terms in the Vermont legislature, oversaw the construction of the church with another local merchant and eventual State Representative, Charles Lafountain.  LeClair provided the wood and bricks from his own brickyard for the project at a reduced price.  Masonry work was completed by parishioners Pierre Fontain and Pierre Villemaire.  The carpenter for the project was parishioner, G. Rouillard, who was assisted by workers paid at their regular wage.  For the cost of $1,500, the sacristy was constructed on the church property in September 1870.  The first Mass was celebrated in the church without a finished interior or a heating system on December 18, 1870.  During that month a portable harmonium organ was purchased for the church for $450.00.Bishop de Goesbriand made his first pastoral visit to the church on September 17, 1871 where he celebrated a Solemn High Mass, sang vespers, and conferred the sacrament of Confirmation upon 110 parishioners.  Historical accounts state that the Bishop had made it plain to parishioners that the church was intended only for those who understood and spoke the French language, as a majority of the local Catholic population of the day were French-Canadians.  In 1867, village records had stated that Winooski had a population of 1,745 which was composed of 855 French-Americans, 626 Yankees, and 264 Irish that lived within roughly 296 buildings along 32 streets.  During the time of its opening there were an estimated 700 parishioners of the Church.\n\nThe church's original towers consisted only of the first tier.  A buttressed second tier and copper-clad steeples were subsequently added to the towers by Joseph E. Lanoue of Burlington with the assistance of a carpenter, Louis Berube in 1882.  By September 1883, steeple construction had been completed.  A three-bell carillon was purchased in October 1885 for $930.00.  Blessed on November 22, and installed in the belfry on November 25, the bells were made by the McShane Foundry in Baltimore, Maryland and tuned in minor keys.  Following French custom, the bells were named.  The first bell, Jean Baptise weighed 2,260 lb (1,030 kg) and was tuned in the key of C.  The second bell, Saint Francis weighed 1,200 lb (540 kg) was tuned in the key of E.  The third named Saint Marie weighed 744 lb (337 kg) and was tuned to the key of G.  The bells were replaced with electronic chimes in 1978.In 1928, a 7 ft (2.13 m) bronze statue of Saint Francis Xavier weighing 1,700 lb (770 kg) was installed upon the niche on the front gable.  The interior of the church was renovated in 1942.  The entrance of the church was remodeled in 1964.  Modern hoods were installed over the three front doors, the brick walkways were replaced with pavement, and new steps were installed from St. Peter Street to the front entrance.  In September 1968, an additional wing (designed by Marcel Beaudoin and Walter Moulton) was constructed on the eastern side of the Church which hosted a baptismal font and served as a ground-level entrance for the elderly and disabled.\n\n\n=== The Church Organ ===\n\nIn December 1879, the harmonium was replaced with a pipe organ that was purchased for the church at the cost of $800.00 (the instrument was said to be worth $2,000).  In May 1948, the pipe organ was replaced with a new instrument for the sum of $15,615.  Gertrude Granger Picher the principal organist of St. Francis Xavier Church from 1930 to 1995 had helped facilitate the parish purchase of the prestigious Casavant pipe organ that is set in the choir loft.  The organ was officially dedicated to her in 1995 with a wall plaque installed in the church vestibule.\n\n\n=== The Interior ===\nConstruction of the church's interior began on December 11, 1872.  For the sum of $2,500, G. Rouillard installed the ceiling, pillars, and built a choir loft.The stained glass windows were created by Guido Nincheri of Montreal sometime between 1941-1948.  Nincheri also undertook replacing the interior church paintings.  Further improvements that occurred during this period included; the replacement of the pews within the sanctuary, the altar, pulpit, choir loft, communion rail, flooring, confessionals, and the sloping ceiling.  The chandeliers were replaced with indirect fluorescent lighting.  Recessed lighting was installed over the side aisles.  The majority of the carved oak interior woodwork was undertaken by local craftsman, Leopold Leclerc.\n\n\n=== The Rectory ===\nA small wooden rectory was built in 1870 and served as the dwelling for Father Audet.  The building was razed in 1876 and replaced with the current brick rectory that was constructed in 1887.  The rectory's architectural genre is considered to be largely influenced by French Second-Empire style which was popular during the day.  However, the use of casement windows is considered to be a typical construction method of the Québécois.\n\n\n== Architecture ==\nThe architect of the building, Rev. Joseph Michaud was known to have later contributed to the design of Cathedral Basilica of Mary Queen of the World (née St. James Cathedral) in Dominion Square in Montreal, and had also designed Co-Cathedral of Saint Joseph in Burlington, Vermont.\nThe building stands at a height of 55 ft. to the ceiling and is approximately 70 ft. wide by 130 ft. long (and 5 bays by 8 bays, respectively).\nAccording to an architectural report by the Vermont Division for Historic Preservation, the style of the church is a combination of Romanesque architecture and provincial French Gothic Revival features.  The report further describes the church's design;\n\n\"Fenestration is mostly stained glass lancet windows, with drip moulds.  Front gable has crucifix at apex, riche with corbelled drip molds containing bronze statue of St. Francis, rose window with radiating spokes immediately below. Central entrance has Gothic-arched opening with corbelled drip moulding, elaborate carved and glazed double doors, gabled brick entrance porch; flanking tower entrances are identical though smaller in scale, and with single doors.  Towers have large recessed panels on 1st tier, 4-gabled 2nd tier with corbelled frieze Gothic-arched louvres; copper spires have flying buttresses, flemish wall-dormer louvres, wrought iron open-work crosses on top.\"\n\n\n== Gallery ==\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== References ==\n\n\n== External links ==\nOfficial website St. Francis Xavier Church\nRoman Catholic Diocese of Burlington Official Site", "links": ["Architect", "Baltimore, Maryland", "Baptismal font", "Bernard Joseph Flanagan", "Building material", "Burlington, Vermont", "Buttress", "Carillon", "Casavant Frères", "Casement windows", "Cathedral of Saint Joseph (Burlington, Vermont)", "Cathedral of the Immaculate Conception (Burlington, Vermont)", "Catholic church", "Chittenden County, Vermont", "Choir (architecture)", "Christian denomination", "Christopher J. Coyne", "Church (building)", "Co-Cathedral of Saint Joseph (Burlington, Vermont)", "Colchester, Vermont", "College of St. Joseph", "Conversion of St. Paul Church", "Dedication", "Edward Francis Ryan", "Fenestration (architecture)", "Francis Xavier", "Francis of Assisi", "French Gothic architecture", "Geographic coordinate system", "Gothic Revival", "Groundbreaking", "Guido Nincheri", "Harmonium", "ISBN (identifier)", "John Aloysius Marshall", "John Stephen Michaud", "Joseph John Rice", "Kenneth Anthony Angell", "List of parishes in the Roman Catholic Diocese of Burlington", "Louis Edward Gelineau", "Louis de Goesbriand", "Mary, Queen of the World Cathedral", "Matthew Francis Brady", "Montreal", "Mount Saint Joseph Academy (Rutland, Vermont)", "Née", "Parish church", "Pastor", "Quebec", "Québécois people", "Rice Memorial High School", "Robert Francis Joyce", "Roman Catholic", "Roman Catholic Diocese of Burlington", "Romanesque architecture", "Sacred architecture", "Sacristy", "Saint Augustine Church, Montpelier", "Saint Francis Xavier", "Saint Michael's College", "Saint Monica's Church, Barre", "Salvatore Ronald Matano", "Second Empire architecture in Europe", "Solemn High Mass", "St. George's Catholic Church", "St. Mary Star of the Sea (Newport, Vermont)", "St. Peter's Church and Mount St. Joseph Convent Complex", "St. Thomas Church (Underhill, Vermont)", "Trinity College of Vermont", "United States", "Vicar", "Winooski, Vermont", "Winooski Block"]}