{
    "url": "https://en.wikipedia.org/wiki/Struthiola_striata",
    "title": "Struthiola striata",
    "summary": "Struthiola striata is a rounded, heather-like shrub of up to 1.5 m (4.9 ft) high that is assigned to the Thymelaeaceae family. It has small assending leaves on long straight branches, with cream, soft yellow or pinkish flowers in spikes, each of which consist of a tube of about 1 cm (0.39 in) long with 4 oval sepal lobes and 4 yellow alternating petal-like scales. It is sometimes called ribbed capespray or featherhead in English and roemenaggie, katstertjie or veërtjie in Afrikaans. It grows on coastal flats and foothills in the Western Cape province of South Africa.",
    "content": "Struthiola striata is a rounded, heather-like shrub of up to 1.5 m (4.9 ft) high that is assigned to the Thymelaeaceae family. It has small assending leaves on long straight branches, with cream, soft yellow or pinkish flowers in spikes, each of which consist of a tube of about 1 cm (0.39 in) long with 4 oval sepal lobes and 4 yellow alternating petal-like scales. It is sometimes called ribbed capespray or featherhead in English and roemenaggie, katstertjie or veërtjie in Afrikaans. It grows on coastal flats and foothills in the Western Cape province of South Africa.\n\n\n== Taxonomy ==\nThis species was first described as Struthiola striata by Jean-Baptiste Lamarck in 1792, based on a collection by the French gardener-botanist Joseph Martin in the Cape area (Cap B. Spei). Later botanists however, overlooked this name. Franz Wilibald Schmidt named the species S. sulcata in 1793, Henry Cranke Andrews in 1800 created the name S. imbricata, while Jens Wilken Hornemann assigned the name S. lateriflora to it in 1815. In 1843 Meissner distinguished two varieties, S. striata var. striata and S. striata  var. angustifolia. In 1857 he considered S. sulcata, S. imbricata and S. lateriflora synonyms of S. striata. Charles Henry Wright in 1915 in turn regarded S. striata var. angustifolia a synonym of S. striata.\n\n\n== Description ==\nRibbed capespray is a rounded shrub of up to 1.5 m (4.9 ft) high that emerges from a single trunk from the ground. The branches are initially covered in soft hairs pressed firmly to the surface, but become hairless when aging.\nThe leaves are in pairs opposing each other, more or less upright, overlapping each other, with the blade directly attached to the branche without a leaf stalk. They are oval to lance-shaped, 5–8.5 mm (0.20–0.33 in) long and generally 2–4 mm (0.079–0.157 in) wide, somewhat depressed along the main vein, almost pointed, with a row of hairs pressed to the surface along its rim. When the leaves are young 3 to 5 stripes are visible along the length of the outward facing surface.The flowers are seated in the axils of the leaves over a considerable length towards the tip of the branches, an inflorescence type called a spike. The two bracteoles are set opposite each other at the base of the flower, awl-shaped, about 2.5 mm (0.098 in) long, with a regular row of hairs along the margin and a blunt tip ending in a tuft of hairs. The calyx is cream-coloured, with at its base a cylindrical tube of about 1 cm (0.39 in) long that is covered on the outside with soft hairs pressed against its surface and at its top 4 oval protracted, almost pointy lobes of 1–2 mm (0.039–0.079 in) long and 1.5–2.5 mm (0.059–0.098 in) wide, hairless but for a tuft of hairs at the tips of the outer pair. Four yellow, elliptic, fleshy, petal-like scales are implanted above and alternating with the sepal lobes, and are surrounded by stiff hairs that may be shorter or longer than the scales. About 1 mm (0.039 in) below the mouth of the tube sits on whorl of four seated stamens, that have a reddish wart at their tips. The ovary is egg-shaped, hairless and about 1 mm long, and is topped by a style of about 8 mm (0.31 in) long and ends in a brush-like stigma.\n\n\n=== Differences with related species ===\nStruthiola has its flowers arranged in long spikes and each flower has 4 anthers, whereas Gnidia differs from it in having its flowers in short spikes, solitary or more often in heads, and the flowers have 8 or 10 anthers in 2 whorls. Both Lachnaea, Passerina and a few Gnidia-species lack scales on the calyx tubes. Both S. striata and S. tetralepis have four petal-like scales implanted at the opening of the calyx tube, while the many dozens of remaining Struthiola species have eight or twelve scales. S. striata is a roundish shrub of up to 1.5 m high with cream, soft yellow or pinkish flowers ending in oval sepal lobes of 1–2 mm long and 1.5–2.5 mm wide, and a reddish wart on the tip of the anthers, S. tetralepis is a single stemmed shrublet of up to 30 cm (0.98 ft) high that has initially greenish yellow, later brownish red flowers with lance-shaped sepal lobes of 2–3 mm (0.079–0.118 in) long and 0.5–1.0 mm (0.020–0.039 in) wide, and a white wart on the anthers.\n\n\n== Distribution, ecology and conservation ==\nStruthiola striata is restricted to coast of the Western Cape province of South Africa, between Yzerfontein in the north and Mossel Bay in the east. It occurs in a vegetation type called sand fynbos where it grows \non lower slopes and coastal sand flats. It is honey-scented at night and gets pollinated by moths. The continued survival of this species is considered to be of least concern because its populations are stable.\n\n\n== References ==",
    "links": [
        "Afrikaans",
        "Binomial nomenclature",
        "Bract",
        "Carl Daniel Friedrich Meissner",
        "Charles Henry Wright",
        "Doi (identifier)",
        "Encyclopedia of Life",
        "Eudicots",
        "Flowering plant",
        "Franz Wilibald Schmidt",
        "Global Biodiversity Information Facility",
        "Gnidia",
        "Henry Cranke Andrews",
        "INaturalist",
        "International Plant Names Index",
        "Jean-Baptiste Lamarck",
        "Jens Wilken Hornemann",
        "Joseph Martin (gardener)",
        "Lachnaea",
        "Leaf",
        "Least-concern species",
        "List of gardener-botanist explorers of the Enlightenment",
        "Malvales",
        "Mossel Bay",
        "National Center for Biotechnology Information",
        "Ovary (botany)",
        "Passerina",
        "Plant",
        "Plants of the World Online",
        "Raceme",
        "Rosids",
        "Sepal",
        "South African National Biodiversity Institute",
        "Stigma (botany)",
        "Struthiola",
        "Struthiola tetralepis",
        "Synonym (taxonomy)",
        "Taxonomy (biology)",
        "The Plant List",
        "Thymelaeaceae",
        "Tropicos",
        "Vascular plant",
        "Wikidata",
        "World Flora Online",
        "Yzerfontein"
    ]
}