{"url": "https://en.wikipedia.org/wiki/Survivor_(Tamil_TV_series)", "title": "Survivor (Tamil TV series)", "summary": "Survivor, also known as Survivor Tamil is an Indian adventure Tamil-language reality television program in India based on the Swedish format Expedition Robinson created in 1997 by Charlie Parsons. The show was produced by Banijay Asia, the program was broadcast on Zee Tamil and streamed on Zee5. The show was hosted by Arjun Sarja. he show features a group of celebrity and popular contestants, referred to as \"castaways\" as they are thrown in an isolated location. The castaways must provide food, water, fire, and shelter for themselves. The contestants compete in various challenges for rewards and immunity from elimination. The contestants are progressively eliminated from the game as they are voted off the island by their fellow castaways. The final vote off happens with the last 3 remaining castaways also known as the finalist, the castaway with the highest amount of jury votes out of the three finalist is awarded the title of \"Sole Survivor\" and the grand prize of ₹10,000,000.\nThe first season premiered on 12 September 2021.", "content": "Survivor, also known as Survivor Tamil is an Indian adventure Tamil-language reality television program in India based on the Swedish format Expedition Robinson created in 1997 by Charlie Parsons. The show was produced by Banijay Asia, the program was broadcast on Zee Tamil and streamed on Zee5. The show was hosted by Arjun Sarja. he show features a group of celebrity and popular contestants, referred to as \"castaways\" as they are thrown in an isolated location. The castaways must provide food, water, fire, and shelter for themselves. The contestants compete in various challenges for rewards and immunity from elimination. The contestants are progressively eliminated from the game as they are voted off the island by their fellow castaways. The final vote off happens with the last 3 remaining castaways also known as the finalist, the castaway with the highest amount of jury votes out of the three finalist is awarded the title of \"Sole Survivor\" and the grand prize of ₹10,000,000.\nThe first season premiered on 12 September 2021.\n\n\n== Format ==\nSurvivor Tamil is a reality show based on the original Swedish Expedition Robinson format developed by Charlie Parsons. Unlike the original Survivor, Survivor Tamil features only celebrity contestants. The contestants (known as \"Survivors\") live in a isolated island that is isolated from any type of modern-day setting. Survivors will be divided into two different tribes in the start of the competition known as the 'Launch Day'. Survivors will need to fight for immunity in order for their tribe to be safe from facing tribal council and elimination. Each week, the losing team will have to attend tribal council, where they will vote out one of their team members. Whoever receives the highest number of votes from their tribe will be eliminated from the game. The winner of the competition receives a ₹1 crore cash prize for avoiding elimination.\n\n\n=== Rules of the Island ===\nSurvivors will only be able to bring a limited amount of clothes to the island and won't be able to bring personal belongings with them. All the survivors are strictly told to speak in Tamil.\n\n\n=== Island ===\nThere will be two different islands for each tribe groups to stay at, and one separate island for where the tasks and tribal councils will take place at. \nSurvivors will need to create their own shelter such as tents in the island they are in, at the same time they will need to find ways to make food using limited amount of items on the island. Survivors will need to find a way to start up fire to cook their meals.\n\n\n=== Airing ===\nDaily episodes present the main tasks the survivors participate in such as 'immunity' or 'reward' challenges and focuses on the tribal councils held each week. The team losing the \"immunity challenge\" will have to sit in the tribal council, where the members of the team should vote for eliminating one weak person from their team.\n\n\n=== Vote Out ===\nSurvivors will gather in the tribal council every week to vote out a member from their own tribe out of the game. However, if one of the members win \"immunity,\" they will be safe for the week and can't be voted out of the game that week.\n\n\n=== Jury Votes ===\nAt the last tribal council, all the eliminated contestants who have been previously voted out will become jury members and will vote one of the member out of the last three remaining finalist to who they think should win the game and emerge as the \"sole survivor\". After the vote is counted, the finalist with the highest number of votes from the jury members will win the show.\n\n\n=== Broadcast ===\nSurvivor Tamil is aired on Zee Tamil. Everyday's episodes contain the main happenings which have been pre - recorded. Every day the makers release an episodes on the OTT app Zee5, the episodes are called Survivor Uncut which features two hours of content for an episode rather than the normal 40 minutes on television.\n\n\n== Season List ==\n  Female Winners\n  Male Winners\n\n\n== Production ==\n\n\n=== Locations ===\n\n\n== Seasons ==\nSeason 1\n\nThis first season, which is hosted by Arjun Sarja, was premiered on 12 September 2021 on Zee Tamil. The season was won by actress Vijayalakshmi Feroz while actor Saran Shakthi emerged as the runner up.\n\n\n== Controversies ==\nOn 6 October 2021, Lady Kash made a three-minute statement on YouTube, talking about the production team not giving enough care about the health of the contestants. Lady Kash had also said the team were making her go through inhumane acts and mental harassment. Kash also said the behaviours of the team members were inhumane and they were lacking humanity. Kash had exited the show on 28 September 2021 during the final days of the filming. She also stated that three participants in the show were tested for COVID-19, and the results came out positive; despite the test, filming still took place without any safety precautions.In Survivor (Tamil season 1), Saran Shakthi was accused and proven guilty of using a mobile phone from which he borrowed from a camera man in the island. However he was not disqualified from the show and still competed, causing the contestants to sense a gust of leniency in the air. He also accused fellow contestant Vijayalakshmi Feroz of using a mobile phone, but ended up being reprimanded by the host.\n\n\n== International broadcast ==\nThe series airs on the following channels outside of India:\n\nIn Singapore the series airs on Zee Singapore, with the series also being available on Zee5 SG.\n\n\n== Castaways pattern ==\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\nSurvivor Tamil at IMDb", "links": ["A. R. Rahman", "Abhinav Shukla", "Achcham Thavir", "Adventure", "Africa", "African Union", "Amzath Khan", "Arjun Sarja", "Australian Survivor", "Baltic Robinson", "Banijay", "Besant Ravi", "Bigg Boss (Tamil TV series)", "Bigg Boss Ultimate", "COVID-19", "Celebrity Camp", "Charlie Parsons", "Expedición Robinson: La Isla Vip", "Expedición Robinson (Argentine TV series)", "Expedición Robinson Ecuador", "Expedición Róbinson (Colombia)", "Expeditie Robinson", "Expedition Robinson", "Expedition Robinson (Switzerland)", "Expedition Robinson 2000 (Central Europe)", "Expedition Robinson 2005 (VIP)", "Extreme Azerbaijan", "GMiri", "Gayathri Reddy", "IMDb", "Immunity (reality television)", "India", "Indraja Shankar", "Inigo Prabhakaran", "Into the Shangri-La", "Jamnadas Majethia", "Koh-Lanta", "L'isola dei famosi", "Lady Kash", "Lakshmi Priyaa Chandramouli", "Last Hero", "Leniency", "Nandha Durairaj", "Narayan Lucky", "No Limite", "Ostrov (Slovak TV series)", "Payal Rohatgi", "Reality competition", "Reality television", "Robinson: La Gran Aventura", "Robinson (TV series)", "Robinson Ekspeditionen", "Robinsonekspedisjonen", "Robinsonův ostrov", "Samir Kochhar", "Sangram Singh", "Saran Shakthi", "Selviytyjät Suomi", "Singapore", "Srushti Dange", "Suomen Robinson", "Supraviețuitorul", "Survivor (American TV series)", "Survivor (British TV series)", "Survivor (GER TV series)", "Survivor (Israeli TV series)", "Survivor (Japanese TV series)", "Survivor (Tamil season 1)", "Survivor (franchise)", "Survivor Africa: Panama", "Survivor BG", "Survivor Croatia", "Survivor Greece", "Survivor India", "Survivor India (season 1)", "Survivor India – The Ultimate Battle", "Survivor México", "Survivor NZ", "Survivor Pakistan", "Survivor Philippines", "Survivor România", "Survivor Slovenija: Filipini", "Survivor South Africa", "Survivor Spain", "Survivor Srbija", "Survivor Tamil (season 1)", "Survivor Turkey", "Survivor Česko & Slovensko", "Survivor – A sziget", "Sweden", "Tamil language", "Tanzania", "Times Of India", "Umapathy Ramaiah", "Vanessa Cruez", "Vijayalakshmi Feroz", "Vikranth Santhosh", "Wyprawa Robinson", "Wyspa przetrwania: Fidżi", "YouTube", "ZEE5", "Zanzibar", "Zee5", "Zee Tamil"]}