{
    "url": "https://en.wikipedia.org/wiki/Synoicum_pulmonaria",
    "title": "Synoicum pulmonaria",
    "summary": "Synoicum pulmonaria, the tennis ball ascidian or sea-fig, is a species of colonial sea squirt, a tunicate in the family Polyclinidae. It occurs in shallow water in the northeastern Atlantic Ocean, the North Sea and the English Channel, and also, to a lesser extent, in the northwestern Atlantic Ocean.",
    "content": "Synoicum pulmonaria, the tennis ball ascidian or sea-fig, is a species of colonial sea squirt, a tunicate in the family Polyclinidae. It occurs in shallow water in the northeastern Atlantic Ocean, the North Sea and the English Channel, and also, to a lesser extent, in the northwestern Atlantic Ocean.\n\n\n== Description ==\nSynoicum pulmonaria is the largest colonial tunicate in the northeastern Atlantic. Young colonies are pear-shaped or club-shaped and are attached by a short stalk. Older colonies are more globular, up to 14 centimetres (6 in) in diameter, and formed by the agglomeration of a number of smaller colonies. The individual zooids are not easy to distinguish, but form groups of seven or eight around a common atrial syphon. The common tunic is tough and cartilaginous, yellowish-brown and transparent. It is usually encrusted with sand and shell fragments.\n\n\n== Distribution ==\nSynoicum pulmonaria is a coldwater species of sea squirt and is found in the northeastern Atlantic Ocean as far north as Svalbard and as far south as the English Channel and the coast of Normandy. It is most abundant in the central North Sea, on the Dogger Bank and the Fisher Bank, where it is usually found at depths between about 20 and 40 metres (66 and 131 ft). It is also present in the northwestern Atlantic Ocean, around the coasts of Greenland and Newfoundland, but is less common here than in the east, and occurs only at depths between 10 and 13 metres (33 and 43 ft). In the 21st century it seems to be becoming more abundant in Normandy on the lower foreshore, taking a tear-like form and somewhat resembling Polyclinum aurantium.\n\n\n== References ==",
    "links": [
        "Animal",
        "Aplousobranchia",
        "Ascidiacea",
        "Binomial nomenclature",
        "Catalogue of Life",
        "Chordate",
        "Colony (biology)",
        "Daniel Solander",
        "Dogger Bank",
        "English Channel",
        "European Nature Information System",
        "Family (biology)",
        "Fisher Bank",
        "Global Biodiversity Information Facility",
        "INaturalist",
        "Integrated Taxonomic Information System",
        "Interim Register of Marine and Nonmarine Genera",
        "John Ellis (naturalist)",
        "National Biodiversity Network",
        "Normandy",
        "North Sea",
        "Polyclinidae",
        "Polyclinum aurantium",
        "SeaLifeBase",
        "Species",
        "Svalbard",
        "Synoicum",
        "Synonym (taxonomy)",
        "Taxonomy (biology)",
        "Tunicate",
        "Wikidata",
        "World Register of Marine Species"
    ]
}