{
    "url": "https://en.wikipedia.org/wiki/T%27Kint_de_Roodenbeke",
    "title": "T'Kint de Roodenbeke",
    "summary": "t'Kint de Roodenbeke is a bourgeois and noble family from Belgium. They are the current owners of the Ooidonk Castle in the city of Deinze, East Flanders.",
    "content": "t'Kint de Roodenbeke is a bourgeois and noble family from Belgium. They are the current owners of the Ooidonk Castle in the city of Deinze, East Flanders.\n\n\n== History ==\nAt first the families of t'Kint and de Roodenbeke were separate families, both from the Brussels region and predominantly active in the textile industry of the eighteenth century.\nThe de Roodenbeke family was one of the Seven Noble Houses of Brussels, forming the patrician class of that city to whom special privileges in the government were granted until the end of the Ancien Régime. While not one of the original seven families, t'Kint was granted membership through the female lineage of de Roodenbeke marrying into the t'Kint family.\nSeveral members have been deans of guilds or have held public office as councilor or vice-mayor as members of the Brussels Nations, or alderman as a member of the Noble Houses. \nSome members were ennobled in the eighteenth century.\nThe first one carrying the combined name of t'Kint de Roodenbeke was Corneille, born in 1720 in Brussels. Today both names still exist separately, as well as combined.\n\n\n== Alliances ==\n\n\n== See also ==\nList of noble families in Belgium\nBourgeois of Brussels\nSeven Noble Houses of Brussels",
    "links": [
        "Ancien Régime",
        "Austrian Netherlands",
        "Baron",
        "Belgian nobility",
        "Belgium",
        "Bourgeois of Brussels",
        "Brussels",
        "Count",
        "Deinze",
        "East Flanders",
        "Ennoblement",
        "Guilds of Brussels",
        "Holy Roman Empire",
        "House of Roodenbeke",
        "Kasteel van Ooidonk",
        "Kingdom of Belgium",
        "List of Presidents of the Senate (Belgium)",
        "List of noble families in Belgium",
        "Ooidonk Castle",
        "Patrician (post-Roman Europe)",
        "Seven Noble Houses of Brussels",
        "Textile industry"
    ]
}