{"url": "https://en.wikipedia.org/wiki/Talpa_de_Allende", "title": "Talpa de Allende", "summary": "Talpa de Allende is a city and municipality in Jalisco, Mexico. Surrounded by pine-covered mountains, Talpa de Allende is a silver mining town founded by the Spanish in 1599. The name \"Allende\" is in honor of General Ignacio Allende.\nTalpa is the destination of a popular pilgrimage route. In the center of Talpa is the church of Nuestra Señora del Rosario, which is the location of the tiny Virgen del Rosario statue, also called \"La Chaparrita\", meaning the short one, who they believe does miracles. Her birthday is celebrated October 7, where millions of people walk to Talpa every year. Another date she is visited is during Easter Week. Approximately 3 million people attended to the celebrations of \"La Chaparrita\" yearly. The walk can be anywhere from a few kilometers to a hundred or more depending on the starting point. The most famous walk is the called \"Ruta del Peregrino\" (Pilgrim's Route). The Route is 117 km long, starting in the city of Ameca and ending in Nuestra Señora del Rosario church. It includes several climbs of hundreds of meters. During Easter week, there are stands selling food and drinks all along to route.", "content": "Talpa de Allende is a city and municipality in Jalisco, Mexico. Surrounded by pine-covered mountains, Talpa de Allende is a silver mining town founded by the Spanish in 1599. The name \"Allende\" is in honor of General Ignacio Allende.\nTalpa is the destination of a popular pilgrimage route. In the center of Talpa is the church of Nuestra Señora del Rosario, which is the location of the tiny Virgen del Rosario statue, also called \"La Chaparrita\", meaning the short one, who they believe does miracles. Her birthday is celebrated October 7, where millions of people walk to Talpa every year. Another date she is visited is during Easter Week. Approximately 3 million people attended to the celebrations of \"La Chaparrita\" yearly. The walk can be anywhere from a few kilometers to a hundred or more depending on the starting point. The most famous walk is the called \"Ruta del Peregrino\" (Pilgrim's Route). The Route is 117 km long, starting in the city of Ameca and ending in Nuestra Señora del Rosario church. It includes several climbs of hundreds of meters. During Easter week, there are stands selling food and drinks all along to route.\n\n\n== History ==\nIt was the capital of the Tlallipan (Tlalipan) cacicazgo. The site was inhabited by a tribe of origin Nahuatl. Towards 1532 Nuño de Guzmán he began to send explorers to these lands from the Holy Spirit Village of Greater Spain, today Tepic, Nayarit, and that was when the inhabitants were subject to the Spanish crown. When Nuño de Guzmán left Nueva Galicia, he divided the domains among his most striving captains Juan de Oñate Juan and Cristóbal de Oñate, Juan Fernández de Hijar, touching the latter Tlallipan. He entered the village peacefully towards 1540. At the arrival of the peninsulars, Talpa was in what is now known as the Bairro Alto, southeast of the current town.\nIn 1599, when Aranjuez's rich minerals were established, the first Spanish families settled. Thus, by a decree of the Real Audiencia of Guadalajara saw the first light the town that received the title of Santiago de Talpa. The Constitution of 1857 was not well received. Prominent conservative Remigio Tovar rose up in arms, joining the conservative party in the Reform War. He was defeated by general Juan Nepomuceno Rocha at Cerro de los Ocotes, in which Tovar's forces suffered 7 casualties. Talpa was a welcoming haven for influential politicians when Guadalajara fell to the conservatives. It was also a kind of headquarters of the government troops that entered and went without encountering any resistance, during this time when encounters and scuffles were staged between the two sides and of political instability, the arises in these directions the Colonel Antonio Rojas, who was commissioned to pacify the region and to fight Remigio Tovar, who had as its center of operations the square of Mascota. Rojas, for his pyromania instincts and his great cruelty soon received the nickname \"El Nero de Jalisco\".\nOn 1871 Porfirio Díaz proclaimed the Plan de la Noria and rose up against the government of Benito Juárez, being defeated by General Alatorre. After leaving Mexico City, he spent a few weeks in Talpa disguised as a bell smelter. During the Mexican Revolution the village was fortified from the attacks from supporters of Venustiano Carranza by forming a general meeting of neighbors and forming a local defense corps that guarded the square; but on June 23, 1913, chief carrancist Santos Arreola came to ask for surrender, but bad weather forced them to flee.\n1844 establishes town hall; 30 April 1871 a department is formed comprising the municipalities of Talpa and Tomatlán, with Talpa being the head. From 1825 to 1844 it belonged to the 6th canton of Autlán de Navarro. On 18 September 1885 by decree number 155 the village was elevated to the category of village under the name of Talpa de Allende in honor of the insurgent chief Ignatius Allende.\nIn 2015, the city was designated part of the \"Pueblos Mágicos\" national program.\n\n\n== Geography ==\nTalpa de Allende is located in the west of the state of Jalisco, within the extreme coordinates 20° 05′ 00″ at 20° 30′ 55″ of north latitude and of the 104° 42′ 30″ to the 105° 13′ 25″ west longitude; at a height of 1,134 meters above sea level.\nThe municipality adjoins to the north with the municipalities of Puerto Vallarta and Mascota; to the east with Mascota, Atenguillo, Cuautla and Tomatlán (Jalisco)' Tomatlán; to the south with the municipality of Tomatlán; to the west with the municipality of Cabo Corrientes.\n\n\n=== Physical Geography ===\n\n\n==== Orography ====\nIn general its surface is made up of rugged areas (77%) heights ranging from 2,100 to 2,500 meters above sea level. Semi-flat zones (13%) they are located in the south of the municipal headwaters, with heights ranging from 600 to 1,300 msnm. Flat areas (10%) located in the northwest of the municipal headland, are formed by heights of 1,200 meters above sea level.\n\n\n==== Soil ====\nThe territory consists of land from the tertiary period. The composition of the soils is predominantly chestnut Chesnut, as well as lateritic yellows, prainearose and reddish soil, and reddish forest brown. The municipality has a territorial area of 227,952 ha-hectares, of which 15,375 are used for agricultural purposes, 31,128 in livestock activity, 176,987 are for forest use, 283 are urban land and 2,078 hectares have other use, not specified 2,101. As far as the property is concerned, an area of 169,637 hectares is private and another is 56,214 ejidal; there is no communal property. Please note that 2,101 hectares do not specify property type.\n\n\n==== Hydrography ====\nIts hydrological resources are provided by the rivers: Talpa, San Nicolás, Cuals, San José and Bramador; by the streams: Crumbled, La Quebrada, Las Palomas, El Corazón, Toledo, Camacho, Gran Juez and Los Lobos, among the most representative. It also has springs that supply water to some localities.\n\n\n=== Climate ===\nTalpa de Allende has a humid subtropical climate, with dry winter and spring, and with no well-defined winter thermal change. The average annual temperature is 21.3 C, with a maximum of 29.5 C and a minimum of 13.2 -C. The rainfall regime is recorded between the months of June and July, with an average rainfall of 1,002.9 mm. The annual average of frost days is 27.5. The prevailing winds are in a southerly direction.\n\n\n=== Flora & Wildlife ===\nIts vegetation is basically composed of Pinus-pine, oyamel, roble (es), Fraxinus-fresno and walnut; in the semitropical lower parts there is havillo, capomo, parota, spring, purple rose and Spanish cedar. There is also a maple protected area; whose existence is originating in Canada and is only found in that country.\nIn the municipality is located a mesophilic forest with maple (Acer binzayedii). Binzayedii refers to the founding of Qatar MBZ which sponsored scientific research that determined that the species in Talpa is unique in the world, which makes this maple forest very special.\nOn January 30, 2016, the Government of the State of Jalisco through the Secretariat of Environment and Territorial Development announced the creation of a Natural Protected Area Arce Forest State Park published in Section V of the Official Newspaper The State of Jalisco. date\" - \"publication\" - \"Official\"- \"The\"-date-access-\" ('doi')\n\n\n== Government and politics ==\nIts form of government is democracy, it depends on the Jalisco state government and federal Mexico; elections are held every 3 years, where the municipal president and his cabinet are elected. The Municipal President is C. Martín Eduardo Guzmán Peña, Institutional Revolutionary Party PRI.\nThe municipality has 178 towns, the most important being: Talpa (municipal head), Ocotes, La Cuesta, Cabos, La Cañada, Desmoronado and El Cuale.\n\n\n== Infrastructure and economy ==\n\n\n=== Housing ===\nIt has 3,266 homes, which are usually private. The 89.71% have electricity service, 68.74% have drainage and drinking water service. Its construction is usually based on brick, concrete and partition.\n\n\n=== Services ===\nThe municipality has services of drinking water, sewerage, street lighting, markets, trail, cemeteries, road, public toilet, public safety, transit, parks, gardens and sports centers.\n79.4% of the population has drinking water; in sewer coverage is 71.5% and in electricity service 85.4%.\n\n\n=== Education ===\nThe population's 90.88%  is alpha-alphabetism-alfabeta, of which 29.56% has ended primary education. The municipality has 19 preschool, 43 primary-primary education, 10 secondarys and two bachilleratos.\n\n\n=== Healthcare ===\nHealth care is attended by the health center, which is advised by the Ministry of Health and depends on health jurisdiction No.8 based in Puerto Vallarta. In addition, the [Mexican Social Security Institute] and private doctors provide their services. The System for Integral Family Development (DIF) is responsible for social welfare.\n\n\n=== Transportation and communication ===\nIt has fax service, telegraph, telephone, radio, television, Internet and radio telephony service. Transportation takes place via the Guadalajara-Puerto Vallarta highway. It has a network of rural roads that connect the villages. Public buses are available. It has a small airport that has flights to Puerto Vallarta, San Sebastián del Oeste and Guadalajara. The main airlines that operate are: Aerotaxis de la Bahía and Transportes Aéreos de Nayarit.\n\n\n== Demographics ==\nAccording to the II population and housing count, the municipality has 13,612 inhabitants, of which 6,703 are men and 6,909 are women; 0.36% of the population are indigenous.  By 2010 the population is expected to be 4,786.\n\n\n=== Religion ===\n90.60% profess Catholic religion,7.36% are believers in [Jehovah's Witnesses], there are also Protestant and believers of other religions. 0.28% of the inhabitants held no religion.For religious worship it has the Basilica of Our Lady of the Rosary, the Parish of Lord San José and chapels in the localities.\n\n\n== Culture ==\nPainting stand out the mural \"The Miracle of the Renewal of the Image of the Virgin of the Rosary\" and the mural of the Holy Trinity.\nCraft: chicle handcrafts, with which they make baskets, furniture, pots, pots, jars, jars, vases, pots. Leather huaraches, belts and saddles are also made.\nTypical Costumes  charro costume for men and China for women.\n\n\n=== Sites of interest ===\nThe Shrine of the Virgen de Talpa: in style Romanesque Architecture and Neoclassical-Neoclassical Architecture, dates from 1782\nThe Parish of Lord San José: in colonial style, built in the year 1600.\nThe Chapel of the Ore of El Cuale: in colonial style, built in 1870.\nThe Chapel of Concepción del Bramador: in colonial style.\nThe Chapel of the Resurrection.\nSanctuary of Our Lady of the Rosary.\nThe municipal palace.\nThe waterfalls of Aranjuez.\n\n\n=== Places to visit ===\nWelcome arch dedicated to pilgrims and visitors in the entrance.\nCalzada de las Reynas: opened on November 18, 2004, and created for he community of pilgrims that visit Talpa de Allende and in honor of all the queens of Mexico. A pathway of statues of the virgins.\nCruz de Romero\nMuseum of the Talpa Virgin where her story is told as well as the history of Talpa de Allende.\nMaple forest of Talpa de Allende with more than 56,000 acres (23,000 ha) of maple and pine trees.\n\n\n=== Sports ===\nIt has sports centers, where it is practiced: football, frontenis and volleyball. It also has a cultural center, theater, charro canvas, square, parks, gardens and library.\n\n\n=== Gastronomy ===\nBirria, pozole, tamales, rotisserie chicken, rabbit, meat with tomatillo and chilaquiles; guava fruit leather, sancocho, figs, and various milk confectioneries; rompope and ponche of fruits such as peach, nance, capulín, pineapple, guava and pomegranate\n\n\n=== Holidays and celebrations ===\nVirgen de la Candelaria from 25 January to 2 February.\nRomería de Tecomán: first Sunday in March.\nRomería in honor of Lord St. Joseph: from 11 to 19 March.\nAnniversary pilgrimage of the Coronation of the Virgen del Rosario de Talpa: from 4 to 12 May.\nFeast of the Renewal:September 10 \"Bath of the Virgin\" (It consists of cleaning all the jewels and changing the clothes of Ntra.Sra.del Rosario de Talpa) and from September 11 to 19 the ninth Renewal.\nIndependence day: 15 and 16 September.\nLiturgical Party in Honor of Our Lady of the Rosary of Talpa: 7 October\nFeast of the Virgen de Guadalupe: 9–12 December\n\n\n== In popular culture ==\nIn Juan Rulfo novel, 'El llano en llamas' refers to Talpa: \"[...][...] Although I knew that Talpa was far away and that we would have to walk a lot under the sun of the days and the cold, of the nights of March [...] \".\nThe film \"Talpa\" was filmed here, based on a short story by Juan Rulfo, .\n\n\n== Notable people ==\nJosé María Cuéllar, governor of Jalisco.\nManuel Ceballos, professor.\nErnesto Ramo Meza, writer.\nJuan Valdéz Verdía, Doctor.\nDaniel Acosta Izquierdo, writer.\nJosé Francisco T. Agraz Gil, writer.\nManuel de San Martín, clergyman.\nBaudelio Bernal, doctor\nGustavo \"Halcón\" Peña Velazco, footballer\n\n\n== Sister City ==\nTalpa de Allende has one sister city.:\n - Lynwood, California, USA\n\n\n== References ==\n\n\n== External links ==\n(in Spanish) http://talpadeallende.com", "links": ["Acatic", "Acatlán de Juárez", "Administrative divisions of Mexico", "Agave Landscape and Ancient Industrial Facilities of Tequila", "Ahualulco de Mercado", "Alpha-alphabetism-alfabeta", "Amacueca", "Amatitán", "Ameca, Jalisco", "Antonio Escobedo", "Arandas, Jalisco", "Atemajac de Brizuela", "Atengo", "Atenguillo", "Atotonilco El Alto", "Atoyac, Jalisco", "Autlán", "Autlán de Navarro", "Ayotlán", "Ayutla, Jalisco", "Bachilleratos", "Barranca de Oblatos", "Benito Juárez", "Birria", "Bolaños Municipality", "Bosque Mesófilo Nevado de Colima State Park", "Brick", "Cabo Corrientes (municipality)", "Cabo Corrientes Municipality", "Cacicazgo", "California", "Casimiro Castillo", "Catholic religion", "Cañadas de Obregón", "Cedrela odorata", "Celsius", "Ceramics of Jalisco", "Chamela-Cuixmala Biosphere Reserve", "Chapala, Jalisco", "Charro", "Chilaquiles", "Chimaltitán", "Chiquilistlán", "Cihuatlán", "Coat of arms of Talpa de Allende", "Cocula, Jalisco", "Colotlán", "Concepción de Buenos Aires", "Concrete", "Congress of Jalisco", "Conservative Party (Mexico)", "Constitution of 1857", "Cristóbal de Oñate", "Cuautitlán de García Barragán", "Cuautla, Jalisco", "Cuenca Alimentadora del Distrito Nacional de Riego 043 Estado de Nayarit", "Cuquío", "Degollado", "Democracy", "Easter Week", "Economy of Jalisco", "Ejutla, Jalisco", "El Arenal, Jalisco", "El Grullo", "El Limón, Jalisco", "El Salto, Jalisco", "El Tuito", "El llano en llamas", "Encarnación de Díaz", "Etzatlán", "Federal Mexico", "Flag of Jalisco", "Fraxinus-fresno", "Governor of Jalisco", "Guachinango, Jalisco", "Guadalajara", "Guadalajara metropolitan area", "Gómez Farías Municipality, Jalisco", "Ha-hectares", "Handcrafts and folk art in Jalisco", "Hostotipaquillo", "Huejuquilla El Alto", "Huejúcar", "Humid subtropical climate", "Ignacio Allende", "Ignatius Allende", "Indigenous peoples", "Institutional Revolutionary Party PRI", "Ixtlahuacán de los Membrillos", "Ixtlahuacán del Río", "Jalisco", "Jalisco state government", "Jalostotitlán", "Jamay", "Jesús María, Jalisco", "Jilotlán de los Dolores", "Jocotepec", "Juan Nepomuceno Rocha", "Juan Rulfo", "Juan de Oñate Juan", "Juanacatlán", "Juchitlán", "La Barca Municipality", "La Huerta, Jalisco", "La Manzanilla de La Paz", "La Primavera Biosphere Reserve", "Lagos de Moreno", "Laguna de Sayula", "List of largest Jalisco cities by population", "Lynwood, California", "Magdalena Municipality, Jalisco", "Mascota", "Mazamitla", "Meters above sea level", "Metropolitan areas of Mexico", "Mexican Revolution", "Mexico", "Mexico City", "Mexticacan", "Mezquitic", "Millimeters", "Mixtlán", "Msnm", "Municipalities of Jalisco", "Nahuatl", "Nayarit", "Neoclassical-Neoclassical Architecture", "Nueva Galicia", "Nuño de Guzmán", "Oak", "Ocotlán, Jalisco", "Ocotlán metropolitan area", "Ojuelos de Jalisco", "Oyamel", "Pihuamo", "Pinus-pine", "Plan de la Noria", "Ponche", "Poncitlán", "Porfirio Díaz", "Pozole", "Preschool", "Primary-primary education", "Protestant", "Puerto Vallarta", "Puerto Vallarta metropolitan area", "Qatar", "Quitupan", "Real Audiencia of Guadalajara", "Reform War", "Remigio Tovar", "Romanesque Architecture", "Rompope", "San Cristóbal de la Barranca", "San Diego de Alejandría", "San Gabriel, Jalisco", "San Ignacio Cerro Gordo", "San Juan de los Lagos", "San Juanito de Escobedo", "San Julián, Jalisco", "San Marcos, Jalisco", "San Martín de Bolaños", "San Martín de Hidalgo", "San Miguel el Alto", "San Sebastián del Oeste", "San Sebastián del Sur", "Santa María de los Ángeles", "Santa María del Oro, Jalisco", "Sayula, Jalisco", "Secondary school", "Sierra de Manantlán Biosphere Reserve", "Sierra de Quila", "Tala, Jalisco", "Tamales", "Tamazula de Gordiano", "Tapalpa", "Tecalitlán", "Techaluta de Montenegro", "Tecolotlán", "Tenamaxtlán", "Teocaltiche", "Teocuitatlán de Corona", "Tepatitlán", "Tepic", "Tequila, Jalisco", "Tertiary period", "Teuchitlán", "Tizapan El Alto", "Tlajomulco de Zúñiga", "Tlaquepaque", "Tolimán, Jalisco", "Tomatlán", "Tomatlán (Jalisco)' Tomatlán", "Tonalá, Jalisco", "Tonaya", "Tonila", "Totatiche", "Tototlán", "Tuxcacuesco", "Tuxcueca", "Tuxpan, Jalisco", "United States", "Unión de San Antonio", "Unión de Tula", "Vallarta Botanical Gardens", "Valle de Guadalupe, Jalisco", "Valle de Juárez", "Venustiano Carranza", "Villa Corona", "Villa Guerrero, Jalisco", "Villa Hidalgo, Jalisco", "Villa Purificación", "Virgen de Guadalupe", "Virgen de Talpa", "Virgen de la Candelaria", "Volcán Nevado de Colima National Park", "Walnut", "Yahualica de González Gallo", "Zacoalco de Torres", "Zapopan", "Zapotiltic", "Zapotitlán de Vadillo", "Zapotlanejo", "Zapotlán del Rey", "Zapotlán el Grande"]}