{
    "url": "https://en.wikipedia.org/wiki/Tanmay_Shah",
    "title": "Tanmay Shah",
    "summary": "Tanmay Shah is a director, producer, writer, editor, cinematographer, script and screenwriter from Gujarat, India who is known for 52FilmsProject and his short documentary Pinch of Salt. He is the Founder and CEO of FridayFictionFilms.",
    "content": "Tanmay Shah is a director, producer, writer, editor, cinematographer, script and screenwriter from Gujarat, India who is known for 52FilmsProject and his short documentary Pinch of Salt. He is the Founder and CEO of FridayFictionFilms.\n\n\n== Early life ==\nShah was born in Ahmedabad. He is an information technology engineer academically. He has worked at Physical Research Laboratory as a project trainee and Indian Institute of Technology Bombay as a research associate. During his stay at Indian Institute of Technology Bombay, he was asked to write a story for a video game by a friend who had created it. The whole process of writing and being on the shoot inspired him to become a filmmaker. Soon after, he left his job at IIT Bombay and returned to Ahmedabad to make films.\n\n\n== 52FilmsProject ==\nIn 2015, Shah undertook a project of making 52 zero-budget short films in a year on various social issues. The issues ranged from Light Pollution, Parenting, Language Manipulation to Child Abuse, Lesbian Wedding and Global Terrorism. He made the first film of the project and released it on the YouTube channel of FridayFictionFilms on 2 January. He released one short film every Friday for the next 52 weeks. The procedure he had designed for the project was to write and shoot the film on Saturday-Sundays, re-shoot on Mondays, Edit on Tuesdays, re-edit on Wednesdays, make the music on Thursdays, and release it on Fridays. All the films were shot in Ahmedabad. 170 actors were part of the project out of which many of them were non-professionals. In 2016, Shah was awarded Limca Book of Records for making 52 zero budget short films in 52 weeks.\n He has given a TEDx talk at TEDxBITSHyderabad about 52FilmsProject.\n\n\n== Pinch of Salt ==\nIn 2016, he made a 12-minute short documentary film, in Gujarati language, based on the lives of 30,000 salt pan workers of Kutch, Gujarat. The short documentary talks about the plight of salt pan workers, how they are deprived of the most basic amenities and infrastructure and yet are thriving their cultural legacy of folk music. It has been screened at the international film festivals of Romania, Russia, USA, Canada, Germany, Spain, UK, and Serbia. It has won 12 awards at various International Film Festivals\n\n\n== Recognition ==\n\n\n== External links ==\nTanmay Shah at IMDb\n\n\n== References ==",
    "links": [
        "Ahmedabad",
        "Ahmedabad Mirror",
        "Bengaluru",
        "Daily News and Analysis",
        "Deccan Herald",
        "Gujarat",
        "IMDb",
        "India",
        "Indian Institute of Technology Bombay",
        "Kutch",
        "Limca Book of Records",
        "NavGujarat Samay",
        "Physical Research Laboratory",
        "TED (conference)",
        "TEDx",
        "The Indian Express",
        "The Times of India"
    ]
}