{"url": "https://en.wikipedia.org/wiki/Ted_McMinn", "title": "Ted McMinn", "summary": "Kevin Clifton \"Ted\" McMinn (born 28 September 1962) is a Scottish former association footballer who played as a winger. His nickname is The Tin Man.", "content": "Kevin Clifton \"Ted\" McMinn (born 28 September 1962) is a Scottish former association footballer who played as a winger. His nickname is The Tin Man.\n\n\n== Playing career ==\n\n\n=== Early years ===\nBorn in Castle Douglas and raised in nearby Dumfries, McMinn was alleged by The Scotsman to be called 'Teddy' at school because he ran as if he had a teddy bear tucked under his arm. In his autobiography McMinn stated it was because as a toddler he and his teddy bear were inseparable.McMinn started his playing career at Scottish junior side Glenafton Athletic in 1981. McMinn joined Glenafton from Dumfries High School FPs along with teammate Stewart Cochrane.\n\n\n=== Queen of the South ===\nMcMinn returned to south-west Scotland joining Dumfries club Queen of the South in 1982. At Queens he became a teammate of Cochrane's for the third time. The transfer fee was, \"£325 so that Glenafton could buy a new carpet for their club house and 1,000 Queens lottery tickets.\" When McMinn debuted in 1982–83 it was for a Queens team who had just been relegated after one season in the middle of Scottish football's three divisions – a season where Willie Harkness and his fellow directors had decided to run the club without a manager and select the team themselves. McMinn's debut was in the 1–1 draw versus Meadowbank Thistle on 6 November. McMinn remained with Queens until October 1984.McMinn returned to Palmerston Park under the new regime of Norman Blount to play for a Queen of the South select on 23 April 1995. The opposition in the 2–2 draw was Rangers in a game to mark Queens' 75th anniversary and the opening of the new stand. Other guests for Queens included Andy Thomson, Davie Irons and Rowan Alexander.When later interviewed for the club, Jimmy Robertson, Alan Davidson and George Cloy were among those McMinn named as the best players he played beside at Palmerston.\n\n\n=== Rangers ===\nGlasgow side Rangers, managed by Jock Wallace, signed him for £100,000. His style of wing play quickly made McMinn a fans favourite at Ibrox as per previous Rangers wingers such as Davie Wilson, Willie Henderson, Willie Johnston and Davie Cooper. McMinn was also noted for his performances against Rangers' rivals Celtic, playing in a number of Old Firm matches including the 1987 League Cup final win.McMinn's debut came as a substitute on Saturday, 13 October 1984 in a 2–0 win at St Mirren. In McMinn's full Rangers debut against Dumbarton at Boghead he scored direct from a corner kick.\nFormer teammate Derek Ferguson recalled, \"I'll never forget playing with Ted in a reserve game at Ibrox. He was running down the wing full speed and crossed the ball into the box. He just kept running so he had to jump over a wall into the Copland Road stand, carried on up the stairs then disappeared down the other side.\"Graeme Souness succeeded Jock Wallace as Rangers manager in April 1986. Souness went on to remark, \"How can I tell Ted McMinn what to do when he doesn't know what he's going to do?\" Rangers were Scottish Champions in 1986–87 for the first time in nine seasons. Under Souness McMinn had not played enough league games to qualify for a medal.\nMcMinn was involved in an incident outside an East Kilbride nightclub in the early hours of 5 December 1986. McMinn believes the incident led to his own removal from the club by his manager Graeme Souness. McMinn later said of his time at Rangers, \"Davie Cooper was my hero and we got on well.\" He added, \"I wasn't getting on with Souness. I was stepping out of line too often.\"\n\n\n=== Sevilla ===\nMcMinn joined Spanish club Sevilla on 1 August 1987, again signed by Jock Wallace. A Spanish journalist observed, \"With his inelegant Tin Man running style, erratic crossing and unquenchable zest for lager, he was the soul of football.He broke his leg three weeks after signing but he recovered to play 22 league games. Wallace's departure from the club unsettled McMinn. Despite public protests at his impending departure McMinn decided to return to the UK.\n\n\n=== Derby County ===\nMcMinn emulated fellow ex Queen of the South player Hughie Gallacher by joining Derby County. This was on 5 February 1988 for £300,000 where he also became a fans favourite. He arrived at the Baseball Ground in Derby's first season back in the First Division after a seven-year exile.Arthur Cox landed the flying winger and was rewarded with a series of outstanding performances from the Scotsman. McMinn's Derby debut came in a 2–1 defeat at Portsmouth the day after he signed. The home debut came in a 2–1 defeat by Manchester United in which he scored the best goal of his career. Along with Peter Shilton, Mark Wright and Dean Saunders the club finished fifth in 1989. With English clubs banned from Europe at the time McMinn missed out on a UEFA Cup place.In November 1989 – with McMinn on the verge of a call-up to the national side ahead of the 1990 FIFA World Cup – he was struck by a serious knee injury in an away game against Tottenham Hotspur. McMinn was out for 14 months.A lack of further investment from chairman Robert Maxwell led to a decline shortly after. The Rams were relegated at the end of the 1990–91 season (with McMinn making his return to the side in the January), just after Maxwell sold the club to new owner Lionel Pickering.McMinn was back to his best form in 1991–92 when he was named as the club's player of the year, having helped them to the playoff semi finals. They were knocked out by eventual winners Blackburn Rovers .He remained with the Rams for a further season, 1992–93, playing 19 league games and scoring twice as the Rams finished eighth – a major disappointment for a side who began the season as promotion favourites. He left on 28 July 1993 in a £115,000 move to Birmingham City.In November 2004 Igor Stimac was voted Derby County's all-time cult hero by BBC's Football Focus viewers. Stimac won with 59% of the vote, ahead of Ted McMinn who came second with 30%.\n\n\n=== Birmingham City ===\nTed McMinn had one season with Birmingham City signing on 28 July 1993.\n\n\n=== Burnley ===\nHe joined Burnley on 5 April 1994 for two years. Burnley were on a push for promotion that saw them achieve a play off place. McMinn played in the play off final 2–1 victory at Wembley against Stockport County before a crowd of 44,806.Despite only two seasons at Turf Moor McMinn came third in the BBC Football Focus Burnley cult heroes poll behind Jimmy McIlroy and Leighton James.\n\n\n=== Later playing career ===\nTed McMinn ended his playing career with Australian club ECU Joondalup and then Slough Town. At Slough Town during the 1996–97 season, although slowing down, he played a holding role, often restarting attacks which had broken down. He was revered by the die hards who would sing his nickname Tin Man, to the tune of Stingray. Being a humourist, Ted would have appreciated this. When questioned whether McMinn was a \"micky taker,\" teammate Mark Fiore replied sardonically \"yes.\" At the end of the season he retired due to arthritis of the knee.\n\n\n== Coaching career ==\nAs assistant to Mark Wright McMinn had a spell coaching at Southport.Wright left to manage his former club Oxford United in June 2001. McMinn went with him. Oxford had just been relegated to the fourth tier of English Football. After an unremarkable start to the season Wright parted with the club in December amid allegations of racial abuse against a match official. Again McMinn followed Wright out the door.\nMcMinn appeared again on 17 January 2002 when Wright soon took over at Conference strugglers Chester City. The club avoided relegation as the pair set about turning the club's fortunes around. McMinn then parted company with both Wright and Chester when he departed in July 2002.\n\n\n== Life after football ==\nIn 2004 McMinn became the match summariser for BBC Radio Derby, working alongside Ross Fletcher. In his three years with the station he attended all Derby County's matches.\nMcMinn contracted a mystery infection that led to most of his right foot being amputated. McMinn then opted to have more of his leg removed in a bid to gain more mobility and independence with a prosthetic limb. As a tribute to McMinn, on 1 May 2006, former players of both Derby County and Rangers contested a match at Derby County's Pride Park Stadium in which a record 33,475 spectators attended – around 10,000 of them being Rangers fans. McMinn said to the Scottish press that he had also received well wishes from Queen of the South fans. Terry Butcher recalled after the benefit game, \"Nigel Spackman said to the physio (at the match) he had a tight calf, Ted said 'So have I' and lifted his trouser leg up and there is just the metal stump there. It does make you think. You never know what can happen to you.\"To coincide with the benefit game McMinn embarked on a 300-mile sponsored bike ride from Glasgow to Derby to help raise money for the Derbyshire Royal Infirmary's limbs unit.He left Radio Derby after only the first game of the 2007–08 season, saying he felt \"let down\" and undervalued by the station following contract negotiations.\nIt was announced in the Derby Evening Telegraph on 13 February 2007 that McMinn has started up a courier and taxi business.\nThe Wisden Cricketer magazine reported that in 2011, McMinn was employed as full-time kit-man by Derbyshire County Cricket Club. His LinkedIn account states he left that role in 2013.\n\n\n== References ==\n\n\n== External links ==\nTed McMinn full career profile on the official Queen of the South website\nTed McMinn benefit match – Official Website\nBBC Derby news article – Tin Man recovers from foot operation\nBBC Derby news article – Ted faces second op\nSoccerbase player profile\nTed McMinn at Post War English & Scottish Football League A–Z Player's Database", "links": ["1990 FIFA World Cup", "1990–91 in English football", "1992–93 in English football", "2007–08 in English football", "Alan Davidson (Scottish footballer)", "Amputation", "Andy Thomson (Scottish footballer)", "Archie Gemmill", "BBC Radio Derby", "Baseball Ground", "Birmingham City F.C.", "Bobby Davison", "Boghead", "Burnley F.C.", "Castle Douglas", "Celtic F.C.", "Charlie George", "Chester City F.C.", "Chris Powell", "Chris Riggott", "Colin Todd", "Craig Bryson", "Craig Short", "Curtis Davies", "Danny Higginbotham", "Dave Langan", "Dave Mackay", "Davie Cooper", "Davie Irons", "Davie Wilson", "Dean Saunders", "Dean Yates", "Derby County F.C.", "Derby County F.C. Player of the Year", "Derby Evening Telegraph", "Derbyshire County Cricket Club", "Derbyshire Royal Infirmary", "Derek Ferguson", "Dumbarton F.C.", "Dumfries", "ECU Joondalup", "East Kilbride", "Fikayo Tomori", "Football Conference", "Football Focus", "Francesco Baiano", "George Cloy", "Georgi Kinkladze", "Geraint Williams", "Glasgow", "Glenafton Athletic F.C.", "Graeme Shinnie", "Graeme Souness", "Hughie Gallacher", "ISNI (identifier)", "Ibrox Stadium", "Igor Stimac", "Iñigo Idiakez", "Jacob Laursen", "Jimmy McIlroy", "Jimmy Robertson (footballer born 1955)", "Jock Wallace", "John Brayford", "John O'Hare", "Kevin Hector", "Leighton James", "Lionel Pickering", "Manchester United", "Marco Gabbiadini", "Mark Wright (footballer, born 1963)", "Mark Wright (footballer born 1963)", "Mart Poom", "Martin Taylor (footballer, born 1966)", "Matthew Clarke (footballer, born 1996)", "Matěj Vydra", "Meadowbank Thistle", "Michael Forsyth (footballer)", "Midfielder", "Nigel Spackman", "Norman Blount", "Old Firm", "Ordinal direction", "Oxford United F.C.", "Peter Daniel (footballer, born 1946)", "Peter Shilton", "Portsmouth F.C.", "Pride Park Stadium", "Queen of the South F.C.", "Rangers F.C.", "Richard Keogh", "Rob Hulse", "Robert Maxwell", "Roger Jones (footballer, born 1946)", "Ron Webster", "Ross Fletcher", "Ross MacLaren", "Rowan Alexander", "Roy McFarland", "Scott Carson", "Scottish League Cup", "Sevilla FC", "Shaun Barker", "Slough Town F.C.", "Southport F.C.", "St Mirren F.C.", "Steve Buckley (footballer)", "Steve Cherry", "Steve Howard", "Steve Powell", "Stewart Cochrane", "Stockport County F.C", "Terry Butcher", "The Scotsman", "Tommy Smith (footballer, born 1980)", "Turf Moor", "UEFA Cup", "VIAF (identifier)", "Wembley Stadium (1923)", "Will Hughes", "Willie Henderson", "Willie Johnston", "Youl Mawéné"]}