{"url": "https://en.wikipedia.org/wiki/Tenderness_(novel)", "title": "Tenderness (novel)", "summary": "Tenderness is a 1997 novel written by Robert Cormier. It is the basis for John Polson's 2009 film, Tenderness.", "content": "Tenderness is a 1997 novel written by Robert Cormier. It is the basis for John Polson's 2009 film, Tenderness.\n\n\n== Plot ==\nEric Poole is a convicted teenage serial killer. Lorelei \"Lori\" Cranston is a troubled 15-year-old girl.\nAs a little boy in New England, Eric Poole already exhibited symptoms of a sociopath. He was suspected of murdering several young girls, but also murdered his mother and stepfather, and was convicted for those deaths. He convinced investigators that he killed his guardians out of self-defense with a false story of abuse.\nLori is described as a beautiful girl with a very mature body at a young age. Consequently, she must constantly deal with the wanted and unwanted sexual attention she receives from men. She has a tendency to fixate on men, and will pursue them until she has put her mouth on theirs.\nDetective Jake Proctor always suspected that Eric was guilty of killing the other girls and that he had fabricated his abuse story. He is determined to prove that Eric is a serial killer.\nAt 18, Eric is released from the juvenile detention center and immediately starts looking for a new victim. Lori sees him on TV, fixates on him, and runs away from home to find him. During this time, Detective Proctor begins setting a trap to catch Eric before he can kill again.\n\n\n== Supporting characters ==\nLieutenant Jake Proctor\nRetired cop, now a detective. Proctor labeled Eric a psychopath and a monster incapable of feeling. Proctor doubts Eric's accusations of abuse and strongly suspects Eric of having committed at least two other murders. The two seem to like each other but are ultimately at cross purposes. Proctor takes Eric's case personally, as 20 years before he let another young man, who resembles Eric and also suspected of murder, go free when he had equally strong doubts. Now Proctor is determined to prove Eric’s guilt and put and bring him to justice, this time as an adult. Proctor hopes this will put an end to his nightmares of murder victims denied justice that keep him up at night.\nAunt Phoebe \nA well-dressed, never married, and attractive woman, Eric's aunt is also the owner of the parrot murdered at Eric’s hands. She offers Eric a place to stay once he is released from the facility.\nMaria Valdez\nThe beautiful dark-haired, dark-eyed Hispanic girl who fits the usual look of Eric's victims. She gives Eric her number while in the facility and later meets him at the state fair. She is revealed to be working with police.\nJimmy \nThe young cop who helps Proctor catch Eric in the act, whether real or framed.\nSonny Boy \nSweet Lefty's torturer and resident bully at the facility.\nSweet Lefty\nAn easygoing and usually well-liked inmate who is bullied by other inmates but \"rescued\" by Eric.\nRoss Packer \nA young reporter at the Wickburg Telegram who writes the Ms. Anonymous piece on Lori that Eric later reads.\nGary \nOne of the nicer men that Lori's mom has dated. Gary also feels attracted to Lori.\nDexter \nAn ex of Lori's mother who beat her, giving her a black eye and then fled soon afterward.\nMr. Clayton \nThe driver of the van who picks up Lori when she hitchhikes and succumbs to her seductions. Lori steals his wallet and decides to mail it back to him, but she never does because it is later stolen from her.\nPhyllis Kendall \nA beautiful old woman with white hair who is also the caretaker and mentor at the teen pregnancy center, Harmony House.\nMrs. Hornsby \nAn out of place cook at the teen pregnancy center, Harmony House.\nDebbie \nAn exceptionally big pregnant teen at Harmony House.\nChantelle \nAnother very pregnant teen girl.\nTiffany \nA frail tiny girl who is also Lori's rival, she tries to frame her for theft at Harmony House.\nRory \nLeader of a gang.\nCrystal \nA plump girl who is a member of the gang, later becomes pregnant, and attends Harmony House teen pregnancy center\nBantam \nA skinny little kid who wants to act tough and is also part of the gang\n\n\n== Reception ==\nIn 1998, the American Library Association named Tenderness one of the top ten Best Books for Young Adults to be published that year.\n\n\n== References ==", "links": ["ALA Best Fiction for Young Adults", "A Little Raw on Monday Mornings", "After the First Death", "American Library Association", "Antisocial personality disorder", "Beyond the Chocolate War", "Black eye", "Dell Publishing", "English language", "Fade (novel)", "Frame-up", "Heroes (novel)", "Hitchhiking", "ISBN (identifier)", "I Am the Cheese", "In the Middle of the Night (novel)", "John Polson", "Now and At the Hour", "Other Bells for Us to Ring", "Psychopath", "Robert Cormier", "Serial killer", "Sydney Morning Herald", "Take Me Where the Good Times Are", "Tenderness (2009 film)", "The Bumblebee Flies Anyway (novel)", "The Chocolate War", "The New York Times", "The Rag and Bone Shop", "Tunes for Bears to Dance To", "United States", "We All Fall Down (Cormier novel)", "Young adult novel"]}