{
    "url": "https://en.wikipedia.org/wiki/The_Lilac_Time",
    "title": "The Lilac Time",
    "summary": "The Lilac Time is a British alternative folk-rock band, originally formed in Herefordshire, England by Stephen Duffy, his brother Nick Duffy and their friend Michael Weston in 1986. The band's name was taken from a line in the Nick Drake song \"River Man\".\nThe Lilac Time has gone through various line-up changes, with the Duffy brothers as mainstays. The band's activity has intertwined with Stephen Duffy's solo and songwriting career.",
    "content": "The Lilac Time is a British alternative folk-rock band, originally formed in Herefordshire, England by Stephen Duffy, his brother Nick Duffy and their friend Michael Weston in 1986. The band's name was taken from a line in the Nick Drake song \"River Man\".\nThe Lilac Time has gone through various line-up changes, with the Duffy brothers as mainstays. The band's activity has intertwined with Stephen Duffy's solo and songwriting career.\n\n\n== History ==\nThe Duffy brothers and Michael Weston recorded music that was first released on Swordfish Records in 1987 and later became the band's self-titled debut. Michael Giri and Fraser Kent joined when the band went on tour. The group signed to Fontana, which reissued the band's first album in remixed form in 1988. The group went on to release the albums Paradise Circus in 1989, and & Love for All in 1990, the latter produced by Andy Partridge and John Leckie.The Lilac Time was dropped by Fontana then briefly signed to Creation Records, where the band was subsequently managed by label head Alan McGee. The band's sole release on Creation was Astronauts, in 1990. The Duffy's cousin, noted session musician Cara Tivey, contributed organ and piano to the album.\nThe band later regrouped with Claire Worrall and Melvin Duffy (no relation to the brothers) and recorded Looking For A Day In The Night with producer Stephen Street for spinART Records in 1999. They then released Lilac 6 on Cooking Vinyl in 2001, followed by Keep Going, released in 2003 under the name \"Stephen Duffy and the Lilac Time\" on Folk Modern.\nRunout Groove was released on 22 October 2007 on Bogus Frontage. The band played the 2007 Green Man Festival and the Queen Elizabeth Hall as a six-piece. The band's gig at the Green Man Festival serves as the backdrop to the film \"Memory & Desire — 30 Years in the Wilderness With Stephen Duffy & The Lilac Time.\" The documentary was filmed over six years by Douglas Arrowsmith and included new and vintage Lilac footage. The film is accompanied by a Universal Records album of the same name, which compiles songs from Duffy's thirty years making music. The Queen Elizabeth Hall concert is to be released as a live recording.\nNo Sad Songs was released on Tapete Records in April 2015.\nA new Lilac Time album, Return to Us, was released in October 2019.\nThe band is now based in Cornwall.\n\n\n== Discography ==\n\n\n=== Studio albums ===\nThe Lilac Time (1987)\nParadise Circus (1989)\n& Love for All (1990)\nAstronauts (1991)\nLooking for a Day in the Night (1999)\nlilac6 (2001)\nKeep Going (2003) (as Stephen Duffy & The Lilac Time)\nRunout Groove (2007) (as Stephen Duffy & The Lilac Time)\nSapphire Stylus (2009) (as Nick Duffy & The Lilac Time)\nNo Sad Songs (2015)\nReturn to Us (2019)\n\n\n=== Compilation albums ===\nCompendium - The Fontana Trinity (2001)\nMemory & Desire - 30 Years In The Wilderness (2009) (as Stephen Duffy & The Lilac Time)\n\n\n=== Tribute album ===\nOne Day One Of These Fans Will Change Your Life (2006) - various artists covering Lilac Time songs\n\n\n== Singles ==\n\n\n== References ==\n\n\n== External links ==\nLilac Time Official Site\nNick Duffy Official Site\nComprehensive discography, gallery, publications, biography, chronology",
    "links": [
        "& Love for All",
        "Alan McGee",
        "Alternative rock",
        "Andy Partridge",
        "Billboard Hot 100",
        "Cara Tivey",
        "Colin Larkin (writer)",
        "Columbia Records",
        "Cooking Vinyl",
        "Cornwall",
        "Creation Records",
        "Encyclopedia of Popular Music",
        "Folk rock",
        "Fontana Records",
        "Green Man Festival",
        "Guinness Publishing",
        "Herefordshire",
        "ISBN (identifier)",
        "ISNI (identifier)",
        "Jangle pop",
        "John Leckie",
        "MBA (identifier)",
        "Mainstream Rock Tracks chart",
        "Mercury Records",
        "Modern Rock Tracks chart",
        "Nick Drake",
        "Nick Duffy",
        "Paradise Circus (album)",
        "Queen Elizabeth Hall",
        "SpinART Records",
        "Stephen Duffy",
        "Stephen Street",
        "Tapete Records",
        "The Lilac Time (Pelle Carlberg album)",
        "The Lilac Time (The Lilac Time album)",
        "The Lilac Time (album)",
        "UK Singles Chart",
        "Universal Records",
        "VIAF (identifier)"
    ]
}