{
    "url": "https://en.wikipedia.org/wiki/The_House_Without_a_Christmas_Tree",
    "title": "The House Without a Christmas Tree",
    "summary": "The House Without a Christmas Tree is a 1972 television movie, novelized into a children's book by Gail Rock in 1974, that centers on the relationship between Adelaide \"Addie\" Mills (Lisa Lucas), a bright and energetic only child, and her melancholy father, James Addison Mills III (Jason Robards). James had never recovered from the death of his wife Helen (Addie's mother), and is bitterly against ever having a Christmas tree in the house. The videotaped production was seen regularly on CBS during the holiday season between 1972 and 1977.",
    "content": "The House Without a Christmas Tree is a 1972 television movie, novelized into a children's book by Gail Rock in 1974, that centers on the relationship between Adelaide \"Addie\" Mills (Lisa Lucas), a bright and energetic only child, and her melancholy father, James Addison Mills III (Jason Robards). James had never recovered from the death of his wife Helen (Addie's mother), and is bitterly against ever having a Christmas tree in the house. The videotaped production was seen regularly on CBS during the holiday season between 1972 and 1977.\n\n\n== Plot synopsis ==\nIn fictional Clear River, Nebraska in 1946, 10-year-old Addie Mills is a lonely child behind her large horn-rimmed glasses, living in a plain, ordinary house with her widowed father James and her loving paternal grandmother.\nHer mother had died from pneumonia  a few months  after she was born, and her embittered father wonders why his beloved wife had to die rather than their tiny and sickly baby. Her first name is taken from her father's middle name, but his only interaction with Addie seems to be in frequent corrections of her. There has never been a Christmas tree in the Mills home since his wife's death, although Addie constantly challenges this omission.\nFinally, Addie wins her class Christmas tree in a school contest — won using a guessing technique learned from her father — and brings it home for her first Christmas with a tree. James angrily orders the tree to be removed. His mother speaks up, reminding him that the house belongs to her; he responds by threatening to take Addie and clear out, leaving her alone in the house. Late that night, Addie sneaks out, removes the tree and delivers it to Gloria Cott, the only other member of her class who also goes treeless at Christmas (and who lost to Addie in the contest) because the Cott family is too poor to afford one, they would be thrilled to finally have a tree.\nThe next morning, while delivering some cookies his mother had baked to the Cott home, James sees the tree, and recognizes it as the tree his daughter had brought home - and that he had ordered removed. James, realizing just how selfish and unkind he has been towards his daughter, rethinks his position. That afternoon, James comes home with a tree and several boxes of ornaments — except a star. James goes up to the attic and brings down just such a star as he had not brought home, much more magnificently-made than the one Addie had created for her prize tree, out of tinfoil carefully saved and collected back in his day, such as from chewing-gum wrappers. As Addie admires the star, her father reveals that her mother had crafted it especially for her much-longed-for baby's first Christmas. Then he lifts Addie up, enabling her to place her star on the tree.\nFinally, it seems that the father-daughter relationship is blossoming. An adult Addie narrates over the final scene; over the ensuing years, her grandmother dies, and she moves away to the big city, but Addie returns to Clear River each year to spend Christmas with her father, who always has a Christmas tree waiting, upon which to place the beloved star.\n\n\n== Characters ==\nAddie Mills (Lisa Lucas)\nJames Addison Mills III, Addie's father (Jason Robards)\nSarah Mills, Addie's grandmother (Mildred Natwick)\nMiss Peggy Thompson, Addie's schoolteacher  (Kathryn Walker)\nCarla Mae Carter, Addie's best friend  (Alexa Kenin)\nThe Narrator/adult Addie Mills (Patricia Hamilton, who was not credited)\nBilly Wild, Addie's classmate (Brady McNamara)\nGloria Cott, Girl who couldn’t afford Christmas tree (Gail Dusome)\n\n\n== Production ==\nOriginally shown on CBS on December 3, 1972, this movie was actually a very low-budget film produced on videotape instead of 35mm film. John J. O'Connor, the television critic for The New York Times, highly praised the program. In his review, O'Connor observed that \"what could have been cloyingly sticky was kept, in an unusually sensitive script by Eleanor Perry, gently perceptive. For one thing, the characterization of Addie did not fall into the Sunnybrook Farm mold typical of most little girls on TV. This one, wearing glasses, made no apologies for being a precocious Miss Know‐It‐All. For another, Paul Bogart's direction was intelligent, helped considerably by fine performances from Jason Robards as the father, Lisa Lucas as Addie and, especially, Mildred Natwick as the grandmother.\" He summed up his critique by saying \"CBS would seem to have another Christmas  perennial on its hands.\" (The New York Times article \"TV: 'Tis The Season for Family Entertainment\" by John J. O'Connor - December 6, 1972, p. 95). As a result of its critical acclaim and high ratings, the program was repeated several times in the 1970s, on CBS, during the holiday season. The following year, a sequel was presented over the CBS Television Network on November 18, 1973. The special, entitled The Thanksgiving Treasure featured essentially the same cast with the exception of guest star Barnard Hughes, as James Mills's nemesis Walter Renquist, and Frannie Michel who replaced Alexa Kenin as Addie's best friend.\nOnce again, John J. O'Connor of The New York Times was quite impressed with the program. In his review, he wrote \"this time around, Addie took her classroom Thanksgiving lesson seriously enough to attempt friendship with one of her father's old enemies, an elderly misanthrope living as a recluse on a nearby farm. After a slow beginning, dawdling too long around school scenes, the hour settled effectively and touchingly on the central relationship of the story. Again, the acting — particularly by the remarkable Miss Lucas — was fine, the photography excellent and the graphics, used as 'bridges' between scenes, were superb.\" (The New York Times article - \"TV: The Holiday Menu\" by John J. O'Connor - November 23, 1973, p. 72). It, too, was rebroadcast a few times during the 1970s. After that, two more sequels were produced - The Easter Promise, presented on March 29, 1975 over the CBS Television Network featured guest star Jean Simmons and Addie and The King of Hearts broadcast on CBS on February 25, 1976, in which the guest stars were Diane Ladd and Richard Hatch. By this time, however, the annual series had run its course and no further installments were produced.  In 1991, The House Without A Christmas Tree was released on VHS, and then on DVD in 2007.Each act of the story featured collages that opened and closed it between commercial breaks. The collage artist who assembled these for the story, Norman Sunshine, won an Emmy Award for them. He later assembled other collages for The Thanksgiving Treasure.The House Without a Christmas Tree was filmed in Uxbridge, Ontario, mainly at the corner of Peel Street and Victoria Drive, where the house and school still exist. They also shot near the downtown core at Church and Brock Street West.\n\n\n== Awards ==\nEleanor Perry won a prime time Emmy for \"Outstanding Writing Achievement in Drama - Adaptation\", and Paul Bogart was nominated for a Director's Guild Award.\n\n\n== Legacy ==\nThe Christmas show was so successful, it resulted in three other specials with the same cast, all likewise based on books that Gail Rock had written. In all of them, Lisa Lucas appeared as Addie Mills.\n\nThe Thanksgiving Treasure, a Thanksgiving Day special transmitted on November 18, 1973. (On its VHS release, it was retitled The Holiday Treasure.) Patricia Hamilton, providing the voice of the older Addie Mills, narrated this special; she had not been credited in The House Without a Christmas Tree, she was credited here.\nThe Easter Promise, an Easter special transmitted on March 26, 1975.\nAddie and the King of Hearts, a Valentine's Day special transmitted on February 25, 1976.All but the last of these were highly rated and were later released on VHS. However, only The House Without a Christmas Tree was known to have been made available on DVD as of late October 2012. The original Christmas special is often recommended on a variety of lists, for both holiday viewing and such other themes as about single parents.On November 4, 2014, the DVD Holiday Family Classics: The Thanksgiving Treasure / The House Without A Christmas Tree was released by Paramount. The release was credited as a two film collection but featured both programs on one DVD (Region 1 only). Soon after, there was another \"Holiday Family Classics\" DVD released by Paramount which included both The Easter Promise and  Addie and the King of Hearts.\n\n\n== Adaptation ==\nHouston Grand Opera commissioned an adaptation from composer Ricky Ian Gordon and librettist Royce Vavrek. The opera premiered on November 30, 2017.\n\n\n== See also ==\nList of Christmas films\n\n\n== References ==\n\n\n== External links ==\nThe House Without a Christmas Tree at IMDb\nNew York Times Review: A House Without a Christmas Tree\nThe House Without a Christmas Tree TV and Movie Review from Goodreads.com\nA House Without a Christmas Tree at Yahoo Movies\nThe Addie Mills Page",
    "links": [
        "Ages of Man (film)",
        "Alan Shayne",
        "Alexa Kenin",
        "Allegheny Times",
        "An Enemy of the People (1966 film)",
        "Arthur B. Rubinstein",
        "Barnard Hughes",
        "Broadway Bound (film)",
        "CBS",
        "CBS Television Network",
        "Cancel My Reservation",
        "Carousel (1967 film)",
        "Class of '44",
        "Daily Breeze",
        "Diane Ladd",
        "Double Solitaire (film)",
        "Ed J. Brennan",
        "Eleanor Perry",
        "Emmy Award",
        "Evening Primrose (musical)",
        "Fun and Games (film)",
        "Gail Rock",
        "Halls of Anger",
        "Hansel and Gretel (1958 TV special)",
        "Houston Grand Opera",
        "IMDb",
        "In Search of America",
        "Jason Robards",
        "Jean Simmons",
        "John J. O'Connor (journalist)",
        "Johnny Belinda (1967 film)",
        "Kathryn Walker",
        "Kiss Me Kate (1968 film)",
        "Lisa Lucas",
        "List of Christmas films",
        "Look Homeward, Angel (film)",
        "Mark Twain Tonight!",
        "Marlowe (1969 film)",
        "Mildred Natwick",
        "Monaural",
        "Mr. Ricco",
        "Nebraska",
        "Nutcracker: Money, Madness and Murder",
        "Oh, God! You Devil",
        "Patricia Hamilton",
        "Paul Bogart",
        "Pinocchio (1957 TV program)",
        "Richard Hatch (actor)",
        "Ricky Ian Gordon",
        "Royce Vavrek",
        "Skin Game",
        "Spartanburg Herald-Journal",
        "Television movie",
        "Tell Me Where It Hurts (film)",
        "Ten Little Indians (1959 film)",
        "The Canterville Ghost (1986 film)",
        "The Citadel (1960 film)",
        "The Country Girl (1974 film)",
        "The Easter Promise",
        "The Final War of Olly Winter",
        "The Gift of Love (1994 film)",
        "The Heidi Chronicles (film)",
        "The Last Mile (1992 film)",
        "The New York Times",
        "The Owl and the Pussycat (1975 film)",
        "The Thanksgiving Treasure",
        "The Three Sisters (1966 film)",
        "The Trap of Solid Gold",
        "The War Widow",
        "Torch Song Trilogy (film)",
        "Tulsa World",
        "Uxbridge, Ontario",
        "Videotape",
        "Winner Take All (1975 film)",
        "You Can't Take It with You (1979 film)"
    ]
}