{
    "url": "https://en.wikipedia.org/wiki/The_Palace_of_the_Arabian_Nights",
    "title": "The Palace of the Arabian Nights",
    "summary": "The Palace of the Arabian Nights (French: Le Palais des mille et une nuits) is a 1905 silent fantasy film directed by Georges Méliès. The film, inspired by the One Thousand and One Nights, follows the adventures of a prince whose bravery and devotion are tested in a magical quest to win the hand of his beloved.",
    "content": "The Palace of the Arabian Nights (French: Le Palais des mille et une nuits) is a 1905 silent fantasy film directed by Georges Méliès. The film, inspired by the One Thousand and One Nights, follows the adventures of a prince whose bravery and devotion are tested in a magical quest to win the hand of his beloved.\n\n\n== Plot ==\nIn a mythical Arabian kingdom, the noble but penniless Prince Sourire (French for \"smile\") loves the beautiful Princess Indigo, and asks his father, a mighty Rajah, for her hand in marriage. The Rajah angrily sends the Prince away; he has already promised Indigo's hand to an old friend of his, the wealthy usurer Sakaram. Indigo protests vehemently as Sourire is driven away by guards.\nReturning to his private chamber, Sourire weeps with grief and accidentally overturns an incense burner. Smoke pours out of the burner, from which appears the sorcerer Khalafar. After hearing the prince's story, the sorcerer takes him under his protection and presents him with a magic sword, promising that if the prince is courageous and determined, the sorcerer will lead him to an abundant treasure that will allow him to win his love. Sourire willingly agrees and sets off on the adventure, followed soon after by his friends, who wish to stop him from doing anything foolhardy.\nArriving in a temple, the prince falls to his knees in supplication at an altar to a goddess, Siva (presumably inspired by the Hindu deity Siva). The statue of the goddess above the altar comes miraculously to life and sends Sourire off in an ornate boat driven by a blue dwarf. The boat navigates a sacred river and brings Sourire to an impenetrable forest, which magically opens up to reveal secret caverns guarded by a Fairy of Gold. Sourire and his friends descend into a Crystal Grotto, where their courage is tested by attacks from genii of fire, will-o'-the-wisps, phantom skeletons, a fire-breathing dragon, and a flock of monstrous toads. Sourire remains steadfast and puts the monsters to flight. Khalafar appears and congratulates the prince for passing the trial period; he will now be rewarded for his efforts. Sourire is led into the Palace of the Arabian Nights and given an enormous treasure.\nBack in the Rajah's kingdom, the day of Indigo's marriage to Sakaram has arrived. Just as the two are about to be married in the palace courtyard, trumpets sound and Prince Sourire appears, bedecked in his newly found finery and followed by a procession revealing his riches. The astounded Rajah allows Indigo to marry Sourire at last. The delighted crowd casts Sakaram out of the courtyard and celebrates the marriage of the Prince and Princess.\n\n\n== Production ==\nThough clearly inspired by the One Thousand and One Nights, the plot of the film is not taken from any single story in that collection; rather, Méliès combined the visual iconography of the work and elements from various stories, including the liberated genie from the folk tale of Aladdin, into an original adventure narrative that would allow ample scope for spectacle and special effects. The result is a simple story full of exotic settings and spectacular moments, highly reminiscent of the plots of féeries, spectacular French stage productions popular in the nineteenth century.Méliès appears in the film as the sorcerer Khalafar. One of Méliès's costume sketches lists the other actors he planned to cast: \"Mlles Calvière, Bodson, Billuart et Pelletier. MM. Docky, d'Hubert, Dufresne, etc.\"The Palace of the Arabian Nights was the second Méliès film, after The Barber of Seville (1904), to be longer than 400 meters. The film, one of Méliès's most opulently designed, is notable for a stronger emphasis on spectacle, and slightly more relaxed pace, than Méliès's earlier films had shown; this change of style may have been influenced by Edwin S. Porter's 1903 film version of Uncle Tom's Cabin or by the lavish historical dramas then in vogue among Italian filmmakers.To costume his film, Méliès took advantage of the availability of a sizable stock of costumes he had purchased the same year from a bankrupt stage costuming house, the Maison Lepère. The film's numerous props include almost all of those that had previously been seen, or would later be seen, in other Méliès films: thus, the Moorish door for the Temple of Gold was borrowed from The Human Fly (1902), the puppet dragon returns in The Witch (1906), the ruins reappear in Sightseeing Through Whisky (1907), and so on. The Palace of the Arabian Nights itself, painted in trompe l'oeil style on a flat backdrop, looks exactly like the salle de glaces (hall of mirrors) featured at the Paris Exposition of 1900. (A very similar room was established more permanently in Paris six years later, as part of the Musée Grevin.)Along with the lavish costumes and scenery, another main focus of the film is the spectacular special effects. Méliès's techniques for creating these effects included stage machinery, pyrotechnics, substitution splices, superimpositions, and dissolves. The transparency effect of phantom skeletons was created through multiple exposure, with the images of the fighting protagonists and the ghostly skeletons recorded over each other so that both would be visible. Méliès's catalogue description for the film shows particular pride in the scene in which an apparently impenetrable forest, painted on flats arranged to show depth of space, magically parts to reveal a temple: \"This decoration which was made only after considerable labor is a veritable marvel of achievement. It possesses a great artistic beauty.\"\n\n\n== Release and reception ==\n\nThe film was released by Méliès's Star Film Company and is numbered 705–726 in its catalogues, where it was advertised as a grande féerie orientale nouvelle. Both a complete print running 28 minutes and an abridged version running 22 minutes were sold by Méliès; both versions were available in either black-and-white or hand-colored prints. (The running times listed in Méliès's catalogues indicate that he intended a frame rate of 14 frames per second for the film.)In a study of cinematic depictions of Arabic culture, the writer Jack Shaheen criticizes The Palace of the Arabian Nights for including some of the imagery that would become stereotypical in Hollywood versions of the Middle East, citing the opening scene in which \"submissive maidens attend a bored, greedy, black-bearded potentate\" while \"a stocky palace guard cools the ruler\" with a giant fan. By contrast, the historian Robert Irwin, in an essay on Méliès's film and other screen versions of the One Thousand and One Nights, argues that \"not too much should be made\" of this stereotyping, saying that \"film-makers have treated British medieval history in a similarly cavalier fashion in films about the adventures of Robin Hood, while a fantasy history of the Old West has been conjured up by the thousands of cowboy films made in Hollywood.\"Film critic William B. Parrill, reviewing silent films in the 2010s, highlighted the skeleton fight scene, saying it \"foreshadows similar and not necessarily more imaginative scenes in the films of Ray Harryhausen\". Academic theorist Antonia Lant, in an analysis of haptics in cinema, lauded the scene with the magically parting forest, writing: \"Melies chose motifs that probed or highlighted the alluring yet illusory depths of the cinema, the impossible compressions and expansions of far and near, the unclear identities of figure and ground.\" Cultural historian Richard Abel highlighted that the cultural milieu evoked by Méliès \"turns into a kind of world tour, eclectically combining\" various real and imaginary exotic locations across the Middle East and Asia, \"and, in a clever twist that exposes the mask of the 'other' and its dangers, the Palace of the Arabian Nights, where the treasure is hidden, turns out to look much like the Musée Grévin in Paris.\"\n\n\n== References ==\n\n\n=== Footnotes ===\n\n\n=== Citations ===\n\n\n== External links ==\nThe Palace of the Arabian Nights at IMDb",
    "links": [
        "A Desperate Crime",
        "A Dinner Under Difficulties",
        "A Fake Diamond Swindler",
        "A Fantastical Meal",
        "A Funny Mahometan",
        "A Grandmother's Story",
        "A Hypnotist at Work",
        "A Lightning Sketch",
        "A Love Tragedy in Spain",
        "A Mesmerian Experiment",
        "A Miracle Under the Inquisition",
        "A Mix-up in the Gallery",
        "A Moonlight Serenade",
        "A Mysterious Portrait",
        "A Nightmare",
        "A Novice at X-Rays",
        "A Private Dinner",
        "A Roadside Inn",
        "A Seaside Flirtation",
        "A Serpentine Dance",
        "A Spiritualistic Photographer",
        "A Terrible Night",
        "A Tricky Painter's Fate",
        "A Trip to the Moon",
        "A Wager Between Two Magicians, or Jealous of Myself",
        "Actuality films by Georges Méliès",
        "Addition and Subtraction",
        "Adventures of William Tell",
        "After the Ball (1897 film)",
        "Aladdin",
        "Alcofrisbas, the Master Magician",
        "An Adventurous Automobile Trip",
        "An Hallucinated Alchemist",
        "An Up-to-Date Conjuror",
        "Aouda",
        "Arrival of a Train (Joinville Station)",
        "Baron Munchausen's Dream",
        "Between Calais and Dover",
        "Black-and-white",
        "Blue Beard (1901 film)",
        "Bob Kick, the Mischievous Kid",
        "Buncoed Stage Johnnie",
        "China Versus Allied Powers",
        "Christ Walking on the Water",
        "Cinderella (1899 film)",
        "Cinderella or the Glass Slipper",
        "Cinema of the United States",
        "Cirque d'Hiver",
        "Comedian Paulus Singing",
        "Conjurer Making Ten Hats in Sixty Seconds",
        "Conjuring (1896 film)",
        "Coppelia, the Animated Doll",
        "Crying and Laughing",
        "D. Devant, Conjurer",
        "Dancing in a Harem",
        "Delirium in a Studio",
        "Dislocation Extraordinary",
        "Dissolve (filmmaking)",
        "Divers at Work on the Wreck of the \"Maine\"",
        "Edwin S. Porter",
        "Every Man His Own Cigar Lighter",
        "Excelsior!",
        "Extraordinary Illusions (1903 film)",
        "Fantasy film",
        "Fat and Lean Wrestling Match",
        "Faust and Marguerite (1904 film)",
        "Film colorization",
        "Fortune Favors the Brave (film)",
        "Frame rate",
        "French Cops Learning English",
        "French language",
        "Fun With the Bridal Party",
        "Féerie",
        "Gaston Méliès",
        "Georges Méliès",
        "Georges Méliès bibliography",
        "Georges Méliès filmography",
        "Georges Méliès in culture",
        "Going to Bed Under Difficulties",
        "Good Glue Sticks",
        "Groom (profession)",
        "Gugusse and the Automaton",
        "Gulliver's Travels Among the Lilliputians and the Giants",
        "Hamlet (1907 film)",
        "Haptic poetry",
        "Hindu deities",
        "Honeymoon in a Balloon",
        "How Bridget's Lover Escaped",
        "Hugo (film)",
        "Humanity Through the Ages",
        "Hypnotist's Revenge",
        "IMDb",
        "ISBN (identifier)",
        "In the Barber Shop",
        "Incense burner",
        "Incident from Don Quixote",
        "Intertitle",
        "Jack Jaggs and Dum Dum",
        "Jack Shaheen",
        "Jack and Jim (film)",
        "Jehanne D'Alcy",
        "Jinn",
        "Joan of Arc (1900 film)",
        "Jupiter's Thunderbolts",
        "King of the Mediums",
        "Le Grand Méliès",
        "List of reconstructed actualities by Georges Méliès",
        "Long Distance Wireless Photography",
        "Love and Molasses",
        "Magic sword",
        "Misfortune Never Comes Alone",
        "Mishaps of the New York–Paris Race",
        "Miss de Vère (English Jig)",
        "Moitié de polka",
        "Multiple exposure",
        "Musée Grevin",
        "Not Guilty (1908 film)",
        "OCLC (identifier)",
        "On the Roofs",
        "One Thousand and One Nights",
        "Paris Exposition, 1900 (film series)",
        "Paris Exposition of 1900",
        "Pharmaceutical Hallucinations",
        "Playing Cards (film)",
        "Post No Bills (1896 film)",
        "Prince Charming",
        "Punch and Judy (film)",
        "Pygmalion and Galatea (1898 film)",
        "Pyrotechnics",
        "Ray Harryhausen",
        "Red Riding Hood (1901 film)",
        "Richard Abel (cultural historian)",
        "Rip's Dream",
        "Robbing Cleopatra's Tomb",
        "Robert Irwin (writer)",
        "Robert Macaire and Bertrand",
        "Robinson Crusoe (1902 film)",
        "Rogues' Tricks",
        "Satan in Prison",
        "Sea Fighting in Greece",
        "Seein' Things (1908 film)",
        "Shakespeare Writing \"Julius Caesar\"",
        "Shiva",
        "Sideshow Wrestlers",
        "Sightseeing Through Whisky",
        "Silent film",
        "Soap Bubbles (film)",
        "Stage machinery",
        "Star Film Company",
        "Substitution splice",
        "Summoning the Spirits",
        "Superimposition",
        "Tchin-Chao, the Chinese Conjurer",
        "Ten Ladies in One Umbrella",
        "Thanking the Audience",
        "The Apparition (1903 film)",
        "The Artist and the Mannikin",
        "The Astronomer's Dream",
        "The Ballet-Master's Dream",
        "The Barber and the Farmer",
        "The Barber of Seville (1904 film)",
        "The Bewitched Inn",
        "The Bewitched Trunk",
        "The Black Imp",
        "The Brahmin and the Butterfly",
        "The Bridegroom's Dilemma",
        "The Broken Violin (1908 film)",
        "The Catastrophe of the Balloon \"Le Pax\"",
        "The Cave of the Demons",
        "The Chimney Sweep (film)",
        "The Christmas Angel",
        "The Christmas Dream",
        "The Clockmaker's Dream",
        "The Clown and Automobile",
        "The Conquest of the Pole",
        "The Cook's Revenge",
        "The Cook in Trouble",
        "The Coronation of Edward VII",
        "The Crystal Casket",
        "The Damnation of Faust (film)",
        "The Devil in a Convent",
        "The Diabolic Tenant",
        "The Diabolical Church Window",
        "The Doctor's Secret (1909 film)",
        "The Doctor and the Monkey",
        "The Drawing Lesson",
        "The Dream of an Opium Fiend",
        "The Dreyfus Affair (film series)",
        "The Duke's Good Joke",
        "The Eclipse, or the Courtship of the Sun and Moon",
        "The Enchanted Sedan Chair",
        "The Enchanted Well",
        "The Eruption of Mount Pelee",
        "The Fairy Dragonfly",
        "The Famous Box Trick",
        "The Firefall",
        "The Four Troublesome Heads",
        "The Frozen Policeman",
        "The Fugitive Apparitions",
        "The Genii of Fire",
        "The Good Luck of a \"Souse\"",
        "The Good Shepherdess and the Evil Princess",
        "The Haunted Castle (1896 film)",
        "The Haunted Castle (1897 French film)",
        "The Helping Hand (1908 French film)",
        "The Hilarious Posters",
        "The Human Fly (1902 film)",
        "The Human Pyramid (1899 film)",
        "The Imperceptible Transmutations",
        "The Impossible Voyage",
        "The Indian Sorcerer",
        "The Infernal Cake Walk",
        "The Infernal Cauldron",
        "The Inn Where No Man Rests",
        "The Invention of Hugo Cabret",
        "The Inventor Crazybrains and His Wonderful Airship",
        "The Kingdom of the Fairies",
        "The Knight of Black Art",
        "The Knight of the Snows",
        "The Laboratory of Mephistopheles",
        "The Last Cartridges",
        "The Lilliputian Minuet",
        "The Living Doll",
        "The Living Playing Cards",
        "The Magic Lantern (film)",
        "The Magician's Cavern",
        "The Magician (1898 film)",
        "The Man with the Rubber Head",
        "The Marvellous Wreath",
        "The Melomaniac",
        "The Mermaid (1904 film)",
        "The Merry Frolics of Satan",
        "The Miracles of the Brahmin",
        "The Mischances of a Photographer",
        "The Miser (1908 film)",
        "The Misfortunes of an Explorer",
        "The Monster (1903 film)",
        "The Mysterious Box",
        "The Mysterious Island (1905 film)",
        "The Mysterious Knight",
        "The Mysterious Retort",
        "The Mystical Flame",
        "The New Lord of the Village",
        "The Old Footlight Favorite",
        "The One-Man Band",
        "The Oracle of Delphi (film)",
        "The Pillar of Fire",
        "The Prophetess of Thebes",
        "The Providence of the Waves",
        "The Queen's Musketeers",
        "The Rag-Picker",
        "The Rajah's Dream",
        "The Rescue on the River",
        "The Sacred Fountain",
        "The Scheming Gambler's Paradise",
        "The School for Sons-in-law",
        "The Shadow-Girl",
        "The Snow Man (1899 film)",
        "The Spider and the Butterfly",
        "The Surrender of Tournavos",
        "The Temptation of Saint Anthony (film)",
        "The Terrible Turkish Executioner",
        "The Tower of London (1905 film)",
        "The Tramp and the Mattress Makers",
        "The Treasures of Satan",
        "The Triple-Headed Lady",
        "The Two Blind Men",
        "The Untamable Whiskers",
        "The Vanishing Lady",
        "The Venetian Looking-Glass",
        "The Voyage of the Bourrichon Family",
        "The Witch's Revenge",
        "The Witch (1906 film)",
        "The Woes of Roller Skaters",
        "The Wonderful Living Fan",
        "The Wonderful Rose-Tree",
        "Théâtre Robert-Houdin",
        "Tit for Tat (1904 film)",
        "Tom Old Boot",
        "Tribulation or the Misfortunes of a Cobbler",
        "Trompe l'oeil",
        "Tunnelling the English Channel",
        "Uncle Tom's Cabin",
        "Under the Seas",
        "Unexpected Fireworks",
        "Up-to-Date Surgery",
        "Usurer",
        "Watering the Flowers",
        "What Is Home Without the Boarder",
        "Whimsical Illusions",
        "Why That Actor Was Late",
        "Will-o'-the-wisp"
    ]
}