{"url": "https://en.wikipedia.org/wiki/The_Inheritance_Cycle", "title": "The Inheritance Cycle", "summary": "The Inheritance Cycle is a tetralogy of young adult high fantasy novels written by American author Christopher Paolini. Set in the fictional world of Alagaësia (), the novels focus on the adventures of a teenage boy named Eragon and his dragon, Saphira, as they struggle to overthrow the evil king Galbatorix. The series was originally intended to be a trilogy (named the \"Inheritance Trilogy\") until Paolini announced on October 30, 2007, while working on the third novel, that he believed the story was too complex to conclude in just three books.\nThe book series as a whole received mixed reviews by critics, but has gained both popularity and commercial success. The first book in the series, Eragon, was originally self-published by Paolini in 2001, and subsequently re-published by Alfred A. Knopf Books for Young Readers on June 25, 2003. The second book in the series, Eldest, was published by Knopf on August 23, 2005. Both were New York Times bestsellers. The third book in the series, Brisingr, was published by Knopf on September 20, 2008. The fourth and final book in the series, Inheritance, was published by Knopf on November 8, 2011. The series has sold 33.5 million copies worldwide.\nIn 2006, a feature film was released based on the first book in the cycle, Eragon, starring Ed Speleers, Jeremy Irons, John Malkovich and Djimon Hounsou. The film received generally negative reviews, but closed as the 13th highest grossing fantasy-live action film within the United States.", "content": "The Inheritance Cycle is a tetralogy of young adult high fantasy novels written by American author Christopher Paolini. Set in the fictional world of Alagaësia (), the novels focus on the adventures of a teenage boy named Eragon and his dragon, Saphira, as they struggle to overthrow the evil king Galbatorix. The series was originally intended to be a trilogy (named the \"Inheritance Trilogy\") until Paolini announced on October 30, 2007, while working on the third novel, that he believed the story was too complex to conclude in just three books.\nThe book series as a whole received mixed reviews by critics, but has gained both popularity and commercial success. The first book in the series, Eragon, was originally self-published by Paolini in 2001, and subsequently re-published by Alfred A. Knopf Books for Young Readers on June 25, 2003. The second book in the series, Eldest, was published by Knopf on August 23, 2005. Both were New York Times bestsellers. The third book in the series, Brisingr, was published by Knopf on September 20, 2008. The fourth and final book in the series, Inheritance, was published by Knopf on November 8, 2011. The series has sold 33.5 million copies worldwide.\nIn 2006, a feature film was released based on the first book in the cycle, Eragon, starring Ed Speleers, Jeremy Irons, John Malkovich and Djimon Hounsou. The film received generally negative reviews, but closed as the 13th highest grossing fantasy-live action film within the United States.\n\n\n== Publication history ==\nHomeschooled by his parents, Christopher Paolini graduated from high school at the age of fifteen, but felt he was not yet mature enough for college, so he wrote Eragon in his spare time. After writing the first draft for a year, he spent a second year rewriting it and fleshing out the story and characters, and then presented it to his parents. They had it self-published by the family publishing company, Paolini International, and Paolini then travelled to various schools advertising his novel. In 2002, author Carl Hiaasen discovered the book while his stepson was reading it, and brought it to the attention of his publisher, Alfred A. Knopf. It was republished by Knopf in 2003.\nBrisingr—a word that means \"fire\" in Alagaësia's ancient language, taken from Old Norse—was published on September 20, 2008. Paolini's announcement of the book's publishing date included the revelation that the Inheritance Trilogy would now contain four books instead of three, thus resulting in the renaming of the series to the Inheritance Cycle.\nInheritance was announced by Random House on March 23, 2011 with the cover artwork. It was released on November 8, 2011 in the United States, Canada, United Kingdom, Australia, and New Zealand.\nEragon (2003)\nEldest (2005)\nBrisingr (2008)\nInheritance (2011)\n\n\n== Synopsis ==\nIn the fictional land of Alagaësia, an order was originally created to oversee the countries and bring peace to the world. This group was known as the Dragon Riders, for they rode dragons, the rider formed a bond with the dragon in accordance with a pact made between elves and dragons millennia earlier. Later, humans were involved in the Riders too. One Dragon Rider named Galbatorix suffered the death of his dragon, Jarnunvösk, at the hands of a group of Urgals (a species of brutish humanoids); the dragon's death pushed him to insanity. Denied another dragon by the Council of Elder Riders, Galbatorix blamed the Council for the death of his dragon and sought to destroy the order. He made an alliance with an ambitious young rider, Morzan, and with his help slew another rider and took his dragon, Shruikan captive. Using magic, he broke Shruikan's will and forced the dragon to serve him. Gathering more Riders to his cause, he created the Thirteen Forsworn and with their help took over Ilirea, the capital of the Broddring Kingdom, and destroyed Doru Araeba, the centre of the Dragon Riders. Galbatorix slew the Elders, their leader Vrael, taking his sword, Islingr, and most of the Dragon Riders, along with their dragons, taking many Eldunarí, or the Heart of Hearts, which is a gem inside dragons that their consciousness can remain in even after they die. When the remaining dragons found out that the betrayal was aided by their own species, they collectively cast a spell on the Forsworns' dragons, which prevents them from being named.\nElder Rider Oromis and his Dragon Glaedr fled to Ellesméra, the capital of the elves' kingdom in the forest Du Weldenvarden, while Morzan confronted his old friend Brom, slaying his dragon Saphira. However, Morzan showed mercy to Brom, who later escaped. After the fall of the Riders, Galbatorix declared himself King over all of Alagaësia. He then focused his efforts onto going after the elves and the dwarfs but he couldn't find them.\nOver the next century, several of the Forsworn were killed either from battle or power struggles or committed suicide after going mad. Galbatorix shut himself up for more than forty years, bending the Eldunarí to his will. His negligence allowed a Southern region called Surda to gain independence from the Empire and become its own country. Brom created the Varden, a rebellion meant to oppose the Empire. He killed three of the Forsworn personally, including Morzan; and orchestrated the deaths of five more. While working undercover for the Varden in Morzan's staff Brom fell in love with Morzan's wife, Selena. Selena, who already had borne Morzan's son, became pregnant with Brom's child. She returned to Carvahall, her brother Garrow's home, to give birth to the child.  After begging her brother and his wife to raise her son, Eragon, as their own, she left Carvahall to return to Morzan and her first son.  She died soon afterward. When Brom needed to disappear, he travelled to Carvahall, disguised as a storyteller to be near his son, who was not aware of his relationship to Brom.\nThe first book in the series started when a Shade named Durza (servant of Galbatorix) ambushed three elves named Fäolin, Glewin and Arya, who was carrying a dragon egg. Only two other dragon eggs remained, in the citadel in Ilirea, renamed Urû'baen by Galbatorix. Arya attempted to send the egg to Brom, but the remaining Eldunarí, which were hidden in the Vault of Souls, a secret cave hidden on the island Vroengard, near Doru Araeba, altered the spell making the egg go to Eragon, because they believed that the egg might hatch for him (revealed in the final book), who finds the egg while on a hunting trip. A few days later, the egg hatches and Eragon touches the dragon that was inside of the egg, giving him a silver mark on his palm (the gëdwey ignasia) and making Eragon a Dragon Rider through their bond. The hatchling chooses the name Saphira from a list of dragon names Eragon recites, from Brom, to her. Eragon's cousin, Roran, leaves for a job in the next town Therinsford, to earn money so he can start a family with his beloved, Katrina. His uncle, Garrow, is killed by King Galbatorix's servants, the Ra'zac, and Eragon flees Carvahall with Brom with the intention of hunting down the Ra'zac, unaware that Brom is his father. Brom gives Morzan's sword, Zar'roc, to Eragon.\nOn the journey, Brom teaches Eragon sword fighting, magic, a minimal understanding of the ancient language, and the ways of the Dragon Riders. On the journey they become close friends. Once again the Eldunarí decide to act, sending Eragon dreams of Arya, who is imprisoned in Gil'ead. Halfway through their journey, their camp is ambushed by the Ra'zac and a stranger named Murtagh rescues them, but Brom is mortally wounded. In his dying breath, Brom reveals to Eragon that he once was a Dragon Rider and his dragon was also named Saphira.\nEragon decides to follow his dream of Arya to Gil'ead, and Murtagh and Eragon rescue her, though Eragon has to battle Durza. When Arya remains unconscious for days on end, Eragon decides to take a risk and communicate with their thoughts. Arya tells him how to find the Varden. They flee to the Varden as they are being chased by Kull (overlarge Urgals). As they are trapped by the Kull, Murtagh is revealed to be Morzan's son. A dwarf named Orik saves them with the help of some of the Varden. One of The Twins, two nasty bald men, examines Eragon's memories, but Murtagh refuses to let anyone into his head. Eragon and Murtagh are taken to Tronjheim, the city-mountain at the center of the hollow mountain Farthen Dûr. The leader of the Varden, Ajihad, imprisons Murtagh after he refuses again to allow his mind to be read, even though Ajihad recognizes Murtagh's voice. Eragon is properly introduced to Ajihad, his daughter Nasuada, the dwarf King Hrothgar, and his foster son Orik. The Varden are attacked by an army of Urgals. In the ensuing battle, Eragon gets separated from the main fighting and finds himself in a one-on-one duel with Durza. In the duel, Eragon receives a large cursed scar on his back, but Arya and Saphira break Isidar Mithrim, the Star Rose, creating a distraction long enough for Eragon to stab Durza through the heart. In the aftermath, Ajihad is killed by a band of stray Urgals, and Murtagh and The Twins are captured.\nMeanwhile, Roran is wanted by the Empire. His supporters help him fortify and defend Carvahall. He later evacuates to Surda along with most of the villagers, intending to join the Varden.\nEragon, Saphira, Orik and Arya set off to Ellesméra, the capital of the elves, to finish Eragon’s training. When they arrived, they met Queen Islanzadí, who they find out was Arya's mother. Eragon was tutored by a rider called Oromis who had a dragon named Glaedr. During an elvish Agaetí Blödhren, or Blood-Oath Celebration, honoring the pact between elves and dragons, Eragon is changed by a symbolic dragon, giving him elf-like abilities and completely healing his back as well as all of his other injuries. Eragon then reveals his true feelings to Arya. After much persistence, Arya angrily rejects Eragon's suit. Meanwhile, Nasuada moves the Varden to the separate country of Surda which is ruled by King Orrin, and Roran moves the villagers of Carvahall to Surda, after their village was destroyed by the Ra'zac, who also captured Katrina. Eragon returns to the Varden, and Nasuada allows the Urgals to join the ranks of the Varden, even though her decision is opposed by many. The next day there is a great battle against Galbatorix's minions. During the battle, a ship arrives with Roran and the entire village of Carvahall. Roran kills The Twins, who are revealed to have planned the death of Ajihad. Meanwhile, Eragon and Saphira confront an enemy Rider, who kills King Hrothgar, and turns out to be Murtagh, and Thorn, who hatched from the second egg and whose growth was accelerated by Galbatorix, making him almost as large as Saphira. Murtagh says that he is sworn to Galbatorix, who extracted oaths of fealty from him and Thorn, and that he and Eragon are brothers. This he says in the ancient language, meaning he can't lie. He takes Zar'roc from Eragon, but shows him mercy, interpreting Galbatorix's orders in a different way.\nEragon, Saphira, and Roran arrive at Helgrind, the Gates of Death, near Dras-Leona, where they free Katrina. Eragon and Roran slay the Raz'ac while Saphira kills the Lethrblaka, the Ra'zac's adult form. Eragon stays behind because he finds Katrina's father Sloan, who betrayed the villagers of Carvahall to the Ra'zac. He finds out Sloan's true name, and uses it to make him go to Ellesméra. Then Eragon catches up with the rest of the Varden. He then goes to the Beor mountains and helps Orik become king of the dwarves, and Saphira fulfills her promise to mend Isidar Mithrim. After that, Eragon goes back to Du Weldenvarden and creates his own sword Brisingr, which bursts into flames each time Eragon speaks its name, and learns from Oromis and Glaedr that Brom is his real father (Eragon and Murtagh are actually only half brothers) and of the Eldunarí, which are also the source of Galbatorix's power.\nThe Varden capture several cities of the Empire, and Oromis and Glaedr are killed by Murtagh and Thorn, though Glaedr has given his Eldunarí to Eragon and Saphira to further their training. After the defeat of one of the Empire's cities, Nasuada is captured by Murtagh, who becomes attached to her and heals her of her injuries, which causes an identity switch, breaking his oath to Galbatorix. Eragon travels to the Vault of Souls, which has a massive amount of secret Eldunarí and dragon eggs hidden from Galbatorix. Taking the Eldunarí, he faces Galbatorix, who uses the true name of the ancient language against Eragon. Eragon duels Murtagh, besting him. Then Eragon and Galbatorix have a fierce mental battle, where Eragon accidentally forces Galbatorix to commit suicide with an improvised spell.\nMurtagh and Thorn retreat to somewhere in the north to have some time to themselves, but Eragon tracks him down. Murtagh tells him the name of the ancient language. Nasuada, after a heated debate with the other leaders of the rebellion, becomes the High Queen of Alagaësia, and changes Urû'baen back to Ilirea. Arya returns to Du Weldenvarden to help choose a new monarch for the elves after the death of Queen Islanzadí in battle, and is chosen herself. She takes with her the rescued green dragon egg, which soon hatches for her. Thus, Arya becomes a Rider with her dragon named Fírnen. Near the end of the book, Arya reveals this to Eragon, as well as her True Name, while Saphira decides to test Fírnen \"to see if he has the iron in his bones, and the fire in his belly to match [her]\". The two dragons become mates shortly thereafter.\nEragon reworks the magic of the original pact between elves and dragons to include both dwarves and Urgals, allowing the dragon eggs to hatch for members of their races. Eragon, coming to the conclusion that there is no safe place to raise the dragons and train new Riders in Alagaësia, begins planning transport of the Eldunarí and the eggs to a region far from Alagaësia, save for two eggs which are kept in Alagaësia: one is to be sent to the dwarves, and the other to the Urgals. Those future Riders will travel to Eragon's new home for training, while new eggs will be sent back to Alagaësia to hatch for new Riders. At the end of the book, Eragon & Saphira depart Alagaësia forever.\n\n\n== Major characters ==\n\nAjihad: The third ruler of the Varden, an alliance that opposes Galbatorix. He is killed in the opening chapter of the second book.\nAngela the herbalist: An eccentric and extremely mysterious witch who is allied with the Varden. She seems to go by many different names, and she reads Eragon's future.\nArya-dröttning, dröttningu, Shadeslayer: An elven princess rescued by Eragon in Eragon, with whom he falls in love. She was ambushed while carrying a dragon egg between the elves and the Varden. At the end of the series, she becomes queen of the elves, and the dragon Fírnen hatches for her.\nBrom: A storyteller in Carvahall whom Eragon travels with, later revealed to be a Dragon Rider. He dies midway through the first book, but is revealed to be Eragon's father in the third.\nDurza: A Shade (meaning he is possessed by spirits), serving Galbatorix. In the first book, he captures and tortures Arya in attempt to locate Saphira's egg, and hunts Eragon.\nElva Farseer: An orphaned baby whom Eragon unwittingly curses in the first book, she is forced to protect others from harm through foresight, and to share in their pain. She grows at a rapid pace for some time after the blessing Eragon gave her, eventually attaining the physical maturity of a six-year-old at less than two years of age.\nEragon Shadeslayer, Bromson, Argetlam, Hrothgar's foster son -finiarel: A Dragon Rider, his quest begins when he finds a mysterious stone, which turns out to be a dragon egg, during a hunting trip. He flees Carvahall with Brom. Eventually, his true training begins. He gradually learns how to fight, use magic, and read. He is bonded to the dragon, Saphira Bjartskularhe also kills the shade Durza becoming the few who have survived a shade attack.\nGlaedr: Paired with the Rider Oromis, who, although physically killed along with Oromis near the end of the third book, survives through his Eldunarí. He is one of Eragon's teachers.\nJeod Longshanks: Brom's old friend, who succeeded in finding a tunnel into Galbatorix's stronghold, therefore helping to steal the egg. He helps Eragon's cousin Roran get to the Varden, where he succeeds again in finding a tunnel, this time leading into Dras-Leona.\nJörmundur: The leader of the Council of Elders and the only one to accept Nasuada as her own leader.\nKing Galbatorix: The initiator of the rebellion responsible for the Fall of the Riders, he forced many Eldunarí and the dragon Shruikan to serve him.\nKing Grimrr Halfpaw: King of the werecats and one-shapes (cats). He allies the werecats with the Varden.\nKing Hrothgar: King of the dwarves, it was he who adopted Eragon into Dûrgrimst Ingeitum, his clan. He is killed at the end of the second book.\nKing Orik: Hrothgar's foster son, he succeeds him as king of the dwarves.\nKing Orrin: The proud and eccentric king of Surda.\nLord Barst: The killer of Queen Islanzadí, he was King Galbatorix's top general until he was killed by Roran Stronghammer.\nMurtagh Kingkiller, Morzanson: The son of Morzan and Selena, he is Eragon's half brother, an inch or so taller than Eragon, and is a few years older. He was raised in Morzan's stronghold, but he escaped and helped Eragon reach the Varden. He is forced to swear loyalty to Galbatorix, and he killed King Hrothgar. After capturing Ajihad's daughter Nasuada, he cares for her, changing his true name and releasing him from his oaths.\nNar Garzhvog: An Urgal war chief, he allied the Urgals with the Varden to bring down King Galbatorix. He is a Kull, meaning he is over eight feet tall.\nOromis-elda, Osthato Chetowä/the Mourning Sage, Togira Ikonoka/the Cripple Who Is Whole: An elven Dragon Rider, bonded with Glaedr, initially presumed dead, who is hiding in Ellesméra awaiting the next Dragon Rider. He is crippled by a curse so that he cannot do complicated magic. He is killed near the end of Brisingr.\nQueen Islanzadí: The elven queen, and Arya's mother. She is killed by Lord Barst at the end of Inheritance.\nQueen Nasuada: Ajihad's daughter and the fourth ruler of the Varden. She is held prisoner and tortured by Galbatorix in Inheritance, but becomes friends with Murtagh.\nRhunön-elda: An elf older than the Dragon Riders, she has made all the Riders' blades. After Galbatorix's betrayal, she swore an oath to never make another blade. When Eragon asks her to make him a sword, she circumvents this by controlling Eragon's mind to help him create his sword Brisingr.\nRoran Stronghammer, Garrowson: Eragon's cousin, he leads his village across Alagaësia and joins the Varden to fight Galbatorix. He becomes known as \"Stronghammer\" due to his preferred weapon and extraordinary feats in battle. He becomes captain of one of the Varden's battalions.\nSaphira Bjartskular/Brightscales: A sapphire blue dragon whose Rider is Eragon, she is the last female dragon and the last free dragon in existence. At the end of Inheritance, she becomes mates with Arya's dragon Fírnen.\nShruikan: A huge black dragon forced to serve Galbatorix, his growth is unusually fast due to Galbatorix's meddling.\nSolembum: A werecat who accompanies Angela everywhere. He gives Eragon some crucial pieces of advice.\nThe Ra'zac: Two creepy humanoids with great speed and strength. They are afraid of light and water, rather they ambush their prey (humans) at night. They killed Eragon's uncle Garrow and destroyed his farm. It is because of them that Eragon leaves Carvahall for revenge.\nThe Twins: Two nasty bald men without names. They led Du Vrangr Gata (The Wandering Path (An organization of spellcasters that works with the Varden)) before they betrayed the Varden and organized Ajihad's death and the capture of Murtagh.\nThorn: Murtagh's dragon. Like Murtagh, he is forced to serve Galbatorix. His growth is accelerated unnaturally by Galbatorix.\nTrianna: A sorceress who takes over Du Vrangr Gata after the Twins' betrayal.\nUmaroth: Vrael's dragon, now dead physically, but alive in his Eldunarí. He helps Eragon defeat Galbatorix.\n\n\n== Setting ==\nThe series is set on the mythical continent of Alagaësia. Its name was invented by the author, although other place names in the series are drawn from real-world examples.\n\n\n=== Geography ===\nThe Beor Mountains are a vast and incredibly tall mountain range in the southeast of Alagaësia. Within this area is the Az Ragni (The River) and Beartooth River, as well as multiple dwarf cities. The city of Tronjheim is located inside the hollow mountain Farthen Dûr. Northwest of Farthen Dûr is Tarnag, the home of Celbedeil, a great dwarven temple, and Dûrgrimstnz Quan and Ragni Hefthyn.\nDu Weldenvarden (The Guarding Forest) is a dense forest which covers the north of Alagaësia. The elves live in Du Weldenvarden, and their cities of Ceris and Ellesméra (named after Ellesmere Island) are located within the forest, as well as other cities, the Gaena River, and Lake Ardwen.\nThe Empire covers the west of Alagaësia and is the area under the control of King Galbatorix. The area is populated by humans living in cities and towns including Aroughs, Belatona, Bullridge, Carvahall, Ceunon, Daret, Dras-Leona, Eastcroft, Feinster, Furnost, Gil'ead, Kuasta, Melian, Narda, Therinsford, Teirm, Urû'baen, and Yazuac. The Empire is split by an untamed mountain range known as The Spine. One peak, named Utgard (from the Norse language), contains the Rider's sanctuary where Vrael died. The Palancar Valley, a major valley of The Spine, is the location of Eragon's hometown Carvahall and Therinsford and is thus where the Inheritance Cycle begins. It was named for the artist John Jude Palencar before he was chosen as the series' cover artist. Helgrind is a large black bare rock mountain known as the Gates of Death, near Dras-Leona. It is where the Ra'zac live.\nSouth of The Empire is the country of Surda which seceded from The Empire while Galbatorix was learning to use the dragons' Eldunari. Surda is home to the cities of Aberon, Cithrí, Dauth, Lithgow, Petrøvya, and Reavstone.\nThe Hadarac Desert is a giant desert which covers the middle of Alagaësia.\nNorthwest of the mainland lies the island of Vroengard, containing the city of Doru Araeba. This used to be the home of the Riders before they fell. Now, it is inhabited by strange creatures - later named by Eragon - and is almost completely abandoned except for a few strange people that Eragon saw.\n\n\n=== Inhabitants ===\nAlagaësia is populated by various sentient races, including humans, elves (the Fair Folk), dwarves, Urgals (Urgals who grow over 8 feet tall are referred to as Kull), dragons, werecats, weredogs/werewolves (mentioned in Eldest was a Weredog and as a woman with a cloak on (the hood and rest would cover ears and tail) who turned into a she-wolf. They have the ability to turn into any canine and appear as a human with a tail and wolf ears. She may or may not be an elf), spirits (beings of pure energy), Shades (a human that is possessed by a spirit or spirits that are stronger than the human vessel), and Ra'zac. Alagaësia was once host to a now extinct race or people known as the Grey Folk.\n\n\n=== Languages ===\nThere are multiple languages in the world of Alagaësia; many races have their own, and the ancient language—which is used to control magic—is spoken mainly by the elves. No one knows the true name of the ancient language, except for Eragon, Arya, Murtagh, and Galbatorix. It is impossible to lie while speaking the ancient language, but one can still write lies through the Liduen Kvaedhí. The common is spoken by all, but mainly humans. Many races can speak Common, including the dragons (through thought), though they more often communicate through the ancient language and through feelings and images. Dwarvish is spoken by the dwarves. The huge, gray-skinned Urgals speak their own guttural language, as well as more primitive Common. The Nomadic language is spoken by the various tribes that wander throughout Alagaësia. The Ra'zac and the Lethrblaka have their own form of communication—a series of clicks, hisses and rattles that no others have been able to speak or decipher. Werecats speak like any other cats.\n\n\n== Eragon's Guide to Alagaësia ==\nEragon's Guide to Alagaësia is a supplemental book to the Inheritance Cycle, published in November 2009. The book takes the appearance of being written by Eragon after the events of Inheritance, and is directed at a \"young Dragon Rider\" (the reader). It is a collection of information about the  characters, settings and objects referred to in the Inheritance novels, and offers some hints as to the ending of Inheritance, Paolini's fourth book. Fully in color, the book features fifteen pieces of artwork depicting cities and the various races of Alagaësia. The illustrations were created by Fred Gambino, Larry McDougal, Ian Miller, and David Wyatt. According to the Publishers Weekly Children's Hardcover Frontlist, more than 100,000 copies of the book were sold in 2009.\n\n\n== Potential sequels ==\nIn an interview, Christopher Paolini stated that he was considering writing more stories set in Alagaësia. He plans for one of them to be a continuation of the Inheritance Cycle, and the others to be for new story lines (such as a possible prequel centering on Brom). A new book was published December 31, 2018 named The Fork, the Witch, and the Worm.\n\n\n== Reception ==\nThe books have been criticized for their derivative nature. The two most commonly discussed sources are Star Wars (because of numerous similarities in the plots) and The Lord of the Rings (because of the setting, elf and dwarf races, the language and character and place names). However, there were also many positive reviews.\n\n\n== Adaptations ==\n\nOn December 15, 2006, a film adaptation of Eragon was released. The movie, starring Ed Speleers in the title role of Eragon, as well as Jeremy Irons, John Malkovich, Rachel Weisz, Sienna Guillory, Djimon Hounsou and Robert Carlyle, was produced by 20th Century Fox. Stefen Fangmeier made his directorial debut with Eragon. The screenplay was written by Peter Buchman. Principal photography for the film took place in Hungary and Slovakia. A DVD of the movie was released March 20, 2007. The film received negative reviews, with complaints of amateur writing and of borrowing from Lord of the Rings. Despite the film's box office success, all planned sequels were cancelled.\nIn June 2021, Christopher Paolini tweeted #EragonRemake in an effort to get Disney, the intellectual rights holders following their acquisition of 21st Century Fox, to revamp the book series into a possible television show for Disney+. Within hours, the hashtag began to trend with fans pushing for a proper adaptation.\n\n\n== References ==\n\n\n== External links ==\nalagaesia.com official Inheritance Cycle website", "links": ["20th Century Fox", "Acquisition of 21st Century Fox by Disney", "Alfred A. Knopf", "Box Office Mojo", "Brisingr", "Carl Hiaasen", "Christopher Paolini", "Compact Disc", "Cover artist", "Disney+", "Djimon Hounsou", "Dragon (Inheritance)", "Ed Speleers", "Eldest", "Ellesmere Island", "Entertainment Weekly", "Eragon", "Eragon (character)", "Eragon (film)", "Eragon (video game)", "Fictional universe", "Film adaptation", "Galbatorix", "Hardcover", "High fantasy", "Homeschooling", "Hungary", "Inheritance (Paolini novel)", "Jeremy Irons", "John Jude Palencar", "John Malkovich", "List of Inheritance Cycle characters", "Live action", "Lord of the Rings", "New York Times Best Seller list", "New Zealand", "Paolini International", "Paperback", "Peter Buchman", "Rachel Weisz", "Random House", "Robert Carlyle", "Rotten Tomatoes", "Saphira", "Sienna Guillory", "Slovakia", "Star Wars", "Stefen Fangmeier", "Tetralogy", "The Fork, the Witch, and the Worm", "The Inheritance Cycle", "The Inheritance Trilogy (disambiguation)", "The Lord of the Rings", "The New York Times", "USA Today", "Young adult fiction"]}