{"url": "https://en.wikipedia.org/wiki/The_Drawn_Together_Movie:_The_Movie!", "title": "The Drawn Together Movie: The Movie!", "summary": "The Drawn Together Movie: The Movie! (also known as The Drawn Together Movie or Drawn Together: The Movie) is a 2010 American adult animated parody black comedy film based on the Comedy Central animated television series Drawn Together written and executive produced by creators Dave Jeser and Matt Silverstein, produced by Brendan Burch and Richard Quan, and directed by Greg Franklin. The film is the first Drawn Together release since the TV show's cancellation, and the film itself deals with it. It is the second animated film from Comedy Central.\nThe original cast returned to voice their characters and features the guest voice of Seth MacFarlane as \"I.S.R.A.E.L.\" (Intelligent Smart Robot Animation Eraser Lady), and Vernon Wells as the villainous Network Head. While the television series was produced and animated by Rough Draft Studios using digital ink and paint, the film was instead produced and animated \nby 6 Point Harness and done entirely in flash animation using Toon Boom and Adobe Flash Professional due to budget cuts.", "content": "The Drawn Together Movie: The Movie! (also known as The Drawn Together Movie or Drawn Together: The Movie) is a 2010 American adult animated parody black comedy film based on the Comedy Central animated television series Drawn Together written and executive produced by creators Dave Jeser and Matt Silverstein, produced by Brendan Burch and Richard Quan, and directed by Greg Franklin. The film is the first Drawn Together release since the TV show's cancellation, and the film itself deals with it. It is the second animated film from Comedy Central.\nThe original cast returned to voice their characters and features the guest voice of Seth MacFarlane as \"I.S.R.A.E.L.\" (Intelligent Smart Robot Animation Eraser Lady), and Vernon Wells as the villainous Network Head. While the television series was produced and animated by Rough Draft Studios using digital ink and paint, the film was instead produced and animated \nby 6 Point Harness and done entirely in flash animation using Toon Boom and Adobe Flash Professional due to budget cuts.\n\n\n== Plot ==\nFoxxy Love discovers that she can swear without being censored, and realizes that the TV show Drawn Together has been cancelled in favor of \"The Suck My Taint Show\". Foxxy calls the network to find out why they were cancelled. The Network Head, upon hearing from Foxxy, learns that the housemates are still alive and summons I.S.R.A.E.L. (Intelligent Smart Robot Animation Eraser Lady), a robot designed specifically to erase cartoon characters.\nOnce they escape from I.S.R.A.E.L., Foxxy insists that the way for them to survive is to get their TV show back on the air. Clara, refusing to believe that she is not a real princess, claims that her father can protect them. Captain Hero, Xandir and Ling-Ling decide to go with Princess Clara, while Spanky Ham and Wooldoor Sockbat decide to go with Foxxy to try to get their show back on the air. While the others are arguing, Toot Braunstein steals Foxxy's van and drives off alone.\nClara, Hero, Molly (a corpse Hero believes to be his girlfriend), Xandir and Ling-Ling arrive at Clara's kingdom, expecting to find refuge. Clara encounters the king of the land, who is not her father. The guards end up dismembering and eventually killing Clara, but the other three manage to escape.\nMeanwhile, Foxxy, Spanky and Wooldoor visit the Suck My Taint Girl, who reveals herself to be a fan of the housemates' show. She tells the group that they were cancelled because vulgar and offensive content is only acceptable when your show \"makes a point\", and that if they want to get Drawn Together back on the air, they will need to get a point, which they can do by making a visit to Make-A-Point Land. (The show \"Suck My Taint\" is a clear parody of the Comedy Central show South Park, to satirize the fact that unlike Drawn Together, it is never cancelled by Comedy Central despite also being obscene and disgusting, simply because it couches its obscenity in some preachy metaphor as \"comedic insight\" and thus instead is widely praised as ingenious brilliance).\nThe wizard of Make-A-Point Land agrees to give the group a point, and presents them with a box containing the previously mentioned point. Wooldoor opens the box to find out it contains an eraser bomb which erases him from existence. It is then that the Network Head, the Jew Producer and I.S.R.A.E.L. show up to erase the remaining cast. The Suck My Taint Girl reveals that she is the Network Head's wife.\nThe Jew Producer manages to convince I.S.R.A.E.L. to spare the housemates, and she then impales the Network Head on a spike. The Network Head opens his coat to reveal that he had enough explosive erasers strapped to his waist to destroy all of Make-A-Point Land. The Jew Producer and the Suck My Taint Girl struggle for possession of the detonator, in the process dropping it, erasing all of Make-A-Point Land. The housemates make it out just in time with the help of The Giant Who Shits Into His Own Mouth (which is a parody of a South Park metaphor for political bipartisanship).\nThe housemates visit the remains of the erased Drawn Together house. The Jew Producer's son shows up to inform them that he might be able to help them by giving them a direct-to-DVD movie. I.S.R.A.E.L. arrives at the scene and she and the giant become smitten with each other. Everyone laughs happily until Spanky accidentally steps on an eraser bomb caught in the ground, which erases them all from existence forever, therefore completing the Network Head's plan.\n\n\n== Cast ==\n\nJess Harnell as:\nCaptain Hero, a chauvinistic, perverted, necrophilic, latently bisexual and lecherous parody of Superman and other superheroes, with a visual style taken from the cartoons of Bruce Timm and Max Fleischer\nWile E. Coyote\nRhino Guard 1 (Ryan)\nThe King\nBedrock bartender\nCree Summer as:\nFoxxy Love, a sharp-tongued ghetto parody of Valerie Brown from Hanna-Barbera's Josie and the Pussycats\nSuck My Taint Girl, the star of The Suck My Taint Show and a spoof of South Park characters\nThe Network Head's wife\nOld Lady\nJames Arnold Taylor as:\nWooldoor Sockbat, a bizarre children's show character in the mold of SpongeBob SquarePants, who displays many of the typical reality-defying behaviors of Looney Tunes characters\nThe Jew Producer, the person in charge of the Drawn Together show, grew attached to the characters and defended them from I.S.R.A.E.L.\nRoad Runner\nBarney Rubble\nEddie, the Jew Producer's Christian next-door neighbor\nBrainy and Hefty Smurf\nThe Make-A-Point wizard\n\"Suck My Taint Show\" audience members\nAdam Carolla as Spanky Ham, a sex-obsessed, toilet-humored, obnoxious pig and a parody of Internet Flash cartoon characters\nTara Strong as:\nPrincess Clara, a pampered, fundamentalist and bigoted princess who is a parody of Disney princesses like Ariel from The Little Mermaid (1989) and Belle from Beauty and the Beast (1991)\nToot Braunstein, an overweight, alcoholic and emotionally unstable sex symbol from the 1920s, reminiscent of Betty Boop\nSasha, the Network Head's daughter\nJew Producer's wife\nThe red-haired princess\nBetty Rubble\nBedrock Blonde\nAbbey DiGregorio as Ling-Ling, a homicidal anime character based on Pikachu from the Pokémon franchise, who battles using various supernatural powers/abilities (reminiscent of anime) and speaks in pseudo-Japanese gibberish (or \"Japorean\", as DiGregorio calls it) with English subtitles.\nJack Plotnick as Xandir P. Wifflebottom, a homosexual and effeminate parody of video-game heroes like Link from The Legend of Zelda series.\nSeth MacFarlane as I.S.R.A.E.L. (Intelligent Smart Robot Animation Eraser Lady), a robot deployed by the Network Head to permanently erase the entire Drawn Together gang.\nVernon Wells as The Network Head, the evil head of the television network who cancelled Drawn Together and attempts to erase them by various means.\nDave Jeser (uncredited) as The Giant Who Shits Into His Own Mouth / Rhino Guard 2\nMatt Silverstein (uncredited) as the Jew Producer's son\nKaitlyn Robrock (uncredited) as Smurfette\n\n\n== Production ==\n\n\n=== Animation ===\nWhile the series was animated by Rough Draft Studios in South Korea and Glendale, California using digital ink and paint, the movie was animated by 6 Point Harness in  Los Angeles, California using Flash animation and Toon Boom. This was because the movie had to be done under half the cost of the series. While the movie had a new crew of animators and artists, the director of the film, Greg Franklin, had actually worked on the original pilot for Drawn Together, which was originally done in flash.When the series was animated by Rough Draft, the creators, Dave Jeser & Matt Silverstein, weren't that much involved with the animation process. In the movie however, the creators were more involved, even as far as to tweak-out jokes. The animation in the film also proved to be quicker than the show.\n\n\n== Release and critical reception ==\nThough originally announced for a November 2009 release, the film's release date was pushed to March 23, 2010, then released on April 20, 2010. The film premiered at the 2010 SXSW festival in Austin, Texas, on March 18, 2010.\nThe film was released April 20, 2010 on DVD, and on Blu-ray exclusively at Best Buy. The film was released on DVD in Australia later that year on October 6, 2010.The film received negative reviews from critics. Common Sense Media, a site that reviews the content of movies for parents, panned the movie and gave it one star, criticizing its vulgarity, stating that the film is \"filled to the brim with lewd sexual acts, language, and violence. The cartoon parody is meant to push the boundaries of taste, but amidst violence against women, the violation of corpses, kids asking to be sexually abused, heads blown off at close range, the drinking of baby blood ... who -- and especially what child -- is going to be thinking of this as a parody?\"IGN also gave the movie a critical review, writing that a \"great comedic opportunity was wasted on cheap one-dimensional gags and boring sex jokes.\"In contrast DVD Verdict was more favorable, commenting that the movie was \"first and foremost a goodbye gift to fans of the series and they should have no problem enjoying the myriad references and in-jokes scattered about, as well as all of the crude humor.\"\n\n\n== References ==\n\n\n== External links ==\nDrawn Together official homepage at Comedy Central\nThe Drawn Together Movie: The Movie! at IMDb\nThe Drawn Together Movie: The Movie! at Rotten Tomatoes", "links": ["6 Days to Air", "6 Point Harness", "Adam Carolla", "Adobe Flash Professional", "Adult animation", "Alcoholism", "Animation", "Anime", "Ariel (The Little Mermaid)", "Austin, Texas", "Barney Rubble", "Beauty and the Beast (1991 film)", "Belle (Disney)", "Best Buy", "Betty Boop", "Betty Rubble", "Bisexuality", "Black comedy film", "Blu-ray Disc", "Brendan Burch", "Bruce Timm", "Captain Hero", "Chauvinism", "Children's television series", "Comedy Central", "Comedy Central Films", "Common Sense Media", "Cree Summer", "DVD", "DVD Verdict", "Dave Jeser", "Disney Princess", "Drawn Together", "Effeminacy", "Flash animation", "Foxxy Love", "Ghetto", "Glendale, California", "Greg Franklin", "Hanna-Barbera", "Homicide", "Homosexuality", "IGN", "IMDb", "Jack Plotnick", "James Arnold Taylor", "Jess Harnell", "Josie and the Pussycats (TV series)", "Josie and the Pussycats (comic)", "Kaitlyn Robrock", "Kevin Hart: Laugh at My Pain", "Link (The Legend of Zelda)", "List of Drawn Together characters", "Looney Tunes", "Los Angeles", "Matt Silverstein", "Max Fleischer", "Necrophilia", "New Kids Turbo", "Obesity", "Paramount Home Entertainment", "Parody", "Perversion", "Pikachu", "Pokémon", "Princess Clara", "Reno 911!: Miami", "Rotten Tomatoes", "Rough Draft Studios", "Seth MacFarlane", "Sex symbol", "Smurfette", "South Korea", "South Park", "South Park: Bigger, Longer & Uncut", "South by Southwest", "Spanky Ham", "SpongeBob SquarePants (character)", "Strangers with Candy (film)", "Superhero", "Superman", "Tara Strong", "The Hebrew Hammer", "The Legend of Zelda (series)", "The Little Mermaid (1989 film)", "Toilet humour", "Toon Boom", "Toot Braunstein", "Vernon Wells (actor)", "Wile E. Coyote", "Wile E. Coyote and Road Runner", "Wooldoor Sockbat", "Xandir"]}