{"url": "https://en.wikipedia.org/wiki/The_Liver_Birds", "title": "The Liver Birds", "summary": "The Liver Birds is a British sitcom, set in Liverpool, North West England, which aired on BBC1 from April 1969 to January 1979, and again in 1996. The show was created by Carla Lane and Myra Taylor. The two Liverpudlian housewives had met at a local writers club and decided to pool their talents. Having been invited to London by Michael Mills, the BBC's then Head of Comedy, and asked to write about two women sharing a flat, Mills brought in sitcom expert Sydney Lotterby to work with the writing team.\nLotterby had previously worked with Eric Sykes and Sheila Hancock, and on The Likely Lads. For the Liver Birds, Carla Lane wrote most of the episodes, Taylor co-writing only the first two series. The pilot was shown on 14 April 1969 as an episode of Comedy Playhouse, the BBC's breeding ground for sitcoms at the time.", "content": "The Liver Birds is a British sitcom, set in Liverpool, North West England, which aired on BBC1 from April 1969 to January 1979, and again in 1996. The show was created by Carla Lane and Myra Taylor. The two Liverpudlian housewives had met at a local writers club and decided to pool their talents. Having been invited to London by Michael Mills, the BBC's then Head of Comedy, and asked to write about two women sharing a flat, Mills brought in sitcom expert Sydney Lotterby to work with the writing team.\nLotterby had previously worked with Eric Sykes and Sheila Hancock, and on The Likely Lads. For the Liver Birds, Carla Lane wrote most of the episodes, Taylor co-writing only the first two series. The pilot was shown on 14 April 1969 as an episode of Comedy Playhouse, the BBC's breeding ground for sitcoms at the time.\n\n\n== Outline ==\nThe series charted the ups and downs of two \"dolly birds\" sharing a flat on Liverpool's Huskisson Street, concentrating on the two young single women's dealings with boyfriends, work, parents and each other. Dressed in the best 1970s fashions, they looked for romance in a loose female equivalent of The Likely Lads.\nThe pilot and Series 1 starred Pauline Collins as Dawn and Polly James as Beryl Hennessey. In Series 2, Nerys Hughes debuted as Sandra Hutchinson, replacing Dawn for the rest of the programme's run. The Beryl-and-Sandra pairing is generally regarded as the programme's best period. Beryl was the more 'common' one, while Sandra was soft-spoken and more refined, due to the influence of her snobbish, overbearing mother (Mollie Sugden).\nCarla Lane drew on her own mother for the character – \"Mrs Hutchinson, I think she was my mother. I'm sure she was my mother\". Beryl's 'common' mother (the Hennesseys live in Bootle, a working class district north of the city) was played by Sheila Fay. Future Emmerdale actor Elizabeth Estensen as Carol Boswell replaced Beryl from Series 5 onwards.\nThe title comes from the name given to two sculpted birds perched on top of the Royal Liver Building at Pier Head in the city of Liverpool. Michael Mills, who commissioned the series, came up with the title, although it was initially disliked by Carla Lane. The Scaffold – a pop group whose line-up included John Gorman, later of Tiswas fame, and poet Roger McGough – sang the title song.\n\n\n== List of The Liver Birds episodes ==\n\n\n=== Pilot ===\n\n\n=== Series 1 (1969) ===\nBoth the pilot and all four episodes from series 1 (originally aired in 1969) are missing, presumed wiped in their entirety, however, the opening titles (including some footage from one of the missing episodes) still exist.\nThe first series was stopped after four episodes because Polly James' hectic schedule—working every evening on Anne of Green Gables in the West End, then rehearsing all day for the TV show—was proving too much. By the time James was available again, Pauline Collins had moved to LWT's Upstairs, Downstairs. The producer Sydney Lotterby remembered having worked with Nerys Hughes on The Likely Lads and, wrongly believing the Welsh actress was from Liverpool, asked her to read for a part in The Liver Birds. (Neither actress really had a Liverpool accent: James was from Oswaldtwistle, near Blackburn, and Hughes was from Rhyl.) Impressed with Hughes' reading, he offered her the part of Sandra, and the new series, in colour, began. The first episode of the second series aired on 7 January 1971. The actresses got on well together. \"The rapport between Polly and myself was fairly instant. It was excellent. It happened in a twinkling really.\" said Hughes later, and James added, \"We just fitted together. We learned our lines sipping Pernod milkshakes.\" There are two different episode listings for Series 2. Sources that list the series always do so in air date order, though the two contradictory listings are both still used. This alternative listing is as follows:\n\nThe Wedding\nLook Before You Leap\nThe Holiday Fund aka Housekeeping\nThe Proposal aka The Engagement\nThe Good Samaritans\nThree's a Crowd\nThe New Neighbour aka The Man Downstairs\nThe New Flat\nThe Dog\nGrandad\nMother's Day\nPromotion\n\n\n=== Series 2 (1971) ===\n\n\n=== Series 3 (1972) ===\nFollowing the second series, Myra Taylor, who missed her family, stopped writing for the show. With 13 episodes commissioned for the third series, Michael Mills felt that the writing duties would be too much for Lane to handle alone, so he handed six episodes to the writing duo of Jack Seddon and David Pursall. \"They wrote like fellas. They had no idea how a woman thought\", Lane said later, and Nerys Hughes observed, \"They weren't empathetic, they were...voyeuristic!\" \"They were, tonally, not the same\", conceded the producer, Sydney Lotterby. This writing arrangement finished at the end of the third series.\n\n\n=== Christmas Night with the Stars ===\nOn 25 December 1972, a Liver Birds short was broadcast as part of  Christmas Night with the Stars, a programme shown annually on Christmas night, when leading BBC performers appeared in short versions of their series, typically 5–10 minutes long.\n\n\n=== Series 4 (1974) ===\nCarla Lane became sole writer for the fourth series. She felt it was now time for the Liver Birds to start thinking about longer-term relationships with men. John Nettles played Paul, Sandra's (frustrated) boyfriend, and Jonathan Lynn played Robert, Beryl's boyfriend. \"I always wanted The Liver Birds not to be too keen about marriage—not to down it—but not to be out to get a boyfriend to marry,\" Lane explained. Beryl's mother (Sheila Fay) voiced the critical view: \"Man is the dog, and woman is the bone. He eats the best of you, and buries the rest of you, and when his dish is empty—he'll dig you up again.\" This would be the last series with Beryl; as Polly James explained: \"The reason I left the programme in the end was that I felt I was in danger of caricaturing what was already a pretty outrageous character.\"\n\n\n=== Series 5 (1975) ===\nProducer Sydney Lotterby had to find a new leading actress to keep the series going after Polly James' departure. In 1971 he'd replaced Pauline Collins with Nerys Hughes, and Hughes herself spotted her potential new flatmate: 'I went to see a musical in town--Willy Russell's, John, Paul, George, Ringo..and Bert, and saw Elizabeth Estensen.' Lotterby saw the performance at Hughes' suggestion, and asked Estensen to audition for the part. 'She was loud, and abrasive, and exactly what I wanted,' said Lotterby. So Beryl, the bouncy blonde, was replaced by feisty, flame-haired Carol. Now into the fifth series, Carla Lane expanded her range from single life to family life and introduced Carol's relatives: the Boswells. \"They were a close family—they were a dysfunctional family\" said Estensen, and they included Carol's brother Lucien, played by native-Liverpudlian Michael Angelis; her father Mr. Boswell played by Ray Dunbobbin; and her mother Mrs. Boswell played initially by Eileen Kennally and later Carmel McSharry. Carla Lane's later series Bread revolved around the Boswell family and, in interviews, Lane agreed that the two families were probably related.\n\n\n=== Christmas Special (1975) ===\n\n\n=== Series 6 (1976) ===\n\n\n=== Series 7 (1976) ===\n\n\n=== Christmas Special (1976) ===\n\n\n=== Series 8 (1977) ===\n\n\n=== Christmas Special (1977) ===\n\n\n=== Series 9 (1978–1979) ===\n\n\n=== Series 10 (1996) ===\nIn 1996, 17 years after the final episode of the classic original series was broadcast, the BBC revived the series, reuniting Beryl and Sandra as they coped with the aftermath of their respective failed marriages.\nAs the BBC's own website admits, some liberties were taken with continuity: Carmel McSharry, who had played Carol's mother in series 8-9 returned transformed into Beryl's mother, and Carol's rabbit-obsessed brother Lucien Boswell, played by Michael Angelis, became Beryl's brother Lucien Hennessey. The revival was not a ratings success and only lasted one series.\n\n\n== Cast table ==\nKey\n  = Main\n  = Recurring\n  = Guest\n\n\n== Musical adaptation ==\nIn 2018, the series was adapted into a musical production entitled, Liver Birds Flying Home. Lyrics were by Barb Jungr; music by Mike Lindup; book by Barb Jungr, George Seaton & Linda McDermott; and the play was directed by Benji Sperring.\n\n\n== DVD releases ==\nOnly the second series was released on DVD, by Universal Playback in the UK in 2003. It has since gone out of print, with retailers such as Amazon only listing used copies, and was notable for placing the episodes in production order rather than transmission order (resulting in some continuity errors).\nHowever, in January 2013, it was announced that Acorn Media UK had obtained the rights to release The Liver Birds onto DVD. The Liver Birds Collection One (containing The Complete Second Series, this time, in Transmission Order) was released on 8 April 2013, The Liver Birds: Collection Two (containing The Complete Third Series) was released on 7 July 2014.A 4-disc set, (consisting both Collections ONE and TWO) was later released on 26 October 2015, So far Series 2 and 3 have been released onto DVD, but Acorn has no plans to release any further series.\n\nCollection One – (The Complete 2nd Series – Bonus, Exclusive Interview) – Released 8 April 2013.\nCollection Two – (The Complete 3rd Series) – Released 7 July 2014.\n\n\n== References ==\n\n\n== External links ==\nBBC Comedy Guide\nThe Liver Birds at the BFI's Screenonline\nThe Liver Birds at British Comedy Guide\nThe Liver Birds at IMDb\nThe Liver Birds at British TV Resources", "links": ["Ace", "Acorn Media UK", "Allerton, Liverpool", "Anne of Green Gables - The Musical", "Anonymity", "Anyone Who Had a Heart (song)", "Aubrey Morris", "Avril Angers", "BBC One", "Barrie Rutter", "Bertrand Russell", "Bill Dean", "Bill Kenwright", "Blackburn", "Blackpool", "Bootle", "Bread (TV series)", "Brian Pettifer", "British Comedy Guide", "British European Airways", "British Film Institute", "Burt Bacharach", "Butterflies (TV series)", "Caerphilly", "Carla Lane", "Carmel McSharry", "Carol Cleveland", "Christmas Night with the Stars", "Christopher Timothy", "Cilla Black", "Cleavage (breasts)", "Clive Francis", "Clive Swift", "Combined oral contraceptive pill", "Comedy Playhouse", "Commode", "Comédie-Française", "Cyril Shaps", "Damaris Hayman", "Derek Fowlds", "Diana King (actress)", "Edna Doré", "Elizabeth Estensen", "Elocution", "Emmerdale", "Eric Sykes", "Everton F.C.", "Fabia Drake", "Felix Bowness", "Fidelis Morgan", "Geoffrey Palmer (actor)", "Gilbert O'Sullivan", "Glasgow", "Good Samaritan", "Hal David", "Hunts Cross", "IMDb", "ISBN (identifier)", "I Woke Up One Morning", "Inventory", "Ivan Beavis", "Jack Woolgar", "Jeanne Mockford", "Joe Gladwin", "John Gorman (entertainer)", "John Junkin", "John Lyons (actor)", "John McKelvey", "John Nettles", "John Quayle (actor)", "John Ringham", "John Rudling", "John Sharp (actor)", "Joker (playing card)", "Jonathan Lynn", "Joyce Grant", "Julia Breck", "Keith Chegwin", "Ken Jones (actor)", "Ken Platt", "LWT", "Labour Party (UK)", "Laundrette", "Leaving (TV series)", "Lee Oakes", "Lewis's", "Lewis Fiander", "Liver bird", "Liverpool", "Liverpool Cathedral", "Liverpool F.C.", "Liverpool Metropolitan Cathedral", "Llandudno", "Lorgnette", "Luv (TV series)", "Majorca", "Methodist", "Michael Angelis", "Michael Mills (British producer)", "Mollie Sugden", "Molly Sugden", "Mother's Day", "Myra Taylor (scriptwriter)", "Nerys Hughes", "New Brighton, Merseyside", "Nicholas Smith (actor)", "No Strings (1974 TV series)", "Norman Shelley", "North West England", "Oesophagus", "Oswaldtwistle", "Patricia Shakesby", "Patrick McAlinney", "Paula Wilcox", "Pauline Collins", "Pennines", "Pernod", "Pier Head", "Polly James", "Psittacosis", "Public employment service", "RSPCA", "Ray Dunbobbin", "Red telephone box", "Rhyl", "Robert Raglan", "Roger McGough", "Ronald Allen", "Royal Liver Building", "Screaming (TV series)", "Screenonline", "Searching (TV series)", "Sefton Park", "Sexism", "Sheila Hancock", "Shorts", "Sir Giles Gilbert Scott", "Sitcom", "Sleeping pill", "Solo (TV series)", "St. Bernard (dog)", "Susan Littler", "Sydney Lotterby", "Tandem bicycle", "The Last Song (TV series)", "The Likely Lads", "The Liver Birds (disambiguation)", "The Mistress (TV series)", "The New Seekers", "The Samaritans", "The Scaffold", "Tim Wylton", "Tiswas", "Tom Chadbon", "Torremolinos", "Unemployment benefits", "Union steward", "Upstairs, Downstairs (1971 TV series)", "Vegetarian", "Veronica Doran", "Wales", "West End theatre", "William Moore (actor)", "Willy Russell", "Wiping", "Working class"]}