{
    "url": "https://en.wikipedia.org/wiki/The_Zombies_That_Ate_the_World",
    "title": "The Zombies That Ate the World",
    "summary": "The Zombies That Ate The World (French: Les Zombies qui ont mangé le monde) is an ongoing comic book series written by Jerry Frissen and illustrated by Guy Davis. It is published in France by Les Humanoïdes Associés and reprinted in North America by Humanoids Publishing/Devil's Due. It is also published in Spain, Germany and Finland.\n\n",
    "content": "The Zombies That Ate The World (French: Les Zombies qui ont mangé le monde) is an ongoing comic book series written by Jerry Frissen and illustrated by Guy Davis. It is published in France by Les Humanoïdes Associés and reprinted in North America by Humanoids Publishing/Devil's Due. It is also published in Spain, Germany and Finland.\n\n\n== Publication history ==\nThe Zombies That Ate The World was originally published in the French Métal Hurlant from issues 141 to 145 (2003-2004) and in the American version from issue 8 to 14 (September/October 2003 - November/December 2004).\nWhen Humanoids Publishing stopped publishing Metal Hurlant, the series continued and was published in France as hardcover albums. Four albums have been published and a fifth one is said to be in production. Devil's Due began publishing a US version in 2009.\n\n\n== Plot ==\nIn a world where humans have to live with the living dead, a new job opportunity is born: zombie catcher. Karl Neard, his sister Maggie and his Belgian friend Freddy Merckx embrace this career in hopes of making easy money. Unfortunately, the job isn’t that simple: not only are zombies dead bodies walking, but they also have a terrible scent and an awful sense of humor. As a matter of fact, zombies just don’t care about anything, since their lives are behind them and they have an eternity to enjoy. Karl and his team end up attracting all sorts of freaks in 2064 Los Angeles.\n\n\n== Reception ==\nThe Zombies That Ate The World was praised by people such as movie directors George A. Romero and Tobe Hooper and comic book author Mike Mignola.The Belgian character Freddy Merckx in the series is a pun on famous Belgian cycling champion Eddy Merckx.\n\n\n== Collected editions ==\nThe French albums are:\n\nUne Odeur Épouvantable (54 pages, 2004, ISBN 978-2-7316-6344-0)\nLes Esclaves De L'Amour (48 pages, 2005, ISBN 978-2-7316-1636-1)\nPopypop Ne Répond Plus (48 pages, 2006, ISBN 978-2-7316-1774-0)\nLa Guerre Des Papes (48 pages, 2008, ISBN 978-2-7316-1903-4)A trade paperback collection was solicited but Devil's Due went out of business around that time:\n\nThe Zombies That Ate The World (184 pages, Devil's Due Publishing, October 2009, ISBN 978-1-934692-66-0)Humanoids eventually released their own collections:\n\nThe Zombies That Ate The World, Book 1: Bring Me Back My Head! (hardcover, 120 pages, November 2011, ISBN 978-1-59465-083-3)\nThe Zombies That Ate The World, Book 2: The Eleventh Commandment (hardcover, 104 pages, 2012, ISBN 978-1-59465-013-0)\nThe Zombies That Ate The World, Book 3: Houston, We Have A Problem (hardcover, 96 pages, 2015, ISBN 978-1-59465-116-8)Norma Editorial collected all four albums in one book for the Spanish market.\n\n\n== Notes ==\n\n\n== References ==",
    "links": [
        "Charlie Kirchoff",
        "Colourist",
        "Comedy",
        "Comic book",
        "Devil's Due Publishing",
        "Eddy Merckx",
        "George A. Romero",
        "Guy Davis (comics)",
        "Humanoids Publishing",
        "ISBN (identifier)",
        "Jerry Frissen",
        "Les Humanoïdes Associés",
        "Mike Mignola",
        "Métal Hurlant",
        "Norma Editorial",
        "Ongoing series",
        "Tobe Hooper",
        "Trade paperback (comics)"
    ]
}