{
    "url": "https://en.wikipedia.org/wiki/The_Tailor_from_Ulm",
    "title": "The Tailor from Ulm",
    "summary": "The Tailor from Ulm (German: Der Schneider von Ulm) is a 1978 West German drama film directed by Edgar Reitz, of Heimat fame. It is the true story of a German pioneer aviator, Albrecht Berblinger, in the late 18th century. It was entered into the 11th Moscow International Film Festival.",
    "content": "The Tailor from Ulm (German: Der Schneider von Ulm) is a 1978 West German drama film directed by Edgar Reitz, of Heimat fame. It is the true story of a German pioneer aviator, Albrecht Berblinger, in the late 18th century. It was entered into the 11th Moscow International Film Festival.\n\n\n== Plot ==\nThe story begins in countryside near Vienna in 1791. The hero sees a runaway hot-air balloon with a distressed lady inside crying for help. He pursues it, never having seen such a thing before. The family look after him for a while in return for his part in the rescue and he reads a book concerning flight. He already has a fascination with birds and how they fly. Through the family, the Morettis from Italy, he meets an existing experimenter in human flight, Irma Moretti's fiancé, Jakob von Degen, and is invited to a public demonstration of his flying machine.\nThe story then jumps two years, to Ulm where Albrecht works as a tailor. He and his new wife, appropriately plain for his station in life, are visited by the dashing Herr Degen, now married to the beautiful Irma whom Albrecht clearly likes. Their visit is brief as he is en route to the Champs de Mars in Paris to demonstrate his flying machine, which is pulled behind his coach on a specially designed cart.\nAlbrecht is in a tavern one evening when a man, Kaspar Fesslen, is thrown out for causing a disturbance by leafleting in the room. The leaflets say he has returned from Paris where he demonstrated a flying machine. Gossip describes him as a Jacobin sent to incite rebellion.\nWe now see Albrecht's own flying machine for the first time: a broad wing shaped glider. He falls off as he tries to fly it down the slope of a hill. His wife finds him injured and the glider damaged. Fesslen comes to visit him and finds him destroying his glider. He invites him back to his printshop and they discuss flight. He is invited to attend a meeting of the Jacobins. Involving himself with this rebel group he gets into trouble and has his house and goods confiscated. Fesslen is imprisoned. He breaks into his old workshop and rebuilds his flying machine. His tests are more successful but each ends in a crash.\nTime jumps to the Napoleonic Wars and the siege of Ulm. Revolutionary sympathisers offer to financially support Albrecht in his research. Whilst with Fritz, a young helper, he has his first fully successful flight and safe landing from a local hill. Fesslen is released and stays with Albrecht, dying soon after. Irma also appears one day as he practices. They announce a public performance of his machine on Pentecost. Authorities hear and ask him not to show the machine publicly. They wish the display to be for the King of Wurrtemberg. Albrecht writes to invite Herr Degen to attend, which he does. He is determined to fly on the promised day despite pressure from many sides.\nOn the allotted day though, in front of the king and a huge crowd, he is not on a tall hill, as in all his practices, but simply a launch platform from the town wall... and the wind is wrong. He is required to fly over the river. The crowd jeer at his delays. He jumps and lands in the river. He clambers out and the crowd chase him.\nHe evades them but collapses. He is found by soldiers and placed unconscious in a covered cart full of gilded but broken furniture. He wakes and crafts a makeshift periscope. He sees himself flying above.\n\n\n== Cast ==\nTilo Prückner as Albrecht Ludwig Berblinger\nHannelore Elsner as Anna Berblinger, his wife\nVadim Glowna as Kaspar Fesslen\nHarald Kuhlmann as Jakob von Degen\nDieter Schidor as Schlumberger\nRudolf Wessely as Monsieur Pointet\nMarie Colbin as Irma Moretti\nHerbert Prikopa as Kratzky\nDana Medřická as Annas Mutter\nOtto Lackovič as Irma's father, Herr Moretti\nMichal Hofbauer as Fritz, a young boy helping Albrecht\nIvan Vyskočil as Herr von Besserer\n\n\n== References ==\n\n\n== External links ==\nThe Tailor from Ulm at IMDb",
    "links": [
        "11th Moscow International Film Festival",
        "Albrecht Berblinger",
        "Cardillac (film)",
        "Champs de Mars",
        "Dana Medřická",
        "Dieter Schidor",
        "Dietrich Lohmann",
        "Drama film",
        "Edgar Reitz",
        "German language",
        "Germany in Autumn",
        "Hannelore Elsner",
        "Harald Kuhlmann",
        "Heimat (film series)",
        "Herbert Prikopa",
        "Home from Home (2013 film)",
        "IMDb",
        "In Danger and Deep Distress, the Middleway Spells Certain Death",
        "Ivan Vyskočil",
        "Jacobin",
        "Lust for Love (1967 film)",
        "Marie Colbin",
        "Michal Hofbauer",
        "Otto Lackovič",
        "Pentecost",
        "Periscope",
        "Petra Kiener",
        "Rudolf Wessely",
        "Tilo Prückner",
        "Trip to Vienna",
        "Ulm",
        "Vadim Glowna",
        "Vienna",
        "Zero Hour (1977 film)"
    ]
}