{"url": "https://en.wikipedia.org/wiki/Tjaarke_Maas", "title": "Tjaarke Maas", "summary": "Tjaarke Hendrika Maria Maas (26 October 1974 – June 2004) was a Dutch painter, whose work came to public attention in the late 1990s.", "content": "Tjaarke Hendrika Maria Maas (26 October 1974 – June 2004) was a Dutch painter, whose work came to public attention in the late 1990s.\n\n\n== Biography ==\nTjaarke Maas started to paint in her early childhood, in Tasmania, Australia, where her family had immigrated from the Netherlands. At the age of 17 she returned to Europe and studied at the Willem de Kooning Academy in Rotterdam. She continued her studies in New York, where she was introduced to the art of icon painting. At the age of 18, Maas was married, and to support her family began to work as a model, travelling extensively throughout Europe, visiting Japan and Australia.\nFrom 1996 Maas lived in Florence, Italy, where she studied at the Accademia di Belle Arti di Firenze and graduated in 2003 with diploma cum laude. She combined painting and writing about icons with studying the theology of the image. At the same time, she also wrote poetry, prose and fairy-tales for children. She produced more than 500 artwork, consisting of paintings, etchings, drawings and sketches.At age 26, Maas was diagnosed with bipolar disorder. A few years later, Maas found refuge in the forests surrounding the Hermit Monastery of St. Francis of Assisi (Eremo delle Carceri) to continue her work on icons as commissioned by the priest Don Gino. She died of a fall from one of the slopes of Monte Subasio, where she was found on 8 July 2004 at age 29. According to her sister, Marise Maas, her death was due to suicide and Tjaarke had vanished some time earlier. In a small cave, where Maas dwelt, her work on an unfinished icon, an image of the Transfiguration was found.Her artwork had been exhibited in \n\nNew York City,\nJersey City, New Jersey,\nFlorence, Italy\nMoscow, Russia\nSt. Petersburg, Russia\n\n\n== Works ==\n\n\n=== Portraits ===\n\n\t\t\n\t\t\n\t\t\n\n\n=== Birds ===\n\n\t\t\n\t\t\n\t\t\n\n\n=== Still life ===\n\n\t\t\n\t\t\n\t\t\n\n\n=== Icons ===\n\n\t\t\n\t\t\n\t\t\n\n\n== References ==\n\n\n== Further reading ==\nTjaarke Maas Opere-Works 1999-2004, Edizioni Polistampa 2005 ISBN 88-8304-910-1\nTjaarke Maas, Pilgrim, 1996–2004, ИПЦ СПбГУТД, Saint-Petersburg 2009 ISBN 978-88-904914-0-5\nTjaarke Maas, Маcтерская (Masterskaya)1996 - 2004, ИПЦ СПбГУТД, Saint-Petersburg 2009 ISBN 978-88-904914-1-2\n\n\n== External links ==", "links": ["Accademia di Belle Arti di Firenze", "Assisi", "Bipolar disorder", "Don Gino", "Drawing", "Eremo delle Carceri", "Etching", "Fiesole", "Florence, Italy", "ISBN (identifier)", "Icon painting", "Jersey City, New Jersey", "Lopik", "Monte Subasio", "Netherlands", "New York City", "Painting", "Rotterdam", "SUDOC (identifier)", "SoHo", "St. Francis of Assisi", "St. Petersburg", "Tasmania", "Transfiguration of Jesus", "Utrecht", "VIAF (identifier)", "Willem de Kooning Academy"]}