{"url": "https://en.wikipedia.org/wiki/Toronto,_Ipswich", "title": "Toronto, Ipswich", "summary": "Toronto is a heritage-listed detached house at 30 Quarry Street, Ipswich, City of Ipswich, Queensland, Australia. It was built from 1863 onwards. It is also known as Devonshire Cottage. It was added to the Queensland Heritage Register on 21 October 1992.", "content": "Toronto is a heritage-listed detached house at 30 Quarry Street, Ipswich, City of Ipswich, Queensland, Australia. It was built from 1863 onwards. It is also known as Devonshire Cottage. It was added to the Queensland Heritage Register on 21 October 1992.\n\n\n== History ==\nToronto is a two-storey timber residence erected in 1863 for Mrs Elizabeth Lloyd, who bought the Quarry Street allotment No. 13 for £45 from the Crown in April 1863. Due to a period of great local prosperity, Ipswich, at that time, was considered a leading commercial centre, strongly contesting Brisbane as Queensland's premier city. The house, originally named \"Devonshire Cottage\", was apparently built for investment purposes for the considerably wealthy Mrs Lloyd, who did not live in the house except for a brief period during 1868. Like Mrs Lloyd, several of Devonshire Cottage's earliest occupants were members of the Congregational Church. In 1870 the house appears to have been occupied by Reverend Mossop possibly as a Congregational Church Manse.In September 1873, when the property was put up for sale, the house was described as having five large rooms on the lower floor and four rooms upon the upper floor, making nine in total. There was also a detached kitchen, a servant's bedroom and a large washing shed. A broad verandah occupied the entire front of the house with a balcony above. In the yard was a large tank with a good pump, stables and a cow house.William Tamlyn bought the house together with several other adjoining allotments. Like Mrs Lloyd, Tamlyn bought the house for investment purposes, choosing to live elsewhere. The house continued to be leased out until 1914, despite a change of ownership to James Jackes in 1882. Jackes was responsible for renaming the house \"Toronto\" after his birthplace, and for subdividing the property into two allotments in 1911. The reduced sized property was sold in 1914 to Josephine Rowlands, who became the house's first owner occupier.Toronto was resold in 1940 to Peter and Alice McKelvie who made various alterations to the house including work to the front verandah, some restumping, a new opening between the living and dining rooms and substantial internal works to the former kitchen wing at the rear. The property changed ownership for five years to Colin Medlin and Margaret Grant from 1965 and was then sold to Donald and Ivy Follett who carried out further work to the house. The work involved restumping, rewiring, glazing of the rear verandah and reinstatement of the house's earlier colour scheme based on scrapings. A new timber fern-house was constructed at the rear of the property in 1977 and a new bathroom constructed in 1985.\n\n\n== Description ==\nToronto is a two storeyed, timber house designed in the Carpenter Gothic style of architecture. The building is dominated by its roof that is basically two large intersecting gables. Beneath the corrugated iron roof cladding is the original roof clad with wooden shingles. Each gable features decorative scalloped bargeboards. A single brick chimney with a simple brick moulding protrudes above the roofline and is capped with two decorative terracotta pots. The external walls of the main house are hand-planed pine chamferboards which are approximately 300 millimetres (12 in) wide. Internal walls and ceilings throughout the house are vertically lined with tongue and groove boards. The house contains seven main rooms, four at ground level with three upstairs. The ground level central hallway is decorated with an intricate fretted semicircular timber panel positioned overhead midway down the hall. A steep and narrow, stained timber staircase connects the two floor levels towards the rear of the house. Most windows in the house are multi-paned double-hung sashes, except at the front where French door with louvred shutters have been installed on both the upper and lower levels. Concave metal hoods with decorative timber fretwork brackets are fitted to windows on both side elevations. Original timber joinery such as fireplace surrounds, doors, architraves and skirtings remain throughout the house.Full width timber verandahs extend across both the front and rear elevations of the house and a small upper level balcony projects from its front gable. The verandahs and the balcony all have hipped roofs clad in corrugated iron. The front verandah and balcony both feature decorative scalloped valances. The balcony has cast iron balustrading and immediately beneath it is the main entrance to the house, highlighted by a wide valance decorated with tracery. The front verandah area is almost entirely screened with lattice, while the rear verandah is currently glazed and has been partly enclosed to form a modern bathroom.The existing kitchen wing is a single storey structure, clad with weatherboards, that is attached to the rear verandah of the main house. A small laundry skillion has been attached to the west side of the kitchen. There are three multi-paned double-hung sash windows to the kitchen wing, each fitted with timber and corrugated iron window hoods which are quite different to those on the main house. Internally the walls and coved ceiling are lined with fibrous cement sheeting. The room has two different ceiling heights, the rear section being the lower. A concrete slab has been introduced for flooring. A toilet has been constructed in one corner of the building but is only accessible from the laundry. Adjacent to the kitchen wing is a large brick lined underground water tank to which is connected a hand-operated pump.Towards the south east corner of the property stands the former stables building, currently converted into a garage. The building is clad with wide chamferboards, similar to those used on the main house. A concrete slab replaces the original floor. A large timber fern- house is located at the rear of the property, orientated east–west.\n\n\n== Heritage listing ==\n\nToronto was listed on the Queensland Heritage Register on 21 October 1992 having satisfied the following criteria.The place is important in demonstrating the evolution or pattern of Queensland's history.\nConstructed in c.1863, Toronto, formerly called Devonshire Cottage, was built during a period of great prosperity in Ipswich when the town was considered a leading commercial centre, strongly contesting Brisbane as Queensland's premier city. The size, quality and favourable location of the house overlooking the city is indicative of the influx of wealthy settlers that moved into the area during the early 1860s in direct response to the town's prosperity.The place demonstrates rare, uncommon or endangered aspects of Queensland's cultural heritage.\nThe house is an early, intact and rare surviving example of the Carpenter Gothic style of architecture, a typically used for domestic applications, particularly in the Ipswich region but also throughout Queensland.The place is important in demonstrating the principal characteristics of a particular class of cultural places.\nThe house is an early, intact and rare surviving example of the Carpenter Gothic style of architecture, a typically used for domestic applications, particularly in the Ipswich region but also throughout Queensland.The place is important because of its aesthetic significance.\nThe unusual style of the two storey, timber house gives the building considerable aesthetic significance with its prominent gables, decorative scalloped bargeboards, traceried timber verandah and intimate scale. The building offers an important contribution to the Quarry Street streetscape, which is of interest for the variety and quality of nineteenth century housing close to the Ipswich city centre.\n\n\n== References ==\n\n\n=== Attribution ===\n This Wikipedia article was originally based on \"The Queensland heritage register\" published by the State of Queensland under CC-BY 3.0 AU licence (accessed on 7 July 2014, archived on 8 October 2014). The geo-coordinates were originally computed from the \"Queensland heritage register boundaries\" published by the State of Queensland under CC-BY 3.0 AU licence (accessed on 5 September 2014, archived on 15 October 2014).\n\n\n== External links ==\n Media related to Toronto, Ipswich at Wikimedia Commons", "links": ["Architrave", "Balcony", "Bracket (architecture)", "Brisbane", "Carpenter Gothic", "Chimney", "City of Ipswich", "Congregational church", "Detached house", "Gable", "Geographic coordinate system", "Ipswich, Queensland", "Ipswich City Council", "Queensland", "Queensland Heritage Register", "State of Queensland"]}