{
    "url": "https://en.wikipedia.org/wiki/Tsybin_RSR",
    "title": "Tsybin RSR",
    "summary": "The Tsybin RSR (Reactivnyy Strategicheskiy Razvedchik, Cyrillic Реактивный Стратегический Разведчик, Russian for \"jet strategic reconnaissance\") was a Soviet design for an advanced, long-range, Mach 3 strategic reconnaissance aircraft.\n\n",
    "content": "The Tsybin RSR (Reactivnyy Strategicheskiy Razvedchik, Cyrillic Реактивный Стратегический Разведчик, Russian for \"jet strategic reconnaissance\") was a Soviet design for an advanced, long-range, Mach 3 strategic reconnaissance aircraft.\n\n\n== Development and design ==\nIn 1954, the design bureau headed by Pavel Tsybin started development of a ramjet-powered supersonic strategic bomber, the RS. This design proved impracticable, and a smaller derivative, the 2RS was proposed, which would achieve intercontinental range by being air-launched from a modified Tupolev Tu-95 bomber.This too was unsuccessful, with the aircraft unable to return to base if used on an intercontinental mission, while being incapable of carrying a thermonuclear bomb. The design was therefore revised again to a reconnaissance aircraft capable of operating from conventional runways, the RSR. As ramjets could not be used for take-off, they were replaced by turbofans.The RSR was primarily of aluminium construction, with a long circular-section fuselage, which housed a pressurized cabin for the pilot together with cameras and fuel, with thin, low-aspect-ratio trapezoidal wings. The engines, two Soloviev D-21 turbofans, were mounted at the tips of the wings. The aircraft had a bicycle undercarriage, with outriggers under the engine nacelles. It was planned to cruise at greater than Mach 2 at a height of 20,000 m (65,600 ft) giving a range of 3,760 km (2,340 mi).A simplified, full-sized aerodynamic prototype for the novel layout, the NM-1 was built in 1957. Intended for low-speed handling tests, the NM-1 had a steel-tube fuselage with duraluminium and plywood skinning. This aircraft, powered by two Mikulin AM-5 turbojets first flew on 7 April 1959. Based on the results of these trials, the RSR was redesigned (as the R-020) to make it more manoeuvrable at high altitude (it was proposed to carry out barrel rolls to avoid surface-to-air missiles). More conventional Tumansky R-11 turbojets (the engine used in the MiG-21) replaced the unavailable Soloviev turbofans.  Five R-020 airframes were virtually complete, only awaiting engines by April 1961, with another 10 planned, when Soviet Premier Nikita Khrushchev cancelled the program.\n\n\n== Specifications (R-020) ==\nData from Soviet X-Planes, The Osprey Encyclopedia of Russian Aircraft 1875–1995General characteristics\nCrew: 1\nLength: 28 m (91 ft 10 in)\nWingspan: 10.66 m (35 ft 0 in)\nWing area: 64 m2 (690 sq ft) \nEmpty weight: 9,100 kg (20,062 lb)\nGross weight: 19,870 kg (43,806 lb)\nFuel capacity: 10,700 kg (23,589 lb)\nPowerplant: 2 × Tumansky R-11F turbojet engines, 38.64 kN (8,686 lbf) thrust  each dry, 60.65 kN (13,635 lbf) with afterburnerPerformance\n\nMaximum speed: 2,600 km/h (1,600 mph, 1,400 kn) at 12,000 m (39,370 ft)\nMaximum speed: Mach 2.44\nRange: 4,000 km (2,500 mi, 2,200 nmi)\nService ceiling: 22,500 m (73,800 ft) \nTake-off run: 1,200 m (3,937 ft)\nLanding run: 800 m (2,625 ft) with brake parachute\n\n\n== See also ==\n\nAircraft of comparable role, configuration, and era\n\nBristol 188\nLockheed A-12\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Bibliography ===\n\n\n== External links ==\nTsybin RSR\nTsybin NM-1\nClip  Tsybin  NM-1\nClip Tsybin  NM-1",
    "links": [
        "Air Enthusiast",
        "Air International",
        "Air launch",
        "Aspect ratio (wing)",
        "Barrel roll",
        "Bill Gunston",
        "Bristol 188",
        "Cruise (aeronautics)",
        "Cyrillic",
        "Design bureau",
        "Duraluminium",
        "ISBN (identifier)",
        "ISSN (identifier)",
        "Lockheed A-12",
        "Mach number",
        "MiG-21",
        "Nacelle",
        "Nikita Khrushchev",
        "Pressurized cabin",
        "Ramjet",
        "Reconnaissance aircraft",
        "Runway",
        "Russian language",
        "Soloviev D-21",
        "Soviet",
        "Strategic bomber",
        "Strategy",
        "Supersonic aircraft",
        "Surface-to-air missile",
        "Thermonuclear bomb",
        "Trapezoidal wing",
        "Tumansky R-11",
        "Tumansky R-11F",
        "Tumansky RD-9",
        "Tupolev Tu-95",
        "Turbofan",
        "Turbojet"
    ]
}