{"url": "https://en.wikipedia.org/wiki/Uckfield_Baptist_Church", "title": "Uckfield Baptist Church", "summary": "Uckfield Baptist Church is a Baptist congregation based in the town of Uckfield in East Sussex, England.  Although services now take place in a school, the cause—founded in 1785 by seceders from the nearby Five Ash Down Independent Chapel—had its own chapel from 1789 until 2005, when the building closed and was sold for residential conversion.  The \"simple brick chapel\" was rebuilt in 1874 and has been listed at Grade II for its architectural and historical importance.\nThe church was formed as a result of doctrinal differences which split the congregation at Five Ash Down a year after the church there was founded.  Believers in particular redemption and closed communion left that church, which in common with many Nonconformist churches in this part of Sussex had been founded along Independent Calvinist lines, and formed a separate church at a farm in Uckfield in 1785.  Four years later the present chapel was built.  Another split occurred in the 1920s as the church realigned itself with General Baptist theology, causing Strict Baptist members to secede once more and form a new church which still meets elsewhere in Uckfield.", "content": "Uckfield Baptist Church is a Baptist congregation based in the town of Uckfield in East Sussex, England.  Although services now take place in a school, the cause—founded in 1785 by seceders from the nearby Five Ash Down Independent Chapel—had its own chapel from 1789 until 2005, when the building closed and was sold for residential conversion.  The \"simple brick chapel\" was rebuilt in 1874 and has been listed at Grade II for its architectural and historical importance.\nThe church was formed as a result of doctrinal differences which split the congregation at Five Ash Down a year after the church there was founded.  Believers in particular redemption and closed communion left that church, which in common with many Nonconformist churches in this part of Sussex had been founded along Independent Calvinist lines, and formed a separate church at a farm in Uckfield in 1785.  Four years later the present chapel was built.  Another split occurred in the 1920s as the church realigned itself with General Baptist theology, causing Strict Baptist members to secede once more and form a new church which still meets elsewhere in Uckfield.\n\n\n== History ==\nFive Ash Down Independent Chapel opened in 1784 in the hamlet of Five Ash Down.  Twelve years earlier, Thomas Dicker junior had experienced a religious conversion after attending an open-air service in the nearby town of Uckfield; in 1773 he started holding meetings at his house, and so many worshippers were attracted to these services that his father provided land for a chapel to be built.  From the start, the doctrine of the Five Ash Down cause was Independent Calvinistic, in common with many churches founded in Sussex in the 17th and 18th centuries.  These churches usually started as small-scale meetings of like-minded people who subscribed to the doctrines of limited atonement, predestination and (to a greater extent in Sussex than elsewhere) the ideals of \"16th-century puritanism\".  Itinerant preachers were important figures, and leading members of chapels often helped to found new churches in the surrounding area.Another group with Calvinistic origins, the Strict and Particular Baptists, shared these views but also adhered to the doctrines of believers' baptism and closed communion, and also differed on other matters of ecclesiastical polity.  During the 18th and 19th centuries, many churches with an Independent Calvinist character were reorganised \"without disturbance or disruption\" along Strict Baptist lines, but \"secession was [also] commonplace\".  Many congregations were split by doctrinal disagreement or the appointment of a new pastor with a different interpretation of Calvinism, and new churches were regularly constituted for seceding members.  Of the dozens of Strict Baptist causes established in Sussex over the years, the majority had their origins in the type of Independent Calvinism practised at Five Ash Down.A year after Five Ash Down Chapel opened, its congregation became divided on the subject of baptism.  Members who held the stricter view that only a confession of faith followed by total immersion baptism could permit membership broke away and formed a separate gathering at Lephams (or Leaphams) Bridge Farm east of Five Ash Down.  A Strict Baptist church was constituted at this location on 15 May 1785, and meetings continued there for just over three years.  In 1788, the congregation obtained the lease in copyhold form of a piece of land at the north end of Uckfield High Street.  (Uckfield was at the time a large village on the brink of expansion into a market town.)  A permanent chapel, Uckfield Baptist Church, was built; it was opened on 22 February 1789 by Henry Brooker, the founder of Bethel Strict Baptist Chapel, Wivelsfield, Joseph Middleton from a chapel in Lewes and Thomas Dicker—son of the founder of Five Ash Down Chapel.  The new church was served by a resident pastor until 1800 and then through much of the 19th century.\n\nThe future of the church was secured in 1871 when the church gained the right to acquire title to the land.  This happened in 1872, and on 5 May of that year the site was put in trust \"for the use of Particular Strict Communion Baptists\".  This also prompted the demolition of the original chapel, which was in a poor state of repair, and its replacement with a large new brick building.  This opened on 28 October 1874.In the same way that disagreement between Independent and Strict Baptist interpretations of Calvinist doctrine caused many churches to split, it became common in the 19th and early 20th centuries for secessions to occur in Strict Baptist churches if pastors, influential members or groups of worshippers started to adopt views associated with General Baptists.  They believed in unlimited atonement and the theological ideas of Arminianism as opposed to Calvinism; and \"affiliation and belief were powerful bonds\" in the Calvinist churches of rural Sussex, which could lead to splits even in long-established congregations.  In 1908 a new pastor introduced General Baptist beliefs, and a secession soon took place in 1920: members who wanted to maintain Strict Baptist beliefs left and began to meet at the Foresters Hall in the south of the town.   The building was later registered formally as a place of worship and is still used as a Strict Baptist chapel aligned with the Gospel Standard movement.The 1789 chapel was registered for the solemnisation of marriages on 1 February 1838.  The registration was formally transferred to the new chapel with effect from 24 October 1876, and was cancelled on 15 June 2005.  Worship at the church ceased in that year, when the building was sold for residential conversion and the congregation moved their services to Manor Primary School in Uckfield.  The church is affiliated with Baptists Together (the Baptist Union of Great Britain) and the Evangelical Alliance.  The church's historical records are stored at the East Sussex Record Office at The Keep, Brighton.\n\n\n== Architecture ==\nUckfield Baptist Church was listed at Grade II by English Heritage on 31 December 1982; this defines it as a \"nationally important\" building of \"special interest\".  As of February 2001, it was one of 2,020 Grade II listed buildings, and 2,173 listed buildings of all grades, in the district of Wealden.It is a \"simple brick chapel\" of a single storey, mostly of red brick with some darker brickwork at the front, and four evenly spaced round-arched windows on the side elevation alongside the road.  The windows retain their original glazing bars.  The roof is tiled.  The gabled front has bargeboards in a curved pattern with pierced openings, and the rear elevation is also gabled.  Although rebuilt in 1874, well after the heyday of Georgian architecture, it is \"still Georgian in character\".\n\n\n== See also ==\nList of former places of worship in Wealden\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Bibliography ==", "links": ["Alfriston United Reformed Church", "All Saints United Reformed Church", "Angmering Baptist Church", "Arminianism", "Baptist", "Baptists", "Baptists Together", "Bargeboard", "Bethel Strict Baptist Chapel, Robertsbridge", "Bethel Strict Baptist Chapel, Rye", "Bethel Strict Baptist Chapel, Wivelsfield", "Billingshurst Unitarian Chapel", "Blue Idol", "Bosham United Reformed Church", "Brighton Friends Meeting House", "Brighton Unitarian Church", "Brighton and Hove National Spiritualist Church", "Bristol Road Methodist Church", "Calvinism", "Central Methodist Church, Eastbourne", "Central United Reformed Church, Hove", "Chapel", "Christian denomination", "Churchmanship", "Closed communion", "Congregational church", "Copyhold", "Countess of Huntingdon's Connexion", "Crowborough Community Church", "Ditchling Unitarian Chapel", "Doi (identifier)", "Dorset Gardens Methodist Church", "East Sussex", "Eastgate Baptist Chapel, Lewes", "Ebenezer Chapel, Heathfield", "Ebenezer Particular Baptist Chapel, Hastings", "Ecclesiastical polity", "English Heritage", "Evangelical Alliance", "Evangelicalism", "Five Ash Down", "Five Ash Down Independent Chapel", "French Protestant Church, Brighton", "Galeed Strict Baptist Chapel, Brighton", "General Baptists", "Geographic coordinate system", "Georgian architecture", "Gospel Standard", "Groundbreaking", "Grove Road Strict Baptist Church", "Hastings Tabernacle", "Hastings Unitarian Church", "Herstmonceux Free Church", "Historic England", "Holland Road Baptist Church", "Hope Chapel, Horsham", "Horsham Friends Meeting House", "Horsham Unitarian Church", "Horsted Keynes Mission Hall", "Hounsom Memorial United Reformed Church, Hove", "Hove Methodist Church", "ISBN (identifier)", "ISSN (identifier)", "Ifield Friends Meeting House", "Images of England", "Immersion baptism", "Jarvis Hall, Steyning", "Jireh Chapel, Haywards Heath", "John Sirgood", "Lewes Free Presbyterian Church", "Lewes Friends Meeting House", "Limited atonement", "List of former places of worship in Wealden", "Listed building", "Littlehampton Friends Meeting House", "Madina Mosque, Horsham", "Methodism", "Montpelier Place Baptist Church, Brighton", "National Heritage List for England", "Nikolaus Pevsner", "Nonconformist (Protestantism)", "Optimus Books", "Ote Hall Chapel, Wivelsfield", "Penn's House, Steyning", "Pevsner Architectural Guides", "Places of Worship Registration Act 1855", "Plymouth Brethren", "Predestination in Calvinism", "Presbyterianism", "Protestantism", "Providence Chapel, Hadlow Down", "Providence Strict Baptist Chapel, Burgess Hill", "Puritans", "Quakers", "Reformed Baptists", "Reformed Church of France", "Rehoboth Chapel, Jarvis Brook", "Rehoboth Chapel, Pell Green", "Religious conversion", "Robertsbridge United Reformed Church", "Robertson Street United Reformed Church", "Rye Particular Baptist Chapel", "Sacred architecture", "Secession", "Selina Hastings, Countess of Huntingdon", "Selsey Methodist Church", "Shover's Green Baptist Chapel", "Sine nomine", "Society of Dependants", "South Street Free Church, Eastbourne", "Southover General Baptist Chapel", "Spiritualism", "St Leonard's Baptist Church, St Leonards-on-Sea", "St Leonards-on-Sea Congregational Church", "St Luke's United Reformed Church, Silverhill, Hastings", "St Peter's Church, St Leonards-on-Sea", "Steyning Methodist Church", "Sussex", "Sussex Archaeological Collections", "Sussex Archaeological Society", "The Keep, Brighton", "The London Gazette", "Trinity Congregational Church, Arundel", "Trust law", "Uckfield", "Union Chapel, Brighton", "Unitarianism", "United Kingdom", "United Reformed Church", "Unlimited atonement", "Vernacular architecture", "Vintners Parrot", "Wellington Square Baptist Church, Hastings", "West Street Baptist Church, East Grinstead", "Westgate Chapel, Lewes", "William Huntington (preacher)", "William Penn", "Worthing Tabernacle", "Yale University Press", "Yapton Free Church", "Zion Chapel, Newick", "Zoar Strict Baptist Chapel"]}