{"url": "https://en.wikipedia.org/wiki/Uganda_Martyrs%27_Secondary_School_Namugongo", "title": "Uganda Martyrs' Secondary School Namugongo", "summary": "Uganda Martyrs' Secondary School Namugongo is a privately sponsored secondary school in Uganda. The school is located in Kira Sub-County, Wakiso District, Uganda\n\n", "content": "Uganda Martyrs' Secondary School Namugongo is a privately sponsored secondary school in Uganda. The school is located in Kira Sub-County, Wakiso District, Uganda\n\n\n== History ==\nThe Uganda Martyrs were killed in 1886, but guided the founders, 81 years later, on the name Uganda Martyrs' S.S Namugongo. The inspiration of the martyrs had been such that they are extolled in the school anthem and are implored daily to intercede for and bestow blessings on the school community.\n\n\n=== Financial constraints ===\nThe low enrollment in the beginning meant minimal income. Students were paying UGX:700 as school fee and the teachers earned UGX:250. On many occasions, the school relied on donations from the founders and well-wishers to survive. As any school starting, Namugongo suffered the unenviable option of recruiting \"the failures who were rejects\" in other schools. Mbwega says this explains the years of quietude the school endured. When the financial hardships became unbearable in 1970, Mbwega suggested to the school management that a boarding section for girls be started. The enrollment somewhat grew. \"School with boarding section is easy to manage. The student are confined in one placed and you can monitor them effectively which is not possible for day scholars. That's why all people founding school are concentrating on making them boarding,\" Mbwega contended. The growth of the school to the present status and the development in the locality paint a deceptive picture. One could easily be misled to think that all has been rosy. In the maiden years, the school had one classroom block. Water was drawn from the kayanja(martyrs' pond) or from Mbwega's tank when it rained. Later a borehole was sunk within the school, but now piped water flows to every corner of the school.\nThe beginning was really difficult. The founders would fund-raise to meet the expenses for the teachers out of their love for the school. The students were few and the fees were not enough to meet the cost of management. These gentlemen made a lot of sacrifice for the school. \"The founders gave their all for the sake of the student,\" Mbwega stated in an interview at Lweza parish. By then Mugerwa, then working with Uganda Posts and telecommunications provided his vehicle for all school activities. In the evening, he would be called to attend to an emergency. To explain better Mugerwa's pivotal role and attachment to Namugongo, several student who left the school in the 1970s end up at his home in search for their academic transcripts. Munyagwa was equally instrumental. He would treat the student and teachers in his clinic at Gyanda free of charge while Namazzi gave away her garden harvest to the students. Her son Mr.Semulya Rex is the deputy head master.\n\n\n=== Enter the Sisters ===\nThe mother General appointed Sister Bernadette Mary who had previously been head mistress of St. Joseph S.S Nsambya for nine years. Before Bernadette could take her new assignment there was a doctrinal problem. Her order barred member of the congregation from teaching boys above 12 years of age. After some discussion a middle line was found in allowing the boys already in school complete and leave. At the beginning of 1981, she started work. The enrollment was 100 students. Today Bernadette, 80, is an instructor at Nkokonjeru Novitiate. She recalls that on arrival at Namugongo she found the school very unruly. She read the riot Act which calmed down the students. At the end of 1981 the students would go to church without being asked to pray something that was unheard of previously. The facilities were still modest. The teachers' quarters, dormitories and classroom were few, poorly furnished and incomplete. In 1982, there was a total turn-around. Their concentration was also compromised by the marauding soldiers and booming disco music near the school. \"There was a time when a big number of soldiers fell in and wanted to take some of my girls. I stood up and said 'no coming this way.' But the same girls claimed, 'these are our relatives.' I said whether relatives or not I am not allowing anybody in the school. In the end the soldiers started persecuting me but I resisted and become quite strong.\" Recalled Sr. Sister Bernadette. When they were denied entry the soldiers would waylay them in the school garden. However, when the head teacher discovered this she banned gardening and food was brought from kireka market. But the soldiers were not yet done. \"One day I got up very early to go to kireka to buy food. When I reached the junction in Kyaliwajjala, I met some men standing on a raised ground. I said to them, 'what's wrong?' They said sister go head.' But as I was moving one of them came and said, 'Sister, Sister……you are going to die. Get away from there. The soldiers are coming.' Do you know where I hid? In a mosque! I stayed there for some time until they came for me. That was my experience and it was really a hard one,\" Sister Bernadette recalls Before coming to Namugongo Sr. Bernadette had applied for leave to return to the quietude of Nkokonjeru away from, in her own words \"the popcorn in Kampala\" [rattling of the guns and explosion that characterized Amin's regime].\nAt the end of 1983 her request for leave was granted. She left for Israel where she spent seven years. Sr. Catherine Agnes who had been a teacher under Sister Bernadette wanted to take over but the superiors could not allow her. She eventually got a place in Nsambya. Sister Justine now working with Tororo Hospital succeeded Sr. Bernadette. Sr. Bernadette's best memories focus on the five girls she won for the vocation of being a nun and the name are on her finger tips: Sr. Goretti Nassuna (now secretary to Mother General at Mother Kevin House, Jinja District), Sr. Teopista Adyeri (now head mistress of Busowa Secondary school in Busoga region) Sr. Sylvia Tamale (now in the United States), Sr. Gertrude Nana samba (was secretary in Nsambya but died) and Rose Nakiyonga(who later quit). \"It gives me really pleasure that the school is doing extremely well and it is well recognized by everybody and there are many students coming to it. And I hope this will still continue and that the discipline and standard will be maintained. I hope that these students will put in mind whatever they are taught and become good citizens of tomorrow,\" Sister Bernadette stated in an interview. In 1984, when sister Justine left Emmanuel Kibirige Musoke came in from Stella Maris Nsuube. During his leadership until 1991, he started the advanced level (S.5, S.6). The section started with a class of 14 students. In 1984 he built the first sickbay. He recruited more qualified staff and the following year, 1985, the school was blessed with its first grade I and few grade IIs'. The creative head teacher also established a small-scale poultry farm to generate more funds for the school. The return was used to build the staffroom and the headmaster's office. He was transferred to Naggalama and replaced by Dr. J.C Muyingo\n\n\n== Reputation ==\nThe school is among the leading providers of quality education in Uganda and has consistently resided among the top ten secondary schools in Uganda.\n\n\n== References ==\n\n\n== External links ==\nUMSSN's Webpage\nLocation of UMSSN at Google Maps", "links": ["Abayita Ababiri", "Absa Bank Uganda Limited", "Aerolink Uganda", "African Bible College (Uganda)", "Air Serv Limited", "Akright City", "Akright Projects Limited", "Amina Moghe Hersi", "Apolo Nsibambi", "Arthur Sserwanga", "Banda, Uganda", "Banga, Entebbe", "Bank of Africa Uganda Limited", "Basilica of the Uganda Martyrs, Namugongo", "Basketball", "Bobi Wine", "Buddo", "Bukasa Inland Port", "Bulindo", "Buloba", "Busoga", "Busukuma", "Bweyogerere", "Cairo Bank Uganda", "Centenary Bank", "Central Region, Uganda", "Christopher Evans (musician)", "Civil Aviation Authority of Uganda", "CoRSU Rehabilitation Hospital", "DFCU Bank", "Dennis Galabuzi Ssozi", "EFC Uganda Limited", "Ecobank (Uganda)", "Entebbe", "Entebbe Children's Surgical Hospital", "Entebbe General Hospital", "Entebbe International Airport", "Entebbe Military Hospital", "Entebbe–Kampala Expressway", "Equity Bank Uganda Limited", "FINCA Uganda Limited", "Finance Trust Bank", "Gayaza", "Gayaza High School", "Gayaza–Ziroobwe Road", "Geographic coordinate system", "Gilbert Bukenya", "Glaydah Namukasa", "Gombe, Wakiso, Uganda", "Guaranty Trust Bank (Uganda)", "Hakim Sendagire", "Herman Kasekende", "High school", "Hoima–Kampala Petroleum Products Pipeline", "Idi Amin", "Imperial Botanical Beach Hotel", "Imperial Golf View Hotel", "Imperial Resort Beach Hotel", "International Specialized Hospital of Uganda", "Israel Kibirige Ssebunya", "J.C Muyingo", "Jinja District", "Julia Sebutinde", "Kabaka of Buganda", "Kabojja", "Kajjansi", "Kajjansi Airport", "Kakiri", "Kampala Industrial and Business Park", "Kampala Northern Bypass Highway", "Kampala Outer Beltway", "Kampala Southern Bypass Highway", "Kampala–Bombo Expressway", "Kampala–Busunju Expressway", "Kampala–Entebbe Road", "Kampala–Gayaza Road", "Kampala–Hoima Road", "Kampala–Jinja Expressway", "Kampala–Jinja Highway", "Kampala–Masaka Road", "Kampala–Mityana Road", "Kampala–Mpigi Expressway", "Kasangati", "Kasubi Tombs", "Katabi", "Katalemwa", "Kawanda", "Kenya–Uganda–Rwanda Petroleum Products Pipeline", "Kigo, Uganda", "Kigulu, Uganda", "Kijabijo", "Kimwanyi", "King's College Budo", "Kira Town", "Kireka", "Kirinnya", "Kisubi", "Kisubi Hospital", "Kitikifumba", "Kitukutwe", "Kyaliwajjala", "Kyaliwajjala–Kira–Kasangati–Matugga Road", "Kyengera", "Lake Victoria", "Lake Victoria Serena Resort", "Louis Kasekende", "Lubigi", "Lubowa", "Lugonjo", "Luwagga Kizito", "Lweeza", "Madhvani Group", "Mahathi Fuel Transport and Storage Depot", "Makerere University Teaching Hospital", "Mandela National Stadium", "Martin Ondeko", "Masulita", "Matugga", "Matugga–Kapeeka Road", "Maya, Uganda", "Mbalwa", "Middle school", "Moriah Aviation Training Centre", "Mulawa, Uganda", "Mutundwe", "Naalya", "Nabbingo", "Nabweru", "Naggalama", "Najjera", "Namanve", "Namayumba", "Namugoga Solar Power Station", "Namugongo", "Namugongo Ring Road", "Namulonge", "Namulonge Airport", "Nangabo", "Nansana", "Nelson Sewankambo", "Netball", "Nkokonjeru", "Nkumba University", "Nsambya", "Nsangi", "Nsasa", "Opportunity Bank Uganda", "Orient Bank", "Pangea Aviation Academy", "Parish", "PostBank Uganda", "President of Uganda", "Roofings Group", "Rosemary Seninde", "Rosemary Tumusiime", "Samson Kisekka", "Sentema", "Ssabagabo", "Ssisa", "St. Mary's College Kisubi", "Stanbic Bank Uganda Limited", "Table tennis", "Telecommunications", "Tondeka Metro Bus Service", "Tororo", "Trinity College Nabbingo", "Ugachick Limited", "Uganda", "Uganda Airlines", "Uganda Clays Limited", "Uganda Electricity Transmission Company Limited", "Uganda Martyrs", "Uganda National Medical Stores", "Umeme", "University of Kisubi", "Uro Care Hospital", "Volleyball", "Wakiso", "Wakiso District", "Wakiso Town", "Wampeewo", "Wayback Machine", "Zana, Uganda"]}