{"url": "https://en.wikipedia.org/wiki/Unnamed_Unknown", "title": "Unnamed Unknown", "summary": "UNNAMED UNKNOWN (Sometimes written Unnamed Unknown) is a Danish alternative/pop rock band from Nyborg on Fyn. The band officially started in the beginning of 2009, but former drummer Mathias Hansen and current frontman Zachary Ray had already played together in the beginning of 2008. Along came bass player Casper Clausen and former guitarist Martin Christiansen. This quartet produced around 23 tracks and recorded it themselves at Zacharys room. But they only manage to land one gig together with another local band from Nyborg.\nAfter personal disagreements, in the middle of 2009, Mathias and Martin were dismissed from the quartet and current drummer Frederik Hansen was new man behind the drumset. From that on, their career started in a serious way, and since then they have played at numerous festivals, gave plenty of concerts, professionally recorded an EP, published a lot of singles and uploaded a music video which has gotten positive criticism.\nTheir music style can best be described as high tempo and energetic, because they jump and dance around a lot on the stage. Equally as high tempoed and energetic is their music, which is full of tight well played drum fields and a lot of guitar riffs. Their music is exploding with energy, and another characteristic is that they have a simple and plain sound which makes the music extremely catchy.", "content": "UNNAMED UNKNOWN (Sometimes written Unnamed Unknown) is a Danish alternative/pop rock band from Nyborg on Fyn. The band officially started in the beginning of 2009, but former drummer Mathias Hansen and current frontman Zachary Ray had already played together in the beginning of 2008. Along came bass player Casper Clausen and former guitarist Martin Christiansen. This quartet produced around 23 tracks and recorded it themselves at Zacharys room. But they only manage to land one gig together with another local band from Nyborg.\nAfter personal disagreements, in the middle of 2009, Mathias and Martin were dismissed from the quartet and current drummer Frederik Hansen was new man behind the drumset. From that on, their career started in a serious way, and since then they have played at numerous festivals, gave plenty of concerts, professionally recorded an EP, published a lot of singles and uploaded a music video which has gotten positive criticism.\nTheir music style can best be described as high tempo and energetic, because they jump and dance around a lot on the stage. Equally as high tempoed and energetic is their music, which is full of tight well played drum fields and a lot of guitar riffs. Their music is exploding with energy, and another characteristic is that they have a simple and plain sound which makes the music extremely catchy.\n\n\n== Name ==\nUnnamed Unknown was created when people started asking what the band was called. Then it was a big theme in the everyday life that you could never be secure of what you do, or what will happen tomorrow, especially not in a young age. Even in the adult world are we not secure and safe. And with those thoughts in mind, Unnamed Unknown was becoming more and more personal for the band members. Since then, the name has been much criticized as inappropriate, now that they have won numerous contents and therefore aren’t “Unknown” anymore.\n\n\n== Band members ==\nZachary Ray Assaiante (Vocal and guitar)\nFrederik Hansen (Drums)\nCasper Clausen (Bass and backup vocals)\n\n\n=== Former members ===\nMartin Christiansen (Guitar)\nMathias Hansen (Drums)\n\n\n== Festivals and gigs that Unnamed Unknown has played on or has been booked to do, by March 2012 ==\nVig Festival (Denmarks 4th largest festival) The band won that honor by winning the audition in competition held by the festival.\nJelling Festival (Denmarks 3rd largest festival after Roskilde Festival (1st) and Skanderborg Festival (2nd)\nKildemoes Festival\nKlar Festival\nBremen in Copenhagen. Søren Huss from the band Saybia, represented the band at a gig for upcoming bands where Simon Kvamm from Nephew were the host, and later went down on his knees to praise the band. At Bremen they managed to get the audience to dance and stand up from the chair, even though the place mainly has seats inside and no real floor for dancing.\nGodset in Kolding (Praised as Denmarks Best Concerthall)\nPosten in Odense, as warm-up band to Norwegian Honningbarna\nMagasinet in Odense\nThe Woken Treehouse\nKansas City in Odenseand many more\n\n\n== Mascot ==\nThe skeleton Gribbi is the official mascot for Unnamed Unknown. It was introduced after the reshuffle in the band's lineup. Gribbi is often seen with a hat on, and is always introduced on the stage, with a small note from the frontman.\n\n\n== Other media ==\nIn 2011 the band was contacted by a radio station in the United States who would like to play their music in the local radio in Rhode Island.\nIn the summer 2012, Unnamed Unknown will have their music played as a commercial tune, for Naked Fruit, which is a local producer of fresh juice, just south of Nyborg.\n\n\n== References ==", "links": ["Alternative rock", "Denmark", "Extended play", "Fyn", "Jelling", "Juice", "Nephew", "Nyborg", "Odense", "Pop rock", "Rhode Island", "Saybia", "Simon Kvamm", "Vig Festival"]}