{
    "url": "https://en.wikipedia.org/wiki/Up_the_Country_(novel)",
    "title": "Up the Country (novel)",
    "summary": "Up the Country : A Tale of Early Australian Squattocracy (1928) is a novel by Australian writer Miles Franklin.\nOriginally published as by \"Brent of Bin Bin\", this novel forms the first part of a trilogy, followed by Ten Creeks Run (1930) and Cockatoos (1955).",
    "content": "Up the Country : A Tale of Early Australian Squattocracy (1928) is a novel by Australian writer Miles Franklin.\nOriginally published as by \"Brent of Bin Bin\", this novel forms the first part of a trilogy, followed by Ten Creeks Run (1930) and Cockatoos (1955).\n\n\n== Story outline ==\nThe novel is set somewhere in the southeast of New South Wales, in Snowy River country, and follows the story of two families, the Pooles and the Mazeres, and their neighbors.\n\n\n== Critical reception ==\nIn a major review of the novel in The Brisbane Courier literary critic Nettie Palmer noted that this book helped fill a missing section of books about Australia, \"books about the Australian pioneering that was not just a struggle with drought in the Never Never.\" She continued: \"The book is something between a novel and reminiscences, rather formless and with an overcrowded canvas; and life bubbles up through it at every part.\"A reviewer in The West Australian was also impressed with the book: \"There have been few books of the kind published in recent years which can compare in stark simplicity of style and vivid description with Brent of Bin Bin's tale of the early Australian squattocracy, in which, though presumably the names of places and of people are disguised, there are many unmistakable evidences of truth and of actual events that happened in the days of long ago.\"\n\n\n== See also ==\n1928 in Australian literature\n\n\n== References ==",
    "links": [
        "1928 in Australian literature",
        "All That Swagger",
        "Back to Bool Bool",
        "Bring the Monkey",
        "Cockatoos (novel)",
        "English language",
        "Miles Franklin",
        "My Brilliant Career",
        "My Career Goes Bung",
        "Nettie Palmer",
        "Old Blastus of Bandicoot",
        "Pioneers on Parade",
        "Prelude to Waking",
        "Some Everyday Folk and Dawn",
        "Ten Creeks Run",
        "William Blackwood & Sons"
    ]
}