{
    "url": "https://en.wikipedia.org/wiki/Viplav_Tripathi",
    "title": "Viplav Tripathi",
    "summary": "Colonel Viplav Tripathi (20 May 1980 -  13 November 2021) was an Indian Army officer, killed in an ambush by Manipuri militants. In that ambush, Triptathi's wife Anuja Shukla and son Abeer were also killed.",
    "content": "Colonel Viplav Tripathi (20 May 1980 -  13 November 2021) was an Indian Army officer, killed in an ambush by Manipuri militants. In that ambush, Triptathi's wife Anuja Shukla and son Abeer were also killed.\n\n\n== Early life and career ==\nBorn on May 20, 1980, Raigarh of Chattishgarh, Viplav studied in Sainik School in Rewa of Madhya Pradesh. Viplav's father Subhash Tripathi is a journalist and his mother Asha Tripathi was a librarian. Viplav's grandfather Kishori Mohan Tripathi was a Freedom Fighter and Member of parliament (MP) of India. Viplav was inspired to join the army by his grandfather in his childhood ages.Viplav's younger brother Anay Tripathi is also an Indian Army officer, serving as Lieutenant Colonel in Shillong, Meghalaya.\n\n\n== Military career ==\nTripathi was selected to National Defence Academy (NDA) and moved to Indian Military Academy for training. Tripathi was commissioned as a Lieutenant in the Kumaon Regiment in 2001. He had also taken courses in Defence Services Staff College.Tripathi also served in Mizoram before he was transferred to Manipur in 2021. Tripathi, who successfully led many major operations seizing drugs and illegal weapons, was named by colleagues as  \"josh machine\".\n\n\n== The ambush ==\nOn the morning of 13 November 2021, Colonel Tripathi, serving as the Commanding officer of 46 Assam Rifles, and his team was going to the battalion headquarters at Khunga after returning from the Behiang border post that is near to Myanmar border. Tripathi also took his wife Anuja and son Abir in his official vehicle, having no idea about what is going to happen on his way.When the Triptahi's convoy reached the Sekhan village of Churachandpur district, the convoy came under a sudden and heavy ambush led by an Improvised explosive device (IED) blast following heavy firings from dense forest, giving soldiers no time to retaliate. In the ambush, Colonel Tripathi, his wife Anuja, son Abir, and four riflemen named Suman Swargiary, Khatnei Konyak, R.P. Meena, and Shyamal Das were killed on the spot.Claiming responsibility for the ambush Manipuri militant group People's Liberation Army of Manipur (PLA), said that they were not aware of any civilian's presence in the convoy. They also said that they follow the Geneva Conventions of 1949 and they would have aborted the ambush if they were aware of the presence of women and children.\n\n\n== NIA investigation ==\nThe Manipur Chief minister announced that the government will request the National Investigation Agency (NIA) to probe the incident of ambush. After getting intimation from the Manipur government, the National Investigation Agency took charge of the probe and registered a case under several sections of the Indian Penal Code (IPC) and the Unlawful Activities (Prevention) Act (UAPA).During the investigation to date, the National Investigation Agency found that 10 militants were involved in the attack. As the militants are still not apprehended, the agency announced cash rewards if anyone can share details to apprehend the militants. The agency also released photos of the militants.The National Investigation Agency announced a cash reward for the accused as Rs 8 Lakh for Lt. Col. Chaoyai alias Pukhrambam Mani Meetei  alias Joy (Resident of: Seraou Mayai Leikai, Kakchin District, Manipur), and Sagolsem Inaocha alias Ranjit Naorem alias Inaocha alias Anganba Mongang (Resident of: Kakwa Naorem Leikai, PS: Singjamei, Imphal West, Manipur), Rs 6 Lakh for Sanatomba (Resident of Tentha Village, District: Thoubal, Manipur), Rs 4 Lakh for Khaba (Resident of: Either Khurai Area, PS: Porompat or Andro Area, PS: Andro, Manipur), Joseph, Rocky, Balin, Khwairakpa (Resident of: Bashikhong Area, Imphal East, Manipur), Nongyai alias Nongphai(details not known), and Kanta(details not known). The agency also said that the name of informants will be kept confidential and the accused are using other aliases.\n\n\n== Notes ==\nDeclaration of cash reward against the wanted accused persons, NIA HQRS, 06-01-2022\n\n\n== References ==",
    "links": [
        "Asian News International",
        "Assam Rifles",
        "Chhattisgarh",
        "Chief minister",
        "Churachandpur district",
        "Commanding officer",
        "Deccan Herald",
        "Defence Services Staff College",
        "Firstpost",
        "Gulf News",
        "Hindustan Times",
        "Improvised explosive device",
        "India TV",
        "India Today",
        "Indian Army",
        "Indian Military Academy",
        "Indian Penal Code",
        "Kishori Mohan Tripathi",
        "Kumaon Regiment",
        "Lieutenant",
        "Lieutenant colonel",
        "Madhya Pradesh",
        "Manipur",
        "Meghalaya",
        "Member of parliament",
        "NDTV",
        "National Defence Academy (India)",
        "National Investigation Agency",
        "News18",
        "People's Liberation Army of Manipur",
        "Raigarh",
        "Sainik School, Rewa",
        "Shillong",
        "ThePrint",
        "The Hindu",
        "The Indian Express",
        "The Statesman (India)",
        "The Week (Indian magazine)",
        "The Wire (India)",
        "Unlawful Activities (Prevention) Act"
    ]
}