{"url": "https://en.wikipedia.org/wiki/Virgilio_Barco_Isakson", "title": "Virgilio Barco Isakson", "summary": "Virgilio Barco Isakson (born 1965) is a Colombian economist and political scientist. Barco Isakson is currently Latin America Director at Acumen, a leading impact investing fund that focuses on tackling global poverty.", "content": "Virgilio Barco Isakson (born 1965) is a Colombian economist and political scientist. Barco Isakson is currently Latin America Director at Acumen, a leading impact investing fund that focuses on tackling global poverty.\n\n\n== Career ==\nBarco Isakson holds a Bachelor of Arts in government from Harvard University (1987), a Master of Science in management from the Massachusetts Institute of Technology, and a Master of Arts in economics from New York University. During his freshman year of college, he lived in Thayer Hall with Eric Prenowitz.\nBarco Isakson served as executive director of the Banca de Inversión Social, a nonprofit organization that is at the forefront of impact investing in Colombia. From 2006 to 2010, he led Invest in Bogota, a public-private partnership that promotes foreign direct investment to the Greater Bogotá region. Barco Isakson also headed the privatization unit at the Colombian Ministry of Finance and Public Credit and was an advisor on local economic development for the country's planning department. He has also worked as a management consultant at Booz Allen Hamilton in Brazil and as a financial analyst at Citibank in Spain.\nBarco Isakson is co-founder and board president of Colombia Diversa, a Bogotá-based nonprofit organization that advocates for LGBT rights in Colombia.  He also sat on the board of Instiglio, a nonprofit that is promoting the use of impact bonds to address social and environmental challenges in developing countries.\n\n\n== Personal life ==\nBarco Isakson was born to former Colombian president Virgilio Barco Vargas and Carolina Isakson Proctor. Barco Isakson is the youngest of four: Carolina, Julia, and Diana. He lives in Bogotá with his partner, Andrew Dier, with whom he has been together since 1998.\n\n\n== References ==", "links": ["Acumen (organization)", "Bachelor of Arts", "Bogotá", "Booz Allen Hamilton", "Carolina Barco Isakson", "Carolina Isakson Proctor", "Citibank", "Colombia Diversa", "Colombian people", "Economist", "Harvard University", "Impact investing", "Massachusetts Institute of Technology", "Master of Arts", "Master of Science", "Ministry of Finance and Public Credit (Colombia)", "New York University", "Political scientist", "Spanish name", "Surname", "Thayer Hall", "Virgilio Barco Vargas"]}