{"url": "https://en.wikipedia.org/wiki/Vuokko_Nurmesniemi", "title": "Vuokko Nurmesniemi", "summary": "Vuokko Hillevi Lilian Eskolin-Nurmesniemi (born 12 February 1930 in Helsinki) is a Finnish textile designer. She is best known for her work as one of the two leading designers of the Marimekko company. Her signature striped Jokapoika shirt helped to make the company's name.", "content": "Vuokko Hillevi Lilian Eskolin-Nurmesniemi (born 12 February 1930 in Helsinki) is a Finnish textile designer. She is best known for her work as one of the two leading designers of the Marimekko company. Her signature striped Jokapoika shirt helped to make the company's name.\n\n\n== Biography ==\nVuokko Eskolin-Nurmesniemi studied ceramics at the Institute of Industrial Arts (in Finnish: Taideteollinen oppilaitos) in Helsinki, Finland. After graduating, she designed glassware and ceramics for Arabia and Nuutajärvi. In 1957, she received a gold medal at the Milan Triennial XI for her glassware.Vuokko Eskolin-Nurmesniemi joined the Finnish company Marimekko in 1953. She designed patterns for many of their printed fabrics in the 1950s; together with Maija Isola, she was responsible for most of Marimekko's patterns. Nurmesniemi's signature product was a simply striped red and white shirt named Jokapoika, in 1956; she went on to create a large number of striking designs.Nurmesniemi left Marimekko in 1960 due to conflicts with Marimekko founder Armi Ratia. She founded her own company, Vuokko Oy, in 1964, and designed textiles as well as ready-to-wear clothing and accessories. This company closed its doors in 1988. In 1990 Nurmesniemi founded a second company, Vuokko Nurmesniemi Oy.She received the Milan Triennial XIII grand prix and Lunning Prize for design in 1964, the Prince Eugen Medal in 1986 and the Kaj Franck Design Prize in 1997.She was married to designer Antti Nurmesniemi until his death in 2003.\n\n\n== Museums and exhibitions ==\n\nA selection of her designs are in the permanent collection at the Metropolitan Museum of Art.In the summer of 2009, the Röhsska museum in Gothenburg, Sweden, held an exhibition of her designs.\n\n\n== Reception ==\nTed Hesselbom of the Swedish Röhsska Museum wrote of Vuokko's Retrospective in 2009:\nVuokko Nurmesniemi's collections for fashion and interior design have a strong graphic and colourful design. Their style and expression is clearly from the same era as Andy Warhol, Mark Rothko and Roy Lichtenstein.\n\n\n== Bibliography ==\nJackson, Lesley. Twentieth Century Pattern Design. Princeton Architectural Press, 2007. ISBN 978-1-56898-712-5\n\n\n== References ==\n\n\n== External links ==\nUS.Marimekko.com: Vuokko Eskolin-Nurmesniemi\nMetropolitan Museum of Art: Vuokko Eskolin-Nurmesniemi (images of Vuokko designs)", "links": ["Ada Dietz", "Alexander Girard", "Angela Adams", "Anna Maria Garthwaite", "Antti Nurmesniemi", "Arabia (brand)", "Armi Ratia", "Astrid Sampe", "Bernard Adeney", "Bernat Klein", "Bronwyn Bancroft", "C. F. A. Voysey", "Celia Birtwell", "Designer", "Dorothy Liebes", "Elenhank", "Ernest Race", "Ethel Mairet", "Fabrics", "Finland", "Franco Scalamandré", "Georgina von Etzdorf", "Gothenburg", "Graziela Preiser", "Hans Krondahl", "Helen Berman", "Helsinki", "Hiroshi Awatsuji", "ISBN (identifier)", "Inside Outside (Petra Blaisse)", "Jack Lenor Larsen", "Joan Glass", "John Henry Dearle", "Jussi Saukkonen", "Kaj Franck Prize", "Kvadrat (company)", "Laura Ashley", "Lily Goddard", "Lucienne Day", "Lunning Prize", "Maija Isola", "Marianne Straub", "Marimekko", "Mario Prassinos", "Mary White (textile designer)", "May Smith (textile designer)", "Meera Mehta", "Metropolitan Museum of Art", "Milan Triennial XI", "Milan Triennial XIII", "Patterns", "Prince Eugen Medal", "Ruth Reeves", "Silver Studio", "Siona Shimshi", "Sue Timney", "Textile", "Thelma Johnson Streat", "Up Tied", "VIAF (identifier)", "Valerie Campbell-Harding", "Viola Gråsten", "Wayback Machine", "William Kilburn", "William Morris"]}