{"url": "https://en.wikipedia.org/wiki/Wabash_Cannon_Ball_(train)", "title": "Wabash Cannon Ball (train)", "summary": "The Wabash Cannon Ball was a passenger train on the Wabash Railroad that ran from 1950 to 1971. The train was named after the song \"Wabash Cannonball\". It was the second train to bear the name \"Cannon Ball\"; the first was the fast express Cannon Ball, which ran in the late 1800s to the early 20th century.", "content": "The Wabash Cannon Ball was a passenger train on the Wabash Railroad that ran from 1950 to 1971. The train was named after the song \"Wabash Cannonball\". It was the second train to bear the name \"Cannon Ball\"; the first was the fast express Cannon Ball, which ran in the late 1800s to the early 20th century.\n\n\n== History ==\n\n\n=== First Cannon Ball trains ===\nThere had been several Wabash Cannon Ball trains traveling throughout the middle and western United States from as early as the 1880s. The first Cannon Ball express train traveled from Chicago, Illinois, southwest to El Paso, Texas. This express train traveled throughout the western part of the Midwest and the eastern part of the southwestern United States. In addition to traveling on the Wabash Railroad, it also traveled on the \"Great Rock Island Route\" in the late 1800s and into the early 1900s.\n\n\n=== Song and reinstituting of a new train and new route ===\nJ. A. Roff wrote a song, The Great Rock Island Route, in the 1880s. In the 1930s, after a rewrite as Wabash Cannonball, country and western singer Roy Acuff gained great popularity with the song. The Wabash Railroad in 1950 resurrected the train on an entirely different route on the railroad between two major Midwestern cities, St. Louis, Missouri, and Detroit, Michigan. The new route hosted one of the Wabash company's prestige trains. The Wabash Cannonball, number 4 eastbound and number 1 westbound, had a parlor car, a dining-lounge car, chair cars and reclining seat coaches. In St. Louis it made connections with the Wabash's City of Kansas City, bound for Kansas City, and the Wabash's City of St. Louis for Denver and points further west. A nighttime counterpart, the Detroit Limited, made the trip eastbound, and another night train counterpart, the St. Louis Limited, went westbound on the same route.\n\nThe train was under the administration of the Norfolk and Western Railway from 1964, as the Wabash company merged with the N&W that year. The train did not survive the conversion of private passenger lines to administration of the trains by Amtrak in May, 1971.\n\n\n== Major stops of the Wabash Cannon Ball ==\nSt. Louis, Missouri (Union Station)\nSt. Louis, Missouri (Delmar Boulevard Station)\nDecatur, Illinois (Wabash Station)\nDanville, Illinois\nLafayette, Indiana\nLogansport, Indiana\nFort Wayne, Indiana\nDetroit, Michigan (Fort Street Union Depot)\n\n\n== Notes ==\n\n\n== External links ==\n1952 schedule of the Wabash Cannon Ball, with consists, at 'Streamliner Schedules'", "links": ["Amtrak", "Birmingham Special", "Blue Bird (train)", "Cannonball (LIRR train)", "Cavalier (N&W train)", "Chicago, Illinois", "City of Kansas City", "City of St. Louis (train)", "Country and western", "Decatur, Illinois", "Decatur station (Illinois)", "Delmar Boulevard station", "Detroit, Michigan", "El Paso, Texas", "Fort Street Union Depot", "Fort Wayne station", "ISBN (identifier)", "Illinois", "Indiana", "Inter-city rail", "Michigan", "Midwestern United States", "Missouri", "Norfolk and Western Railway", "Ohio", "Parlor car", "Pelican (train)", "Pocahontas (train)", "Powhatan Arrow", "Roy Acuff", "Sleeping car", "Southland (train)", "St. Louis, Missouri", "Tennessean (train)", "Tolono, Illinois", "Track gauge", "Union Station (St. Louis)", "Wabash Cannonball", "Wabash Railroad"]}