{
    "url": "https://en.wikipedia.org/wiki/We_Are_Dating_Now",
    "title": "We Are Dating Now",
    "summary": "We Are Dating Now is a 2002 South Korean television series starring Chae Rim and So Ji-sub. It aired on SBS from January 16 to March 7, 2002 on Wednesdays and Thursdays at 21:55 for 16 episodes.",
    "content": "We Are Dating Now is a 2002 South Korean television series starring Chae Rim and So Ji-sub. It aired on SBS from January 16 to March 7, 2002 on Wednesdays and Thursdays at 21:55 for 16 episodes.\n\n\n== Synopsis ==\n\n\n=== Youth ===\nNeighbours Ho-jung and Kyo-in as youths have developed a quarrelsome relationship. As a youth Ho-jung made several blind dates, namely Jae-young, Hyun-min, Jin-sung and Jeong Hoon. Cha-hee had also dated Kyo-in during their youth, who rejected her. The girls and their family missed Kyo-in and Ho-jae when they entered the army together.\nTheir friends, Soo-ji and Ho-jae, met stiff opposition from their parents since their youth when they developed relations. When Ho-jae was about to be enrolled into the army, Soo-ji ran away from home for a day, even forgetting to put on her shoes. This prompted Ho-jae to remove his shoes and lend it to Soo-ji, suffering the cold winter road until they reach a shoe retail shop where he bought a new pair of black shoes for Soo-ji. At night, when they slept in a hotel, Soo-ji promised that she would send him 1000 letters, daily, during his entire term in the army, by presenting a red card with the number \"1000\" drawn on a red heart. This act affectionately touched Ho-jae and he gave her a hug.\n\n\n=== Adult life ===\nAfter serving the army, Kyo-in was employed into a company together with his friend Gun-woo, whom he first met when they helped a fellow employee-to-be during an interview who had taken ill, and they became friends from there. Ho-jung herself has already become an established photographer, and had graduated from university.\nHowever, things turned sour when Ho-jung turned her sights to Gun-woo, and once Gun-woo and Kyo-in fought at their office for Ho-jung.\nMeanwhile, Ho-jae was inspired to become a model upon meeting Cha-hee, who had already a well-established modelling career. He posed for a magazine as a replacement model, and later asked for money from his parents to study in a modelling institute. At this time, Ho-jae proposed to Soo-ji, but they met with stiff opposition from their parents. The couple then approached a statue of Jesus Christ, pleading him to permit their relation.\nThe couple bought a small, cheap flat unit on the top floor of a flat, shortly after Soo-ji's parents forsook her. A few months later, Ho-jae bought a car, which made Soo-ji extremely happy.\nHo-jae's character eventually turned for the worse when he began frequenting nightclubs with his friends, frequently returning home drunk. An angry Soo-ji isolated him, but under Cha-hee's direction, she arranged a private dinner at home, wearing an evening gown as an attempt to entice Ho-jae into her lure. When Ho-jae returned home, he was rather shocked upon seeing Soo-ji's unusual behaviour. However, his attitude briefly changed for the better when he realised that Soo-ji wanted to spend a romantic night with him, saying, \"Why didn't you say earlier? I am an expert in this field!\".\nHearing that, Soo-ji's mood changed for the worse, and asked Ho-jae to make his point clear. Ho-jae's attempt made Soo-ji even angrier, and she pushed him away when he tried to approach her.\nHo-jung finally gave up on Seon-woo, and her mother returned the wedding ring given to Ho-jung to him. The two later met, and Seon-woo gave her an ice-cream treat, saying that ice-cream is good for people who are depressed. That night, he brought her to a karaoke, and sang a song. Ho-jung looked on sympathetically.\n\n\n=== Sweet endings ===\nFinally, Ho-jae and Soo-ji got married in a mini-celebration with the approval of their parents. Soo-ji and Ho-jae bumped into each other when they did the traditional Korean bow, which created a comical atmosphere. The friends were a little surprised when Kyo-in showed up late.\nOne night, some time later, while returning home from work, Kyo-in and Ho-jung happened to pass the same shop window and both thought of their past memories. Both of them later happened to be on the same subway platform, Kyo-in tried to give chase when Ho-jung got on the train but the doors closed as he rushed towards it.\nKyo-in got on the next train and sat on the stairs that he visited frequently with Ho-jung. As he was about to leave, Ho-jung called out to him. The couple sat next to each other on the stairs, and asked about Seon-woo. Ho-jung admitted that she occasionally contacts Seon-woo.\nHo-jung notices a ring on Kyo-in's little finger and comments on it. Kyo-in removed the ring from his hand, and said that he had bought it a long time ago for his love. Then he says that he'll give it to the woman that he'll love in the future. Ho-jung protests that no woman will accept it with that kind of history. Kyo-in puts the ring on her palm and tells her that she doesn't have to wear but to please keep it for him. Ho-jung stares at it, realizing that the woman he had bought the ring for many years ago was her. She slowly puts it on her finger and smiles at him. The couple gently  nudge their heads together and smile happily.\n\n\n== Cast ==\nChae Rim as Yoon Ho-jungThe older sister of Ho-jae, she is interested in photography and later becomes a photographer after winning a contest. In her youth Ho-jung had several blind dates, namely Jae-young, which ended up Ho-jung splashing a cup of water at his face; Hyun-min; Jin-sung, a man with tyrannical behaviour who pressured Ho-jung to marry him and attempted to throw her into the sea after she refused; and Jeong Hoon, a married man. Later, Ho-jung dated Jeon-woo, which leads to rivalry with Kyo-in, the man she finally chooses.So Ji-sub as Choi Kyo-inIn his youth Kyo-in had dated Cha-hee, whom he later rejected before serving the army. At eighteen, Kyo-in entered the army with his best friend Ho-jae, the younger brother of Ho-jung, the girl whom he loves. After serving the army, Kyo-in later worked in the same company with Jeon-woo and has a rivalry with him for Ho-jung. Ho-jung later chooses Kyo-in as her partner.Choi Yoon-young as Kang Cha-heeCha-hee worked as a stewardess and dated Kyo-in, who eventually rejected her. A hurt Cha-hee severed contact with Ho-jung and Kyo-in for three years, before Ho-jae rediscovered her working as a model.Kwon Sang-woo as Yoon Ho-jaeThe younger brother of Ho-jung, and the best friend of Kyo-in. In his youth he had been very reluctant to attend university, and secretly became a swimming trainer by showing his great body to the owner, impressing her in the process. His mother later discovered his secret job and forced Ho-jae resign. At this time he liked Soo-ji, but experienced some turbulence in his relationship with her when he started a modelling career and frequented night clubs (for a brief period of time). They later married under their parents' consent and have a daughter.Kim Na-woon as Choi Kyo-sunThe older sister of Kyo-in. She worked as a clerk, and attends to Kyo-in's needs. The siblings had a father living in the countryside.Lee Ui-jeong as Kang Soo-jiHo-jae's love interest, whom he calls \"baby\". Both Soo-ji herself and Ho-jae had commented on her bad looks. She shows deep affection for Ho-jae, despite the vehement objections from her parents, particularly when he was about to serve in the army. However, their relationship briefly wavered when Ho-jae frequented nightclubs and came back drunk. They later married with their parents' consent and have a baby daughter.Han Jin-hee as Yoon Ji-haeFather of Ho-jae and Ho-jung. He works as a road sweeper, and once got into  debt, when he had to use his house as credit. Unlike his wife, he was more accepting of Ho-jae's relationship with Soo-ji as well as Ho-jung's with Kyo-in.Kim Young-ae as Yeol-sunMother of Ho-jae and Ho-jung. She works as a taxi driver. For a long time she wanted Ho-jung to date Seon-woo instead of Jeon-woo partly because of his material wealth. She frequently fought with Tae-hee, especially when she visited their home.Sunwoo Eun-sook as Tae-heeMother of Soo-ji. For a long time, she vehemently objects to Soo-ji's relationship with Ho-jae, due in part to his social standing.Sung Si-kyung as Han Jae-young\nIm Hyun-sik as Kang Dae-cheolA lecturer, who dotes on his daughter Soo-ji and calls her \"Princess\" frequently.Lee Jae-hwang as Oh Jeon-wooHo-jung's boyfriend. He was initially Kyo-in's friend as a colleague, but their relationship somewhat sours when they compete for Ho-jung.\n\n\n== Trivia ==\nThe series was broadcast in Japan due to the Korean Wave popularity of Kwon Sang-woo and So Ji-sub.\nDespite playing her younger brother, Kwon Sang-woo is actually three years older than Chae Rim.\n\n\n== International broadcast ==\n Thailand Aired on UBC (currently TrueVisions) starting June 14, 2003 on Saturdays and Sundays at  19:00.\n\n\n== References ==\n\n\n== External links ==\nWe Are Dating Now official SBS website (in Korean)\nWe Are Dating Now at HanCinema\nWe Are Dating Now at IMDb",
    "links": [
        "Chae Rim",
        "Comedy film",
        "HanCinema",
        "Han Jin-hee",
        "Hangul",
        "Hanja",
        "IMDb",
        "Jesus Christ",
        "Kim Na-woon",
        "Kim Young-ae",
        "Korea Standard Time",
        "Korean Wave",
        "Korean drama",
        "Kwon Sang-woo",
        "Lee Jae-hwang",
        "McCune–Reischauer",
        "Piano (TV series)",
        "Revised Romanization of Korean",
        "Romance film",
        "Seoul Broadcasting System",
        "So Ji-sub",
        "Successful Story of a Bright Girl",
        "Sung Si-kyung",
        "Sunwoo Eun-sook",
        "Thailand",
        "TrueVisions",
        "United Broadcasting Corporation"
    ]
}