{
    "url": "https://en.wikipedia.org/wiki/West_Burlington_Independent_School_District",
    "title": "West Burlington Independent School District",
    "summary": "The West Burlington Independent School District is a public school district in West Burlington, Iowa, and is home to the West Burlington Falcons.\nThe district serves almost all residential areas in West Burlington.",
    "content": "The West Burlington Independent School District is a public school district in West Burlington, Iowa, and is home to the West Burlington Falcons.\nThe district serves almost all residential areas in West Burlington.\n\n\n== Early history ==\nThere have been a total of six buildings that could be called \"West Burlington Schools\". Fairview was the first, but was on the North side of Mt. Pleasant Road, and therefore, not in \"corporate\" town limits. The next was on the corner of Wheeler and Ramsey, and was around as early as 1888. It was later replaced by a two-story brick school and was used until 1939 when A \"Public Works Administration project\" took place, and it was reconstructed. It was used as the only elementary building for students until 1956 when the present day elementary was started.\n\n\n== West Burlington Elementary School ==\nThe current Elementary school houses Pre-school through grade five. In 1960-61, an eight-room wing was added on and grades four through six were relocated to the elementary building. In 1997 an addition was added to the building and many rooms were remodeled. The old gym was turned into the library and a new wing containing ten classrooms, a gym, and a music room was added. The building was further upgraded in 2005-2006. The new addition contained another set of ten classrooms, a remodeled nurse's office, front office, and special ed classrooms. Eventually, the grades were changed to Pre-school up to grade five.\n\n\n== Central Office (Old Middle School) ==\nThe Central Office (formerly West Burlington Middle School) was built in the early 1930s. In 1997 it was converted from a school building to the central offices for the school district due to asbestos issues with the building and lack of handicap access to the second story.\n\n\n== West Burlington Arnold Jr./Sr. High School ==\nWest Burlington Arnold Jr./Sr. High School (formerly West Burlington High School & West Burlington Arnold High School) was built in three phases, the first beginning in 1966, and was finished in 1969. In 1972 the school was renamed in honor of Walter E. Arnold, a teacher in the district since 1931, and the Superintendent from 1957 until his death -inside school walls- in 1971. In 1997 a major renovation project was done at the school. The high school gym had the stage removed and a concession stand was put in facing the cafeteria. The Junior High wing was also added. This added nine classrooms, renovated the library, added a computer lab, added another gym, and added a 399-seat auditorium. The front office was also remodeled during this project. Another addition to the building began in the Fall of 2010 that added eight more classrooms.\n\n\n=== Athletics ===\nThe Falcons compete in the Southeast Iowa Superconference in the following sports:\nBasketball\nBaseball\nVolleyballAnd the following as West Burlington-Notre Dame:\n\nCross Country\nFootball\nWrestling\nGolf\nTrack and Field\nSoccer\nTennis\n\n\n== See also ==\nList of school districts in Iowa\nList of high schools in Iowa\n\n\n== References ==\n\n\n== External links ==\nWBISD's website\nWBISD's Website at the Wayback Machine (archive index)\nWBISD's Website at the Wayback Machine (archive index)\nWBISD's Website at the Wayback Machine (archive index)\n[1]- West Burlington Athletic Booster Club\n[2]- Great Prairie AEA\n[3]- Falcon Focus Website\n[4] Elementary school 2021-2022 handbook for the Elementary School",
    "links": [
        "Accessibility",
        "Asbestos",
        "Auditorium",
        "Cafeteria",
        "Computer",
        "Des Moines County, Iowa",
        "Fifth grade",
        "Geographic coordinate system",
        "Gym",
        "Iowa Department of Education",
        "Library",
        "List of high schools in Iowa",
        "List of school districts in Iowa",
        "Music",
        "National Center for Education Statistics",
        "Nursing",
        "Preschool",
        "Primary education",
        "Public Works Administration",
        "School district",
        "Southeast Iowa Superconference",
        "State school",
        "United States",
        "Wayback Machine",
        "West Burlington, Iowa"
    ]
}