{"url": "https://en.wikipedia.org/wiki/William_Robe", "title": "William Robe", "summary": "Colonel Sir William Robe (18 February 1765 – 5 November 1820)  was a British Army officer of the Royal Artillery who served in the Revolutionary and Napoleonic Wars. He was praised as an artillery commander in combat and an organiser of military operations, as well as starting the first regimental school for soldiers' children, and serving as the architect of Quebec's Anglican cathedral.", "content": "Colonel Sir William Robe (18 February 1765 – 5 November 1820)  was a British Army officer of the Royal Artillery who served in the Revolutionary and Napoleonic Wars. He was praised as an artillery commander in combat and an organiser of military operations, as well as starting the first regimental school for soldiers' children, and serving as the architect of Quebec's Anglican cathedral.\n\n\n== Early life ==\nRobe was born at Woolwich in 1765, the son of William Robe, Second Lieutenant in the Royal Artillery's invalid battalion, and proofmaster in the Royal Arsenal, and his wife, Mary Broom. He entered the Royal Military Academy at Woolwich on 20 October 1780 as an extra cadet, and was gazetted to a commission as second lieutenant in the Royal Artillery on 24 May 1781.\n\n\n== Career ==\nRobe served from June 1782 to July 1784 at Jamaica, acting as adjutant and storekeeper. After two years at home he was in 1786 sent to Canada. He was promoted to first lieutenant on 22 November 1787, and returned to England in 1790.In April 1793 Robe went to Holland with the artillery under Major Wright, part of an advanced force of the Duke of York's army for the Flanders Campaign, the main body of artillery under Sir William Congreve embarking in May. Robe took part in the siege defence operations at Willemstad, with which the English share of the campaign commenced. He was appointed, in addition to his ordinary duties, acting adjutant and quartermaster, and at the instance of Congreve, he was made inspector of ammunition. Robe was at the Battle of Famars, the Siege of Valenciennes, the Battle of Caesar's Camp, the Siege of Dunkirk, the Siege of Landrecies, and the operations near Tournay, including at Lanoy and Roubaix. He took part in the retreat into Holland, and was particularly engaged at the bridge of Waerlem and at Nimeguen in October and November 1794, returning to England towards the end of November.Robe was promoted to be captain-lieutenant on 9 September 1794, and was appointed quartermaster in the Royal Artillery's 1st Battalion at Woolwich on 25 November, remaining there for nearly five years. In 1797 he originated the first regimental school for the children of soldiers; the Duchess of York subscribed liberally, and the school proved a success, so the Board of Ordnance undertook its direction. In 1799 Robe embarked for Holland with the Duke of York's army in the Helder Expedition. He was appointed brigade major of Royal Artillery under General Sir Anthony Farrington. He was present at the Battle of Bergen on 2 October 1799, on which date he was promoted to be captain. He took part in the capture of Alkmaar on 6 October, and returned to England with the army on 3 November, and on his return he was posted to the 9th Company of the 2nd Battalion.In the following year he was transferred to the command of the 9th Company, 4th Battalion in Canada, where he served on the staff until 1806. Having considerable knowledge of architecture and drawing, he was employed to design and to superintend the erection of the Cathedral of the Holy Trinity, which remains a permanent record of his talent.Robe was promoted to regimental major on 1 June 1806, when he returned to England, and regimental lieutenant-colonel on 13 January 1807. Robe accompanied the expedition to Copenhagen under Lord Cathcart in 1807. Major-General Thomas Blomefield commanded the artillery, and he favourably mentioned Robe for his command of the batteries of the left attack in his report on the bombardment.\n\n\n=== Peninsular War ===\nOn 12 July 1808 Robe sailed for Portugal, in command of the artillery of Arthur Wellesley's expedition. He was present at the Battle of Roliça on 17 August and the Battle of Vimeiro on 21 August, and was mentioned in despatches. At Vimeiro he used shrapnel shell for the first time, and was so pleased with its effect that he applied for large supplies of it. On the evacuation of Lisbon by the French, Robe took possession of the ordnance in the citadel. When Sir John Moore's army left for Spain, Robe remained in command of the artillery at Lisbon, under Sir Harry Burrard and John Craddock, until the arrival of Brigadier-General Howarth in April 1809. On Wellesley's return from England to take command of the British forces in the Peninsula in April 1809, Robe was in charge of the artillery reserves. He took part in the advance against Marshal Soult to the Tras os Montes, and the capture of Porto in May. He was in the advance into Spain against Joseph Buonaparte, the Battle of Talavera on 27 July 1809, and in the subsequent retreat over the Mesa d'Ibor to Truxillo, and thence to Badajos. In 1810 he was appointed to the command of the Royal Artillery driver corps, and he took part in the retreat to the Lines of Torres Vedras, including the Battle of Bussaco on 28 September.In 1811 Robe was engaged in all the active operations of the pursuit of Marshal Masséna to the region of Ciudad Rodrigo. In August he returned to England on account of his health, but rejoined the army before Badajos on 20 April 1812, the morning after the capture of the Picurina Fort. He opened the principal breaching batteries, and on the fall of Badajos he was particularly mentioned by Wellington in his despatch. Robe was present in the advance against Marshal Marmont, at the attack on the forts of Salamanca and the Battle of Salamanca in July 1812. He commanded the Royal Artillery at the entry of the army into Madrid, at the surrender of the Retiro, and at the unsuccessful Siege of Burgos, when for the third time he was mentioned in despatches. He was severely wounded in the retreat from Burgos, while defending the bridge at Cabeçon, near Valladolid. His wound necessitated his return to England; he was carried four hundred miles on men's shoulders to Lisbon.Robe was promoted to be brevet colonel on 4 June 1814, and to be regimental colonel on 16 May 1815. For his services he received on 13 September 1810 the Army Gold Medal for Roliça and Vimeiro; on 13 September 1813 this was superseded by a cross bearing the names of Vimeiro, Talavera, Badajos, and Salamanca, and on 3 July 1815 an additional clasp for Bussaco was added. On 3 January 1815 Robe was made a Knight Commander of the Order of the Bath and a Knight Commander of the Royal Guelphic Order that year. He was also permitted from that date to wear the Order of the Tower and Sword of Portugal, granted to him by the Prince Regent of Brazil on 12 October 1812.\n\n\n== Family ==\nRobe married Sarah, daughter of Captain Thomas Watt of Quebec, about 1788 in Canada. Robe died at Shooters Hill, near Woolwich, on 5 November 1820, and was buried in the family vault in Plumstead churchyard. They had five sons and four daughters. Sarah died ten years after him, on 4 February 1831.All of his sons joined the British Army and all but one died while serving. Their eldest son, William Livingstone, was born in 1791, and served alongside his father in the Peninsular War before dying at the Battle of Waterloo in 1815. Their second son, Alexander Watt (1793–1849), was a lieutenant-colonel of the Royal Engineers, and their third son, Thomas Congreve (1799–1853) a lieutenant-colonel of the Royal Artillery. Their fourth son, Frederick Holt (1801–1871), was major-general and colonel of the 95th Regiment of Foot, and the Governor of South Australia. The fifth son, George Mountain Sewell (1802–1825), was a lieutenant in the 26th Bengal Native Infantry, served as adjutant in the First Burmese War, and died on passage to Chittagong. Robe's daughters were unmarried. The youngest, Vimiera, died in December 1893 at Woolwich. She presented to the Royal Artillery Institution at Woolwich all the medals, orders, and decorations of her father and eldest brother, together with miniature portraits of each of them.\n\n\n== References ==\n\n\n=== Works cited ===\n This article incorporates text from a publication now in the public domain: Vetch, R. H. (1896). \"Robe, William\".  In Lee, Sidney (ed.). Dictionary of National Biography. Vol. 48. London: Smith, Elder & Co. pp. 342–343.\nVetch, R. H.; Stearn, R. T. (January 2011). \"Robe, William Livingstone\". Oxford Dictionary of National Biography (online ed.). Oxford University Press. doi:10.1093/ref:odnb/23711. (Subscription or UK public library membership required.)", "links": ["26th Bengal Native Infantry", "95th (Derbyshire) Regiment of Foot", "Adjutant", "André Masséna", "Anglo-Russian invasion of Holland", "Army Gold Medal", "Arthur Wellesley, 1st Duke of Wellington", "Auguste de Marmont", "Badajos", "Battle of Alkmaar (1799)", "Battle of Bergen (1799)", "Battle of Bussaco", "Battle of Caesar's Camp", "Battle of Copenhagen (1807)", "Battle of Famars", "Battle of Roliça", "Battle of Salamanca", "Battle of Talavera", "Battle of Tournay", "Battle of Vimeiro", "Battle of Waterloo", "Brigade major", "British Army", "Buen Retiro Palace", "Captain-lieutenant", "Captain (British Army and Royal Marines)", "Capture of Porto", "Cathedral of the Holy Trinity (Quebec)", "Chittagong", "Ciudad Rodrigo", "Colonel", "Colonel (United Kingdom)", "Dictionary of National Biography", "Doi (identifier)", "First Anglo-Burmese War", "First lieutenant", "Flanders Campaign", "Frederick Holt Robe", "Frederick Robe", "French Revolutionary", "French Revolutionary Wars", "Governor of South Australia", "Jean-de-Dieu Soult", "John Francis Cradock, 1st Baron Howden", "John Moore (British Army officer)", "John VI of Portugal", "Joseph Buonaparte", "Kingdom of Great Britain", "Knight Commander of the Order of the Bath", "Knight Commander of the Royal Guelphic Order", "Knight of the Royal Guelphic Order", "Lanoy", "Lieutenant-colonel", "Lines of Torres Vedras", "Madrid", "Major", "Mention in Despatches", "Mentioned in despatches", "Mesas de Ibor", "Napoleonic Wars", "Nijmegen", "Order of the Tower and Sword", "Plumstead", "Prince Frederick, Duke of York and Albany", "Public domain", "Quebec", "Roubaix", "Royal Arsenal", "Royal Artillery", "Royal Guelphic Order", "Royal Military Academy at Woolwich", "Second lieutenant", "Shrapnel shell", "Sidney Lee", "Siege of Badajoz (1812)", "Siege of Burgos", "Siege of Dunkirk (1793)", "Siege of Landrecies (1794)", "Siege of Valenciennes (1793)", "Sir Anthony Farrington, 1st Baronet", "Sir Harry Burrard, 1st Baronet, of Lymington", "Sir William Congreve, 2nd Baronet", "Thomas Blomefield", "Trujillo, Cáceres", "Trás-os-Montes Province", "United Kingdom", "VIAF (identifier)", "Valladolid", "Willemstad", "William Cathcart, 1st Earl Cathcart", "William Livingstone Robe", "William S. Yellow Robe Jr.", "Woolwich"]}