{"url": "https://en.wikipedia.org/wiki/Wingate,_Texas", "title": "Wingate, Texas", "summary": "Wingate is an unincorporated community in Runnels County, Texas, United States. According to the Handbook of Texas, the community had an estimated population of 216 in 1990 and 132 in 2000.", "content": "Wingate is an unincorporated community in Runnels County, Texas, United States. According to the Handbook of Texas, the community had an estimated population of 216 in 1990 and 132 in 2000.\n\n\n== Geography ==\nWingate is located at 32°02′39″N 100°06′36″W (32.0440287, -100.1100942). It is situated along FM 53 in northwestern Runnels County, about 13 miles northwest of Winters and 54 miles southwest of Abilene.\n\n\n== History ==\nThe area was initially settled by several pioneer families in the early 1890s. A school opened in 1891 and a post office was established on March 14, 1892. The community was named after Ballinger attorney W.J. Wingate. By the 1920s, Wingate had a bank and several other businesses. A new high school was constructed around the same time. In 1940, Wingate had an estimated population of 250. A modest buffalo-ranching industry was launched by Vester Parrish in 1961. Wingate's population stood at just over 200 in 1990. On July 1, 1991, the Wingate Independent School District was annexed into Winters ISD. By 2000, roughly 132 residents were living in Wingate.Wingate has a post office with the zip code of 79566.\n\n\n== Education ==\nPublic education in the community of Wingate is provided by the Winters Independent School District.\n\n\n== References ==\n\n\n== External links ==\nU.S. Geological Survey Geographic Names Information System: Wingate, Texas\nWingate, Texas from the Handbook of Texas Online", "links": ["Abilene, Texas", "Ballinger, Texas", "Benoit, Texas", "Census-designated place", "City", "County seat", "Farm to Market Road 53", "Handbook of Texas", "Miles, Texas", "Norton, Texas", "Rowena, Texas", "Runnels County, Texas", "The Handbook of Texas", "Unincorporated area", "United States", "Winters, Texas", "Winters Independent School District"]}