{"url": "https://en.wikipedia.org/wiki/Wolford_Mountain_Reservoir", "title": "Wolford Mountain Reservoir", "summary": "Wolford Mountain Reservoir is a reservoir in Grand County, Colorado. The reservoir and associated dam are part of the Wolford Mountain Recreation Area, which is managed by the Colorado River District, headquartered in Glenwood Springs. The reservoir dams Muddy Creek and is part of the Colorado River watershed. Construction of the reservoir was completed in 1996.", "content": "Wolford Mountain Reservoir is a reservoir in Grand County, Colorado. The reservoir and associated dam are part of the Wolford Mountain Recreation Area, which is managed by the Colorado River District, headquartered in Glenwood Springs. The reservoir dams Muddy Creek and is part of the Colorado River watershed. Construction of the reservoir was completed in 1996.\n\n\n== Recreation area ==\nThe Wolford Mountain recreation area offers lake and stream fishing, boat rentals, boat ramps, picnic areas, and 48 campsites. The reservoir is stocked with trout and kokanee salmon. The tailwater section of Muddy Creek below the dam offers rainbow and brown trout fishing on publicly accessible lands.\n\n\n== Dam problems ==\nThe Colorado River District revealed in early 2015 that there are some structural problems with the dam, specifically settling and movement of the earthen dam structure. The Ritschard Dam, as it is called, is 122 feet in height and 1,910 feet wide. The dam has also moved horizontally.In 2016 Colorado River District officials and consulted experts determined that the dam is safe and does not require extensive rehabilitation.In late 2020, a comprehensive dam safety evaluation prepared by the firm HDR Engineering for Colorado's Division of Water Resources indicated that the dam's risk of internal erosion from cracking had increased since the 2016 evaluation. The earlier report found a one in one billion chance of the dam failing in any given year, but the 2020 evaluation put the risk of a dam failure at 1.5 in 10,000. The Colorado River Water Conservation District has engaged HDR Engineering to deal with the dam's worsening condition.\n\n\n== See also ==\nList of largest reservoirs of Colorado\n\n\n== References ==", "links": ["Body of water", "Colorado River", "Colorado River Water Conservation District", "Geographic coordinate system", "Grand County, Colorado", "Inflow (hydrology)", "List of largest reservoirs of Colorado", "Muddy Creek (Colorado)", "Reservoir", "Sockeye salmon", "VIAF (identifier)"]}