{
    "url": "https://en.wikipedia.org/wiki/Women_in_unions_in_South_Korea",
    "title": "Women in unions in South Korea",
    "summary": "Women in Asia have been organizing to address workplace issues, such as unequal pay and workplace violence as early as the 1880s. The formation of women's labor unions in South Korea began in the late 1970s with the Minjung movement, as it is based on the mobilization of young female factory workers and martial law suspended labor rights. Women in South Korea are typically irregular workers, who are not protected by labor laws, make up to 35% less in wages than men, and are less likely to be a union member. The representation of women in leadership positions in unions are also stark with few unions such as the Korean Federation of Trade Unions (KCTU) trying to increase their number of women leaders. The unions that represent women include the Korean Women Workers Association (KWWA) which is under the umbrella organization Korean Women's Associations United (KWAU), Seoul Women's’ Trade union (SWTU), Korean Women's Trade Union (KWTU).",
    "content": "Women in Asia have been organizing to address workplace issues, such as unequal pay and workplace violence as early as the 1880s. The formation of women's labor unions in South Korea began in the late 1970s with the Minjung movement, as it is based on the mobilization of young female factory workers and martial law suspended labor rights. Women in South Korea are typically irregular workers, who are not protected by labor laws, make up to 35% less in wages than men, and are less likely to be a union member. The representation of women in leadership positions in unions are also stark with few unions such as the Korean Federation of Trade Unions (KCTU) trying to increase their number of women leaders. The unions that represent women include the Korean Women Workers Association (KWWA) which is under the umbrella organization Korean Women's Associations United (KWAU), Seoul Women's’ Trade union (SWTU), Korean Women's Trade Union (KWTU).\n\n\n== Early Union Activity ==\nWomen in Korea began organizing while still under Japanese occupation in the early 20th century. The first documented women-only union organized a strike at the Kyongsong Rubber factory in Seoul to protest the mistreatment of women workers. After Japanese occupation, Korea was ruled by a military dictatorship that closely monitored union activity.In 1970, activist Jeon Tae-il (or Chun Tae-il) committed suicide by self-immolation to protest the treatment of women garment workers. This would spark more union activity.\n\n\n== Minjung movement ==\n\n\n=== Factory Girls' Movement (Yo'Kong Undong) ===\nUnder the rule of General Park Chung-Hee (1961-1979), women who worked in factories dealt with sexual harassment, low wages, poor working conditions, and were targets of police brutality. These women led the union movement and elected the first woman to the position of union president in 1972.The Garment Makers Union (Chunggye Pibok Union), led by Lee So Sun, a woman, participated in the union movement and represented 200,000 women employed at Seoul's Peace Market.The YH Union protested the closure of the YH Company, a wig factory, and demanded better working conditions and pay. Women of the union locked themselves in the company building, and the ensuing police raid resulted in the death of Kim Kyoung-sook, who would become a martyr for the movement.\n\n\n== Korean Women Workers Associations United ==\n\nFrom 1989 to 1991, the Korean Women Workers Association (KWWA) formed groups in various regions in Korea. In 1992, the regional groups came together to form the Korean Women Workers Associations United (KWWAU). The KWWAU is now made up of 33 other organizations and works with the government to promote the welfare of women workers. Organizations that fall under the KWWAU include the Korean Women's Trade Union (KWTU) and the Korean Women Workers Association (KWWA).\nThe KWWAU has also expanded the issues it deals with. In 2004, they organized the \"Women Workers Initiative Challenge Against Globalization.\"In 2001, the KWTU and KWWAU launched a campaign to raise the minimum wage which led to a 12.6% increase per month.\n\n\n=== Korean Women's Trade Union ===\nThe KWTU formed in 1999 under the umbrella of the Korean Women's Associations United. It is Korea's largest women-only union, with nine branches and approximately 5000 members.  KWTU's membership is actually continuing to expand. However, the reach of the KWTU is limited because it, along with other women-only unions, are classified as \"second\" unions, which limits their recruitment in workplaces that already have a union. So, KWTU often organizes in workplaces without unions. Members of the union are mostly irregular workers.The KWTU conducts collective bargaining on behalf of its members, education activities, and fundraising activities.\nThe KWTU, along with the SWTU, Korean Congress of Trade Unions (KCTU), and the Federation of Korean Trade Unions (FKTU) joined the Council to Reform the Maternity Protection Act in 2002. The KWTU has also worked with these organizations to change labor legislation to protect independent workers.\n\n\n== Post-Democratization ==\n\n\n=== Background ===\nAfter the Asian Financial Crisis in 1997, South Korea transitioned to neoliberal policies which has led to large companies, or chae-bols, and an insecure job market. The chae-bol centered economy has undermined unions by creating more competitive work environments, through what they call 'New Management Strategy' (shin geyongyeong jeollyak), and deregulating labor by lobbying for easier hiring and firing processes and outsourcing jobs. Irregular workers, who are largely women under 20 and over 60, have been the main participants in unions. The pay discrepancies between male and female irregular workers is large, with women making 40% of the men's hourly wage. Unions such as the FKTU and KCTU have been criticized for their lack of female and precarious worker membership.Various laws have been put into place to protect women from workplace discrimination, including the Gender Equality Law, Gender Discrimination Prevention and Relief Law, and the Public Sector Female Employment Incentive System.In 2000, the Action Center for the Restoration of Irregular Women Worker's Rights was formed to advocate for irregular women workers.\n\n\n=== 1998: Hyundai Motors Union ===\nIn 1998, after the Hyundai Motors Union went on strike for 14 days in response to a sweep of lay-offs, the union agreed to their employers offer of dismissing 277 workers, 144 of them being women who worked in the cafeteria. These women were fired then re-hired as subcontracted workers, which meant lower wages and less benefits, under the idea that they would be rehired later on. The Hyundai Motors Union did not support the cafeteria workers, so the women went on a hunger strike for 14 days until the union agreed to their demands for direct employment. The women and the union did not have their demands met, and the women would continue working as subcontracted employees.\n\n\n=== 1999: Golf Caddies Union ===\nIn 1999, the management at the 88 Country Club (88CC) fired gold caddies over the age of 40, claiming it was for the safety of the workers, while the 12 women fired saw it as discrimination, since many of the golf caddies were older women. The KWWAU helped the women form the Chang Po Hoi (Iris Group), who led a 14-day campaign to get their jobs back. The campaign resulted in all 12 women being rehired. In October 1999, the Chang Po Hoi formed an official union under the KWTU. The management at 88CC would not work with the union because the gold caddies were not classified as legitimate workers. In May 2000, the Ministry of Labor classified them as legitimate workers, which would lead to a bargaining agreement between the union and 88CC management.\n\n\n=== 1996-2000: Janitors Union ===\nJanitors, who were mostly women and over the age of 35, at Inha University and Seoul National University were also affected by the outsourcing of jobs.Inha University outsourced the custodial jobs which placed workers under one year contracts, and monthly wages of about 400,000 won. In February 1999, JH cleaning company, one of the companies with contracts with Inha University, changed the wages so that the workers would be paid less, would not get severance pay, would not get bonuses, and have to work at another site. One janitor, Sun-ho, went to the KWTU's Incheon branch, who helped her form the janitor's union in October 2000. The union would go on to negotiate with the university, and when the university denied their requests five times, the union organized a strike on campus which led to an increase in wages and benefits.In May 1996, Seoul National University began outsourcing custodial jobs for four years, when all custodial positions, except for those in the main University Administration building were outsourced. Throughout these four years, the workers' wages would gradually get smaller and smaller, and hundreds and thousands of workers were let go. In January 2000, the workers formed the Seoul National University Building Services union.\n\n\n=== 2007: E-Land Strike ===\n\nOn July 1, 2007 800 E-Land unionists took over the Homever store in Seoul for almost three weeks to protest E-land's hiring and firing practices that negatively affected the mostly female workers above the age of thirty. During the occupation of the store, police blocked the entrance and eventually ended the occupation, which resulted in solidarity protests and 30 civic organizations condemning the treatment of the unionists. The union would be on strike for 510 days until Samsung Tesco bought the Homever outlet.\n\n\n=== 2004: KTX Strike ===\n\nIn 2004, KORAIL's KTX bullet train hired 351 female attendants with the promise of job security, when they were actually hired by another sector of the railroad administration on nine month contracts. After hearing of this, almost all of the women joined the Korean Railway Workers Union (KRWU), part of the Korean Confederation of Trade Unions (KCTU), to which KORAIL responded to by firing 280 striking attendants. Union members would continue to protest for the next 12 years, until 180 female attendants were rehired in 2018.\n\n\n== References ==",
    "links": [
        "1997 Asian financial crisis",
        "2013 railroad strike in South Korea",
        "Chaebol",
        "Doi (identifier)",
        "E-Land strike",
        "Federation of Korean Trade Unions",
        "ISBN (identifier)",
        "ISSN (identifier)",
        "Inha University",
        "Jeon Tae-il",
        "Korail",
        "Korea Train Express",
        "Korea under Japanese rule",
        "Korean Railway Workers' Union",
        "Korean Women's Associations United",
        "Korean Women Workers Association",
        "Minjung",
        "OCLC (identifier)",
        "Park Chung-hee",
        "Seoul National University",
        "South Korean KTX Train Attendant Union Strike",
        "Women in South Korea"
    ]
}