{
    "url": "https://en.wikipedia.org/wiki/Wood_Farm",
    "title": "Wood Farm",
    "summary": "Wood Farm is a secluded farmhouse cottage property set on the British Royal Family's Sandringham Estate in Norfolk, England. Historically occupied by members of the Royal Family and their guests, the house has long been a favourite of Elizabeth II. From his retirement in 2017, the house was home to Prince Philip, Duke of Edinburgh.",
    "content": "Wood Farm is a secluded farmhouse cottage property set on the British Royal Family's Sandringham Estate in Norfolk, England. Historically occupied by members of the Royal Family and their guests, the house has long been a favourite of Elizabeth II. From his retirement in 2017, the house was home to Prince Philip, Duke of Edinburgh.\n\n\n== Design and location ==\nWood Farm is a five-bedroom cottage located in a secluded part of the Sandringham Estate, overlooking the sea. It has been described as a  “comfortable open beamed cottage two miles from the ‘big house’”. The house is two miles from the Wolferton railway station and is located near the stables and pheasant shooting grounds. Prince Philip, Duke of Edinburgh, reportedly decorated the walls with his own art, redesigned the kitchen and bedrooms.\n\n\n== History and occupants ==\nIn 1904, the farmhouse was referred to as “Marsh Farm\" by local residents. King George V and Queen Mary sent their youngest son, Prince John, who suffered from epileptic seizures to reside at Wood Farm in 1917. He tended to a garden alongside a flock of chickens, occasionally receiving Queen Alexandra as a visitor before his death in 1919. The cottage was subsequently rented out for a number of years, including to James Ansell, the royal family's physician, before his retirement in the 1960s.Elizabeth II and her family began using Wood Farm in 1967. Prince Philip, chose the cottage for the family or guests to stay in without the huge staff or costs presented by the main house. Staff have been reported to not wear uniforms at the cottage. The Queen has also been described to cook and do the dishes while in residence.  Charles, Prince of Wales, began to host shooting parties at Wood Farm during his college years, and continued to use it as a country retreat in adulthood.The cottage is also a guest house for visitors who want \"complete privacy\". Diana, Princess of Wales, stayed at the farm with the Queen during a shooting party before her engagement. Divorced spouses of royals such as Sarah, Duchess of York are often put up at Wood Farm during holiday periods so they can be close to royal children without officially being at the Queen's festive holiday celebrations at Sandringham House. Catherine, Duchess of Cambridge, stayed at the cottage during her visits to Sandringham early in her relationship with Prince William, Duke of Cambridge. The couple reportedly continued to host shooting parties at Wood Farm after their marriage.After his retirement, Prince Philip, Duke of Edinburgh lived at Wood Farm. He was often visited by the Queen, and reportedly ran a truffle farm on the grounds of the cottage.\n\n\n== References ==",
    "links": [
        "Art",
        "BBC News",
        "British Royal Family",
        "British royal family",
        "Catherine, Duchess of Cambridge",
        "Charles, Prince of Wales",
        "Diana, Princess of Wales",
        "Elizabeth II",
        "England",
        "Epileptic seizures",
        "Geographic coordinate system",
        "Guest house",
        "King George V",
        "Mary of Teck",
        "Norfolk",
        "Pheasant",
        "Prince John of the United Kingdom",
        "Prince Philip, Duke of Edinburgh",
        "Prince William, Duke of Cambridge",
        "Queen Alexandra",
        "Sandringham Estate",
        "Sandringham House",
        "Sarah, Duchess of York",
        "The Crown Estate",
        "Truffle",
        "Uniforms",
        "Wolferton",
        "Wolferton railway station",
        "Wood Farm (disambiguation)"
    ]
}