{"url": "https://en.wikipedia.org/wiki/World_Electric_Vehicle_Association", "title": "World Electric Vehicle Association", "summary": "The World Electric Vehicle Association (WEVA) is an organization that promotes electric vehicles.", "content": "The World Electric Vehicle Association (WEVA) is an organization that promotes electric vehicles.\n\n\n== Member associations ==\nIt is composed of :\n\nThe Electric Drive Transportation Association (EDTA)\nThe Electric Vehicle Association of Asia Pacific (EVAAP)\nThe European Association for Battery, Hybrid and Fuel Cell Electric Vehicles (AVERE)\n\n\n=== EDTA ===\nThe Electric Drive Transportation Association (EDTA) is the American branch, based in Washington, D.C.\nFounded in 1989, the EDTA is a US industry association dedicated to the promotion of electric drive EDTA supports the sustainable commercialization of all electric drive transportation technologies by providing in-depth information, education, industry networking, public policy advocacy and international conferences and exhibitions.\n\n\n=== EVAAP ===\nElectric Vehicle Association of Asia Pacific (EVAAP) is an international organization which promotes the use of electric vehicles in the Asia and the Pacific.\n\n\n=== AVERE ===\nThe European Association for Battery, Hybrid and Fuel Cell Electric Vehicles (AVERE) was founded in 1978 and is based in Brussels. It is a European network of users, NGO's, associations, interest groups, etc. Its main objective is promoting the use of battery, hybrid and fuel cell electric vehicles (individually and in fleets) for priority uses in order to achieve a greener mobility for cities and countries.\n\n\n==== Structure ====\nAVERE is a federated and decentralized structure with 17 National Associations, 2 European networks (CITELEC and Eurelectric) as well as direct members. In total, there are over 1000 direct and indirect members.\n\n\n==== Activities ====\nThe main activities are related to dissemination, networking, monitoring, participation in European and multilateral projects, lobbying, research and development. In public policy advocacy AVERE presents the concerns of electric drive industry and R&D bodies to the European Commission which plays the key role in helping the development of clean vehicles.\nAs a part of WEVA, AVERE organizes Electric Vehicle Symposiums (EVS). It also collaborates in regional events in different countries and in many specialized conferences and workshops.\n\n\n== World Electric Vehicle Journal (WEVJ) ==\nWEVA publishes an international scientific journal called the World Electric Vehicle Journal (ISSN 2032-6653). The World Electric Vehicle Journal is a peer-reviewed international scientific journal that covers all studies related to battery, hybrid and fuel cell electric vehicles comprehensively. It publishes selected contributions from the EVS Symposia after an additional review process.\n\n\n== See also ==\nCalCars\nElectric vehicle\nJapan Automobile Research Institute (JARI)\nRepower America\n\n\n== References ==\n\n\n== External links ==\nWEVA official site", "links": ["Battery electric vehicle", "Battery vehicle", "Brussels", "CHAdeMO", "CalCars", "Charging station", "Combined Charging System", "Electric aircraft", "Electric bicycle", "Electric boat", "Electric bus", "Electric car", "Electric car use by country", "Electric motorcycles and scooters", "Electric truck", "Electric vehicle", "Electric vehicle charging network", "Electric vehicle industry in India", "Electric vehicles in Hong Kong", "Fuel cell vehicle", "Hybrid electric vehicle", "Hybrid vehicle", "ISSN (identifier)", "Japan Automobile Research Institute", "Megawatt Charging System", "New energy vehicles in China", "Peer review", "Plug-in electric vehicles in Australia", "Plug-in electric vehicles in California", "Plug-in electric vehicles in Europe", "Plug-in electric vehicles in France", "Plug-in electric vehicles in Germany", "Plug-in electric vehicles in Japan", "Plug-in electric vehicles in Norway", "Plug-in electric vehicles in the United Kingdom", "Plug-in electric vehicles in the United States", "Plug-in hybrid", "Repower America", "Tesla Megacharger", "Tesla Supercharger", "Vehicle-to-grid", "VinFast", "Washington, D.C."]}