{"url": "https://en.wikipedia.org/wiki/Yeshayah_Steiner", "title": "Yeshayah Steiner", "summary": "Yeshaya Steiner (Yiddish: ישעיה שטיינער; known as Reb Shaya'la of Kerestir (Kerestirer); Yiddish: ר' ישעיה'לה קערעסטירער‏) (1851 – 27 April 1925), was a Rebbe in the town of Kerestir (Bodrogkeresztúr) near Miskolc in Hungary.", "content": "Yeshaya Steiner (Yiddish: ישעיה שטיינער; known as Reb Shaya'la of Kerestir (Kerestirer); Yiddish: ר' ישעיה'לה קערעסטירער‏) (1851 – 27 April 1925), was a Rebbe in the town of Kerestir (Bodrogkeresztúr) near Miskolc in Hungary.\n\n\n== Biography ==\nRabbi Yeshaya Steiner was born in 1851 to Rabbi Moshe and Hentsha Miriam Steiner in the village of Zborov near Bardeyov (today in Slovakia). When he was 3 years old, his father died. At the age of 12, his mother sent him to study in Hungary with Rabbi Tzvi Hirsh of Liska the author of Ach Pri Tevua, who later appointed him as his aide (Gabbai). When Tzvi Hirsh died and his son-in-law Rabbi Chaim Friedlander author of Tal Chaim succeeded him, Steiner started travelling to Rabbi Chaim Halberstam of Sanz. After the death of Rabbi Chaim of Sanz, he became a disciple of Rabbi Mordechai Leifer. Rabbi Mordechai Leifer suggested that he move to the town of Kerestir, in Hungary.\nIn Kerestir, Steiner became a Hasidic Rebbe and became known as a miracle worker, and tens of thousands of Hasidim came to his court.\nHe was known as hospitable on an institutional scale. In recent years, hospitality projects have developed in his town of Kerestir.\nSteiner's image is used as an amulet by those Jews who believe that it wards away mice and offers protection against misinformation.His children were: Rabbi Avraham; Kreintsheh wife of Rabbi Shmuel Gross Rabbi of Krula; Rivka Feiga, wife of Rabbi Reuven Chaim Klein, Rabbi of Snina; and Rachel the wife of Rabbi Yisrael Avraham Alter Landa Rabbi of Edelin and author of Beith Yisrael. In 1925 he was succeeded by his son Avraham.\n\n\n== Descendants ==\nRabbi Yissachar Dov Rubin, Grand Rabbi of Kerestir in Borough Park, Brooklyn\nRabbi Naftali Grosz (1901–1987) Grand Rabbi of Kerestir-Berbesht, Son-in-Law of Rabbi Avraham Steiner. Brooklyn New York, Israel, Miami Beach. After Grosz died in 1988, his son, Rabbi Rafeal Grosz, (also known as Rabbi Armin Grosz), became the new Kerestir Rebbe in Miami Beach.\nRabbi Yeshaya Gross, eldest son of Rabbi Naftali Grosz, of Williamsburg, Brooklyn – Grand Rabbi of Kerestir-Berbesht, Brooklyn NY, Desert Hot Springs California.\n\n\n== Kerestir Dynasty ==\nRebbe Yeshayah Steiner (1852–1925)\nRebbe Avrohom Steiner (1883–1927), son of Rebbe Yeshaya (Rebbe from 1925 to 1927)\nRabbi Shmuel Gross, son-in-law of Rebbe Yeshaya\nRabbi Reuven Chaim Klein, son-in-law of Rebbe Yeshaya\nRabbi Yisroel Avrohom Alter Landa, son-in-law of Rebbe Yeshaya\nRebbe Meir Yosef Rubin of Kerestir, son-in-law of Rebbe Avrohom\nRebbe Naftoli Gross of Debrecen (died 1988), brother of Rabbi Yeshaya's son-in-law Rabbi Shmuel and son-in-law of Rebbe Avrohom\nRebbe Rafael Gross (1928–2007) – Kerestir Rebbe of Miami Beach, Florida, son of Rebbe Naftoli\nRebbe Chananyah Gross – Kerestir Rebbe of Woodridge, NY, son of Rebbe Rafael\nRebbe Yeshaya Grosz – (died on 2nd AdarI 5776) Kerestir-Berbesht Rebbe of Williamsburg, Brooklyn, NY, son of Rebbe Naftoli\nRabbi Reuven Grosz (the former Rabbi of Karlsbad, disciple and adopted ben bayis of Rabbi Yeshaya Grosz) – Brachfeld, E. Israel\nRabbi Yoishua Moishe Baruch of Woodmere, son of Rebbe Naftali\nRebbi Alter Krausz – present Kerestir Rebbe in Monsey, NY, USA.\nRabbi Shmuel David Krausz, grandchild of Rabbi Yisroel Avrohom.\nRabbi Mayer Yosef Rubin, son of Rabbi Mendel Monroe, NY, USA Rabbi in Kerestir Since 1991\n\n\n== References ==\n\n\n== External links ==\nPictures of the grave and more on Kosher Trip Adviser Website\nFindLaw case on religious freedom\n\n\n== Further reading ==\nLevi Grossman (1943). שם ושארית Shem uSheirith. Jerusalem.", "links": ["Amulet", "Bardejov", "Bodrogkeresztúr", "Borough Park, Brooklyn", "Carei", "Chaim Halberstam", "Debrecen", "Edelény", "Gabbai", "Giulești, Maramureș", "Hospitality", "Hungary", "ISBN (identifier)", "ISNI (identifier)", "Judaism", "Karlovy Vary", "Liske (Hasidic dynasty)", "Miami Beach, Florida", "Mice", "Miskolc", "Mordechai of Nadvorna", "Rebbe", "Sanz", "Slovakia", "Snina", "VIAF (identifier)", "Williamsburg, Brooklyn", "Yiddish language", "Zborov, Bardejov District"]}