{
    "url": "https://en.wikipedia.org/wiki/Zachariah_Chandler",
    "title": "Zachariah Chandler",
    "summary": "Zachariah Chandler (December 10, 1813 – November 1, 1879) was an American businessman, politician, one of the founders of the Republican Party, whose radical wing he dominated as a lifelong abolitionist. He was mayor of Detroit, a four-term senator from the state of Michigan, and Secretary of the Interior under President Ulysses S. Grant.\nAs a successful young businessman in Detroit, Chandler supported the Underground Railroad. During the Civil War, he advocated for the Union war effort, the abolition of slavery, and civil rights for freed African Americans. As Secretary of the Interior, Chandler eradicated serious corruption in the Bureau of Indian Affairs, fully endorsing President Grant's Peace Policy initiative to civilize American Indian tribes. In 1879, he was re-elected U.S. Senator and was a potential presidential candidate, but he died the following morning after giving a speech in Chicago.\n\n",
    "content": "Zachariah Chandler (December 10, 1813 – November 1, 1879) was an American businessman, politician, one of the founders of the Republican Party, whose radical wing he dominated as a lifelong abolitionist. He was mayor of Detroit, a four-term senator from the state of Michigan, and Secretary of the Interior under President Ulysses S. Grant.\nAs a successful young businessman in Detroit, Chandler supported the Underground Railroad. During the Civil War, he advocated for the Union war effort, the abolition of slavery, and civil rights for freed African Americans. As Secretary of the Interior, Chandler eradicated serious corruption in the Bureau of Indian Affairs, fully endorsing President Grant's Peace Policy initiative to civilize American Indian tribes. In 1879, he was re-elected U.S. Senator and was a potential presidential candidate, but he died the following morning after giving a speech in Chicago.\n\n\n== Early life and career ==\nZachariah Chandler was born in Bedford, New Hampshire, on December 10, 1813. His father was Samuel Chandler and his mother was Margaret Orr. Through an entirely paternal line Samuel Chandler was a descendant of William Chandler who had migrated to Roxbury, Massachusetts, from England in 1637. Through this line he was the seventh generation of his family born in North America. Margaret Orr was the oldest daughter of military officer Col. John Orr. Chandler was educated in the common schools. Upon graduation, deciding not to attend college, Chandler moved west in 1833 to Detroit, at that time the capital of Michigan Territory. In Detroit, Chandler opened a general store and through trade, banking, and land speculation became one of the wealthiest men in the state of Michigan.\n\n\n== Marriage and family ==\nOn December 10, 1844, Chandler married Letitia Grace Douglas, a native of Baltimore, who moved to New York. A social entertainer, Letitia lived in Washington during the Winter throughout Chandler's career. Chandler and Letitia had one daughter, Mary Douglas Chandler, who married Senator Eugene Hale of Maine. Chandler's and Letitia's grandchildren included Frederick Hale, who was a long-serving U.S. Senator from Maine, and Chandler Hale, who served as a U.S. diplomat in Rome. Letitia, known to have a \"gentle and kindly disposition\" and to be \"much beloved,\" died on February 19, 1899.\n\n\n== Political career ==\nFrom his youth, Chandler had been strongly opposed to slavery, and hoped that the Northern Whig party would be able to stop Southern slave power from spreading slavery into the Western Territories. Chandler financially supported the Detroit Underground Railroad, which helped fugitive or runaway slaves find safe haven.In 1848 Chandler began his political career by making campaign speeches for the Whig party presidential candidate Zachary Taylor. In 1851, Chandler was elected Mayor of Detroit and served one year in office. In 1852, Chandler ran as a Whig candidate for the Governor of Michigan, but he was defeated. Having supported Kansas as a free state without slavery, Chandler signed a petition that formed the Republican Party on July 6, 1854. In 1856, Chandler was a delegate at the first Republican Party National convention in Pittsburgh, Pennsylvania, and was a member of the Republican National Committee. The Republican Convention that year nominated John C. Frémont for president, known as The Pathfinder, who wanted to rid Kansas of African American slavery, and opposed the repeal of the Missouri Compromise. Chandler was known as one of the Radical Republicans who pushed for harsher punishment for the former rebels, and greater liberties for African-Americans. After the war he angrily stated that \"Every man who murdered and stole and poisoned was a Democrat\".\n\n\n== U.S. Senator (1857–1875) ==\n\nIn January 1857, Chandler ran as a Republican and was elected as a U.S Senator for Michigan, succeeding Lewis Cass. Chandler was reelected in 1863 and again in 1869, serving from March 4, 1857, to March 3, 1875, in the 35th through the 43rd U.S. Congresses. In the Senate Chandler allied himself with the anti-slavery Radicals, although he opposed Massachusetts Senator Charles Sumner. Chandler was the most outspoken Senator against secession. From March 1861 to 1875 Chandler was chairman of the Committee on Commerce that controlled powerful \"pork barrel\" appropriations for rivers and harbors. At the outbreak of the Civil War Chandler used his Senatorial influence to raise and equip the Michigan volunteers. Chandler was a member of the Joint Committee on the Conduct of the War.\n\nOn July 6, 1862, Chandler castigated General George McClellan's prosecution of the war in a speech at Jackson, Michigan. Chandler regarded his speech against McClellan as one of his most important public services. Chandler's attack on McClellan came five days after McClellan failed to capture Richmond and the withdrawal of Union troops by McClellan to the James River during the Seven Days Battle that resulted in Confederate victory. On March 3, 1863, Chandler authored legislation for the collection and administration of abandoned property in the South. On July 2, 1864, Chandler authored legislation for the regulation of intercourse with the insurrectionist Confederate states.Chandler supported higher tariff rates, the creation of a national bank, and voted for greenbacks as an emergency war measure, but strongly condemned any inflation of the currency. Chandler supported Reconstruction Acts that gave civil rights to African Americans, but criticized reconstruction for being too lax. On January 5, 1866, Chandler authored a resolution for non-intercourse with Great Britain for refusing to negotiate the Alabama Claims, but this was rejected by the Senate. During the Civil War Great Britain secretly allowed Confederate warships to be armed in British ports. These ships, including the CSS Alabama, did much to destroy Union commerce causing great monetary damage to the Union war effort. On November 29, 1867, in retaliation to Britain, Chandler submitted a resolution that Abyssinia be recognized as a belligerent nation at war against Great Britain, demanding that Abyssinia be given the \"same rights which the British had recognized to the Confederacy\" during the Civil War. During the election of 1868 Chandler was chairman of the Republican Congressional Committee.During his entire Senate career Chandler used his Senatorial federal patronage to increase his own political power. Chandler's methods of obtaining power were considered \"openly partisan and despotic if not actually corrupt\" in obtaining control of the Republican machine in Michigan. Chandler was for many years Michigan's undisputed Republican boss. The Democratic landslide during the election of 1874 broke his Senatorial power and he was defeated by Isaac P. Christiancy while seeking election for a fourth term, when the Michigan legislature deadlocked.\n\n\n== Secretary of Interior (1875–1877) ==\n\nChandler was appointed Secretary of the Interior by President Ulysses S. Grant in October 1875 and served until 1877. In compliance with President Grant's recommendations and authority, he implemented reforms in and reorganized the Department of Interior during his tenure in office. The previous Secretary of the Interior, Columbus Delano, was not a reformer, and had carelessly allowed profiteering to spread throughout the Interior Department. Secretary Chandler fired corrupt agents at the Bureau of Indian Affairs, and fired and replaced the Indian Commissioner and Bureau Clerk. In addition, Secretary Chandler banned \"Indian Attorneys\" from the Interior Department, who swindled Indian tribes into paying for bogus representation in Washington D.C. Secretary Chandler fully endorsed President Grant's Peace Policy initiative to civilize American Indian tribes. To assist in fighting corruption Chandler convinced President Grant to appoint reformers Charles T. Gorman of Michigan to Assistant Secretary of Interior and Augustus S. Gaylord Assistant Attorney-Generalship of the Department of Interior. These men were instrumental helping Chandler remove internal corruption from the Department of Interior. In February 1876 Chandler handed Indians who refused to leave their hunting grounds, concerning the encroachment in the Black Hills by miners, over to Secretary of War William W. Belknap's department.\n\n\n=== Reformed Bureau of Indian Affairs ===\n\nWhen Chandler took office he found the Bureau of Indian Affairs to be the most corrupt out of the federal departments under his charge. Chandler replaced the Bureau's Commissioner and the Chief Clerk. Chandler quietly investigated the Bureau and found corrupt appointees and suspicious practices by subordinates. Chandler ordered their removal, but the new commissioner said that these men were valuable to the Bureau, so Chandler held off firing the clerks. President Grant was following Chandler's activities and asked why the corrupt clerks at the Bureau had not been fired. Chandler replied to Grant that the Commissioner said it would be impossible to run the Bureau without them. Grant, then ordered Chandler to fire the corrupt clerks even if that meant shutting down the Bureau. Chandler immediately went over to the Bureau and gave orders for the suspected clerks to be fired which was promptly enforced. This was the only time Grant was directly active in reforming a federal department. Grant continued to support Chandler in his reform efforts.\n\n\n=== Reformed Pension Bureau and Land Office ===\nIn addition to the Bureau of Indian Affairs, Chandler also thoroughly investigated the Pension Bureau. The investigation resulted in removing of fraudulent claims that saved the federal government hundreds of thousands of dollars. Within one month of his administration Chandler fired all Pension Bureau clerks involved in corruption. Chandler had Gaylord and Gorman to investigate the Land Office whose investigation discovered there was a \"Chippewa half-breed scrip\" profiteering combination. Chandler broke up the combination and fired all of the members connected to the corrupt ring.\n\n\n=== Reformed Patent Office ===\nDuring his first month in office Chandler fired all the clerks in one room of the Patent Office declaring every desk vacant believing all the clerks were involved in either corruption or lacked the integrity for reform. Chandler vacated the room and put in charge an African American porter to lock by key and keep people from entering the room until honest replacements were found. Chandler paid no attention to complaints and warned a man who believed he was fired unjustly not to complain to the press. Chandler without warning instigated an investigation by putting a new officer in charge of monthly payrolls of Patent Office employees taking the full names and addresses of everyone who signed them. Almost twenty employees were found to be fictitious created by a profiteering ring to defraud federal payroll monies. Chandler also exposed and removed corrupt unqualified clerks who profiteered by hiring out their work to underpaid replacements. Chandler simplified Patent Office rules making patents easier to obtain and lessening their costs to the public.\n\n\n=== Banned Indian Attorneys ===\nIn December 1875 Chandler banned \"Indian Attorneys\", persons who claimed to represent Indians in Washington, from the Department of Interior. Bogus \"agents\" induced Indian tribes to pay them $8.00 a day plus expenses in exchange for fraudulent legislative representation in Washington during the Winter months. Other agents would contract Indian land acquisition arrangements as security for payments. Preying on the fears of Indians, these \"attorneys\" would tell the Indians their tribal rights would be taken away in Washington if they did not accept their services. Chandler banned payment to these men for alleged services to Indians saying their claims or representation were illegal and immoral. Chandler declared, \"...the regularly-appointed Indian Agent, the Commission of Indian Affairs, and the Secretary of Interior are competent to protect and defend the rights of Indians in all respects....\" Chandler's banning of \"Indian Attorneys\" saved the Indian tribes large amounts of money.\n\n\n== Chairman of Republican Party ==\n\nChandler, as Chairman of the Republican National Committee, managed Rutherford B. Hayes' successful 1876 campaign for the presidency, though Hayes declined to keep Chandler as Secretary of the Interior. He became Chairman of the Michigan Republican Party in 1878.\n\n\n== U.S. Senator (1879) ==\nIn 1879, he was again elected to the Senate to fill the vacancy caused by the resignation of Isaac P. Christiancy, who had succeeded him just four years earlier. He served in the 45th and 46th Congresses from February 22, 1879, until his death later that year.\n\n\n=== Last speech and death ===\nUnder consideration by party leaders as a possible candidate in the 1880 presidential election, Chandler went to Chicago to deliver a political speech on October 31, 1879. Maintaining his Radical roots, Chandler spoke in front of an African American Young Men's Republican Auxiliary Club at McCormick Hall. Chandler said that he hoped one day blacks would be able to vote freely and safely, run for office, and make speeches throughout the nation including the South just as former rebels were allowed to vote, run for office, and speak in the North. Although he had earlier contracted a cold he was known to be his robust self that day. The next day he was found dead in one of his rooms at the Grand Pacific Hotel at 7:00 in the morning reclining on his bed. He is interred at Elmwood Cemetery in Detroit.\n\n\n== Historical legacy ==\n\nWhen Chandler was appointed Secretary of Interior by President Grant in 1875, reformers were concerned that corruption and patronage in the Department would continue as under Secretary Columbus Delano, Grant's previous appointment. Chandler had a reputation as a wealthy Republican partisan political boss, rather than a reformer. However, these concerns proved unwarranted, as Chandler proved to be an efficient reformer. Chandler investigated corruption in his department and reported to President Grant, who gave him approval to launch reforms. He fired many in the Department who were involved in corruption and fraud, and removed from the Department persons known as \"Indian Attorneys.\"\n\n\n== See also ==\nList of United States Congress members who died in office (1790–1899)\n\n\n== References ==\n\n\n== Sources ==\nThe Detroit Post and Tribune (1880). Zachariah Chandler An Outline Sketch of His Life and Public Services. Detroit: The Post and Tribune Company Publishers.\nMacDonald, William (1929).  Allen Johnson (ed.). Dictionary of American Biography Chandler, Zachariah. New York: Charles Scribner's Sons.\n\"Mrs. Zachariah Chandler Dead\" (PDF). New York Times. New York. February 20, 1899.\n\n\n== External links ==\nZachariah Chandler in Statuary Hall\nBiographical Directory of the U.S. Congress\nZachariah Chandler from History of Genesee County, Michigan, Her People, Industries and Institutions by Edwin O. Wood, LL.D, President Michigan Historical Commission, 1916 Zachariah Chandler: An Outline Sketch of His Life and Public Services at Project Gutenberg (Full transcription of 1880 book)",
    "links": [
        "1852 Michigan gubernatorial election",
        "1856 Republican National Convention",
        "1860 Republican National Convention",
        "1864 National Union National Convention",
        "1868 Republican National Convention",
        "1872 Republican National Convention",
        "1876 Republican National Convention",
        "1880 Republican National Convention",
        "1880 United States presidential election",
        "1884 Republican National Convention",
        "1888 Republican National Convention",
        "1892 Republican National Convention",
        "1896 Republican National Convention",
        "1900 Republican National Convention",
        "1904 Republican National Convention",
        "1908 Republican National Convention",
        "1912 Republican National Convention",
        "1916 Republican National Convention",
        "1920 Republican National Convention",
        "1924 Republican National Convention",
        "1928 Republican National Convention",
        "1932 Republican National Convention",
        "1936 Republican National Convention",
        "1940 Republican National Convention",
        "1944 Republican National Convention",
        "1948 Republican National Convention",
        "1952 Republican National Convention",
        "1956 Republican National Convention",
        "1960 Republican National Convention",
        "1964 Republican National Convention",
        "1968 Republican National Convention",
        "1972 Republican National Convention",
        "1976 Republican National Convention",
        "1980 Republican National Convention",
        "1984 Republican National Convention",
        "1988 Republican National Convention",
        "1992 Republican National Convention",
        "1996 Republican National Convention",
        "2000 Republican National Convention",
        "2004 Republican National Convention",
        "2008 Republican National Convention",
        "2009 Republican National Committee chairmanship election",
        "2011 Republican National Committee chairmanship election",
        "2012 Republican National Convention",
        "2013 Republican National Committee chairmanship election",
        "2015 Republican National Committee chairmanship election",
        "2016 Republican National Convention",
        "2017 Republican National Committee chairmanship election",
        "2020 Republican National Convention",
        "Abraham Lincoln",
        "Act Prohibiting Importation of Slaves",
        "Administration (government)",
        "Adolph E. Borie",
        "African American",
        "African Americans",
        "Alabama Claims",
        "Alabama Republican Party",
        "Alaska Republican Party",
        "Albert B. Cummins",
        "Albert B. Fall",
        "Albert Cobo",
        "Alexander Hugh Holmes Stuart",
        "Alexander Lewis",
        "Alf Landon",
        "Allen J. Ellender",
        "Alpheus Felch",
        "Alphonso Taft",
        "American Civil War",
        "Amos T. Akerman",
        "Andrew Johnson",
        "Andrew Mack",
        "Ann Wyley",
        "Arizona Republican Party",
        "Arthur Summerfield",
        "Arthur Vandenberg",
        "Asher B. Bates",
        "Augustus B. Woodward",
        "Augustus Seymour Porter",
        "B. Carroll Reece",
        "Bailey Walsh",
        "Baltimore, Maryland",
        "Barry Goldwater",
        "Bedford, New Hampshire",
        "Benjamin Bristow",
        "Benjamin Franklin Jones (industrialist)",
        "Benjamin Harrison",
        "Benjamin Ruggles",
        "Benjamin Wade",
        "Bertrand Snell",
        "Bibliography of the history of the Republican Party",
        "Bill Brock",
        "Bill Frist",
        "Blackburn Riots",
        "Blair Moody",
        "Bob Dole",
        "Bob Packwood",
        "Bruce Babbitt",
        "Burton K. Wheeler",
        "C. Wesley Roberts",
        "CSS Alabama",
        "Cabinet of the United States",
        "Caleb Blood Smith",
        "California Republican Party",
        "Calvin Coolidge",
        "Campau family",
        "Carl Hayden",
        "Carl Levin",
        "Carl Schurz",
        "Catharine A. F. Stebbins",
        "Cecil Andrus",
        "Chandler Hale",
        "Charles A. Halleck",
        "Charles Bowles (mayor)",
        "Charles C. Foote",
        "Charles Christopher Trowbridge",
        "Charles Curtis",
        "Charles D. Hilles",
        "Charles E. Potter",
        "Charles E. Stuart",
        "Charles E. Townsend",
        "Charles Evans Hughes",
        "Charles G. Dawes",
        "Charles Howard (Detroit)",
        "Charles L. McNary",
        "Charles Sumner",
        "Charles T. Gorham",
        "Charles W. Fairbanks",
        "Charles W. Tobey",
        "Chester A. Arthur",
        "Chicago",
        "Christian H. Buhl",
        "Clarence Dill",
        "Claudius H. Huston",
        "Clayton Yeutter",
        "Clement Claiborne Clay",
        "Code Noir",
        "Coleman Young",
        "College Republicans",
        "Colorado Republican Party",
        "Columbus Delano",
        "Congressional Hispanic Conference",
        "Connecticut Republican Party",
        "ConservAmerica",
        "Constitution of Michigan",
        "Cornelius Newton Bliss",
        "Crosswhite Affair",
        "Dan Quayle",
        "Daniel Inouye",
        "Daniel McBride Graham",
        "Dave Bing",
        "David B. Henderson",
        "David Bernhardt",
        "David R. Francis",
        "De Garmo Jones",
        "Dean Burch",
        "Dean of the United States Senate",
        "Deb Haaland",
        "Debbie Stabenow",
        "Dennis Archer",
        "Dennis Hastert",
        "Detroit",
        "Detroit race riot of 1863",
        "Dick Cheney",
        "Dirk Kempthorne",
        "District of Columbia Republican Party",
        "Donald P. Hodel",
        "Donald Riegle",
        "Donald Trump",
        "Douglas McKay",
        "Douglass Houghton",
        "Duncan U. Fletcher",
        "Dwight D. Eisenhower",
        "Dwight M. Sabin",
        "Earl Warren",
        "Ebenezer R. Hoar",
        "Ed Gillespie",
        "Edward Jeffries",
        "Edwards Pierrepont",
        "Edwin C. Johnson",
        "Edwin D. Morgan",
        "Elihu B. Washburne",
        "Elijah Brush",
        "Elizabeth Margaret Chandler",
        "Elizabeth Rous Comstock",
        "Ellison D. Smith",
        "Elmwood Cemetery (Detroit)",
        "Emancipation Proclamation",
        "Erastus Hussey",
        "Ethan A. Hitchcock (Interior)",
        "Ethiopian Empire",
        "Eugene Hale",
        "Eugene Van Antwerp",
        "Everett Dirksen",
        "Everett Sanders",
        "Fifth Party System",
        "Fourth Party System",
        "Frances Titus",
        "Francis B. Stockbridge",
        "Francis E. Warren",
        "Francis G. Newlands",
        "Frank Couzens",
        "Frank Ellsworth Doremus",
        "Frank Fahrenkopf",
        "Frank Harris Hitchcock",
        "Frank Knox",
        "Frank Murphy",
        "Franklin Knight Lane",
        "Fred A. Seaton",
        "Frederick Buhl",
        "Frederick H. Gillett",
        "Frederick Hale (US senator)",
        "Freedom Caucus",
        "Fritz Hollings",
        "Fugitive Slave Act of 1793",
        "Fugitive Slave Act of 1850",
        "Furnifold McLendel Simmons",
        "Gale Norton",
        "Galusha A. Grow",
        "Garret Hobart",
        "Gary Peters",
        "General Land Office",
        "George Aiken",
        "George B. Cortelyou",
        "George C. Langdon",
        "George DeBaptiste",
        "George F. Edmunds",
        "George H. Hopkins",
        "George H. W. Bush",
        "George Henry Williams",
        "George M. Robeson",
        "George McClellan",
        "George P. Codd",
        "George S. Boutwell",
        "George W. Bush",
        "George W. McCrary",
        "Georgia Republican Party",
        "Gerald Ford",
        "Governor of Michigan",
        "Grand Pacific Hotel (Chicago)",
        "Guy Beckley",
        "Guy Gabrielson",
        "Haley Barbour",
        "Hamilton Fish",
        "Hannibal Hamlin",
        "Harold L. Ickes",
        "Harrison E. Spangler",
        "Harry Stewart New",
        "Hawaii Republican Party",
        "Hazen S. Pingree",
        "Henry B. Anthony",
        "Henry Bibb",
        "Henry Cabot Lodge",
        "Henry Cabot Lodge Jr.",
        "Henry Clay Payne",
        "Henry Dodge",
        "Henry Howard (Detroit)",
        "Henry Jackson Hunt (Mayor of Detroit)",
        "Henry Jarvis Raymond",
        "Henry Ledyard",
        "Henry M. Teller",
        "Henry P. Baldwin",
        "Henry P. Fletcher",
        "Henry Wilson",
        "Herbert Brownell Jr.",
        "Herbert Hoover",
        "Hiram Johnson",
        "History of Michigan",
        "History of slavery in Michigan",
        "History of the Republican Party (United States)",
        "Homer S. Ferguson",
        "House Republican Conference",
        "Howard Baker",
        "Howard Cannon",
        "Hubert D. Stephens",
        "Hubert Work",
        "Hugh Moffat (politician)",
        "Hugh Scott",
        "ISNI (identifier)",
        "Idaho Republican Party",
        "Illinois Republican Party",
        "Indiana Republican Party",
        "International Democrat Union",
        "Isaac P. Christiancy",
        "J. Donald Cameron",
        "J. Warren Keifer",
        "Jabez W. Huntington",
        "Jack Kemp",
        "Jacob Dolson Cox",
        "Jacob Harold Gallinger",
        "Jacob M. Howard",
        "Jacob Thompson",
        "James A. Bayard Jr.",
        "James A. Garfield",
        "James A. Van Dyke",
        "James Eastland",
        "James Eli Watson",
        "James G. Blaine",
        "James G. Watt",
        "James Gunn (senator)",
        "James Harlan (senator)",
        "James Hillhouse",
        "James J. Couzens",
        "James Lloyd (Massachusetts politician)",
        "James McMillan (politician)",
        "James Noble Tyner",
        "James Paul Clarke",
        "James Pearce",
        "James Robert Mann (Illinois politician)",
        "James Rudolph Garfield",
        "James S. Clarkson",
        "James S. Sherman",
        "James William Marshall",
        "Jay Rockefeller",
        "Jay Treaty",
        "Jerome Cavanagh",
        "Jim Gilmore",
        "Jim Nicholson (Secretary of Veterans Affairs)",
        "John A. Logan",
        "John Aaron Rawlins",
        "John Adams Dix",
        "John Askin",
        "John Barton Payne",
        "John Biddle (Michigan politician)",
        "John Boehner",
        "John Brown (Kentucky politician)",
        "John Brown Gordon",
        "John C. Frémont",
        "John C. Lodge",
        "John C. Stennis",
        "John Creswell",
        "John Danforth",
        "John Davis (Massachusetts governor)",
        "John Forsyth (politician)",
        "John Fremont Hill",
        "John Gaillard",
        "John H. Harmon",
        "John Hamilton (Kansas politician)",
        "John Jacob Rhodes",
        "John L. McClellan",
        "John Ladue",
        "John Langdon (politician)",
        "John McCain",
        "John Norvell",
        "John P. Hale",
        "John Palmer Usher",
        "John Patton (Detroit mayor)",
        "John Patton Jr.",
        "John Pridgeon Jr.",
        "John R. Williams",
        "John Sherman",
        "John T. Adams",
        "John Thune",
        "John W. Bricker",
        "John W. Smith (Detroit mayor)",
        "John Willock Noble",
        "Jonathan Kearsley",
        "Jonathan Walker (abolitionist)",
        "Joseph A. Martin",
        "Joseph Anderson",
        "Joseph Gurney Cannon",
        "Joseph W. Martin Jr.",
        "Josiah Bailey",
        "Josiah S. Johnston",
        "Julius Albert Krug",
        "Julius C. Burrows",
        "Justin Smith Morrill",
        "Kansas Republican Party",
        "Ken Mehlman",
        "Ken Salazar",
        "Kenneth Cockrel Jr.",
        "Kenneth McKellar (politician)",
        "Kenneth S. Wherry",
        "Kentucky raid in Cass County (1847)",
        "Kevin McCarthy (California politician)",
        "Kinsley S. Bingham",
        "Kirkland C. Barker",
        "Knute Nelson",
        "Kwame Kilpatrick",
        "Lansing, Michigan",
        "Larry Pressler",
        "Laura Smith Haviland",
        "Lee Atwater",
        "Leonard W. Hall",
        "Levi Cook",
        "Levi P. Morton",
        "Levi Woodbury",
        "Lewis Cass",
        "Liberty Caucus",
        "Lisette Denison Forth",
        "List of Republican Party presidential primaries",
        "List of United States Congress members who died in office (1790–1899)",
        "List of United States Republican Party presidential tickets",
        "List of United States Senators from Michigan",
        "List of United States senators from Michigan",
        "List of chairpersons of the College Republicans",
        "List of mayors of Detroit",
        "List of presidents of the United States",
        "List of state parties of the Republican Party (United States)",
        "Log Cabin Republicans",
        "Lot M. Morrill",
        "Louis Miriani",
        "Louis XV",
        "Lucie Blackburn",
        "Lucius Lyon",
        "Lucius Quintus Cincinnatus Lamar",
        "M. Hoke Smith",
        "Mackinac Island",
        "Mahlon Dickerson",
        "Maine Republican Party",
        "Manuel Lujan Jr.",
        "Marc Racicot",
        "Marcus Lawrence Ward",
        "Maria Cantwell",
        "Mark Hanna",
        "Marshall Chapin",
        "Marshall Jewell",
        "Marvin H. Chamberlain",
        "Mary Louise Smith (politician)",
        "Maryland Republican Party",
        "Massachusetts Republican Party",
        "Mathew Brady",
        "Matt Whitaker Ransom",
        "Matthew Butler",
        "Matthew Quay",
        "Meade Alcorn",
        "Mel Martínez",
        "Merrill I. Mills",
        "Michael Steele",
        "Michigan",
        "Michigan Anti-Slavery Society",
        "Michigan Republican Party",
        "Michigan Territory",
        "Mike Duggan",
        "Mike Duncan",
        "Mike Pence",
        "Mississippi Republican Party",
        "Missouri Compromise",
        "Missouri Republican Party",
        "Mitch McConnell",
        "Mitt Romney",
        "Monette (slave)",
        "Montana Republican Party",
        "Moses E. Clapp",
        "Nathan Sanford",
        "Nathaniel Silsbee",
        "National Republican Congressional Committee",
        "National Republican Redistricting Trust",
        "National Republican Senatorial Committee",
        "National Statuary Hall",
        "National Union Party (United States)",
        "Nebraska Republican Party",
        "Nevada Republican Party",
        "New Hampshire Republican State Committee",
        "New Jersey Republican State Committee",
        "New York City",
        "New York Republican State Committee",
        "New York State",
        "Newt Gingrich",
        "Nicholas Longworth",
        "Nicholas Murray Butler",
        "North America",
        "North Carolina Republican Party",
        "North Dakota Republican Party",
        "Northwest Ordinance",
        "Ohio Republican Party",
        "Oklahoma Republican Party",
        "Oliver Moulton Hyde",
        "Omar D. Conger",
        "Oregon Republican Party",
        "Orville Hickman Browning",
        "Oscar L. Chapman",
        "Oscar Marx",
        "Party leaders of the United States House of Representatives",
        "Party leaders of the United States Senate",
        "Patrick Leahy",
        "Patrick V. McNamara",
        "Paul Laxalt",
        "Paul Ryan",
        "Pennsylvania",
        "Pennsylvania Republican Party",
        "Personal liberty laws",
        "Philip Breitmeyer",
        "Philip Hart",
        "Pittsburgh",
        "Prentiss M. Brown",
        "Presidency of Abraham Lincoln",
        "Presidency of Andrew Johnson",
        "Presidency of Benjamin Harrison",
        "Presidency of Calvin Coolidge",
        "Presidency of Chester A. Arthur",
        "Presidency of Donald Trump",
        "Presidency of Dwight D. Eisenhower",
        "Presidency of George H. W. Bush",
        "Presidency of George W. Bush",
        "Presidency of Gerald Ford",
        "Presidency of Herbert Hoover",
        "Presidency of Richard Nixon",
        "Presidency of Ronald Reagan",
        "Presidency of Rutherford B. Hayes",
        "Presidency of Theodore Roosevelt",
        "Presidency of Ulysses S. Grant",
        "Presidency of Warren G. Harding",
        "Presidency of William Howard Taft",
        "Presidency of William McKinley",
        "President of the United States",
        "Project Gutenberg",
        "Radical Republicans",
        "Raudot Ordinance of 1709",
        "Ray C. Bliss",
        "Ray Lyman Wilbur",
        "Reed Smoot",
        "Reince Priebus",
        "Republican Governance Group",
        "Republican Governors Association",
        "Republican Jewish Coalition",
        "Republican Liberty Caucus",
        "Republican Main Street Partnership",
        "Republican Majority for Choice",
        "Republican National Coalition for Life",
        "Republican National Committee",
        "Republican National Convention",
        "Republican National Hispanic Assembly",
        "Republican Party (Northern Mariana Islands)",
        "Republican Party (United States)",
        "Republican Party (United States) organizations",
        "Republican Party of American Samoa",
        "Republican Party of Arkansas",
        "Republican Party of Florida",
        "Republican Party of Guam",
        "Republican Party of Iowa",
        "Republican Party of Kentucky",
        "Republican Party of Louisiana",
        "Republican Party of Minnesota",
        "Republican Party of New Mexico",
        "Republican Party of Puerto Rico",
        "Republican Party of Texas",
        "Republican Party of Virginia",
        "Republican Party of Wisconsin",
        "Republican Party of the Virgin Islands",
        "Republican Party presidential debates",
        "Republican State Committee of Delaware",
        "Republican Study Committee",
        "Republicans Abroad",
        "Republicans Overseas",
        "Rhode Island Republican Party",
        "Richard A. Ballinger",
        "Richard Bond (political executive)",
        "Richard Nixon",
        "Richard Reading",
        "Richard Richards (Utah politician)",
        "Richard Russell Jr.",
        "Ripon Society",
        "Robert A. Taft",
        "Robert Byrd",
        "Robert H. Michel",
        "Robert Henry Goldsborough",
        "Robert McClelland (American politician)",
        "Robert P. Griffin",
        "Robert S. Duncanson",
        "Roger Wicker",
        "Rogers Morton",
        "Roman Gribbs",
        "Ronald Reagan",
        "Ronna McDaniel",
        "Roscoe Conkling",
        "Roxbury, Massachusetts",
        "Roy Owen West",
        "Royal S. Copeland",
        "Russell A. Alger",
        "Rutherford B. Hayes",
        "Ryan Zinke",
        "Sally Jewell",
        "Samuel J. Kirkwood",
        "Samuel J. R. McMillan",
        "Sarah Palin",
        "Schuyler Colfax",
        "Senate Republican Conference",
        "Seven Days Battle",
        "Shelby Moore Cullom",
        "Simeon D. Fess",
        "Sixth Party System",
        "Slavery among Native Americans in the United States",
        "Slavery in the colonial history of the United States",
        "Sojourner Truth",
        "Solomon Foot",
        "South Carolina Republican Party",
        "South Dakota Republican Party",
        "Spencer Abraham",
        "Spiro Agnew",
        "Stanley K. Hathaway",
        "Stephen Benedict Grummond",
        "Stephen Benton Elkins",
        "Stewart Udall",
        "Straits of Mackinac",
        "Strom Thurmond",
        "Styles Bridges",
        "Sunday Free Press",
        "Ted Stevens",
        "Teen Age Republicans",
        "Tennessee Republican Party",
        "The Wish List (political organization)",
        "Theodore Foster",
        "Theodore M. Pomeroy",
        "Theodore Roosevelt",
        "Third Party System",
        "Thirteenth Amendment to the United States Constitution",
        "Thomas Brackett Reed",
        "Thomas E. Dewey",
        "Thomas Ewing",
        "Thomas Fitzgerald (American politician)",
        "Thomas H. Carter",
        "Thomas Hart Benton (politician)",
        "Thomas J. Henderson (politician)",
        "Thomas McKean Thompson McKennan",
        "Thomas S. Kleppe",
        "Thomas W. Ferry",
        "Thomas W. Palmer",
        "Thornton Blackburn",
        "Thruston Ballard Morton",
        "Timeline of modern American conservatism",
        "Townsend E. Gidley",
        "Trent Lott",
        "Truman Handy Newberry",
        "Ulysses S. Grant",
        "Underground Railroad",
        "United States Attorney General",
        "United States Congress",
        "United States Postmaster General",
        "United States Secretary of State",
        "United States Secretary of War",
        "United States Secretary of the Interior",
        "United States Secretary of the Navy",
        "United States Secretary of the Treasury",
        "United States Senate",
        "United States Senate Committee on Commerce, Science, and Transportation",
        "Uriah Upjohn",
        "Utah Republican Party",
        "VIAF (identifier)",
        "Vermont Republican Party",
        "Victor Rosewater",
        "Wallace H. White Jr.",
        "Wally Hickel",
        "Walter F. George",
        "Walter L. Fisher",
        "Warren Austin",
        "Warren G. Harding",
        "Warren Magnuson",
        "Washington State Republican Party",
        "Wendell Willkie",
        "Wesley Livsey Jones",
        "West Virginia Republican Party",
        "Whig Party (United States)",
        "Whitelaw Reid",
        "Will H. Hays",
        "William A. Wheeler",
        "William Adams Richardson",
        "William Alden Smith",
        "William B. Allison",
        "William Barlum Thompson",
        "William Borah",
        "William C. Duncan",
        "William C. Maybury",
        "William Claflin",
        "William E. Miller",
        "William Freeman Vilas",
        "William G. Thompson",
        "William Henry Haywood Jr.",
        "William Howard Taft",
        "William Hunter (Senator)",
        "William J. Campbell (Illinois politician)",
        "William Knowland",
        "William L. Dayton",
        "William Lambert (abolitionist)",
        "William M. Butler",
        "William Macomb (merchant)",
        "William McKinley",
        "William P. Clark Jr.",
        "William P. Frye",
        "William Pennington",
        "William R. King",
        "William Richert (mayor)",
        "William Russell Willcox",
        "William W. Belknap",
        "William W. Wheaton",
        "William Woodbridge",
        "Willie Person Mangum",
        "Woodbridge Nathan Ferris",
        "Wright Modlin",
        "Wyoming Republican Party",
        "Young Republicans",
        "Zachary Taylor",
        "Zina Pitcher"
    ]
}