{"url": "https://en.wikipedia.org/wiki/Zenith_Plateau", "title": "Zenith Plateau", "summary": "The Zenith Plateau is a large bathymetric high in the Indian Ocean, located about 450 kilometres (280 mi) west-northwest of the Wallaby Plateau, 1,400 kilometres (870 mi) west-northwest of Carnarvon, Western Australia, and 1,700 kilometres (1,100 mi) north-west of Perth, Western Australia. The summit of the Zenith Plateau lies 1,960 meters (6,430 ft) below sea level and its base is at about 5,000 meters (16,000 ft) below sea level. It is about  300 kilometres (190 mi) long and 200 kilometres (120 mi) wide. In the east, the Zenith Plateau is separated from the Wallaby (Cuvier) Plateau by a 100–150 kilometres (62–93 mi) wide, north to northeast-trending bathymetric trough. The Zenith Plateau lies outside of the Australian Exclusive Economic Zone.As discussed by Amos and Beaman, the bathymetry of the Zenith Plateau is very poorly mapped. Precise ocean floor depth data from bathymetric surveys, which used modern acoustic echosounders, across this undersea plateau are lacking. Transects across it by older, less precise singlebeam echosounder are few and insufficient to provide bathymetric data of significant detail. The bulk of the mapping is based upon coarse interpretation of satellite altimetry data in which the ocean floor bathymetry is inferred from measured variations in the elevation of the overlying sea surface.", "content": "The Zenith Plateau is a large bathymetric high in the Indian Ocean, located about 450 kilometres (280 mi) west-northwest of the Wallaby Plateau, 1,400 kilometres (870 mi) west-northwest of Carnarvon, Western Australia, and 1,700 kilometres (1,100 mi) north-west of Perth, Western Australia. The summit of the Zenith Plateau lies 1,960 meters (6,430 ft) below sea level and its base is at about 5,000 meters (16,000 ft) below sea level. It is about  300 kilometres (190 mi) long and 200 kilometres (120 mi) wide. In the east, the Zenith Plateau is separated from the Wallaby (Cuvier) Plateau by a 100–150 kilometres (62–93 mi) wide, north to northeast-trending bathymetric trough. The Zenith Plateau lies outside of the Australian Exclusive Economic Zone.As discussed by Amos and Beaman, the bathymetry of the Zenith Plateau is very poorly mapped. Precise ocean floor depth data from bathymetric surveys, which used modern acoustic echosounders, across this undersea plateau are lacking. Transects across it by older, less precise singlebeam echosounder are few and insufficient to provide bathymetric data of significant detail. The bulk of the mapping is based upon coarse interpretation of satellite altimetry data in which the ocean floor bathymetry is inferred from measured variations in the elevation of the overlying sea surface.\n\n\n== Name ==\nThe Zenith Plateau is named after the cable ship Zenith, which discovered it while surveying the cable route from Cocos (Keeling) Islands to Fremantle, Western Australia. It was initially known as the Zenith Seamount as shown in the 1933 DMA Chart 5446 and the May 1975 Australian INT 708 chart.  The Zenith Plateau is incorrectly designated as the Wallaby Plateau by a few official charts, some popular maps, American Association of Petroleum Geologists' maps, and the ACUF Gazetter. This confusion likely is the result of maps by Heezen and Tharp that incorrectly show the Zenith Plateau and the Wallaby Plateau as a single, composite bathymetric feature.\n\n\n== Geology ==\nBecause the Zenith Plateau has not been studied in any detail, its internal structure and origin has largely been a matter of speculation and indirect inference from magnetic and satellite gravity studies and research involving adjacent bathymetric highs. It is generally inferred to be of the same geologic structure and origin as the adjacent and better studied Quokka Rise. Initially, the Zenith Plateau, along with the adjacent Wallaby Plateau, was thought to be part of a short-lived hotspot. As the result of detailed studies of the Wallaby Plateau, this hypothesis has been largely abandoned. Later, it was proposed that the Zenith Plateau, like the adjacent Wallaby Plateau, consists of a continental fragment of highly attenuated, stretched, and faulted continental crust that has been extensively intruded by magmatic rocks and deeply buried by volcanic rocks during the initial breakup of East Gondwana. More recently, the Zenith Plateau is inferred to be a volcanic plateau that consists of a thick sequence of highly attenuated, stretched, and faulted volcanic margin crust formed during the time of the  continental break-up of Gondwana. This crust is inferred to be buried by voluminous volcanic deposits that immediately followed its formation. Later on, complicated tectonic activity that was associated with local rifting and sea floor spreading separated the Wallaby and Zenith plateaus from Australia and each other.Judging from research conducted for adjacent oceanic rises and plateaus, it is presumed that the volcanic rocks, which comprise the Zenith Plateau are covered by a blanket of Cenozoic and older deep sea sediments of unknown thickness. Research conducted during the 25th cruise of the R/V Dmitriy Mendeleyev indicates that the deep sea sediments covering the Zenith Plateau consist of calcareous ooze. One core, core 2036, recovered during that cruise penetrated 3 meters (9.8 ft) of rather compact light pale yellow pelitic, coccolith-foraminiferal ooze. Radiocarbon dating of samples from the upper 50 cm (20 in) of the core yielded dates ranging from 9790±750 to greater than 28,500 years radiocarbon. The average sedimentation rate calculated for sediments in this core is 4.1 mm (0.16 in) to 4.3 mm (0.17 in) per thousand years. According to these rates and the core description, the sediments covering this plateau are likely well-consolidated and possibly quite stiff.\n\n\n== Malaysia Airlines Flight 370 ==\nThe northern flank of the Zenith Plateau underlies the part of the Indian Ocean that was initially suspected to be the final resting place of Malaysia Airlines Flight 370. According to the GEBCO Digital Atlas, the depth of the ocean bottom within the area that the ADV Ocean Shield detected acoustic signals that once were thought to be consistent with those emitted by underwater locator beacons (ULBs) mounted on flight recorders ranges from about 3,800 meters (12,500 ft) to 4,800 meters (15,700 ft). However, lengthy searches of parts of the Zenith Plateau found nothing.\nExcept for its depth, the blanket of foraminiferal ooze, which likely covers the Zenith Plateau, provides an environment that should be helpful for searching for any aircraft wreckage lying on the ocean bottom. According to William Sager, a professor of marine geophysics at the University of Houston in Texas, the surface of ocean bottom covered with foraminiferal ooze is soft enough to squeeze between a person's toes, but it's not so soft that airplane wreckage would sink into it. He stated: \"Something big like pieces of an airplane, it's going to be sitting on the surface.\" In addition, Robin Beaman, a marine geologist at James Cook University, Queensland, Australia, noted that any large metallic object lying on an ocean bottom covered by foraminiferal ooze would be readily recognizable on an autonomous underwater vehicle's sidescan sonar. Sidescan sonar can be quite good at differentiating the acoustic return of a hard, metallic object compared to that of an ocean floor covered by ooze.\n\n\n== References ==\n\n\n== External links ==\nBeaman, R., 2014, Zenith Plateau as the final resting place for MH370. Deep Reef Explorer, James Cook University, Queensland, Australia.", "links": ["ADV Ocean Shield", "American Association of Petroleum Geologists", "Australia", "Autonomous underwater vehicle", "Bathymetry", "Carnarvon, Western Australia", "Cenozoic", "Coccolith", "Cocos (Keeling) Islands", "Continental crust", "Continental fragment", "Deep sea", "Exclusive Economic Zone", "Fault (geology)", "Foraminifera", "Fremantle", "Geographic coordinate system", "Geophysics", "Gondwana", "Hotspot (geology)", "ISBN (identifier)", "Indian Ocean", "James Cook University", "Magma", "Malaysia Airlines Flight 370", "Marine (ocean)", "Marine geology", "National Oceanic and Atmospheric Administration", "Pelagic sediment", "Pelite", "Perth", "Queensland", "Radiocarbon dating", "Rift", "Sea floor spreading", "Sediment", "Sidescan sonar", "Texas", "Underwater locator beacon", "United States Department of Commerce", "University of Houston", "Volcanic rock", "Wallaby Plateau", "Western Australia"]}