{
    "url": "https://en.wikipedia.org/wiki/Zero_2_Infinity",
    "title": "Zero 2 Infinity",
    "summary": "Zero 2 Infinity (0II∞, sometimes rendered as Zero2Infinity) was a private Spanish company developing high-altitude balloons intended to provide access to near space and low Earth orbit using a balloon-borne pod and a balloon-borne launcher.\nThe company was founded in 2009 by aerospace engineer Jose Mariano López-Urdiales, the current CEO. It is headquartered in Barberà del Vallès, Barcelona, Spain.\nZero 2 Infinity has been testing high-altitude balloons and launching small payloads to high altitudes for scientific institutions and commercial firms for testing elements above most of the Earth's atmosphere. Their launch system has a significantly lower impact on the environment, an advantage over conventional systems. The company's pod named Bloon may also be used for tourism. In late 2016, its CEO had suggested that commercial flights could take place as early as 2019. As of 2020, the company aims to carry paying passengers to above 30 km altitude by 2021.\n\n",
    "content": "Zero 2 Infinity (0II∞, sometimes rendered as Zero2Infinity) was a private Spanish company developing high-altitude balloons intended to provide access to near space and low Earth orbit using a balloon-borne pod and a balloon-borne launcher.\nThe company was founded in 2009 by aerospace engineer Jose Mariano López-Urdiales, the current CEO. It is headquartered in Barberà del Vallès, Barcelona, Spain.\nZero 2 Infinity has been testing high-altitude balloons and launching small payloads to high altitudes for scientific institutions and commercial firms for testing elements above most of the Earth's atmosphere. Their launch system has a significantly lower impact on the environment, an advantage over conventional systems. The company's pod named Bloon may also be used for tourism. In late 2016, its CEO had suggested that commercial flights could take place as early as 2019. As of 2020, the company aims to carry paying passengers to above 30 km altitude by 2021.\n\n\n== Products ==\nThe company has three main offerings:\n\nBloostar: a balloon-borne launcher for carrying payloads such as small, micro, and nanosatellites to orbit, based on rockoon technology.\nBloon: a balloon-borne zero emission craft for launching crewed vehicles to near space for scientific research, educational and also space tourism purposes.\nElevate: a service provided to fly payloads to near space for science, communications, satellite testing, meteorology and marketing purposes.\n\n\n=== Bloostar ===\n\nBloostar is a launch vehicle currently in development, intended to compete in the small satellite launch market. It is based on the rockoon concept: the first stage of the ascent is conducted by the use of a high-altitude balloon up to 30 km (19 mi), where the rocket platform is ignited and detached from the balloon to insert the payload into orbit. The design is intended to be capable of delivering a 140 kg payload to a 200-km low Earth orbit, or a 75 kg payload to a 600-km sun-synchronous orbit.\n\n\n==== Design ====\nThe launch vehicle is composed of a set of liquid fuel engines clustered as concentric toroids attached to the central payload. Each toroid works as a stage during the rocket climb once it has been ignited from around 30 km (19 mi) above ground level. The stages are progressively separated from the vehicle, similarly to conventional satellite launch using a rocket with parallel staging.\nThe design includes a total of 13 engines split across three stages, all using methalox (liquid methane and liquid oxygen) fuel. The first, outermost stage is a toroid with six Teide 2 engines each producing 15 kN of thrust; the second stage is a smaller toroid with six smaller Teide 1 engines each producing 2 kN of thrust; the third stage is positioned at the centre of the toroids with a single Teide 1 engine. By using propellant crossfeed, all available engines will fire simultaneously but only the fuel tank in the outermost stage will be depleted at a time, increasing performance. As the engines will only ever fire at very high altitude, all 13 will be optimized to produce maximum thrust in vacuum or near-vacuum conditions, similar to the upper-stage engines of conventional rockets. Due to their high-altitude-only use, much lower combustion chamber pressures are required and thus a simple pressure-fed engine design is used, substantially reducing cost and complexity by omitting turbopumps. The combustion chambers for the Teide 1 engines are 3D printed by the Andalusian Foundation for Aerospace Development.The use of several toroid-shaped stages results in an increased stand-off distance to the sonic line during atmospheric entry, reducing the possibility of damaging the stages because of the high temperatures reached. Another promoted advantage is the capability to launch satellites with no need of folding them, as a flat-shaped vehicle is capable of fitting panel-deployed satellites right from the launch site.The balloon components will be landed and potentially reused. According to López Urdiales, the Bloostar rocket launch vehicle \"has been designed to be reusable, technically, but not as part of the business plan. The engines burn methane and oxygen for many reasons, but one is that it creates less soot and leaves the engines reusable. Also, the shape of a torus has been selected to reduce the aero-heating on reentry. The optimal shape in vacuum is similar to the optimal shape for reentry (blunt). The optimal shape for ascent is very different (slender). Bloostar has been designed from its ignition taking into account ‘the way back down.’ It’s easier to do if the ‘way up’ is taken care of by the balloon.\" Recovery will be attempted, however, and consideration has been given for an eventual system by which the first stage will descent top-down, using a portion of its dorsal fairing as an ablative heat shield, and slow to be caught in a sea-based net.\n\n\n==== Development history ====\nDevelopment of Bloostar began in 2013. The first flight test was successfully conducted in March 2017, in which a less-than-half-scale prototype of the upper two stages was carried to 25 km altitude by balloon, separated, made a short burn using a small solid motor, and then was recovered intact by parachute. According to the Payload User's Guide, Phase 2 of development will follow, which will involve suborbital flights of nanobloorstar (a third stage from a production Bloostar) with a 75 kg payload to 180 km altitude.At that time of the 2017 test flight the first commercial launch was projected for 2019. However, López Urdiales subsequently noted this date could potentially slip as Zero 2 Infinity focused on its revenue-generating Elevate product line.\n\n\n=== Bloon ===\n\nBloon is a zero emission craft in development, which consists of a high-altitude balloon-borne capsule to perform crewed flights to near space and a steerable parachute system for returning autonomously to Earth. It also refers to the balloon-borne craft prototype range of the same company: Bloon, Minibloon, Microbloon and Nanobloon, which are differentiated among them by their size.Considering that only a helium balloon is responsible for lifting the load above most of the atmosphere, it is considered a zero emission craft. With this technology, Bloon would carry up to 4 passengers and 2 pilots (6 total crew) to an altitude as high as 36 km (22 mi, 118,110 feet). The vehicle would take from 1.5 to 2 hours to reach maximum altitude, and then stay there for up to 2 hours, with a final descent by steerable parachute after releasing the balloon, using airbags to smooth the landing.\n\n\n=== Elevate ===\nElevate is a service provided to lift payloads to near space on a stratospheric balloon platform for purposes such as testing of (components of) spacecraft, drop tests, celestial observation or publicity. The useful load on a stratospheric zero pressure balloon can range from several kilograms to over 5000 kg and the target altitude varies between 20 and 42 kilometers. The duration at altitude or ‘float’ can be extended from hours to several days or even weeks depending on the launch location. Additional solutions such as solar arrays, battery power or advanced return options such as a guided parafoil (as opposed to a traditional parachute) and tailor-made solutions to customer requirements are also offered as part of the Elevate service.\n\n\n== Flights ==\nZero 2 Infinity reports that it has conducted over 30 flights as of 2016. The most important flights for Bloon are listed below\nOn March 1, 2017, Zero 2 Infinity ignited its first rocket from Near Space, a Bloostar prototype. The flight took place at the INTA (Instituto Nacional de Técnica Aeroespacial) facilities in El Arenosillo, Huelva. The balloon that took Bloostar to 25 km was launched from a boat in the Gulf of Cadiz. At 25 km the ignition of the rocket took place. The goals of the mission were: (i) validation of the telemetry systems in Space conditions, (ii) controlled ignition, (iii) stabilization of the rocket, (iv) monitoring of the launch sequence, (v) parachute deployment, and finally, (vi) sea recovery. All these goals were achieved in full.\n\n\n== See also ==\nPLD Space – Private Spanish launch services provider\nWorld View Enterprises, another near-space-balloon-tourism company\nDeimos-One, a private American launch services company\nSpace Perspective - American Private company providing space-balloon-tourism\n\n\n== References ==\n\n\n== External links ==\nZero 2 Infinity official website",
    "links": [
        "3D printing",
        "Aerospace engineer",
        "Aerospace manufacturer",
        "Aldebaran (rocket)",
        "Alén Space",
        "Amazonas 1",
        "Amazonas 2",
        "Amazonas 3",
        "Amazonas 4A",
        "Amazonas 5",
        "Andalusian Foundation for Aerospace Development",
        "Andøya Space Center",
        "Argo (sounding rocket)",
        "Ariane (rocket family)",
        "Ariane 1",
        "Ariane 2",
        "Ariane 3",
        "Ariane 4",
        "Ariane 5",
        "Ariane 5 ME",
        "Ariane 6",
        "Ariane Next",
        "Atmospheric entry",
        "BAC Mustard",
        "Barberà del Vallès",
        "Barcelona",
        "Black Arrow",
        "Bloon",
        "Bloons",
        "Bloostar",
        "Capricornio (rocket)",
        "Cebreros Station",
        "Company",
        "Deimos-1",
        "Deimos-2",
        "Deimos-One",
        "Diamant (rocket)",
        "El Arenosillo",
        "El Hierro Launch Centre",
        "Europa (rocket)",
        "Gando Air Base",
        "HOTOL",
        "Haas (rocket)",
        "Heat shield",
        "Helium",
        "High-altitude balloon",
        "Hisdesat",
        "Hispasat",
        "Hispasat 1A",
        "Hispasat 1B",
        "Hispasat 1C",
        "Hispasat 1D",
        "Hispasat 30W-6",
        "Hispasat AG1",
        "Hopper (spacecraft)",
        "Hyperion SSTO",
        "INTA-100",
        "INTA-255",
        "INTA-300",
        "Ingenio (satellite)",
        "Instituto Nacional de Técnica Aeroespacial",
        "Intasat",
        "Jose Mariano López-Urdiales",
        "Launch vehicle",
        "Liberty (rocket)",
        "Limited liability company",
        "Liquid Fly-back Booster",
        "Liquid oxygen",
        "Low Earth orbit",
        "Lume-1",
        "Madrid Deep Space Communications Complex",
        "Maspalomas Station",
        "Methane",
        "Minisat 01",
        "Miura 1",
        "Miura 5",
        "Nanosat-1B",
        "Nanosat 01",
        "Nanosatellite",
        "Near space",
        "OPTOS",
        "OTRAG (rocket)",
        "Orbit",
        "PLD Space",
        "Pangea Aerospace",
        "Parallel staging",
        "Paz (satellite)",
        "Pedro Duque",
        "Pressure-fed engine",
        "Privately held company",
        "Reusable launch system",
        "Rocket",
        "Rocket Factory Augsburg AG",
        "Rockoon",
        "SOAR (spaceplane)",
        "Skylon (spacecraft)",
        "Small satellite",
        "Space program of Spain",
        "Space tourism",
        "Spain",
        "Spainsat",
        "Spainsat NG",
        "Spanish Astrobiology Center",
        "Sun-synchronous orbit",
        "Teruel Airport",
        "Toroid",
        "Turbopump",
        "UPM-Sat",
        "Vega (rocket)",
        "Villafranca Station",
        "World View Enterprises",
        "XTAR-EUR",
        "Xatcobeo",
        "Zero 2 Infinity",
        "Zero emission",
        "Zero to Infinity"
    ]
}