{
    "url": "https://en.wikipedia.org/wiki/%C3%96zg%C3%BCr_%C3%9Clke",
    "title": "Özgür Ülke",
    "summary": "Özgür Ülke was a newspaper established on the 28 April 1994, following the shut down of Özgür Gündem and other newspapers which reported on the Kurdish Turkish conflict by the Turkish government. It was closed down on the 2 February 1995, and 220 of its 247 issues were confiscated.",
    "content": "Özgür Ülke was a newspaper established on the 28 April 1994, following the shut down of Özgür Gündem and other newspapers which reported on the Kurdish Turkish conflict by the Turkish government. It was closed down on the 2 February 1995, and 220 of its 247 issues were confiscated.\n\n\n== History ==\nThree offices of the newspaper, two in Istanbul and one in Ankara, were simultaneously bombed on the 3 December 1994. As a result one person died and 23 others were wounded by the explosions. The next day the paper was published with the title  \"This fire could burn you, too\" on the front-page.  The Turkish authorities didn't charge anyone for the bombings, but arrested the wounded at their release from hospital. Following a solidarity campaign was launched by the Turkish public society. After about two weeks time, Özgür Ülke released an article containing a document signed by Tansu Çiller, in which was ordered to take measures to silence the media which was deemed a threat for the integrity of the state, specifically singling out Özgür Ülke. Yıldırım Aktuna, a spokesperson of the Government of Tansu ÇIller, declared that the authorities suspect that the newspaper bombed itself, in order to put the Turkish government into a difficult position.  It was shut down on 2 February 1995 on grounds that it represented a continuation of the defunct and prohibited Özgür Gündem.\n\n\n== References ==",
    "links": [
        "Government of Turkey",
        "Kurdish–Turkish conflict (1978–present)",
        "Tansu Çiller",
        "Yıldırım Aktuna",
        "Özgür Gündem"
    ]
}